{
  "meta": {
    "id": "tvmaze:2955",
    "type": "series",
    "name": "Taskmaster",
    "description": "Greg Davies is the Taskmaster who, with the help of his right-hand man, Alex, sets out to test the wiles, wit and wisdom of five hyper competitive comedians through a series of ingenious challenges. With the chance to be crowned show champion, rivalry amongst the comedians is encouraged, dodgy tactics rewarded and bribes accepted.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/587/1467935.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/587/1467935.jpg",
    "videos": [
      {
        "id": "tvmaze:3459492",
        "title": "Taskmaster's New Year Treat, Episode 1",
        "season": 20,
        "episode": null,
        "released": "2026-01-02",
        "overview": "In Taskmaster's annual new year celebration, five new contestants from outside the world of comedy compete to win Greg Davies' much-coveted golden eyebrows trophy. And for the first time ever, this New Year Treat takes place over two episodes, which means contestants have twice the opportunity to impress Greg with their brilliance - and a double possibility of making him really cross with their incompetence. The five stout-hearted stars who believe they can take on the Taskmaster's baffling tasks are: Big Zuu, Jill Scott, Sam Ryder, Susie Dent and Rose Ayling-Ellis. How will they fare when they're asked to prod a dangerous animal? What will they do when they're presented with a case of dice? And which one of them will spend 20 minutes sweating over a foot pump? Little Alex Horne bears witness to all of the celebs' attempts, whether they're playing the glockenspiel or being baffled by flags, and feeds the relevant facts and figures back to Greg, who uses his peerless judgement to award points to the most deserving. Who'll plot their path to new year glory?"
      },
      {
        "id": "tvmaze:3459493",
        "title": "Taskmaster's New Year Treat, Episode 2",
        "season": 20,
        "episode": null,
        "released": "2026-01-03",
        "overview": ""
      },
      {
        "id": "tvmaze:209613",
        "title": "Melon Buffet",
        "season": 1,
        "episode": 1,
        "released": "2015-07-28",
        "overview": "In the first ever episode, Greg Davies and Alex Horne challenge Frank Skinner, Josh Widdicombe, Roisin Conaty, Romesh Ranganathan and Tim Key to paint the best picture of a horse while riding a horse"
      },
      {
        "id": "tvmaze:209614",
        "title": "The Pie Whisperer",
        "season": 1,
        "episode": 2,
        "released": "2015-08-04",
        "overview": "Greg Davies and Alex Horne set madcap tasks for five comedians: can they identify the mystery pies? But these are no ordinary pies - these are Taskmaster pies!"
      },
      {
        "id": "tvmaze:209615",
        "title": "The Poet and the Egg",
        "season": 1,
        "episode": 3,
        "released": "2015-08-11",
        "overview": "Josh Widdicombe gives Taskmaster Greg Davies the ultimate gift that they will both remember for ever... Plus Frank, Josh, Roisin, Romesh and Tim throw a teabag into a mug and build a tower for an egg."
      },
      {
        "id": "tvmaze:209616",
        "title": "Down an Octave",
        "season": 1,
        "episode": 4,
        "released": "2015-08-18",
        "overview": "Can Frank Skinner, Josh Widdicombe, Roisin Conaty, Romesh Ranganathan and Tim Key fill an egg cup with tears or work out how to play 'Taskmaster squash'?"
      },
      {
        "id": "tvmaze:209617",
        "title": "Little Denim Shorts",
        "season": 1,
        "episode": 5,
        "released": "2015-08-25",
        "overview": "How do you make a Swedish man blush? And can you take a giant boulder on a train? Find out as Greg Davies and Alex Horne torment their captive band of comics."
      },
      {
        "id": "tvmaze:209618",
        "title": "The Last Supper",
        "season": 1,
        "episode": 6,
        "released": "2015-09-01",
        "overview": "In the series finale, as well as playing for Tim Key's fish chowder, the comics have their eyes on the inaugural Taskmaster prize. Who is best at golf with eggs?"
      },
      {
        "id": "tvmaze:811743",
        "title": "Fear of Failure",
        "season": 2,
        "episode": 1,
        "released": "2016-06-21",
        "overview": "Doc Brown, Joe Wilkinson, Jon Richardson, Katherine Ryan and Richard Osman tackle tricky tasks, including a potato hole-in-one that will surely go down in television history"
      },
      {
        "id": "tvmaze:826622",
        "title": "Pork is a Sausage",
        "season": 2,
        "episode": 2,
        "released": "2016-06-28",
        "overview": "Greg Davies judges our famous five. Jon Richardson gives his disturbing take on Three Blind Mice as he tries to create the best music video for a nursery rhyme."
      },
      {
        "id": "tvmaze:826623",
        "title": "A Pistachio Eclair",
        "season": 2,
        "episode": 3,
        "released": "2016-07-05",
        "overview": "Doc Brown, Joe Wilkinson, Jon Richardson, Katherine Ryan and Richard Osman are confronted with an intimidating man in gold chains: the mayor of Chesham. What can they do to impress him?"
      },
      {
        "id": "tvmaze:826624",
        "title": "Welcome to Rico Face",
        "season": 2,
        "episode": 4,
        "released": "2016-07-12",
        "overview": "In the penultimate episode of the series, the opponents conceal a pineapple on their person. And one of them is used as a guinea pig in a Taskmaster experiment."
      },
      {
        "id": "tvmaze:826625",
        "title": "There's Strength in Arches",
        "season": 2,
        "episode": 5,
        "released": "2016-07-19",
        "overview": "In the last episode of the series, Richard Osman gets carried away with a shopping trolley. But who will emerge victorious clutching Greg's golden head?"
      },
      {
        "id": "tvmaze:917457",
        "title": "A Pea in a Haystack",
        "season": 3,
        "episode": 1,
        "released": "2016-10-04",
        "overview": "Greg Davies and Alex Horne host as Al Murray, Dave Gorman, Paul Chowdhry, Rob Beckett and Sara Pascoe encounter out-of-season snowmen and some swede-on-Swede action"
      },
      {
        "id": "tvmaze:917458",
        "title": "The Dong and the Gong",
        "season": 3,
        "episode": 2,
        "released": "2016-10-11",
        "overview": "Greg Davies sets our five comics more tenuous tasks. Who can give Alex Horne the biggest surprise when he emerges from his shed after an hour cooped up inside?"
      },
      {
        "id": "tvmaze:917459",
        "title": "Little Polythene Grief Cave",
        "season": 3,
        "episode": 3,
        "released": "2016-10-18",
        "overview": "Al Murray goes to extreme lengths to maximise his point potential with an egg cup. Sara Pascoe swiftly becomes one of the greatest sporting minds of our time using a few balloons and a loaf of bread."
      },
      {
        "id": "tvmaze:917461",
        "title": "A Very Nuanced Character",
        "season": 3,
        "episode": 4,
        "released": "2016-10-25",
        "overview": "In the penultimate episode of the series, can the comedians impress Greg Davies by giving an item of clothing to a passing cyclist and whispering to an old man?"
      },
      {
        "id": "tvmaze:917462",
        "title": "The F.I.P.",
        "season": 3,
        "episode": 5,
        "released": "2016-11-01",
        "overview": "It's the series finale, but before Greg Davies hands over the Taskmaster trophy, which contestant has the most handsome relative? And why is Rob Beckett livid with a melon?"
      },
      {
        "id": "tvmaze:1126316",
        "title": "A Fat Bald White Man",
        "season": 4,
        "episode": 1,
        "released": "2017-04-25",
        "overview": "Greg Davies and Alex Horne host as Hugh Dennis, Joe Lycett, Lolly Adefope, Mel Giedroyc and Noel Fielding beautifully destroy a cake"
      },
      {
        "id": "tvmaze:1126317",
        "title": "Look at Me",
        "season": 4,
        "episode": 2,
        "released": "2017-05-02",
        "overview": "Greg Davies sets more ludicrous tasks for five comics. This time, there's long-distance painting, bread gloves, a flying trestle table and some flagrant cheating."
      },
      {
        "id": "tvmaze:1126318",
        "title": "Hollowing Out a Baguette",
        "season": 4,
        "episode": 3,
        "released": "2017-05-09",
        "overview": "The task onslaught continues as Greg Davies criticises the competitors' ability to camouflage themselves, herd dogs and make trailers for Taskmaster: The Movie"
      },
      {
        "id": "tvmaze:1126319",
        "title": "Friendship is Truth",
        "season": 4,
        "episode": 4,
        "released": "2017-05-16",
        "overview": "What will Mel Giedroyc do to a humble pommel horse? Should Hugh Dennis climb that high? And why are Alex Horne and Noel Fielding dancing like a pair of shrews?"
      },
      {
        "id": "tvmaze:1126320",
        "title": "Meat",
        "season": 4,
        "episode": 5,
        "released": "2017-05-23",
        "overview": "Greg Davies and Alex Horne engage in some role play to assess the success of a throwing task. Swedishman Fred receives an intense video call. And all hell breaks loose in the Battle of the Bath."
      },
      {
        "id": "tvmaze:1126321",
        "title": "Spatchcock It",
        "season": 4,
        "episode": 6,
        "released": "2017-05-30",
        "overview": "Expect camel carnage, carrier bag football, and the dark secrets of the Taskmaster's sleeping bag, as our five comics continue to vie for the highly coveted prize"
      },
      {
        "id": "tvmaze:1126322",
        "title": "No Stars for Naughty Boys",
        "season": 4,
        "episode": 7,
        "released": "2017-06-06",
        "overview": "Greg Davies and Alex Horne watch with despair as five comics take on wheelie bins, bothersome bunting and an unstable mannequin in the battle for Greg's golden head"
      },
      {
        "id": "tvmaze:1126323",
        "title": "Tony Three Pies",
        "season": 4,
        "episode": 8,
        "released": "2017-06-13",
        "overview": "It's the series finale, but who will lift Greg Davies's golden head? Noel Fielding finds his soulmate, and Mel Giedroyc bites off more than she can chew."
      },
      {
        "id": "tvmaze:1275069",
        "title": "Dignity Intact",
        "season": 5,
        "episode": 1,
        "released": "2017-09-13",
        "overview": "Aisling Bea, Bob Mortimer, Mark Watson, Nish Kumar and Sally Phillips tackle futile tasks: basketball (no hands), rowing (no oars) and cuddles (no kissing)"
      },
      {
        "id": "tvmaze:1289335",
        "title": "The Leprechaun or the Lesbian",
        "season": 5,
        "episode": 2,
        "released": "2017-09-20",
        "overview": "Greg Davies and Alex Horne bear witness as Aisling Bea bleeds on bread, Nish Kumar pretends he's Robin Hood, and Mark Watson feels the wrath of yoghurt"
      },
      {
        "id": "tvmaze:1295883",
        "title": "Phoenix",
        "season": 5,
        "episode": 3,
        "released": "2017-09-27",
        "overview": "Greg Davies ranks five comics in order of competency as they attempt complex tasks such as coconut costumery. Plus: can Mark Watson open an unlocked briefcase?"
      },
      {
        "id": "tvmaze:1299432",
        "title": "Residue Around the Hoof",
        "season": 5,
        "episode": 4,
        "released": "2017-10-04",
        "overview": "The five task-hungry comics attempt to make Marmite. And can anyone recognise Alex Horne when he's wearing a hat?"
      },
      {
        "id": "tvmaze:1299433",
        "title": "A Wind-Dried Puffin",
        "season": 5,
        "episode": 5,
        "released": "2017-10-11",
        "overview": "Alex Horne risks the Taskmaster's wrath by setting a cheeky unsanctioned task, and Sally Phillips locks herself in the caravan with an amorous water cooler"
      },
      {
        "id": "tvmaze:1299434",
        "title": "Spoony Neeson",
        "season": 5,
        "episode": 6,
        "released": "2017-10-18",
        "overview": "Alex Horne has a makeover, Bob Mortimer champions sausage meat, Sally Phillips returns to the womb, and Nish Kumar has a heart-to-heart with the Taskmaster"
      },
      {
        "id": "tvmaze:1299435",
        "title": "Boing Boing",
        "season": 5,
        "episode": 7,
        "released": "2017-10-25",
        "overview": "In the series semi-final, Greg Davies and Alex Horne baffle the contestants by giving them bread to hold while blindfolded and calling yet another referendum"
      },
      {
        "id": "tvmaze:1299436",
        "title": "Their Water's So Delicious",
        "season": 5,
        "episode": 8,
        "released": "2017-11-01",
        "overview": "Aisling Bea, Bob Mortimer, Mark Watson and Sally Phillips battle to win the Taskmaster trophy in the series finale, and Nish Kumar comes along for the ride"
      },
      {
        "id": "tvmaze:1445951",
        "title": "The Old Soft, Curved Padlock",
        "season": 6,
        "episode": 1,
        "released": "2018-05-02",
        "overview": "Alice Levine, Asim Chaudhry, Liza Tarbuck, Russell Howard and Tim Vine negotiate wheelbarrow stunts, lemon towers and a wardrobe in a field"
      },
      {
        "id": "tvmaze:1457972",
        "title": "Tarpeters",
        "season": 6,
        "episode": 2,
        "released": "2018-05-09",
        "overview": "Our five comics continue their quest to win Taskmaster Greg Davies' great golden bonce. This time: darts, eggs and a doomed wind-up man on a penny-farthing."
      },
      {
        "id": "tvmaze:1457973",
        "title": "One Warm Prawn",
        "season": 6,
        "episode": 3,
        "released": "2018-05-16",
        "overview": "Taskmaster Greg Davies judges with fire and fury as five comics attempt baffling assignments involving spinning, baby food and bedtime stories for grown-ups"
      },
      {
        "id": "tvmaze:1457974",
        "title": "BMXing!",
        "season": 6,
        "episode": 4,
        "released": "2018-05-23",
        "overview": "Tim Vine stands semi-naked in a box at the roadside. Russell Howard gets some macho tattoos. Alice Levine apes Leonardo da Vinci using squirty cream."
      },
      {
        "id": "tvmaze:1457975",
        "title": "H",
        "season": 6,
        "episode": 5,
        "released": "2018-05-30",
        "overview": "Asim Chaudhry plays snooker with drainpipes, Tim Vine gets stuck in a tunnel, and Alex Horne suffers a sharp telling-off from the Taskmaster"
      },
      {
        "id": "tvmaze:1457976",
        "title": "We Met at Mealtimes",
        "season": 6,
        "episode": 6,
        "released": "2018-06-06",
        "overview": "The Taskmaster makes more carefully considered judgements as his five competitors wrestle with snow globes, rubber ducks and wooden spoons"
      },
      {
        "id": "tvmaze:1457977",
        "title": "Roadkill Doused in Syrup",
        "season": 6,
        "episode": 7,
        "released": "2018-06-13",
        "overview": "Taskmaster Greg and his secretary Alex Horne set five wary comics rigorous tests, involving wet bras, skinny elephants and competitive pancake consumption"
      },
      {
        "id": "tvmaze:1457978",
        "title": "What Kind of Pictures?",
        "season": 6,
        "episode": 8,
        "released": "2018-06-20",
        "overview": "Alex Horne devours a clutch of surprising chocolate eggs as Greg Davies sets more tricky challenges for the five willing comics. Plus: Tim Vine's big toe bobble hat."
      },
      {
        "id": "tvmaze:1457979",
        "title": "The Bubble Brothers",
        "season": 6,
        "episode": 9,
        "released": "2018-06-27",
        "overview": "It's the penultimate episode of the series, and Liza Tarbuck is the leader of the pack vying to win the Taskmaster trophy. This time: hook, feline and singers!"
      },
      {
        "id": "tvmaze:1457980",
        "title": "He Was a Different Man",
        "season": 6,
        "episode": 10,
        "released": "2018-07-04",
        "overview": "It's the series finale. Tim Vine does a risky impersonation. Liza Tarbuck gifts Alex Horne a messy cake. And one supreme contestant lifts Greg's golden bonce."
      },
      {
        "id": "tvmaze:1492648",
        "title": "The Mean Bean",
        "season": 7,
        "episode": 1,
        "released": "2018-09-05",
        "overview": "A fresh batch of contestants - James Acaster, Jessica Knappett, Kerry Godliman, Phil Wang and Rhod Gilbert - perform pointless tasks involving clothes, construction and baked bean counting."
      },
      {
        "id": "tvmaze:1518747",
        "title": "My Eyes Are Circles",
        "season": 7,
        "episode": 2,
        "released": "2018-09-12",
        "overview": "Five fearless comics continue their Taskmaster battle. Phil Wang makes ogres poignant. Jessica Knappett mimics a foghorn. James Acaster goes round in circles."
      },
      {
        "id": "tvmaze:1518748",
        "title": "Twelve Blush Majesty Two",
        "season": 7,
        "episode": 3,
        "released": "2018-09-19",
        "overview": "Taskmaster Greg Davies sets our five intrepid comics more tricky tasks. What really gets Alex Horne's pulse racing?"
      },
      {
        "id": "tvmaze:1518749",
        "title": "OLLIE",
        "season": 7,
        "episode": 4,
        "released": "2018-09-26",
        "overview": "Jessica Knappett wonders how much water weighs. James Acaster presses the emergency alarm in a lift. Rhod Gilbert comes to regret smearing mustard in his eyes."
      },
      {
        "id": "tvmaze:1518750",
        "title": "Lotta Soup",
        "season": 7,
        "episode": 5,
        "released": "2018-10-03",
        "overview": "Rhod Gilbert endangers Alex Horne's life (again), Jessica Knappett's sunny outlook is tested by a grumpy man, and Phil Wang has fun with mayonnaise."
      },
      {
        "id": "tvmaze:1518751",
        "title": "A Coquettish Fascinator",
        "season": 7,
        "episode": 6,
        "released": "2018-10-10",
        "overview": "Greg Davies and Alex Horne host the 50th ever episode. Kerry Godliman and Jessica Knappett have a catfight. James Acaster makes Greg's face out of a ukulele."
      },
      {
        "id": "tvmaze:1518752",
        "title": "The Perfect Stuff",
        "season": 7,
        "episode": 7,
        "released": "2018-10-17",
        "overview": "Greg Davies challenges five funny people to entertain him by completing baffling challenges. This time: crackers Christmas crackers and eye-opening techniques."
      },
      {
        "id": "tvmaze:1518753",
        "title": "Mother Honks Her Horn",
        "season": 7,
        "episode": 8,
        "released": "2018-10-24",
        "overview": "Greg Davies deals out more withering looks and occasional faint praise in his role as the Taskmaster. Ever wondered what was underneath Phil Wang's costume?"
      },
      {
        "id": "tvmaze:1518754",
        "title": "The Pendulum Draws the Eye",
        "season": 7,
        "episode": 9,
        "released": "2018-10-31",
        "overview": "It's the penultimate episode of the series. Rhod Gilbert's at the centre of some satsuma-based controversy. Kerry Godliman and Jessica Knappett play ukulele tennis."
      },
      {
        "id": "tvmaze:1518755",
        "title": "I Can Hear It Gooping",
        "season": 7,
        "episode": 10,
        "released": "2018-11-07",
        "overview": "The series reaches its majestic climax. Which of our contestants will win Greg Davies' coveted golden head and become only the seventh Taskmaster champion in history?"
      },
      {
        "id": "tvmaze:1638771",
        "title": "Hello",
        "season": 8,
        "episode": 1,
        "released": "2019-05-08",
        "overview": "Iain Stirling, Joe Thomas, Lou Sanders, Paul Sinha and Sian Gibson take on tasks set by fearsome Greg Davies and fearful Alex Horne. This time: baby monitors and seductive dummies."
      },
      {
        "id": "tvmaze:1638772",
        "title": "A Novel About Russian Gulags",
        "season": 8,
        "episode": 2,
        "released": "2019-05-15",
        "overview": "The race continues for Taskmaster Greg Davies' golden head trophy. Lou Sanders acquires some creepy facial hair, and the contestants make fascinating noises."
      },
      {
        "id": "tvmaze:1638773",
        "title": "Stuck in a Mammal Groove",
        "season": 8,
        "episode": 3,
        "released": "2019-05-22",
        "overview": "Greg Davies judges the efforts of five comics who are desperate to impress him. Joe Thomas struggles with the definition of a mammal. Sian Gibson sends the Taskmaster a not-safe-for-work text."
      },
      {
        "id": "tvmaze:1638774",
        "title": "The Barrel Dad",
        "season": 8,
        "episode": 4,
        "released": "2019-05-29",
        "overview": "Tensions bubble to the surface during an apparently simple team task. Plus: what constitutes a loo roll? And how do you entertain a toddler?"
      },
      {
        "id": "tvmaze:1638775",
        "title": "Stay Humble",
        "season": 8,
        "episode": 5,
        "released": "2019-06-05",
        "overview": "Taskmaster Greg Davies and his loyal lickspittle Alex Horne take careful notes as Paul Sinha struggles with a basketball and Joe Thomas has a very unhappy birthday."
      },
      {
        "id": "tvmaze:1638776",
        "title": "Rock 'n' Roll Umlaut",
        "season": 8,
        "episode": 6,
        "released": "2019-06-12",
        "overview": "Greg Davies and Alex Horne watch in despair as Paul Sinha squats in a phone box and Iain Stirling stakes his claim for the Scottish national football team."
      },
      {
        "id": "tvmaze:1638777",
        "title": "This is Trevor",
        "season": 8,
        "episode": 7,
        "released": "2019-06-19",
        "overview": "Greg Davies hands down more brutally honest judgements as five comics fight among themselves to win his golden head. This time: the pink, the powerful and the pirate."
      },
      {
        "id": "tvmaze:1638778",
        "title": "Aquatic Sewing Machine",
        "season": 8,
        "episode": 8,
        "released": "2019-06-26",
        "overview": "Water, sand and beach balls contribute a seaside feel to this episode, but the jovial tone is soured by one contestant's flagrant cheating."
      },
      {
        "id": "tvmaze:1638779",
        "title": "I've Been a Bit Ill",
        "season": 8,
        "episode": 9,
        "released": "2019-07-03",
        "overview": "In the series semi-final, Alex Horne sucks delicious dust through a makeshift vegetable straw, while Paul Sinha, Lou Sanders and Iain Stirling become one."
      },
      {
        "id": "tvmaze:1638780",
        "title": "Clumpsy Swayey Clumsy Man",
        "season": 8,
        "episode": 10,
        "released": "2019-07-10",
        "overview": "There's eraser eating, camera wrecking and caravan crushing in the final episode of the series. Which of our intrepid comics will emerge triumphant?"
      },
      {
        "id": "tvmaze:1696814",
        "title": "Join Our Cult",
        "season": 9,
        "episode": 1,
        "released": "2019-09-04",
        "overview": "David Baddiel, Ed Gamble, Jo Brand, Katy Wix and Rose Matafeo make very dramatic entrances."
      },
      {
        "id": "tvmaze:1701648",
        "title": "Butter in the Microwave",
        "season": 9,
        "episode": 2,
        "released": "2019-09-11",
        "overview": "Taskmaster Greg Davies takes five comics to task on their efforts to complete pointless tasks. Jo Brand and David Baddiel take time out to enjoy a sandwich."
      },
      {
        "id": "tvmaze:1701649",
        "title": "Five Miles Per Day",
        "season": 9,
        "episode": 3,
        "released": "2019-09-18",
        "overview": "David Baddiel steers a steamroller towards a representation of his childhood sweetheart, in the hope of impressing Taskmaster Greg Davies."
      },
      {
        "id": "tvmaze:1701650",
        "title": "Quisps",
        "season": 9,
        "episode": 4,
        "released": "2019-09-25",
        "overview": "Greg Davies' assistant Alex Horne is powerless in the face of Ed Gamble's creative vision. Plus: bare chests and bucking donkeys."
      },
      {
        "id": "tvmaze:1701651",
        "title": "Another Spoon",
        "season": 9,
        "episode": 5,
        "released": "2019-10-02",
        "overview": "Our five comics devise new ways to help Alex Horne make the Taskmaster's breakfast. Plus: former series champion Kerry Godliman makes a dramatic return."
      },
      {
        "id": "tvmaze:1701652",
        "title": "Bready Bready Bready",
        "season": 9,
        "episode": 6,
        "released": "2019-10-09",
        "overview": "Jo Brand demonstrates an impressive grasp of street slang and David Baddiel takes a sledgehammer approach to a tricky problem. Plus: former series champion Katherine Ryan returns."
      },
      {
        "id": "tvmaze:1701653",
        "title": "A Cuddle",
        "season": 9,
        "episode": 7,
        "released": "2019-10-16",
        "overview": "A throwing task leaves some of the contestants with egg on their faces. Jo Brand reveals her stunning psychic superpowers. Katy Wix creates 'Mash Rushmore'."
      },
      {
        "id": "tvmaze:1701654",
        "title": "Shaqinahat",
        "season": 9,
        "episode": 8,
        "released": "2019-10-23",
        "overview": "Greg Davies delivers angry appraisals from his comfy throne. This time: bins, balloons and a big baby. Plus: putting lyrics to the Taskmaster theme tune."
      },
      {
        "id": "tvmaze:1701655",
        "title": "Don't Like Them Go Bang",
        "season": 9,
        "episode": 9,
        "released": "2019-10-30",
        "overview": "The five comics go undercover as they try to impress Taskmaster Greg Davies with their attempts at high-level espionage. And Ed Gamble shaves his knees."
      },
      {
        "id": "tvmaze:1701656",
        "title": "Think About the Spirit",
        "season": 9,
        "episode": 10,
        "released": "2019-11-06",
        "overview": "The grand final features tip-top teas, preposterous chickpeas and absent keys. But who will become only the ninth ever Taskmaster series champion?"
      },
      {
        "id": "tvmaze:1922017",
        "title": "God's Haemorrhoid",
        "season": 10,
        "episode": 1,
        "released": "2020-10-15",
        "overview": "Taskmaster Greg Davies and his sidekick Alex Horne test the wit of Daisy May Cooper, Johnny Vegas, Katherine Parkinson, Mawaan Rizwan and Richard Herring with giant bears and flying eggs."
      },
      {
        "id": "tvmaze:1944059",
        "title": "A Documentary About a Despot",
        "season": 10,
        "episode": 2,
        "released": "2020-10-22",
        "overview": "Johnny Vegas yells from a tall chair. Katherine Parkinson forgets how balloons work. Richard Herring flails around in a dinghy."
      },
      {
        "id": "tvmaze:1944060",
        "title": "Point of Swivel",
        "season": 10,
        "episode": 3,
        "released": "2020-10-29",
        "overview": "Mawaan Rizwan attempts a farm-related illusion in the hope of impressing domineering Taskmaster Greg Davies. Plus: pasta disasters and catapult calamities."
      },
      {
        "id": "tvmaze:1944061",
        "title": "Toshwash",
        "season": 10,
        "episode": 4,
        "released": "2020-11-05",
        "overview": "Daisy May Cooper flirts with a security guard, Richard Herring is surprised by chickens and Alex Horne wears sparkly high heels while operating heavy machinery."
      },
      {
        "id": "tvmaze:1944062",
        "title": "I Hate Your Trainers",
        "season": 10,
        "episode": 5,
        "released": "2020-11-12",
        "overview": "Greg Davies and Alex Horne host as five task-hungry comics demonstrate their love of watermelon and Johnny Vegas bags up a passing cyclist like a Christmas tree."
      },
      {
        "id": "tvmaze:1944063",
        "title": "Hippopotamus",
        "season": 10,
        "episode": 6,
        "released": "2020-11-19",
        "overview": "The comics are shaken and stirred by a very tricky task. Mawaan Rizwan learns a lesson about waterfowl. And Richard Herring wrings out a wet sock."
      },
      {
        "id": "tvmaze:1944064",
        "title": "Legit Glass",
        "season": 10,
        "episode": 7,
        "released": "2020-11-26",
        "overview": "Mawaan Rizwan masters remote control cars. Katherine Parkinson is baffled by a giant marble. Can Daisy May Cooper decipher Richard Herring's mysterious messages?"
      },
      {
        "id": "tvmaze:1944065",
        "title": "Moments of Silence",
        "season": 10,
        "episode": 8,
        "released": "2020-12-03",
        "overview": "Alex Horne gets an acting role, while Richard Herring delivers a star turn from behind a bush. Mawaan Rizwan nicks a cup of tea. Johnny Vegas takes a tumble."
      },
      {
        "id": "tvmaze:1944066",
        "title": "Air Horn Andy",
        "season": 10,
        "episode": 9,
        "released": "2020-12-10",
        "overview": "The comics go all out to win in the series semi-final: Richard Herring bleeds on beer mats, Mawaan Rizwan volleys oranges and Katherine Parkinson counts plastic balls."
      },
      {
        "id": "tvmaze:1944067",
        "title": "Dog Meat Trifle",
        "season": 10,
        "episode": 10,
        "released": "2020-12-17",
        "overview": "In a tense grand final, Katherine Parkinson searches for a spider and Daisy May Cooper destroys a mannequin. But who will become the 10th Taskmaster series champion?"
      },
      {
        "id": "tvmaze:2040443",
        "title": "It's Not Your Fault",
        "season": 11,
        "episode": 1,
        "released": "2021-03-18",
        "overview": "Charlotte Ritchie, Jamali Maddix, Lee Mack, Mike Wozniak and Sarah Kendall catch rats and have a smashing time delivering crockery on a scooter."
      },
      {
        "id": "tvmaze:2040444",
        "title": "The Lure of the Treacle Puppies",
        "season": 11,
        "episode": 2,
        "released": "2021-03-25",
        "overview": "The contestants argue about facial hair. Mike Wozniak vaults a high fence. Lee Mack struggles to see a balloon."
      },
      {
        "id": "tvmaze:2040445",
        "title": "Run Up a Tree to the Moon",
        "season": 11,
        "episode": 3,
        "released": "2021-04-01",
        "overview": "Lee Mack attempts an audacious hammer throw, Sarah Kendall makes sitting down memorable, and Jamali Maddix forgets his passport."
      },
      {
        "id": "tvmaze:2042295",
        "title": "Premature Conker",
        "season": 11,
        "episode": 4,
        "released": "2021-04-08",
        "overview": "Charlotte Ritchie climbs a ladder with some loo roll, Mike Wozniak tries out a new catchphrase, and Lee Mack terrifies an innocent member of the public."
      },
      {
        "id": "tvmaze:2042296",
        "title": "Slap and Tong",
        "season": 11,
        "episode": 5,
        "released": "2021-04-15",
        "overview": "Greg Davies and Alex Horne set their captive band of comics humiliating missions involving cling film, fashion for insects, and face-based shape-shifting."
      },
      {
        "id": "tvmaze:2042297",
        "title": "Absolute Casserole",
        "season": 11,
        "episode": 6,
        "released": "2021-04-22",
        "overview": "Jamali Maddix decorates the Taskmaster caravan, Sarah Kendall bites into a deep-fried kiwi fruit, and Mike Wozniak leaves Greg Davies in a state of horrified delirium."
      },
      {
        "id": "tvmaze:2042298",
        "title": "You've Got No Chutzpah",
        "season": 11,
        "episode": 7,
        "released": "2021-04-29",
        "overview": "There are fires, alarms, bizarre banquets and surprising sound effects, as our five comics complete pointless tasks under the watchful eye of Greg Davies and Little Alex Horne."
      },
      {
        "id": "tvmaze:2042299",
        "title": "An Orderly Species",
        "season": 11,
        "episode": 8,
        "released": "2021-05-06",
        "overview": "Taskmaster Greg Davies is impressed by Charlotte Ritchie's snack-munching methods and Jamali Maddix's pretty wings, as the race to win Greg's shiny skull-trophy continues."
      },
      {
        "id": "tvmaze:2042300",
        "title": "Mr Octopus and Pottyhands",
        "season": 11,
        "episode": 9,
        "released": "2021-05-13",
        "overview": "It's all to play for in the penultimate episode of the series. Mike Wozniak issues a stark warning. Lee Mack has a makeover. And there's a storm brewing on Taskmaster Island..."
      },
      {
        "id": "tvmaze:2042301",
        "title": "Activate Jamali",
        "season": 11,
        "episode": 10,
        "released": "2021-05-20",
        "overview": "In an epic final featuring dunking, dinosaurs and disastrous directions, Jamali Maddix staggers around and Mike Wozniak staggers everyone - again. Who will win Greg's head?"
      },
      {
        "id": "tvmaze:2165206",
        "title": "An Imbalance in the Poppability",
        "season": 12,
        "episode": 1,
        "released": "2021-09-23",
        "overview": "Greg Davies sets tasks to a team of celebs comprising Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell. The first set of challenges features with tasks featuring creepers, catapults and one (fake) cactus. As usual, Greg's loyal sidekick Alex Horne offers the intrepid contenders moral support."
      },
      {
        "id": "tvmaze:2170044",
        "title": "Oatmeal and Death",
        "season": 12,
        "episode": 2,
        "released": "2021-09-30",
        "overview": "The five comedic contestants continue competing against each other but for the first time this series, they'll need to show off some teamwork as they are faced with a mountain to climb. Alex Horne keeps a diligent record of events as Morgana Robinson investigates some suspect doggy bags and Guz Khan slaps a bouncy rabbit."
      },
      {
        "id": "tvmaze:2176528",
        "title": "The End of the Franchise",
        "season": 12,
        "episode": 3,
        "released": "2021-10-07",
        "overview": "Greg Davies sets more tasks to a team of celebs comprising Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell. This instalment finds Victoria drawing an exploding cat, Alan hurting himself with a rubber band and Desiree doing something inexplicable when faced with sand. As usual, Greg's loyal sidekick Alex Horne offers the intrepid participants moral support."
      },
      {
        "id": "tvmaze:2183321",
        "title": "The Customised Inhaler",
        "season": 12,
        "episode": 4,
        "released": "2021-10-14",
        "overview": "Greg Davies sets more tasks to contenders Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell, while his loyal sidekick Alex Horne gets all excited over a task involving a fiendish riddle. In this edition Morgana drenches herself in peas, Victoria learns a new skill, Desiree makes a political statement with jam, Alan piles on the sunglasses and Guz pens a new song."
      },
      {
        "id": "tvmaze:2188358",
        "title": "Croissants Is Croissants",
        "season": 12,
        "episode": 5,
        "released": "2021-10-21",
        "overview": "Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell attempt seemingly pointless tasks testing their ingenuity, dexterity and calmness under pressure. In the 100th episode, Victoria celebrates with a flapjack, Morgana celebrates by slicing up some plastic balls, and Guz celebrates by barricading himself in the Taskmaster house."
      },
      {
        "id": "tvmaze:2193832",
        "title": "A Chair in a Sweet",
        "season": 12,
        "episode": 6,
        "released": "2021-10-28",
        "overview": "Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell attempt seemingly pointless tasks testing their ingenuity, dexterity and calmness under pressure. This week, Desiree attempts to affix tennis balls to gaffer tape, Victoria tries to construct a rudimentary pulley system, while Alan finds out how many circles he can carry."
      },
      {
        "id": "tvmaze:2197104",
        "title": "The Integrity of the Product",
        "season": 12,
        "episode": 7,
        "released": "2021-11-04",
        "overview": "Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell attempt seemingly pointless tasks testing their ingenuity, dexterity and calmness under pressure. Guz currently holds a slender lead in this series, but with four episodes to go, any one of the contenders could walk off with host Greg Davies's gorgeous golden head tucked under their arm. This time, Greg's able sidekick Alex Horne lends his considerable acting skills to a promotional film, while Morgana passes a pole through a sponge, and Victoria tries to come to terms with a swanee whistle."
      },
      {
        "id": "tvmaze:2197105",
        "title": "A Couple of Ethels",
        "season": 12,
        "episode": 8,
        "released": "2021-11-11",
        "overview": "Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell continue their quest to join the elite pantheon of greats who get to put `Taskmaster Champion\" on their business card. This week, Desiree draws on her face, Guz endures a ball to the groin and Alan loses an eye. As usual, Greg Davies sets the tasks, while Alex Horne offers the contenders moral support."
      },
      {
        "id": "tvmaze:2197106",
        "title": "Nothing Matters",
        "season": 12,
        "episode": 9,
        "released": "2021-11-18",
        "overview": "With scores tight, contestants Alan Davies, Desiree Burch, Guz Khan, Morgana Robinson and Victoria Coren Mitchell each retain hopes of being crowned the winner. Taskmaster Greg Davies can barely conceal his contempt as he witnesses Alan yawning at a friend, Victoria throwing paint and his sidekick Alex Horne blowing cold air down Desiree's neck via a long tube."
      },
      {
        "id": "tvmaze:2197107",
        "title": "Caring Uncle Minpict",
        "season": 12,
        "episode": 10,
        "released": "2021-11-25",
        "overview": "On the final leg of this marathon challenge, Guz Khan joyously gobbles chocolates, Victoria Coren Mitchell attempts to decipher Alan Davies' unfathomable body movements and Desiree Burch writes a very persuasive song for Alex Horne. Morgana Robinson also remains in the running. Later, television's ultimate prize - Taskmaster Greg Davies' gilded bonce on a short spike - is finally awarded."
      },
      {
        "id": "tvmaze:2304097",
        "title": "The Noise That Blue Makes",
        "season": 13,
        "episode": 1,
        "released": "2022-04-14",
        "overview": "The award-winning celebrity challenge returns, with Greg Davies as the all-powerful Taskmaster and Alex Horne as his sidekick, setting all manner of perplexing and downright extraordinary tasks for five contestants from the comedy world - Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. They'll be facing all manner of tasks to test their daring, dexterity and dignity under pressure - and to also make them look just a little bit silly too."
      },
      {
        "id": "tvmaze:2308415",
        "title": "Birdy Hand Finger",
        "season": 13,
        "episode": 2,
        "released": "2022-04-21",
        "overview": "All-powerful Taskmaster Greg Davies sets more perplexing and downright extraordinary tasks for Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. Greg's personal valet Alex Horne diligently notes the facts and figures as Ardal makes some sheep, Chris gets younger, Judi becomes a queen, Sophie wets some teabags and Bridget gets lost in a small field."
      },
      {
        "id": "tvmaze:2310609",
        "title": "I Think I've Got This",
        "season": 13,
        "episode": 3,
        "released": "2022-04-28",
        "overview": "This time, in an unexpected interpretation of a task, Bridget Christie shoves a cuddly toy inside a traffic cone, to create a scene that almost reduces Little Alex Horne to tears. Taskmaster Greg Davies is surprisingly sympathetic to his PA's distress but is less forgiving of Sophie Duker's dinosaur impression. Meanwhile, Ardal O'Hanlon is defeated by a robot, Chris Ramsey is impressed with a hose, and Judi Love is confident about everything except marbles."
      },
      {
        "id": "tvmaze:2318341",
        "title": "Shoe Who",
        "season": 13,
        "episode": 4,
        "released": "2022-05-05",
        "overview": "The Taskmaster's diminutive sidekick Alex Horne suffers for his boss as he is pelted with milk and gin, while Bridget Christie has many questions concerning shoes, Judi Love is bewildered by bunting, and Ardal O'Hanlon looks a bit bereft."
      },
      {
        "id": "tvmaze:2322084",
        "title": "Having a Little Chuckle",
        "season": 13,
        "episode": 5,
        "released": "2022-05-12",
        "overview": "All-powerful Taskmaster Greg Davies sets more perplexing and downright extraordinary tasks for Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. This time, several contenders become baffled by things as apparently simple as a high five and a fish tank, which doesn't bode well as they continue their quest to win Greg's gilded bonce. Alex Horne records the minutiae of each task as Ardal discovers that a mallet floats, Bridget has a present for the Taskmaster and Sophie covers some keys in saliva."
      },
      {
        "id": "tvmaze:2323338",
        "title": "The 75th Question",
        "season": 13,
        "episode": 6,
        "released": "2022-05-19",
        "overview": "Greg Davies sets more perplexing and downright extraordinary tasks for Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. It's the midway point of the series, as Ardal straddles a mannequin, Judi demands access to a puppy, Sophie asks a very good question, Chris takes a sausage to the nostril and Bridget is the one to beat. Meanwhile, Greg's sidekick Alex Horne shows off his mastery of mimicry."
      },
      {
        "id": "tvmaze:2326670",
        "title": "Heg",
        "season": 13,
        "episode": 7,
        "released": "2022-05-26",
        "overview": "There's a food and drink theme running through this week's show as Ardal O'Hanlon indulges in a plant-based snack, liquids are poured down a giant tube on Sophie Duker's head, Chris Ramsey refuses to consume dried spaghetti and Bridget Christie browns a bun. Judi Love, meanwhile, impresses Taskmaster Greg Davies with her tales of celebrity encounters."
      },
      {
        "id": "tvmaze:2332883",
        "title": "You Tuper Super",
        "season": 13,
        "episode": 8,
        "released": "2022-06-02",
        "overview": "Greg Davies sets more perplexing and downright extraordinary tasks for Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. Ardal sings about leaning on a fence, Judi designs some classy headgear, Bridget uses her phone and Sophie displays genuinely world-class levels of endurance and fortitude. Meanwhile, Chris finds he can still fit into Alex Horne's horrible slip-on shoes."
      },
      {
        "id": "tvmaze:2332972",
        "title": "It Might Be Wind",
        "season": 13,
        "episode": 9,
        "released": "2022-06-09",
        "overview": "Greg Davies sets more perplexing and downright extraordinary tasks for Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker. As the series nears its end, it remains to be seen whether Taskmaster Greg is impressed by Bridget's research into Welsh royalty or Judi poking a shoe from under a curtain. Alex Horne keeps tabs on everything with his usual relentless efficiency."
      },
      {
        "id": "tvmaze:2339652",
        "title": "The House Queens",
        "season": 13,
        "episode": 10,
        "released": "2022-06-16",
        "overview": "Ardal O'Hanlon, Bridget Christie, Chris Ramsey, Judi Love and Sophie Duker compete, as the furious race to claim Greg Davies' gleaming golden head trophy reaches its glorious climax in the Taskmaster grand final. Able sidekick and administrator Alex Horne keeps tabs on everything with his usual relentless efficiency."
      },
      {
        "id": "tvmaze:2393208",
        "title": "The Chassis, The Wings",
        "season": 14,
        "episode": 1,
        "released": "2022-09-29",
        "overview": "Greg Davies returns to set more tasks to a series of celebrity guests. Dara Ó Briain, Fern Brady, John Kearns, Munya Chawawa and Sarah Millican are the noble knights who are hoping to win this elaborate joust to become the 14th Taskmaster champion. In this opening episode, they fumble frozen peas and shout about fish, while Greg's ever-loyal puppy, Alex Horne, lurks furtively in the background."
      },
      {
        "id": "tvmaze:2401908",
        "title": "Enormous Hugeness",
        "season": 14,
        "episode": 2,
        "released": "2022-10-06",
        "overview": "Dara Ó Briain, Fern Brady, John Kearns, Munya Chawawa and Sarah Millican battle to win this elaborate joust to become the 14th Taskmaster champion. John gets nostalgic about fonts, Sarah searches for a door and Munya Chawawa falls in a bath. Alex Horne is as happy as a sandboy when he gets to supervise tasks involving administration, little ducks and, best of all, messy flour on behalf of Taskmaster Greg Davies."
      },
      {
        "id": "tvmaze:2401918",
        "title": "Dafty in the Middle",
        "season": 14,
        "episode": 3,
        "released": "2022-10-13",
        "overview": "Greg Davies sets more tasks to Dara Ó Briain, Fern Brady, John Kearns, Munya Chawawa and Sarah Millican, the intrepid players hoping to become the 14th Taskmaster champion. As the quintet of cowering comics heads out into the wilderness, Alex Horne takes notes and records numbers with admirable - bordering on irritating - efficiency."
      },
      {
        "id": "tvmaze:2412849",
        "title": "Crumbs in My Bralette",
        "season": 14,
        "episode": 4,
        "released": "2022-10-20",
        "overview": "Dara Ó Briain displays a fabulous flair for folding, Fern Brady complains about being forced to tidy up, and Munya Chawawa does DIY magic with a coat hanger."
      },
      {
        "id": "tvmaze:2415688",
        "title": "Chip Biffington",
        "season": 14,
        "episode": 5,
        "released": "2022-10-27",
        "overview": "Sarah Millican gets her hands in some cottage pie, Fern Brady becomes Brandy Alexander, Munya Chawawa demonstrates a mastery of martial arts and John Kearns survives an operation."
      },
      {
        "id": "tvmaze:2418417",
        "title": "Long-legged Lobster",
        "season": 14,
        "episode": 6,
        "released": "2022-11-03",
        "overview": "Dara Ó Briain leads the pack at the halfway point of the series, but even he's baffled by a quantity of milk. John Kearns and Munya Chawawa do some elaborate skipping and jumping."
      },
      {
        "id": "tvmaze:2423990",
        "title": "The System of Endless Plates",
        "season": 14,
        "episode": 7,
        "released": "2022-11-10",
        "overview": "Sarah Millican flails about with a frying pan, Munya Chawawa pulls off a brilliant billiards shot, and all five comics spend far too long searching for a bath, given its size..."
      },
      {
        "id": "tvmaze:2425752",
        "title": "The One That Bats Do",
        "season": 14,
        "episode": 8,
        "released": "2022-11-17",
        "overview": "Fern Brady and Munya Chawawa are yet to claim a win. Can a rare tailless tiger bring them luck? Meanwhile, Dara Ó Briain gets frustrated, and Sarah Millican does something clever."
      },
      {
        "id": "tvmaze:2427356",
        "title": "A New Business End",
        "season": 14,
        "episode": 9,
        "released": "2022-11-24",
        "overview": "With Dara Ó Briain holding a very slender lead in the race to claim television's most prestigious prize, this penultimate episode finds John Kearns blunting the business end of a sausage, Fern Brady struggling with a raspberry and Munya Chawawa unwittingly forcing Sarah Millican into finding a novel use for a ping-pong ball. Greg Davies hosts, ably assisted by Alex Horne."
      },
      {
        "id": "tvmaze:2428645",
        "title": "Did I Meet These Potatoes Before?",
        "season": 14,
        "episode": 10,
        "released": "2022-12-01",
        "overview": "After nine tense episodes, it's time for the glorious grand final, featuring grapes, ducks and moon boots. Which lucky contestant will stroll away with Greg Davies' golden head?"
      },
      {
        "id": "tvmaze:2506297",
        "title": "The Curse of Politeness",
        "season": 15,
        "episode": 1,
        "released": "2023-03-30",
        "overview": "Greg Davies sets tasks to Frankie Boyle, Ivo Graham, Jenny Eclair, Kiell Smith-Bynoe and Mae Martin compete, the intrepid players hoping to become the 15th Taskmaster champion. In this episode, Jenny dances around a giant golden pineapple in a wedding dress, while Frankie discovers why cats love balls of string so much. Greg's `Admiral of Admin\" Alex Horne helps maintain order amid the chaos."
      },
      {
        "id": "tvmaze:2510122",
        "title": "Trapped In A Loveless Marriage",
        "season": 15,
        "episode": 2,
        "released": "2023-04-06",
        "overview": "At Greg's request, Little Alex Horne has split his band five ways for the sake of a task. This in turn leads to Jenny Eclair imparting her knowledge on trumpeters and piles. And Frankie Boyle shares some pretty strong opinions on golf."
      },
      {
        "id": "tvmaze:2514418",
        "title": "I Love to Squander Promise",
        "season": 15,
        "episode": 3,
        "released": "2023-04-13",
        "overview": "The comics take part in another selection of challenges, highlights of which include Jenny Eclair having a lovely time sitting on a chair while new potatoes cascade onto her head. Elsewhere, things get emotional - who can keep it together for the all-important sausage quiz? Frankie Boyle, Ivo Graham, Mae Martin and Kiell Smith-Bynoe are the other four contestants competing for Greg Davies's golden head."
      },
      {
        "id": "tvmaze:2520909",
        "title": "How Heavy Is the Water?",
        "season": 15,
        "episode": 4,
        "released": "2023-04-20",
        "overview": "Kiell Smith-Bynoe finds himself playing bingo without any shoes on, Mae Martin plays an unusual but potentially brilliant drum solo and all the comedians create boats to carry eggs, in a race involving eggs in boats. Greg Davies hands out the scores, while Alex Horne hands out the tasks, designed to test the comedians' daring, dexterity and dignity under pressure - and to also make them look a little bit silly too."
      },
      {
        "id": "tvmaze:2525947",
        "title": "Old Honkfoot",
        "season": 15,
        "episode": 5,
        "released": "2023-04-27",
        "overview": "Greg Davies challenges the short-term memory and musicality of contenders Frankie Boyle, Ivo Graham, Jenny Eclair, Kiell Smith-Bynoe and Mae Martin as the five intrepid comedians approach the halfway point in the series. Frankie impresses with his falsetto, while Kiell wows everyone with his spoon retrieval abilities. Plus, Mae fakes their way into assistant Alex Horne's wallet."
      },
      {
        "id": "tvmaze:2529612",
        "title": "It's My Milk Now",
        "season": 15,
        "episode": 6,
        "released": "2023-05-04",
        "overview": "Greg Davies has some tricky judging to do when people question the definition of the colour gold and nobody understands a simple egg-shelling task. As usual, Alex Horne offers sterling support to all concerned."
      },
      {
        "id": "tvmaze:2539899",
        "title": "Schrödinger's Egg",
        "season": 15,
        "episode": 7,
        "released": "2023-05-11",
        "overview": "Contenders Frankie Boyle, Ivo Graham, Jenny Eclair, Kiell Smith-Bynoe and Mae Martin continue to address the challenges set for them. As the battle for the trophy continues, Greg Davies and Alex Horne take things up a notch by introducing a pulper to proceedings. Jelly babies also cause friction between the participants."
      },
      {
        "id": "tvmaze:2539907",
        "title": "100% Bosco",
        "season": 15,
        "episode": 8,
        "released": "2023-05-18",
        "overview": "Contenders Frankie Boyle, Ivo Graham, Jenny Eclair, Kiell Smith-Bynoe and Mae Martin continue to address the challenges set for them by Greg Davies. At this stage of the competition, it's no surprise that people find retrieving pineapples from a millpond stressful. The comics inventively repurpose umbrellas and - in a fitting climax - Frankie goes to town on a gigantic cat scratching post. As usual, Alex Horne helps maintain order."
      },
      {
        "id": "tvmaze:2545472",
        "title": "A Show About Pedantry",
        "season": 15,
        "episode": 9,
        "released": "2023-05-25",
        "overview": "It's nearly the end of the series, and the pressure is so intense that Mae Martin immediately forgets the only rule to a task. Greg Davies demands to be educated about history - but the five comics only seem to know about the year 1066. And there's paint, stomping, poor time keeping and some impressively sneaky prizes in this sort-of semi-final."
      },
      {
        "id": "tvmaze:2550565",
        "title": "A Yardstick For Failure",
        "season": 15,
        "episode": 10,
        "released": "2023-06-01",
        "overview": "It's the grand finale, and naturally the five comedians are all chomping at the bit to amass the most points and raise aloft Greg's mighty golden bonce. For their final act, the comics contemplate using a hose, have an incredibly intense game of face-changing chess with Alex, and create something soothing for two very specific professions. Who'll reign supreme in this truly unparalleled gladiatorial arena?"
      },
      {
        "id": "tvmaze:2639143",
        "title": "The Natural Friends",
        "season": 16,
        "episode": 1,
        "released": "2023-09-21",
        "overview": "Comedian Julian Clary, actress writer and stand-up Lucy Beaumont, award-winning stand-up Sam Campbell, , writer and comedian Sue Perkins and actress, writer and director Susan Wokoma battle to win an elaborate joust to become the 16th Taskmaster champion. As usual, Alex Horne helps maintain order amid the chaos, though falls foul of Taskmaster Greg Davies at one point because of peas. Elsewhere, Lucy marvels at a canned blindfold and everyone tries to put a big duck in a lake."
      },
      {
        "id": "tvmaze:2648003",
        "title": "Hell Is Here",
        "season": 16,
        "episode": 2,
        "released": "2023-09-28",
        "overview": "Alex Horne sets the five new comics another set of challenges ranging from the cunning to the crackpot, before Greg Davies leads the all-important debrief and score-giving back in the studio. Highlights include Julian Clary finding a former Taskmaster champion hiding behind a door, Susan Wokoma doing something unexpected with mice and fish and Sue Perkins demonstrating her love of portcullises."
      },
      {
        "id": "tvmaze:2648201",
        "title": "Languidly",
        "season": 16,
        "episode": 3,
        "released": "2023-10-05",
        "overview": "Julian Clary destroys a table, Lucy Beaumont munches on a tree and Sam Campbell gets underneath some lint. Meanwhile, Alex Horne is subjected to a tickling by Susan Wokoma and is verbally insulted by a panpipe-playing Sue Perkins."
      },
      {
        "id": "tvmaze:2648202",
        "title": "Dynamite Chicks",
        "season": 16,
        "episode": 4,
        "released": "2023-10-12",
        "overview": "The episode sees Alex having to choke down some vaguely cylindrical meals created by the five contestants. Greg watches in wonder, delight - and sometimes disgust - as Lucy gets her flowers mixed up, Sam regrets a trip abroad, Julian orders some edible pants and Susan shakes her head at Sue sniffing a door."
      },
      {
        "id": "tvmaze:2648203",
        "title": "Skateboard Division",
        "season": 16,
        "episode": 5,
        "released": "2023-10-19",
        "overview": "Susan Wokoma finds something hidden in a flower, Lucy Beaumont gets handy with loo roll, and Julian Clary makes some kitchen receptacles look a bit sinister. Meanwhile, Alex Horne gets intimidated by Sam Campbell."
      },
      {
        "id": "tvmaze:2648204",
        "title": "Brother Alex",
        "season": 16,
        "episode": 6,
        "released": "2023-10-26",
        "overview": "Sue Perkins makes an extraordinary noise, Julian Clary gets on his hands and knees, and Lucy Beaumont creeps everyone out. Elsewhere, Sam Campbell proves adept at identifying colourful birds, and Susan Wokoma finds unexpected reasons to be grateful for her formal acting training."
      },
      {
        "id": "tvmaze:2648205",
        "title": "I'm Off to Find a Robin",
        "season": 16,
        "episode": 7,
        "released": "2023-11-02",
        "overview": "Lucy Beaumont wonders if she should risk flicking a forbidden switch, Julian Clary wonders if he needs more than one pie, while Sue Perkins assesses whether a deer head is preferable to a boundary line. Faced with all this wonderment, Sam Campbell rips off his own head. Alex Horne wonders if Taskmaster Greg Davies will ever respect him as he tries to maintain order amid the chaos."
      },
      {
        "id": "tvmaze:2648206",
        "title": "Never Packed a Boot",
        "season": 16,
        "episode": 8,
        "released": "2023-11-09",
        "overview": "Julian Clary, Lucy Beaumont, Sam Campbell, Sue Perkins and Susan Wokoma battle to win an elaborate joust to become the 16th Taskmaster champion. The mystery of the secret task is finally revealed to the baffled cast of comics, before the answers are gathered to some age-old questions - why does everyone keep choosing Sam, why is Sue tossing her head like a lion - and, crucially, who will get to wear the 'Special Hat'?"
      },
      {
        "id": "tvmaze:2648207",
        "title": "Fagin at the Disco",
        "season": 16,
        "episode": 9,
        "released": "2023-11-16",
        "overview": "It's the business end of the series, and time is running out for certain contenders to make their late run to claim Taskmaster Greg's head. Susan Wokoma has excuses when it comes to road sweeping, Julian Clary makes smart use of a fishing rod, Sue Perkins reimagines Botticelli, Sam Campbell collects some coins and Lucy Beaumont asks Taskmaster Greg Davies's assistant Alex Horne to sit on a sled."
      },
      {
        "id": "tvmaze:2648208",
        "title": "Always Forks and Marbles",
        "season": 16,
        "episode": 10,
        "released": "2023-11-23",
        "overview": "The series reaches an exhilarating climax as Sam Campbell designs a small bikini, Sue Perkins forgets about the milk, Lucy Beaumont feeds her young, Susan Wokoma pairs cornflakes with hot sauce and Julian Clary gently assaults an innocent Taskmaster Assistant."
      },
      {
        "id": "tvmaze:2795893",
        "title": "Grappling With My Life",
        "season": 17,
        "episode": 1,
        "released": "2024-03-28",
        "overview": "Joanne McNally, John Robins, Nick Mohammed, Sophie Willan and Steve Pemberton are the formidable five hoping to pass the Taskmaster's muster with their attempts to hunt for patatas, hoopla a gorilla and hug a special friend."
      },
      {
        "id": "tvmaze:2800533",
        "title": "Jumungo",
        "season": 17,
        "episode": 2,
        "released": "2024-04-04",
        "overview": "Greg Davies has to find a way to award points after watching Nick Mohammed sheath a water bottle with a sock, Joanne McNally tie a noose for a soft toy, and Steve Pemberton repeatedly express a hankering for pancakes. Meanwhile, Little Alex Horne jots down all the facts and figures as John Robins puts his faith in honey and Sophie Willan attempts to take flight."
      },
      {
        "id": "tvmaze:2807730",
        "title": "Some Impropriety?",
        "season": 17,
        "episode": 3,
        "released": "2024-04-11",
        "overview": "The answers to a great many questions will be answered in this episode. Will Steve Pemberton's no-vowels gamble pay off? Why does Sophie Willan love to balance items on her head? Can John Robins make formula milk? What does Nick Mohammed think is going to happen to those eggs? And, most intriguingly, why is Joanne McNally sniffing Little Alex Horne's beard?"
      },
      {
        "id": "tvmaze:2814725",
        "title": "Apropos Of Apoppo",
        "season": 17,
        "episode": 4,
        "released": "2024-04-18",
        "overview": "The contestants are forced to wrangle wild animals, with unpleasant results for Steve Pemberton and Sophie Willan. Plus: pickled onions, and a controversial cardboard tube."
      },
      {
        "id": "tvmaze:2826476",
        "title": "Snooker Cue Umbrella Chin",
        "season": 17,
        "episode": 5,
        "released": "2024-04-25",
        "overview": "Contenders Joanne McNally, John Robins, Nick Mohammed, Sophie Willan and Steve Pemberton continue their quest to be series champion. Steve experiments with G-force, Joanne rocks a traffic cone and Sophie splatters a human pigeon, all of which makes scoring a little tricky for all-powerful Taskmaster Greg Davies. Elsewhere, Nick gets trapped under a bed and John constructs a lengthy homage to Little Alex Horne's hero."
      },
      {
        "id": "tvmaze:2831644",
        "title": "A Three-Ring Man",
        "season": 17,
        "episode": 6,
        "released": "2024-05-02",
        "overview": "As the series passes the halfway stage and the epic battle to win Greg Davies' beautiful bonce begins to intensify. Steve Pemberton delivers a timely message of peace. Elsewhere, Joanne McNally invents a new catchphrase, Nick Mohammed and Sophie Willan both struggle with a bottle of water, John Robins gets creative with beans and Little Alex Horne feels the thrill of victory."
      },
      {
        "id": "tvmaze:2837726",
        "title": "Dream Date Territory",
        "season": 17,
        "episode": 7,
        "released": "2024-05-09",
        "overview": "Sophie Willan shouts the name of a body part in Alex Horne's flustered face. John Robins demonstrates the power of his forearms. And can Joanne McNally act out the word 'beer'?"
      },
      {
        "id": "tvmaze:2845449",
        "title": "The Umbrella Wink",
        "season": 17,
        "episode": 8,
        "released": "2024-05-16",
        "overview": "Taskmaster Greg Davies has witnessed many bizarre moments, but this episode ups the ante - from oars for arms to a beatboxing wolf. And why won't Nick Mohammed stop winking?!"
      },
      {
        "id": "tvmaze:2851985",
        "title": "Assistantbury",
        "season": 17,
        "episode": 9,
        "released": "2024-05-23",
        "overview": "Alex Horne risks raising Greg Davies' hackles with a task in celebration of himself. Steve Pemberton has an expletive-laden row with a bin. Plus: a novel use for a cow's ear."
      },
      {
        "id": "tvmaze:2851986",
        "title": "Ambience and Information",
        "season": 17,
        "episode": 10,
        "released": "2024-05-30",
        "overview": "It's the grand final, which means one superior competitor will end this episode by clutching Greg Davies' gilded bonce to their proud chest. But before that glorious moment, Sophie Willan will impress on keyboards, Steve Pemberton will be surprised in a field, John Robins will refuse a biscuit, Joanne McNally will struggle with an anagram, and Nick Mohammed will make a magical prediction. And, of course, Little Alex Horne will diligently record every last moment for posterity."
      },
      {
        "id": "tvmaze:2988970",
        "title": "The Faceless Facilitators",
        "season": 18,
        "episode": 1,
        "released": "2024-09-12",
        "overview": "Andy Zaltzman, Babátúndé Aléshé, Emma Sidi, Jack Dee and Rosie Jones attempt to impress the Taskmaster by searching for a seal, hurling yoga balls in a theme park, and force-feeding Alex a bowlful of bubblegum."
      },
      {
        "id": "tvmaze:2992735",
        "title": "...And Then a Detective Comes in",
        "season": 18,
        "episode": 2,
        "released": "2024-09-19",
        "overview": "Jack Dee has a dramatic change of wardrobe, Rosie Jones presents her new baby, Babátúndé Aléshé attaches ducks to his fingers, Andy Zaltzman starts seeing chickens, and Emma Sidi can't stop thinking about Tamzin Outhwaite."
      },
      {
        "id": "tvmaze:3002478",
        "title": "The Gangsters of the Sea",
        "season": 18,
        "episode": 3,
        "released": "2024-09-26",
        "overview": "As we settle into the series, it becomes clear that this race for the Taskmaster's golden face is going to be a tight one. Much is learned in this third episode: Babátúndé Aléshé knows what a rocket is, Emma Sidi can swear, Jack Dee closely resembles a world-famous artist, Rosie Jones enjoys cheating, and Andy Zaltzman will not be defeated in an argument over syntax."
      },
      {
        "id": "tvmaze:3008417",
        "title": "I'm a Girl Who Likes a Clean Line",
        "season": 18,
        "episode": 4,
        "released": "2024-10-03",
        "overview": "Jack Dee takes a long riverside stroll, Andy Zaltzman risks two bites of a vegetable, Emma Sidi does some cartwheels, Babatunde Aléshé gets annoyed with a rocket and Rosie Jones menaces a member of the crew. Chief statistician Alex Horne dons a luminous hat and rings a bell while proceeding at a gentle pace, while Greg Davies awards points, praise and pity."
      },
      {
        "id": "tvmaze:3008418",
        "title": "Big Stupid Things",
        "season": 18,
        "episode": 5,
        "released": "2024-10-10",
        "overview": "The headline news from this episode is that Greg Davies almost gags after opening a large jar - and the competition remains as close as ever. It's certainly is time for Andy Zaltzman to make a robot sing, and for a newly blond Jack Dee to discuss hedgehogs."
      },
      {
        "id": "tvmaze:3008419",
        "title": "A Dance As Old As Time Itself",
        "season": 18,
        "episode": 6,
        "released": "2024-10-17",
        "overview": "The Taskmaster's much-admired assistant, Little Alex Horne, has many talents. He can use a stopwatch, he can record statistics and he can comb Greg Davies' hair every night for exactly 20 minutes. But can he competently wield a pair of pliers? Rosie Jones is keen to find out. Elsewhere, Andy Zaltzman finds a really important pen, Jack Dee adopts a charismatic New York accent, Babátúndé Aléshé creates a lovely little otter and Emma Sidi enjoys some horrible wine."
      },
      {
        "id": "tvmaze:3008420",
        "title": "Captain Jackie and The Hotdog",
        "season": 18,
        "episode": 7,
        "released": "2024-10-24",
        "overview": "Rosie Jones feels badly let down by her comedy hero Jack Dee, while Babátúndé Aléshé shouts about a fortune cookie. And Andy Zaltzman predicts the end of the world."
      },
      {
        "id": "tvmaze:3008421",
        "title": "The Nexus of Truth",
        "season": 18,
        "episode": 8,
        "released": "2024-10-31",
        "overview": "The contestants continue as Jack Dee performs some energetic air cycling, Rosie Jones wails like a cat stuck in a cat flap and Babatunde Aleshe resorts to phoning a friend. Meanwhile, Andy Zaltzman deliberately dirties Alex Horne's carefully ironed trousers and Emma Sidi reveals a startling belief about socks."
      },
      {
        "id": "tvmaze:3008422",
        "title": "The Cockle Children",
        "season": 18,
        "episode": 9,
        "released": "2024-11-07",
        "overview": "While the race for Greg Davies' gold-plated noggin remains too close to call, some important questions will be answered in this penultimate episode. What will Babátúndé Aléshé do with a power washer? Can Andy Zaltzman shoehorn cricket into yet another task? Will Jack Dee's son make his dad proud with some crucial information? Why has Rosie Jones smeared a plate with brown stuff? And what makes Emma Sidi such an effective supervisor? Rest assured, Alex Horne is on hand to note down all the crucial details."
      },
      {
        "id": "tvmaze:3008423",
        "title": "Le Goose",
        "season": 18,
        "episode": 10,
        "released": "2024-11-14",
        "overview": "Our five weary contestants compete one last time, in a grand final featuring tiny chairs, giant eggs and a honking Alex Horne. But at the end of it all, who'll lift the legendary Taskmaster trophy?"
      },
      {
        "id": "tvmaze:3208452",
        "title": "Sometimes Spit",
        "season": 19,
        "episode": 1,
        "released": "2025-05-01",
        "overview": "Comedian and writer Fatiha El-Ghorri, American comedian, actor and podcaster Jason Mantzoukas, actor and writer Mathew Baynton, podcaster and broadcaster Rosie Ramsey, and comedian, actor and podcaster Stevie Martin take up the challenge. Their success in this opening episode will rest on their skills in tasks involving vinegar, raisins and, as is traditional, peas. As usual, Alex Horne administers the tasks and Greg Davies determines the winners"
      },
      {
        "id": "tvmaze:3209906",
        "title": "An Invisible Jump Rope",
        "season": 19,
        "episode": 2,
        "released": "2025-05-08",
        "overview": "The first team task of the series brings the usual awkwardness, but also the joys of Stevie Martin inventing a new way for humans to move, and Fatiha El-Ghorri sweeping the lawn with a small broom. Elsewhere, Rosie Ramsey has a visceral reaction to mental arithmetic, Mathew Baynton strikes his own face with a grape, and Jason Mantzoukas destroys a shower. Little Alex Horne watches on in awe as Taskmaster Greg Davies judges it all with his customary wisdom."
      },
      {
        "id": "tvmaze:3223884",
        "title": "My Presumably Scrotum",
        "season": 19,
        "episode": 3,
        "released": "2025-05-15",
        "overview": "The contestants are released from the Taskmaster grounds to explore an old abbey, but Fatiha El-Ghorri is concerned about the aggressive waterfowl. Despite Rosie Ramsey going flying, Stevie Martin attempting art with a duck and Jason Mantzoukas finding a new moustache, it's Mathew Baynton crawling through a corridor that causes the largest commotion. Alex Horne supplies the stats so that Greg Davies can make the judgements."
      },
      {
        "id": "tvmaze:3225157",
        "title": "Midnight Picnic",
        "season": 19,
        "episode": 4,
        "released": "2025-05-22",
        "overview": "Greg Davies expertly presides over another episode of profoundly important tasks, but he may come to regret a bold promise involving his mighty trousers. Greg's adoring assistant Little Alex Horne has some trouser issues of his own, thanks to Rosie Ramsey, but he gamely records events as Stevie Martin repeatedly punches a mannequin in the groin and Jason Mantzoukas pops raisins into a little hole in a wooden box. Meanwhile, Mathew Baynton strikes a memorable pose and Fatiha El-Ghorri demonstrates her acting chops."
      },
      {
        "id": "tvmaze:3233541",
        "title": "Maybe We're the Monsters",
        "season": 19,
        "episode": 5,
        "released": "2025-05-29",
        "overview": "The challenge continues as Rosie Ramsey has a revelation about monster identity, Stevie Martin finds a new use for her nail varnish and Jason Mantzoukas learns that lollipop ladies exist. Task setter Alex Horne gets comfy by a campfire to hear Fatiha El-Ghorri tell a disturbing story about a goat, before he's compelled to join in with Mathew Baynton's ode to storage."
      },
      {
        "id": "tvmaze:3242967",
        "title": "It's Got to Be Obsolete",
        "season": 19,
        "episode": 6,
        "released": "2025-06-05",
        "overview": "The halfway point sees the competitive streak start to show in all the contestants. Sadly, this is mainly at the expense of administrator Alex Horne, who's poked with a snooker cue by Fatiha El-Ghorri, repeatedly dunked by Mathew Baynton and aggressively pursued by a bearded Stevie Martin. Taskmaster Greg Davies does his best to keep a lid on things as Rosie Ramsey impersonates a teacher and an unhinged Jason Mantzoukas causes havoc in the previously harmonious Taskmaster House."
      },
      {
        "id": "tvmaze:3248477",
        "title": "Glass Half Most",
        "season": 19,
        "episode": 7,
        "released": "2025-06-12",
        "overview": "The contest continues, with Jason Mantzoukas trying to befriend a fisherman, Rosie Ramsey displaying a talent for trotting, Fatiha El-Ghorri boasting about her seductive scent and Stevie Martin pitching for a role in Downton Abbey. Meanwhile, Mathew Baynton spectacularly forfeits any remaining dignity. In a not-unrelated instance, Little Alex Horne's shoes are doused with yoghurt as Taskmaster Greg Davies casts his judgements."
      },
      {
        "id": "tvmaze:3273265",
        "title": "Science All Your Life",
        "season": 19,
        "episode": 8,
        "released": "2025-06-19",
        "overview": "For the 12th time this series, Jason Mantzoukas chooses violence as the solution to a task. Fatiha El-Ghorri retches into a balloon. Stevie Martin relives a difficult memory."
      },
      {
        "id": "tvmaze:3274643",
        "title": "Getaway Sticks",
        "season": 19,
        "episode": 9,
        "released": "2025-06-26",
        "overview": "It's the penultimate episode of the series, and Patatas the cat is back! Fatiha El-Ghorri knocks down an egg-shaped Alex Horne. And who's the master of multi-tasking?"
      },
      {
        "id": "tvmaze:3275106",
        "title": "The Clever Side?",
        "season": 19,
        "episode": 10,
        "released": "2025-07-03",
        "overview": "A shiny-new champion is about to be crowned, but not before Fatiha El-Ghorri kicks in a door, Mathew Baynton threatens a puppy and Stevie Martin expertly burns some toast."
      },
      {
        "id": "tvmaze:3341774",
        "title": "9x7",
        "season": 20,
        "episode": 1,
        "released": "2025-09-11",
        "overview": "Greg Davies and Alex Horne welcome the latest five comics to take on the challenge - Maisie Adam, Reece Shearsmith, Sanjeev Bhaskar, Phil Ellis and Ania Magliano. They'll be facing all manner of tasks, beginning with challenges involving codes, gym balls and disgusting noises, to test their daring, dexterity and dignity under pressure - and to also make them look just a little bit silly too."
      },
      {
        "id": "tvmaze:3350218",
        "title": "Cows Are Made of Milk",
        "season": 20,
        "episode": 2,
        "released": "2025-09-18",
        "overview": "The continuing challenge sees Reece Shearsmith's hand emerging from inside a bag, Sanjeev Bhaskar rotating around a hill of flour and Maisie Adam's mouth poking through Taskmaster Greg Davies' nose. Meanwhile, Phil Ellis finds something surprising inside a fake fish and Ania Magliano makes a startling revelation. As ever Little Alex Horne does his level best to maintain a little decorum."
      },
      {
        "id": "tvmaze:3356302",
        "title": "Thompson",
        "season": 20,
        "episode": 3,
        "released": "2025-09-25",
        "overview": "The contestants have a tricky time identifying someone in the lab, leading Phil Ellis to ponder a 1980s pop group and Maisie Adam to rely on the lyrics to a 1990s dance tune. Ania Magliano is unsure of the difference between snakes and worms, Sanjeev Bhaskar creates a disturbing tableau and Reece Shearsmith gets quite angry with a large yellow cube. Taskmaster Greg Davies issues the points, though assistant Alex Horne very often agrees with his decisions."
      },
      {
        "id": "tvmaze:3367568",
        "title": "Hey Mate",
        "season": 20,
        "episode": 4,
        "released": "2025-10-02",
        "overview": "Reece Shearsmith reacts strangely to insects, Phil Ellis and Maisie Adam are repulsed by olives and Sanjeev Bhaskar remains calm in the face of a team-mate's incompetence. Meanwhile, Taskmaster Greg Davies' loyal assistant Alex Horne regrets giving Ania Magliano access to his phone."
      },
      {
        "id": "tvmaze:3372642",
        "title": "Bats, Bats, Hang Up",
        "season": 20,
        "episode": 5,
        "released": "2025-10-09",
        "overview": "Alex Horne goes under the spotlight as a livid Maisie Adam objects to his actions in a task involving an obstacle course. Ania Magliano asks a stranger about their marital status, Sanjeev Bhaskar resorts to bribery, Phil Ellis strips to his base layer and Reece Shearsmith destroys a valuable ornament."
      },
      {
        "id": "tvmaze:3383073",
        "title": "Is That Number Got Curves?",
        "season": 20,
        "episode": 6,
        "released": "2025-10-16",
        "overview": "Greg Davies presides as the series enters its second half. Reece Shearsmith builds a ladder out of chopsticks, Ania Magliano lassos a weathervane and Sanjeev Bhaskar attempts to crush an egg. Meanwhile, Alex Horne is forced to give up his prized watch, Phil Ellis's sunny disposition costs him dear and Maisie Adam hits a new low."
      },
      {
        "id": "tvmaze:3388013",
        "title": "Drier Than You Think, Chalk",
        "season": 20,
        "episode": 7,
        "released": "2025-10-23",
        "overview": "The contestants are pushed to their limits as they try to pull off a heist, pay dubious homage to their heroes and shout about foodstuffs while wielding a mallet. Phil Ellis does a spot of rewiring, Ania Magliano spews some blue jelly, Sanjeev Bhaskar asks for a comfort break and Maisie Adam squawks like an exotic bird."
      },
      {
        "id": "tvmaze:3397575",
        "title": "Am I an Idiom?",
        "season": 20,
        "episode": 8,
        "released": "2025-10-30",
        "overview": "Little Alex Horne has a lot of fun administering a task involving ducks and mystery. But while that may be his favourite sort of task, it's not appreciated by everyone - especially Sanjeev Bhaskar. Ania Magliano makes a noise like a small cat, Maisie Adam becomes smug, Reece Shearsmith balances on one leg for an impressive length of time, while Phil Ellis struggles to open a door as the challenges continue to be dished out by Greg Davies."
      },
      {
        "id": "tvmaze:3400961",
        "title": "A 1970s Camping Kettle",
        "season": 20,
        "episode": 9,
        "released": "2025-11-06",
        "overview": "All five competitors remain in with a chance of winning Greg Davies' glittering bonce. Efficient assistant Alex Horne shows off his jockey silks in the weighing room, while Maisie Adam makes sexy use of a feather boa and shin pads. Ania Magliano and Phil Ellis cause calamity with a tower of bricks, Sanjeev Bhaskar watches a croissant float by and Reece Shearsmith pays homage to the dawn of cinema."
      },
      {
        "id": "tvmaze:3406267",
        "title": "Supping From The Fountain",
        "season": 20,
        "episode": 10,
        "released": "2025-11-13",
        "overview": "In the mad dash to the finish line, Ania Magliano worries about leaving Phil Ellis unattended, Maisie Adam gets apple juice in her ear, Reece Shearsmith tries out a new nose and Sanjeev Bhaskar loses his temper over the word flanks. With mutiny in the air, Alex Horne gets drenched multiple times, before Greg Davies crowns the new champion."
      }
    ]
  }
}