{
  "meta": {
    "id": "tvmaze:1852",
    "type": "series",
    "name": "Shetland",
    "description": "The dark side of one of the most beautiful places on earth. Uncovering secrets and lies from the past.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491325.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491325.jpg",
    "videos": [
      {
        "id": "tvmaze:3448730",
        "title": "Episode 6",
        "season": 10,
        "episode": 6,
        "released": "2025-12-10",
        "overview": "As Calder and Tosh close in on the motive for Eadie's murder, the pool of suspects narrows."
      },
      {
        "id": "tvmaze:185311",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2013-03-10",
        "overview": "As DI Jimmy Perez investigates the murder of an elderly lady who is shot dead outside her croft, he finds evidence of a massive, bitter dispute between two families."
      },
      {
        "id": "tvmaze:185312",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2013-03-11",
        "overview": "With two murders and no strong leads, can Perez apprehend the suspect before crowds descend on the Shetland Islands for Up Helly Aa, the biggest fire festival in Europe?"
      },
      {
        "id": "tvmaze:185313",
        "title": "Raven Black - Part 1",
        "season": 2,
        "episode": 1,
        "released": "2014-03-11",
        "overview": "When the body of a teenage girl is found on a beach, DI Perez leads the investigation. It seems the case may be linked to the disappearance of a young girl 19 years earlier."
      },
      {
        "id": "tvmaze:185314",
        "title": "Raven Black - Part 2",
        "season": 2,
        "episode": 2,
        "released": "2014-03-18",
        "overview": "DI Perez believes he and his team are finally closing in on the killer as they discover what 17-year-old Catherine Ross was hiding from everyone in the hours before her death."
      },
      {
        "id": "tvmaze:185315",
        "title": "Dead Water - Part 1",
        "season": 2,
        "episode": 3,
        "released": "2014-03-25",
        "overview": "A journalist is killed in a road accident and it emerges he was an old pal of Perez. As the investigation progresses it seems the victim's return to Shetland was connected to plans for a controversial new gas pipeline"
      },
      {
        "id": "tvmaze:185316",
        "title": "Dead Water - Part 2",
        "season": 2,
        "episode": 4,
        "released": "2014-04-01",
        "overview": "After a second body is found brutally murdered, DI Perez wonders if the two killings are connected to corporate greed and corruption on the island or to just one woman - Evie Watt."
      },
      {
        "id": "tvmaze:185317",
        "title": "Blue Lightning - Part 1",
        "season": 2,
        "episode": 5,
        "released": "2014-04-08",
        "overview": "When a visiting scientist is found murdered in her lab on the island that also happens to be Perez's childhood home, he returns to conduct an investigation that includes the immediate family and fellow scientist as the prime suspects."
      },
      {
        "id": "tvmaze:185318",
        "title": "Blue Lightning - Part 2",
        "season": 2,
        "episode": 6,
        "released": "2014-04-15",
        "overview": "Time is running out for Perez as prime suspect Peter Latimer lies critically ill in hospital. Was the fire a drunken accident, or was Latimer the second victim of a murderer still free on Fair Isle?"
      },
      {
        "id": "tvmaze:550315",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2016-01-15",
        "overview": "A young man completely disappears on the ferry crossing between Aberdeen to Shetland, whilst a small child ends up in intensive care. DI Perez and his team believe the two incidents are connected and begin their investigation."
      },
      {
        "id": "tvmaze:556488",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2016-01-22",
        "overview": "Jimmy is convinced that Michael must somehow be implicated in Robbie's death, but he faces a uphill battle to even start up the case, especially with Michael remaining completely silent."
      },
      {
        "id": "tvmaze:556489",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2016-02-05",
        "overview": "Perez and Tosh head to Glasgow to try and uncover the reasons behind Maguire's death and how he was connected to Robbie. Old ghosts haunt Perez, however and soon stop him from finding out the truth."
      },
      {
        "id": "tvmaze:556490",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2016-02-12",
        "overview": "Perez and the rest of his team are determined to track down the person that helped Michael Thompson's killer. The closer the team get to the truth however, the more dangerous it gets for all involved."
      },
      {
        "id": "tvmaze:556491",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2016-02-19",
        "overview": "Perez continues his investigation into the murders of Robbie and Michael, but struggles with what has happened to Tosh. He soon however discovers the shocking identity of who Thompson was about to testify against."
      },
      {
        "id": "tvmaze:556492",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2016-03-04",
        "overview": "Perez and the team discover that the person that they believed to be responsible for the murders is closer to home than any of them thought. A new light is shone on the murder of Michael when the team discovers who assaulted Kelly. Leanne is struggling to deal with the emotional aftermath after being shot. Perez is troubled when he discovers that Michael's witness protection handler Asha was in Lerwick on the same day that the email was sent out. The team dig deeper into Asha's past and discover a connection to one of McCall's team."
      },
      {
        "id": "tvmaze:1398741",
        "title": "Episode 1",
        "season": 4,
        "episode": 1,
        "released": "2018-02-13",
        "overview": "When Shetlander Thomas Malone has his murder conviction overturned after 23 years, which he's spent behind bars, Perez has to reopen the investigation into the 1994 death of local teenager Lizzie Kilmuir."
      },
      {
        "id": "tvmaze:1405597",
        "title": "Episode 2",
        "season": 4,
        "episode": 2,
        "released": "2018-02-20",
        "overview": "Perez is on the trail of an attacker, Tosh investigates an oil company in the hunt for Sally's killer, and DNA testing in the Kilmuir case yields a surprising result, as murder-mystery Shetland continues."
      },
      {
        "id": "tvmaze:1406044",
        "title": "Episode 3",
        "season": 4,
        "episode": 3,
        "released": "2018-02-27",
        "overview": "Perez questions Donna about the shocking DNA results, Tosh arrives in Norway in search of Andreas Hagan, and an unexpected twist leads Perez and Tosh into the murky world of the Norwegian far right."
      },
      {
        "id": "tvmaze:1406045",
        "title": "Episode 4",
        "season": 4,
        "episode": 4,
        "released": "2018-03-06",
        "overview": "Ignoring Secret Service warnings, Perez and Tosh track down Mathias Soderland. Back on Shetland, a beach memorial service is held for Sally McColl."
      },
      {
        "id": "tvmaze:1406046",
        "title": "Episode 5",
        "season": 4,
        "episode": 5,
        "released": "2018-03-13",
        "overview": "Perez must re-assess the investigation in the aftermath of the attack. The MIT arrives on Shetland and sets its sights on Malone. Meanwhile, Tosh begins to have doubts about Lars."
      },
      {
        "id": "tvmaze:1406047",
        "title": "Episode 6",
        "season": 4,
        "episode": 6,
        "released": "2018-03-20",
        "overview": "Troubled by historical DNA evidence results, Jimmy has to face the fact that Duncan may have been involved in Lizzie Kilmuir's murder, and potentially Sally McColl's as well. A shocked Duncan is brought to the station for questioning, hurt that Perez would even think him capable of murder. However, the detective knows Duncan's lying - perhaps not about the murder, but about something else significant. So when Duncan finally admits he had an affair with Donna, it's not long before a bombshell is dropped."
      },
      {
        "id": "tvmaze:1596490",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2019-02-12",
        "overview": "When body parts belonging to a young Nigerian man are discovered on the island, Perez and the team investigate. They use CCTV to trace the victim's last movements, and after scrutinising his emails and social media accounts, the case takes a sinister turn."
      },
      {
        "id": "tvmaze:1602767",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2019-02-19",
        "overview": "Carla and Prentice Hayes are found murdered in a violent knife attack. Jamie Hayes is missing, initially leading the team to speculate that he could be responsible. But Jimmy is convinced that Jamie could not have mutilated his mother in this way. Aware of her altercation with Prentice the previous evening, Perez pays a visit to Olivia Lennox. She's in her room, shaken, with blood on her clothes. Could she be responsible or an innocent bystander?"
      },
      {
        "id": "tvmaze:1602768",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2019-02-26",
        "overview": "As the death toll rises, Perez heads to Glasgow in an attempt to crack the case, and joins forces with DI Sam Boyd from the trafficking unit."
      },
      {
        "id": "tvmaze:1602769",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2019-03-05",
        "overview": "Having heard of the traumatic events in Glasgow, an angry Duncan confronts Jimmy over his fears for Cassie's safety. Although shaken, Cassie seems pleased that Perez has trusted her with the truth. Now sure that Zezi is still being held on the island, Perez and Sandy pay Morag Dunwoody a visit in an attempt to extract further information. However, matters take a more dramatic turn when Morag's house is petrol-bombed."
      },
      {
        "id": "tvmaze:1602770",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2019-03-12",
        "overview": "Perez interviews Andrea Doyle. Initially petulant, she quickly becomes scared when he explains the charges against her, and reluctantly agrees to show him the safe house. The detectives are horrified to discover Nikki's body dumped in the garden of the property, wrapped in bin liners. A distraught Olivia comes dangerously close to driving herself and Jamie Hayes off the edge of a cliff, while a hungover Duncan makes a shocking discovery when he wakes up on the beach."
      },
      {
        "id": "tvmaze:1602771",
        "title": "Episode 6",
        "season": 5,
        "episode": 6,
        "released": "2019-03-19",
        "overview": "Olivia has almost given up hope of ever finding her daughter. Perez is trying to reassure her when some terrible news reaches them.Perez speaks to a traumatised and shaken Duncan, who can't believe what he's seeing on the beach. Although Perez believes that he's not involved in the trafficking, these events have left Duncan at rock bottom and he's thinking of leaving Shetland for good."
      },
      {
        "id": "tvmaze:2188252",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2021-10-20",
        "overview": "When a prominent and controversial Shetlander is shot dead on their doorstep in broad daylight, Perez rushes back from his mother's funeral to lead the investigation."
      },
      {
        "id": "tvmaze:2193588",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2021-10-27",
        "overview": "In the aftermath of the diving incident, the team searches for a link between the two bodies. Meanwhile, Perez must deal with the return of Donna Killick."
      },
      {
        "id": "tvmaze:2198235",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2021-11-03",
        "overview": "The hunt is on for Sandy's attacker, before a shocking confession causes tensions to boil over and some Islanders take justice into their own hands."
      },
      {
        "id": "tvmaze:2203044",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2021-11-10",
        "overview": "After the shocking events of the previous night, Perez must piece together what happened before a rampaging and vengeful Creggan finds his target."
      },
      {
        "id": "tvmaze:2207989",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2021-11-17",
        "overview": "Facing a dead end in the hunt for Galbraith's killer, Tosh leads Perez to the remote island of Fetlar. Donna asks Duncan for one last favour."
      },
      {
        "id": "tvmaze:2210903",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2021-11-24",
        "overview": "As Perez closes in on the identity of Galbraith's killer, he struggles with Duncan's secret, while Donna has one more surprise in store."
      },
      {
        "id": "tvmaze:2365578",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2022-08-10",
        "overview": "DI Perez investigates the disappearance of a vulnerable young man, whose family are new to Shetland. Has whatever they are running from come back to haunt them?"
      },
      {
        "id": "tvmaze:2368308",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2022-08-17",
        "overview": "After the discovery of an unknown body, the search for Connor grows increasingly desperate. Perez follows Danny on a perilous journey into his murky past."
      },
      {
        "id": "tvmaze:2371040",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2022-08-24",
        "overview": "Mounting evidence pushes Perez and the team to revise their view of missing man Connor Cairns.The identity of the new murder victim casts doubt over whether Connor is a vulnerable missing man or a killer on the run. Rachel Cairns is horrified by the suggestion her son is involved, but Perez's interest is piqued when Abbie confesses her brother used to work for drug gangs in Glasgow.Procurator Fiscal Maggie Kean encourages Perez to revise the missing person's case, while a facial reconstruction of the unidentified body in the suitcase leads to a possible match on the airport CCTV footage.Later, when Connor's phone is recovered from the search area, the geolocation data shows repeated trips to an unknown remote spot in Shetland, surely Connor's 'safe place'. However, this breakthrough in the case puts one of the team in grave danger."
      },
      {
        "id": "tvmaze:2374207",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2022-08-31",
        "overview": "As the team process the aftermath of the explosion, Perez sets his sights on Connor as the bomb-maker and prime suspect. Rachel Cairns is outraged, believing her son is the victim not the perpetrator.Perez's team interview those closest to Connor in search of any extremist beliefs. While Jamie, Murry and Lloyd reject the notion Connor is capable of violence, a despairing Danny admits environmental issues had stirred up anger in his son.Elsewhere, Sandy tries to fill in the missing pieces about the body found in the voe - William Rodgers, a US citizen. Sandy discovers William worked in the energy industry but his links to Shetland remain unclear and the reason for his death a mystery.With her family in turmoil, Abbie grows suspicious of Martin the photographer, who is showing an unhealthy interest in the case. Enlisting the help of Clana, she steals Martin's SD card and is stunned by the content.The investigation takes a chilling turn when another body is discovered at the foot of a cliff. The scene suggests suicide, but the post mortem reveals an altogether more disturbing reality."
      },
      {
        "id": "tvmaze:2379565",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2022-09-07",
        "overview": "Lloyd went on the run after being framed for the murder of a police officer. He went unspotted for decades, until seeing Williams Rodgers in Lerwick. Confirming that only Connor knew this secret, Perez wonders whether he has found a motive for murder.A masked figure breaks into the agricultural suppliers and steals only fertiliser. There is another amateur bombmaker at work.Meg can see that Perez blames himself for the murders. She is wary of being with someone who needs to protect an entire community. Donnie's friendship with Carol Anne continues to irritate Tosh, even though Carol Anne shows more interest in her."
      },
      {
        "id": "tvmaze:2383402",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2022-09-14",
        "overview": "Perez and his team face a race against time to prevent disaster striking Lerwick. With nowhere left to run, an increasingly desperate killer looks to make a devastating political statement as the current series of crime drama Shetland draws to a close.Ally and Carol Anne insist their eco-group is non-violent and are stunned when Perez reveals photos of Connor's tortured body. Believing someone in the group is building another bomb, Perez makes Ally see they've been fooled by a person close to them, revealing the identity of the suspected mastermind.When the police find a suspect truck laden with chemical drums parked in Lerwick town centre, they join forces to corner the bomber before it's too late.However, when the bomber panics, Perez tracks the increasingly unhinged suspect to the site of the Braer oil spill and a life or death stand-off ensues – putting Perez's future in sharp focus.As the investigation nears its end, it becomes clear not all the murders are connected, shining a light on a new, unexpected suspect"
      },
      {
        "id": "tvmaze:2664664",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2023-11-01",
        "overview": "After thirty years away, Met detective DI Ruth Calder returns to Shetland on the trail of Ellen Quinn – the scared witness to a London gangland murder. In Lerwick, Tosh pauses her investigation into a string of sinister animal deaths to help Calder find Ellen before it's too late.Ellen's family are the influential and notorious Bains, led by dominant matriarch, Grace. Calder and Tosh discover her mother Stella and father Kieran haven't seen Ellen since she left for London six months ago and are surprised to hear that she's back in Shetland.Matters are made worse when armed London gangsters - the experienced Howell and volatile Nowak - arrive on the Isles on a mission to silence Ellen.On top of the twists and turns of the case, Calder is faced with figures from her past including her ex-boyfriend Cal Innes and estranged younger brother Alan – now the minister of their late father's old church. However, these siblings have starkly different views of their shared childhood.As the case gathers momentum, Calder and Tosh are stunned by news of a brutal murder which has all the hallmarks of organised crime. However, there's another shock in store for the team."
      },
      {
        "id": "tvmaze:2668466",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2023-11-08",
        "overview": "Calder and Tosh stand over the body of the latest victim, lying in a remote ruin at the water's edge. Tosh sees the hand of organised crime in the murder but Calder casts doubt over her theory.On the other side of the island, crofter Agnes Moffat's morning drive is interrupted by a gun-toting Howell who forces her back home to look after the wounded Nowak while they wait for a means of escape.Elsewhere, Tosh and Calder deliver the grim news to the victim's family. Grief and shock turn into action as they take matters into their own hands.Calder is embarrassed to find her personal life becoming part of the investigation when Cal Innes, under Sandy's interrogation, uses her as his alibi. Unimpressed Procurator Fiscal, Harry Lamont, questions Calder's suitability for the case but Tosh comes to her defence.Elsewhere, a family meal ends with an alarming discovery for Calder, while, at the mortuary, Tosh is faced with evidence which sends their case in a dark new direction."
      },
      {
        "id": "tvmaze:2676616",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2023-11-15",
        "overview": "Calder decides to stay on and investigate the previous night's discovery. Tosh welcomes her support as the revelation of a tattoo sends the case in a sinister new direction.When a mysterious tribute is left at the crime scene, Tosh and Calder are drawn to the house of Tom Knox, a nervous and reclusive figure whose family have a longstanding feud with the Bains. Tom is guarded about his relationship with Ellen and the detectives grow suspicious.Elsewhere, Sandy visits a mental health facility where Ellen stayed briefly before moving to London. He discovers that she was admitted by her cousin Heather and looked after by Dr Azir Sadat. Both blame Ellen's breakdown on her hard partying lifestyle but it becomes clear that there are hidden layers to Heather and Azir's relationship.Tosh receives a shocking call from Cora at the mortuary with a horrifying development, while Calder's past and present collide when she hears a startling revelation about her father.As Calder and Tosh race to prevent disaster, they are drawn to a horrifying fire on a remote hillside and a brand new prime suspect in this increasingly complex and unnerving case."
      },
      {
        "id": "tvmaze:2679472",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2023-11-22",
        "overview": "In the interview room, the new prime suspect talks about his special connection to Ellen Quinn. He claims that his funeral rites were an act of love, part of an ancient religion. But Tosh and Calder see an attempt to destroy evidence.While Grace berates Calder and Tosh over their handling of the case, Stella is stunned to discover Ellen had a secret friendship with Tom Knox and decides to pay him a visit.Following Jean's shocking revelation, Calder sits on her fears about her father and Stella. However, when her secret background check on Amma returns a surprising link to Ellen Quinn, she must come clean to an unimpressed Tosh.When secret letters signed off with the mysterious symbol are uncovered at the home of Tosh's prime suspect, the team ask if his pen pal might be an accomplice to murder.At the same time, hospital security records bring one of Ellen's friends into the frame. Tosh and Calder track their latest suspect down to a remote location where they make a startling discovery."
      },
      {
        "id": "tvmaze:2684399",
        "title": "Episode 5",
        "season": 8,
        "episode": 5,
        "released": "2023-11-29",
        "overview": "Tosh visits the Sadats to ask if Ellen's struggles might be related to their son's death. They maintain that Ellen barely knew Akmal but, after Tosh leaves, Farida begins to unravel as her husband Azir watches on, concerned.A voicemail from the night before turns suspicion onto Bobby Bain, but Tosh resists Calder's demands to make an arrest. When Sandy finds evidence of drug dealing at Cal's house, a defensive James points the finger at Neil Bain.Tosh is accused of harassing the Sadats and Procurator Fiscal Harry tells her to back off. However, the warning only deepens Tosh's suspicion. Combing through the case files, she discovers evidence of a surprising connection between Heather Bain and the Sadats' family tragedy.Later, a surprise confession reveals the shocking next step in the final movements of Ellen Quinn."
      },
      {
        "id": "tvmaze:2689718",
        "title": "Episode 6",
        "season": 8,
        "episode": 6,
        "released": "2023-12-06",
        "overview": "The farm is in lockdown and police search teams swarm over the property, as the Bains are rocked by Azir's revelation. Believing the identity of the killer lies in the reason why Ellen left Shetland, Tosh and Calder arrest Bobby Bain. An explosive interrogation does nothing to dampen Calder's suspicions.Back at the farm, physical evidence of Ellen turns the spotlight on another member of her family, as the police continue to piece together her final movements.As the Bains begin to unravel, Grace remains defiant, but her silence only serves to confirm the existence of a secret at the heart of this family. Piecing together all that they have learnt so far, Tosh and Calder move ever closer to an answer beyond what either of them could have imagined."
      },
      {
        "id": "tvmaze:3034676",
        "title": "Episode 1",
        "season": 9,
        "episode": 1,
        "released": "2024-11-06",
        "overview": "DI Ruth Calder is talking to Malcolm Kidd, a jittery young man holding a shotgun. His brother's dead body lies on the floor between them. Tosh and the rest of the cavalry are waiting outside. It has to end at some point, but how?Later that night, Tosh attends her friend's birthday party and witnesses the argument of two married friends, Annie and Ian Bett. Their nine-year-old son, Noah, tells Tosh his parents are separating. Before they leave, Annie arranges a meeting with Tosh the next morning – she wants to speak to her about something important. Annie and Noah are staying with John Harris, a mussel farmer, and his sons Patrick and Fergus. But when Tosh arrives the next morning, there's no sign of Annie's car, and she's not picking up her phone. Where are Annie and Noah?"
      },
      {
        "id": "tvmaze:3043746",
        "title": "Episode 2",
        "season": 9,
        "episode": 2,
        "released": "2024-11-13",
        "overview": "A picture of victim Anton Bergen begins to emerge, leading Calder and Tosh to question whether they're dealing with a revenge killing. Furthermore, strange details begin to suggest there's a hidden side to Annie Bett. They attempt to fill in the pieces by speaking to Bergen's employers Karin and Stefan Jakobson – a wealthy Swedish couple who arrived in Shetland six months ago - and discover Bergen was a nurse to their chronically ill daughter, Astrid.Elsewhere, a hungover Ian is found slumped in an abandoned building, wearing bloodstained clothes. Unable to answer police questions, Ian is released. That is, until messages on Ian's phone shock Tosh to the core.Meanwhile, at the mortuary, Cora reveals a shocking discovery from her post mortem."
      },
      {
        "id": "tvmaze:3046065",
        "title": "Episode 3",
        "season": 9,
        "episode": 3,
        "released": "2024-11-20",
        "overview": "Rossi reveals details of Annie's hidden history, leaving Tosh and Calder to wonder whether they might be dealing with something bigger and more dangerous than previously thought. Noah gives a heart-breaking account of the fateful night but falls short of identifying the killer. He does, however, give Calder a strange, cryptic detail which spikes her interest.As conspiracy theorist Angus Wallace monitors the marine research facility, the opportunity to infiltrate presents itself. When he fails to return, his friend Lisa raises her concerns to Rev Alan Calder.Meanwhile, an emotional John Harris opens up to Tosh about his fondness for Annie. However, when a new connection to Bergen is unearthed, the team quickly grow suspicious of John's sons, Patrick and Fergus. As the Harrises find themselves under the police spotlight – and John wrestles the loss of his friend Annie - their family dynamic begins to unravel with shocking consequences"
      },
      {
        "id": "tvmaze:3047026",
        "title": "Episode 4",
        "season": 9,
        "episode": 4,
        "released": "2024-11-27",
        "overview": "In the aftermath of the tragedy, Calder questions Patrick about Annie who, while he didn't particularly like Annie or her relationship with John, insists he had nothing to do with her murder. Thanks to Angus' exaggerated testimony of his attack, Tosh and Calder finally get a search warrant for the facility. There, they find a hidden basement where sinister, possibly illegal, activity has taken place.In an interview with Dr Mohan, she reveals the identity of the mastermind behind the operation. Tosh and Calder consider whether this person could have been responsible for the deaths of Annie and Bergen. However, before they can connect the lab to the double murder, they go in search of vulnerable teen Astrid Jakobson, who's suddenly gone missing. Believing her to be an important witness, Tosh and Calder are up against it, both worrying that Astrid's elaborate efforts to escape the Isles will put her in grave danger.At the Bett house, Ian is stunned to find Rossi in the garden talking to Noah. He leaves with an ominous promise – Rossi will put things right for Annie. Hearing of the encounter, Calder worries what Euan Rossi is really doing in Shetland."
      },
      {
        "id": "tvmaze:3050519",
        "title": "Episode 5",
        "season": 9,
        "episode": 5,
        "released": "2024-12-04",
        "overview": "Standing in Rossi's abandoned hotel room, Tosh and Calder realise that he's been conducting his own investigation into who killed Annie and Bergen. Their fears are verified when MI5 agent Rob Harding warns them that if Rossi is seeking justice for his former protégé, it will be fatal. As they put the pieces of the investigation together, the detectives uncover a failed MI5 operation in London which surprisingly leads them to a local family, as a chilling showdown unravels.At the kirk, Alan organizes a memorial for Annie. However, the mood quickly sours when an unwanted face arrives to pay their respects, unsettling the family.In the aftermath of the confrontation, Tosh and Calder interview Rossi, who gives them his reasoning and motivation for going after Annie's killer – a tale full of guilt and revenge."
      },
      {
        "id": "tvmaze:3058717",
        "title": "Episode 6",
        "season": 9,
        "episode": 6,
        "released": "2024-12-11",
        "overview": "At the manse, Alan suspects that Lisa is lying about her argument with Annie on the day of her murder. After a surprising altercation, he calls his sister back to the kirk, where Lisa makes a shock confession to Calder and Tosh – shining a light on a new murder suspect.Meanwhile, an increasingly desperate Ian continues to struggle in the face of Noah's nightmares. To help, he makes the shocking decision to return to the scene of the crime…with heart-breaking consequences"
      },
      {
        "id": "tvmaze:3406829",
        "title": "Episode 1",
        "season": 10,
        "episode": 1,
        "released": "2025-11-05",
        "overview": "Calder and Tosh travel to the remote village of Lunniswick to investigate the brutal murder of an elderly woman. She has been out in the elements for several days."
      },
      {
        "id": "tvmaze:3425032",
        "title": "Episode 2",
        "season": 10,
        "episode": 2,
        "released": "2025-11-12",
        "overview": "In the aftermath of the fire, Tosh and Calder struggle to get answers from an unreliable suspect. A historic grudge from Eadie's time as a social worker comes to light."
      },
      {
        "id": "tvmaze:3431192",
        "title": "Episode 3",
        "season": 10,
        "episode": 3,
        "released": "2025-11-19",
        "overview": "Events in Lunniswick turn violent as holidaymakers Chris and Hayley risk it all to clear their debts. A paranoid Stevie wants Amy all to herself."
      },
      {
        "id": "tvmaze:3438290",
        "title": "Episode 4",
        "season": 10,
        "episode": 4,
        "released": "2025-11-26",
        "overview": "While Calder pressures Louden for help and Tosh investigates Robert Tulloch, Stevie's battle to keep her sister turns desperate."
      },
      {
        "id": "tvmaze:3441606",
        "title": "Episode 5",
        "season": 10,
        "episode": 5,
        "released": "2025-12-03",
        "overview": "Tosh finally confronts Billy about his relationship with Robert Tulloch. Fuelled by guilt over Louden, Calder goes after the people responsible."
      }
    ]
  }
}