{
  "meta": {
    "id": "tvmaze:70273",
    "type": "series",
    "name": "Mother, May I Murder?",
    "description": "What happens when nature's strongest bond between mother and child turns toxic? ID, explores exactly what happens when this connection turns deadly. In seven shocking stories, lust, greed, and jealousy drive mothers and their children to conspire with - and against - each other to kill. With gripping eye witness accounts and powerful home and police archives, this new ID series pulls back the dark underbelly of American family life to unmask manipulation and murder. From the extraordinary coast-to-coast crimes of a notorious mother-son grifter duo to shocking acts of revenge in small town America, Mother, May I Murder? reveals that the ties that bind families can also rip them apart.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/474/1186989.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/474/1186989.jpg",
    "videos": [
      {
        "id": "tvmaze:3452038",
        "title": "The Mother of Betrayal",
        "season": 2,
        "episode": 8,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:2610118",
        "title": "Suburban Psycho",
        "season": 1,
        "episode": 1,
        "released": "2023-07-31",
        "overview": "A mum, Kay Parsons, is brutally murdered in a Georgia suburb; her neighbour and best friend, Becky Sears, is shot the next day; police uncover a tale of adulterous deceit, which links the attacks and reveals a deadly mother-son conspiracy."
      },
      {
        "id": "tvmaze:2610119",
        "title": "Nine Bullet \"Suicide\"",
        "season": 1,
        "episode": 2,
        "released": "2023-08-07",
        "overview": "Police reveal a suspected suicide as a brutal nine-shot execution with only two suspects, the victim's ex-wife and their son; that son, Radley Horwitz, recalls the toxic series of events, which he says triggered his mother's murderous act of rage."
      },
      {
        "id": "tvmaze:2610120",
        "title": "Groomed to Kill",
        "season": 1,
        "episode": 3,
        "released": "2023-08-14",
        "overview": "Corey Breininger, a 10-year-old, shoots his father in a tragic accident, but years later, Corey reveals all is not what it seems; with extraordinary courage, he recounts the truly harrowing story of the sinister role played by his scheming stepmom."
      },
      {
        "id": "tvmaze:2618449",
        "title": "Blood Feud",
        "season": 1,
        "episode": 4,
        "released": "2023-08-21",
        "overview": "The heir-apparent to a Colorado ranch, Jake Millison, suddenly disappears, which shocks his friends, but his family doesn't seem to care. When a worker discovers human remains, an unexpected confession destroys the sacred bond between mother and child."
      },
      {
        "id": "tvmaze:2624538",
        "title": "Mommy's Little Sex Dungeon",
        "season": 1,
        "episode": 5,
        "released": "2023-08-28",
        "overview": "The murder of beloved husband and father, Ron, in a violent carjacking devastates his family. Yet his grieving widow and her son turn the family home into a party house full of sex toys and drugs, exposing a very different reality."
      },
      {
        "id": "tvmaze:2629043",
        "title": "The Grifter Murders",
        "season": 1,
        "episode": 6,
        "released": "2023-09-04",
        "overview": "The mysterious disappearance of a New York millionaire and an audacious plan to steal an $8 million townhouse unearth a scarcely believable story; how glamorous mother and son, Sante and Kenny Kimes, con, cheat and kill their way across America."
      },
      {
        "id": "tvmaze:2629044",
        "title": "The Root of All Evil",
        "season": 1,
        "episode": 7,
        "released": "2023-09-11",
        "overview": "A wife's lust for money and a lesbian love life sow the seeds for the brutal killing of her husband. The murder of popular businessman Kevin Boyd reveals a vicious family story of duplicity and betrayal."
      },
      {
        "id": "tvmaze:3377410",
        "title": "Sex, Lies and Murder",
        "season": 2,
        "episode": 1,
        "released": "2025-10-14",
        "overview": "A shooter kills a young mum in her home, and they leave her body locked in a sexual pose. Investigators suspect an attempt to shame her even in death."
      },
      {
        "id": "tvmaze:3402029",
        "title": "Mommy's Little Helper",
        "season": 2,
        "episode": 2,
        "released": "2025-10-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3427550",
        "title": "Murder in Law",
        "season": 2,
        "episode": 3,
        "released": "2025-11-04",
        "overview": "Police respond to a domestic assault, but a shock discovery in the backyard reveals a dark and sinister familial plot, fuelled by control and revenge."
      },
      {
        "id": "tvmaze:3436537",
        "title": "Whatever Mother Wants",
        "season": 2,
        "episode": 4,
        "released": "2025-11-11",
        "overview": "After the murder of a mother on a remote road, police dig into her bitter custody battle and uncover a disturbing bond between her ex and his mother."
      },
      {
        "id": "tvmaze:3436536",
        "title": "A Family Affair",
        "season": 2,
        "episode": 5,
        "released": "2025-11-18",
        "overview": "Gunmen shoot a man in broad daylight. And detectives uncover a tangled murder-for-hire plot driven by greed, manipulation, and a shocking prize."
      },
      {
        "id": "tvmaze:3441890",
        "title": "A Soldier's Secrets",
        "season": 2,
        "episode": 6,
        "released": "2025-11-25",
        "overview": "After the murder of an army major, police uncover a twisted world of swinging, manipulation, and a teen trapped in a family's dark double life."
      },
      {
        "id": "tvmaze:3448480",
        "title": "Seven Ways to Kill Your Lover",
        "season": 2,
        "episode": 7,
        "released": "2025-12-02",
        "overview": ""
      }
    ]
  }
}