{
  "meta": {
    "id": "tvmaze:253",
    "type": "series",
    "name": "Hell's Kitchen",
    "description": "In Hell's Kitchen, aspiring chefs are put through an intense culinary academy to prove they possess the right combination of ingredients to win a life-changing grand prize.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/587/1469625.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/587/1469625.jpg",
    "videos": [
      {
        "id": "tvmaze:3440522",
        "title": "Charity Dinner From Hell",
        "season": 24,
        "episode": 11,
        "released": "2025-12-11",
        "overview": "The team's ability to work together is put to the test when they are challenged to make Chinese dishes in a tag-team fashion; a charity night dinner service for organizations Feeding America and Stand Up To Cancer."
      },
      {
        "id": "tvmaze:3440523",
        "title": "TBA",
        "season": 24,
        "episode": 12,
        "released": "2026-01-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3440524",
        "title": "TBA",
        "season": 24,
        "episode": 13,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3440525",
        "title": "TBA",
        "season": 24,
        "episode": 14,
        "released": "2026-01-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3440526",
        "title": "TBA",
        "season": 24,
        "episode": 15,
        "released": "2026-01-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3440520",
        "title": "Is It Steak?",
        "season": 24,
        "episode": 10,
        "released": "2025-12-04",
        "overview": "It's time for the annual blind taste test; the teams must push aside tensions to come out on top with a perfect dinner service."
      },
      {
        "id": "tvmaze:20906",
        "title": "12 Chefs Compete",
        "season": 1,
        "episode": 1,
        "released": "2005-05-30",
        "overview": "HELL'S KITCHEN is a culinary boot camp that features a group of aspiring restaurateurs opening a top-class restaurant, overseen by world-renowned but terrifying chef GORDON RAMSAY. A former pro-soccer-player-turned-Michelin-starred-chef, Ramsay has conquered London's haute cuisine scene. Now he's crossing the Pond to Los Angeles, to open the city's newest restaurant and discover - or create - the country's next culinary star. HELL'S KITCHEN will follow 12 competing chefs 24/7, capturing the fiery drama, intrigue and high emotion as the restaurant's opening night approaches. These ambitious hopefuls believe they have the drive, talent and desire to run their own restaurant, and they will be tossed into the cauldron, working under Ramsay and fighting for survival. So for the trainees, this means one thing: if they can't stand the heat, they'll have to get out of HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20907",
        "title": "11 Chefs Compete",
        "season": 1,
        "episode": 2,
        "released": "2005-06-06",
        "overview": "After barely surviving the opening night of the HELL'S KITCHEN restaurant, the heat is on as the contestants prepare for their second dinner service. These wannabe chefs and restaurateurs are trying to impress world-renowned but terrifying head chef Gordon Ramsay. A former pro-soccer-player-turned-Michelin-starred-chef, Ramsay has conquered London's haute cuisine scene and has crossed the Pond to Los Angeles, to open the city's newest restaurant and discover - or create - the country's next culinary star. Each week, Ramsay will slice and dice the contestants, keeping only those who possess the right ingredients to ensure success. So for the trainees, this means one thing: if they can't stand the heat, they'll have to get out of HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20908",
        "title": "10 Chefs Compete",
        "season": 1,
        "episode": 3,
        "released": "2005-06-13",
        "overview": "After barely surviving the opening night of the Hell's Kitchen restaurant and fumbling their way through night two, the remaining contestants have gotten more than a taste of the wrath of Chef Ramsay - and hungry patrons. As the contestants prepare for their third dinner service, the pressure of Hell's Kitchen is too much for one of the wannabe chefs, who chooses to leave HK and hang up their apron for good. But the choice is Ramsay's for another unlucky contestant whose goose is cooked on HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20909",
        "title": "8 Chefs Compete",
        "season": 1,
        "episode": 4,
        "released": "2005-06-20",
        "overview": "HELL'S KITCHEN continues to sizzle as the contestants attempt to serve up Gordon Ramsay's signature dishes at Los Angeles' newest hot spot, Haute Cuizine. These wannabe chefs and restaurateurs are trying to impress world-renowned but terrifying head chef Gordon Ramsay. Tonight another contestant's fate is chosen by Ramsay as he continues to slice and dice those who do not possess the right ingredients for HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20910",
        "title": "7 Chefs Compete",
        "season": 1,
        "episode": 5,
        "released": "2005-06-27",
        "overview": "On the restaurant's fifth night, HELL'S KITCHEN gets a taste of Italy as the contestants not only make, but serve, an entire Italian-themed menu. After a tense competition in the afternoon, one team is rewarded with an afternoon outing with Chef Ramsay. Later at the dinner service, the participants' competitive nature comes to a head as one team deliberately sabotages the other while a contestant makes a decision that shocks both the red and blue teams. At the end of the night, Ramsay tells an unlucky contestant to \"fugget-about-it\" and kicks them out of HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20911",
        "title": "6 Chefs Compete",
        "season": 1,
        "episode": 6,
        "released": "2005-07-11",
        "overview": "As the HELL'S KITCHEN contestants prepare for their sixth dinner service, Chef Ramsay reveals the latest twist - each team will create its own menu consisting of three appetizers, entrees and desserts. Egos and tempers reach a boiling point as the wannabe chefs hustle to get their signature dishes up to Ramsay's impeccable standard and out to the hungry guests in a timely manner. At the end of the service, the contestants learn the hard way that each person is out for him- or herself while two contestants' futures at HK are on the line. The next night, the five remaining contestants learn they are no longer competing as teams, but as individuals who must work together (and against one another) to complete an entire dinner service. The theme of the dinner is tableside service, with both the appetizers and dessert prepared tableside. To further complicate matters, there is a power failure, and the filet mignon mysteriously disappears. Accompanied by the usual relentless criticism from Chef Ramsay, the service proves to be too stressful for some of the wannabe chefs, who lose their cool and retaliate. But Ramsay gets the last word and someone's head ends up on his chopping block."
      },
      {
        "id": "tvmaze:20912",
        "title": "5 Chefs Compete",
        "season": 1,
        "episode": 7,
        "released": "2005-07-11",
        "overview": "The final four have to create a haute-cuisine meal made entirely of leftovers from the previous night's dinner service. The winner gets to cook alongside Ramsay on a national TV show, which raises the temperature in the kitchen even higher."
      },
      {
        "id": "tvmaze:20913",
        "title": "4 Chefs Compete",
        "season": 1,
        "episode": 8,
        "released": "2005-07-18",
        "overview": "HELL'S KITCHEN opens its eighth night with not only the contestants left over from the previous night's service, but also the ingredients. The four remaining chefs are given 15 minutes and a tray of leftovers to create a meal that Chef Ramsay considers servable. The winner of the challenge is rewarded with a chance to cook on a live national TV show alongside Ramsay. Jealousy and desperation are eating away at the wannabe chefs and with all of them fighting for themselves, the kitchen feels like a pressure cooker. Who can handle the heat and who gets kicked out of the kitchen?"
      },
      {
        "id": "tvmaze:20914",
        "title": "3 Chefs Compete",
        "season": 1,
        "episode": 9,
        "released": "2005-07-25",
        "overview": "It's down to the final three in this blazing kitchen and Gordon's task of serving an entire dining room becomes too much for one contestant who's succumbing to fatigue. The contestants' signature dishes are served, but one disastrous performance causes the other teammates to suffer. Find out who will create the most mouth-watering dish and who will be sent home without their just desserts on HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20915",
        "title": "2 Chefs Compete",
        "season": 1,
        "episode": 10,
        "released": "2005-08-01",
        "overview": "It's down to the final two contestants who have survived the wrath of Ramsay and many disastrous nights at Hell's Kitchen. In the two-hour season finale, Ramsay turns HK over to the battling duo by dividing the restaurant in half - with each wannabe chef designing a portion of the restaurant. From décor, to creating the menu, to naming the spot, the contestants will be tested on how they run the restaurant and the kitchen on their own. These chefs will need some help slicing and dicing their way to win the final challenge, and to their surprise, Ramsay hand-picks former contestants to staff the kitchen and help the final two achieve their goal. Tempers blaze and egos boil as the wannabe chefs do their best to emulate the high standards taught and expected by Ramsay. Who will succumb to the pressure, and who will Ramsay crown head chef?"
      },
      {
        "id": "tvmaze:20916",
        "title": "12 Chefs Compete",
        "season": 2,
        "episode": 1,
        "released": "2006-06-12",
        "overview": "World-renowned chef GORDON RAMSAY is back for a second serving of the sizzling unscripted series HELL'S KITCHEN. A former pro-soccer-player-turned-Michelin-starred-chef, Ramsay has conquered London's haute cuisine scene. Now he's crossing the Pond again, to discover - or create - America's next culinary star. The heat is on and the stakes are high as the contestants endure Ramsay's hellishly intense culinary boot camp for a chance to win the ultimate culinary prize - the coveted title of Executive Chef of a luxurious fine-dining restaurant at the brand-new Red Rock Casino Resort Spa in Las Vegas. In addition, the winner will be eligible to receive a financial interest in the restaurant and assist in the design of the eatery. Each week Ramsay will slice and dice the contestants, keeping only those who possess the right combination of ingredients to ensure success. In this pressure-cooker environment, only one thing is certain: if the contestants can't stand the heat, they'll have to get out of HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20917",
        "title": "11 Chefs Compete",
        "season": 2,
        "episode": 2,
        "released": "2006-06-12",
        "overview": "After a disastrous opening night, the women deal with their defeat while the men prepare for their next challenge. But when the pressure is on, both teams face setbacks as the stress cracks one wannabe chef for good while another gets pulled from the kitchen. Per Ramsay's request, the contestants learn that a good restaurant is not just about food but also about service, and they get a taste of what it's like to be a waiter at a restaurant. With Ramsay up in smoke, two are put on the chopping block and one is forced to leave."
      },
      {
        "id": "tvmaze:20918",
        "title": "9 Chefs Compete",
        "season": 2,
        "episode": 3,
        "released": "2006-06-19",
        "overview": "After another frustrating dinner service, Ramsay teaches the group a lesson in communication and timing, which are key to a successful restaurant. But when gender roles are challenged, Ramsay isn't the only one frustrated with the wannabe chefs as each team works harder to prove the opposite sex wrong. The third night's goal is to have a complete dinner service, but find out who can't cut it and is kicked out of the kitchen."
      },
      {
        "id": "tvmaze:20919",
        "title": "8 Chefs Compete",
        "season": 2,
        "episode": 4,
        "released": "2006-06-26",
        "overview": "With one team in a deficit, the battle of the sexes is over as Ramsay switches up the groups in hopes of helping them out. Now with even teams, Hell's Kitchen is open for lunch for the first time ever and the wannabe chefs are put to the test as they serve a new category of guests: children. But just when things start to look better, the contestants once again fumble in the kitchen and Ramsay, disappointed with everyone, forces one cook to leave."
      },
      {
        "id": "tvmaze:20920",
        "title": "7 Chefs Compete",
        "season": 2,
        "episode": 5,
        "released": "2006-07-10",
        "overview": "As HELL'S KITCHEN continues to sizzle, the wannabe chefs get a taste of Gordon Ramsay's wrath as he teaches them all a lesson on culinary flavor. With only seven contestants remaining, the stakes are even higher and each mistake could cost them the competition. Ramsay hopes for a complete dinner service tonight, but while one team pulls through, the other fails miserably."
      },
      {
        "id": "tvmaze:20921",
        "title": "6 Chefs Compete",
        "season": 2,
        "episode": 6,
        "released": "2006-07-17",
        "overview": "Inspiration is Ramsay's next lesson as the two teams battle it out with original dishes to win a night out in the town. With the stakes even higher, Ramsay gives them the opportunity to create their own menu for the night's dinner service. But even with the freedom of cooking up the meal of their choice, one wannabe chef can't stand the heat and gets cooked for good."
      },
      {
        "id": "tvmaze:20922",
        "title": "5 Chefs Compete",
        "season": 2,
        "episode": 7,
        "released": "2006-07-24",
        "overview": "With only five remaining contestants, Ramsay turns up the heat as the two teams merge and the wannabe chefs compete for the first time as individuals. While some take a trip to Las Vegas with Ramsay and get a taste of what it's like to own a restaurant at the Red Rock Casino Resort, others let jealousy eat away at them. As HELL'S KITCHEN opens its eighth night, the group must complete the dinner service together, but teamwork doesn't come easy for these competing chefs and one is put on the chopping block."
      },
      {
        "id": "tvmaze:20923",
        "title": "4 Chefs Compete",
        "season": 2,
        "episode": 8,
        "released": "2006-07-31",
        "overview": "As the wannabe chefs get one step closer to winning the chance to run a Las Vegas restaurant, the final four try to dodge the chopping block as the stakes get higher with every challenge. Chef Ramsay is impressed at the start of the dinner service, but when things take a turn for the worse no one is ever safe in his kitchen. Then, an unexpected decision makes the contestants realize it's every man for woman for him- or herself, and the final three contestants are announced ."
      },
      {
        "id": "tvmaze:20924",
        "title": "3 Chefs Compete",
        "season": 2,
        "episode": 9,
        "released": "2006-08-07",
        "overview": "After a surprising elimination round, the remaining three contestants realize that no one is ever safe in the kitchen and tension amounts as they each strive to be the last one standing. With the finals approaching, Ramsay tests their leadership skills and gives them each a chance to run the kitchen. But his job is not as easy as it seems and one wannabe chef learns that it takes more than good cooking to win it all ."
      },
      {
        "id": "tvmaze:20925",
        "title": "2 Chefs Compete",
        "season": 2,
        "episode": 10,
        "released": "2006-08-14",
        "overview": "It's down to the final stretch as the last two contestants are one dinner service away from being crowned the winner of HELL'S KITCHEN. After overcoming several failed tasks and watching Chef Ramsay eliminate their opponents, the final two face the ultimate test: to design and run their own restaurant. From the menu to the décor, they must combine cooking skills with creativity and passion to prove their worth to Ramsay. Find out which contestant survives the pressure cooker and becomes the new head chef at a multi-million dollar Las Vegas restaurant."
      },
      {
        "id": "tvmaze:20926",
        "title": "12 Chefs Compete",
        "season": 3,
        "episode": 1,
        "released": "2007-06-04",
        "overview": "Mondays are going to be hell for the 12 would-be restaurateurs trying to impress world-renowned chef Gordon Ramsay in the third serving of the sizzling unscripted series HELL'S KITCHEN. A former pro-soccer-player-turned-Michelin-starred-chef, Ramsay has conquered London's haute cuisine scene and recently opened his first U.S. restaurant. Now he's back to discover - or create - America's next culinary star. The heat is on and the stakes are high as the contestants endure Ramsay's hellishly intense culinary boot camp for a chance to win the grand prize and opportunity of a lifetime - the coveted title of Head Chef of the Terra Rossa restaurant at the Green Valley Ranch Resort, Spa and Casino in Las Vegas. Each week Ramsay will slice and dice the contestants, keeping only those who possess the right combination of ingredients to ensure success. In this pressure-cooker environment, only one thing is certain: if the contestants can't stand the heat, they'll have to get out of HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20927",
        "title": "11 Chefs Compete",
        "season": 3,
        "episode": 2,
        "released": "2007-06-11",
        "overview": "After a disastrous opening night at HELL'S KITCHEN, the women deal with their defeat while both teams prepare for the next challenge. As temperatures inside the kitchen rise, one of the contestants starts to succumb to the pressure and might not have what it takes to survive chef Gordon Ramsay. Meanwhile, with the reward of precious time spent outside the kitchen with Chef Ramsay motivating both teams, the guys and girls face off in a challenge that tests their food preparation skills, with the losing team faced with an almost impossible undertaking. Chef Ramsay's temper is tested once again as both teams attempt to complete dinner service, two contestants are put on the chopping block and one is forced to leave."
      },
      {
        "id": "tvmaze:20928",
        "title": "10 Chefs Compete",
        "season": 3,
        "episode": 3,
        "released": "2007-06-18",
        "overview": "The teams face off once again with a special challenge as they prepare breakfast for men and women of the armed forces who have come to dine at HELL'S KITCHEN. Not unlike a drill sergeant himself, Chef Ramsay pushes each team to serve the honored guests with impeccable quality, and the team leaders are given the perfect opportunity to either shine or crumble under the pressure. After demonstrating they can truly feed an army, the winning team is rewarded with a special day of rest and relaxation, while the losing team finds out what Kitchen Patrol, or KP, is really like in HELL'S KITCHEN. When one of the contestants falls seriously ill, the team must carry on, not knowing if their fallen comrade will be able to return. Later, Chef Ramsay's temper is pushed to the limits as the teams attempt to complete dinner service once again. When one team narrowly escapes serving a potentially toxic dish, a contestant is forced to leave."
      },
      {
        "id": "tvmaze:20929",
        "title": "9 Chefs Compete",
        "season": 3,
        "episode": 4,
        "released": "2007-06-25",
        "overview": "The remaining chefs compete in a blindfolded taste test. The losers must then taste items that are somewhat less than appetizing while the winners dine with Chef Ramsay. At the dinner service, the dishes are critiqued and rated by the diners."
      },
      {
        "id": "tvmaze:20930",
        "title": "8 Chefs Compete",
        "season": 3,
        "episode": 5,
        "released": "2007-07-02",
        "overview": "After a disastrous dinner service the previous night, the remaining eight contestants are shocked to hear that their next challenge will have nothing to do with cooking. Emphasizing that the secret to being a good chef is having a discerning palate, Chef Ramsay pits the teams against each other in a HELL'S KITCHEN taste-test challenge. The blindfolded contestants go head-to-head to identify a selection of foods chosen by Chef Ramsay, relying not only on their taste buds, but also on their experience as chefs. When the losing team fails to identify some of the most commonplace food items, Chef Ramsay orders a grotesque taste-testing practice session that turns even some of the strongest contestants' stomachs. Meanwhile, the winning team members get to treat their palates to a unique dining experience with Chef Ramsay that is unlike anything they've ever experienced before. At the next dinner service, the contestants' fate lies in the hands of the customers, who will rate and critique the meals they are served that evening. As Chef Ramsay's insults abound, the criticism pushes some contestants dangerously close to their breaking point."
      },
      {
        "id": "tvmaze:20931",
        "title": "7 Chefs Compete",
        "season": 3,
        "episode": 6,
        "released": "2007-07-09",
        "overview": "The seven remaining contestants are challenged to present a meal for a wedding reception taking place at HELL'S KITCHEN. The teams go shopping and race the clock to buy all of their ingredients on-time and under-budget. When it's time for the bride and groom to taste the entrées, one team makes a truly inadequate and embarrassing presentation, and Chef Ramsay needs all of his strength not to explode into a fit of fury in front of the guests of honor. At dinner service that night, the pressure is on as both teams race to make sure they do not disappoint the newlyweds or the hungry bridal party. But when a power struggle ensues in the kitchen, Chef Ramsay must find a solution or forever hold his peace."
      },
      {
        "id": "tvmaze:20932",
        "title": "6 Chefs Compete",
        "season": 3,
        "episode": 7,
        "released": "2007-07-16",
        "overview": "After a decisive dinner service and a swift elimination the night before, the remaining six contestants prepare for their next challenge. Chef Ramsay informs them they must turn trays full of leftovers into delectable meals in just 30 minutes, a challenge he always gives his chefs to test their resourcefulness and creativity. It's a mad dash as each team sifts through the leftover ingredients in order to come up with one appetizer and two entrees tasty enough to impress Chef Ramsay. While one team fails to \"wow\" him, the winning team is elated at the challenge reward when they are given the ultimate chance for revenge on Chef Ramsay. At dinner service that evening, the competition gets serious as each team designs and executes its own original menu. When the HELL'S KITCHEN diners seem to be ordering mainly from one team's menu, lack of teamwork and poor communication may signal the end of one contestant's dream."
      },
      {
        "id": "tvmaze:20933",
        "title": "5 Chefs Compete",
        "season": 3,
        "episode": 8,
        "released": "2007-07-23",
        "overview": "With only five chefs remaining in the competition, Chef Ramsay combines them into one team and they celebrate their survival thus far in HELL'S KITCHEN. Chef Ramsay tells the contestants that their next challenge will involve competing head-to-head with individual dishes to impress some very special trendsetters. The contestants are blindfolded and escorted off-site, only to find that the judges-of-honor are 100 hungry and very opinionated high school students. One chef handily wins the votes of the hungry high-schoolers and is rewarded with a special trip with Chef Ramsay and a contestant of their choosing to the Green Valley Ranch resort in Las Vegas, where they meet up with a familiar face. Back in HELL'S KITCHEN, the contestants prepare the restaurant for the upcoming dinner service. That evening, the job goes anything but smoothly as two contestants engage in a heated power struggle. After one too many mistakes, Chef Ramsay loses his patience, and in a fit of rage sends one contestant packing in the middle of dinner service. Then, at a very emotional elimination that evening, Chef Ramsay makes a heartfelt offer to a deserving contestant."
      },
      {
        "id": "tvmaze:20934",
        "title": "3 Chefs Compete",
        "season": 3,
        "episode": 9,
        "released": "2007-07-30",
        "overview": "At their next challenge, Chef Ramsay instructs the Top 3 contestants to take a classic American dish and transform it into an entrée worthy of fine-dining, noting that special guests of honor will be judging their creations. In one of the most emotional reunions yet, the contestants learn that the greatest home-cooking experts they know - their very own mothers - have come to HELL'S KITCHEN to vote for their favorite entrée. Not knowing who made what, the mothers select a winner, who is treated to a memorable meal. That evening in a critical dinner service, Chef Ramsay informs the chefs that each of them will have a shot at running the kitchen in his place, so that he can separate the cooks from the leaders. To ensure that the chefs have a discerning eye and a desire for perfection not unlike his own, Chef Ramsay enlists the helps of the sous chefs to throw some wrenches into the preparations. While some contestants catch the mistakes before the sabotaged plates are served to the diners, others struggle to handle the hot plate. In one of the most difficult eliminations yet, Chef Ramsay chooses two finalists who will go on to compete for the Head Chef position."
      },
      {
        "id": "tvmaze:20935",
        "title": "2 Chefs Compete",
        "season": 3,
        "episode": 10,
        "released": "2007-08-06",
        "overview": "It's down to the final stretch as the last two contestants are one dinner service away from being crowned the winner of HELL'S KITCHEN. After overcoming several failed tasks and watching Chef Ramsay eliminate their opponents, the final two face the ultimate test: to design and run their own restaurant. From the menu to the décor, they must combine cooking skills with creativity and passion to prove their worth to Ramsay."
      },
      {
        "id": "tvmaze:20936",
        "title": "Winner Announced",
        "season": 3,
        "episode": 11,
        "released": "2007-08-13",
        "overview": "In the much-anticipated season finale, the last two contestants come face-to-face to with Chef Ramsay to learn which of them he will designate winner of HELL'S KITCHEN. To complete their final challenge, Chef Ramsay brings in some helping hands to staff the dinner service, and tempers blaze as the competing chefs do their best to impress Chef Ramsay. See who survives the pressure cooker and becomes the new head chef at the Green Valley Ranch Resort, Spa and Casino in Las Vegas."
      },
      {
        "id": "tvmaze:20937",
        "title": "15 Chefs Compete",
        "season": 4,
        "episode": 1,
        "released": "2008-04-01",
        "overview": "HELL'S KITCHEN is back open for business! The pressure is on, as this season's prize is bigger and better than ever before. Chef Ramsay will pick one lucky contestant to become the Executive Chef for his new restaurant, The London West Hollywood. Gordon wastes no time as he immediately sends the contestants to the kitchen to prepare their signature dish. In the most shocking taste-test ever, Gordon gets physically sick from a contestant's concoction leaving everyone speechless. During the first dinner service, emotions run high and one contestant goes missing. Will Gordon be forced to shut down the kitchen?"
      },
      {
        "id": "tvmaze:20938",
        "title": "14 Chefs Compete",
        "season": 4,
        "episode": 2,
        "released": "2008-04-08",
        "overview": "In pursuit of the prestigious Executive Chef title of Gordon Ramsay's new restaurant, The London West Hollywood, the blue and red teams are now in the competition up to their gills. For the first challenge, the teams must prove they can make the cut by accurately slicing a halibut into six-ounce filets. The winning team will swim away to receive some much needed rest before the second dinner service. The night will bring several changes, as one member of each team must work as a maitre d' while the others staff the kitchen. Tempers flare as both teams struggle to provide the best service, yet one chef will be eliminated on HELL'S KITCHEN."
      },
      {
        "id": "tvmaze:20939",
        "title": "13 Chefs Compete",
        "season": 4,
        "episode": 3,
        "released": "2008-04-15",
        "overview": "The competition has gone to the birds as the contestants are woken up by the sounds of chickens running around their sleeping quarters. The two teams head to the kitchen and race to cook some chickens. Chef Ramsay demands absolute perfection and will count the birds only if they are perfectly plucked. The winning team will get to dress up and fly the coop, while the losing team is sent to the fields to pick peppers. The dinner service requires the contestants to serve the chicken family-style at the tables, but nerves and inexperience could leave many families hungry."
      },
      {
        "id": "tvmaze:20940",
        "title": "12 Chefs Compete",
        "season": 4,
        "episode": 4,
        "released": "2008-04-22",
        "overview": "The two teams must compete to see who can prepare the most pasta for the evening dinner service, with a trip to Santa Monica for the winners. One contestant winds up in the hospital after an accident in the kitchen."
      },
      {
        "id": "tvmaze:20941",
        "title": "11 Chefs Compete",
        "season": 4,
        "episode": 5,
        "released": "2008-04-29",
        "overview": "The chefs receive their first challenge, create a gourmet pizza. The winning team will head to Santa Barbara for a gourmet meal, while the losers will be sentenced to taking pizza orders during dinner service and then deliver them, at which one contestant is rushed to the hospital after suffering an accident."
      },
      {
        "id": "tvmaze:20942",
        "title": "10 Chefs Compete",
        "season": 4,
        "episode": 6,
        "released": "2008-05-06",
        "overview": "This episode finds the chefs challenged to satisfy a picky teen as they cook up a meal for her birthday party. The winners will be chosen by the teen by picking the menu theme she prefers, while the losers are stuck with a perky party planner to help with the party decisions."
      },
      {
        "id": "tvmaze:20943",
        "title": "9 Chefs Compete",
        "season": 4,
        "episode": 7,
        "released": "2008-05-13",
        "overview": "Chef Ramsay tests the teams' taste-buds by doing a blindfold taste-test challenge. Find out who knows their pork from their chicken and their potatoes from their polenta. Those who impress Chef Ramsay get to enjoy being pampered at the spa, while the losing team is forced to clean the dorms. During dinner service when one team tries to serve raw food and the other team fails to communicate with one another, Gordon loses his cool. Will the teams be able survive his wrath in the \"9 Chefs Compete\" episode."
      },
      {
        "id": "tvmaze:20944",
        "title": "8 Chefs Compete",
        "season": 4,
        "episode": 8,
        "released": "2008-05-20",
        "overview": "The group dynamics are drastically changed when Chef Ramsey asks for a volunteer to switch sides. This week's challenge consists of creating 4 new dishes from 20 ingredients. One chef requires a medic after injuring himself during the challenge."
      },
      {
        "id": "tvmaze:20945",
        "title": "7 Chefs Compete",
        "season": 4,
        "episode": 9,
        "released": "2008-05-27",
        "overview": "The opening challenged for the seven remaining chefs is to prepare dishes in a relay race, with the winners receiving surfing lessons and the losers being forced to clean the restaurant. The dinner service finds the teams creating their own menus. Following the difficulty for one team is a most unusual elimination ceremony."
      },
      {
        "id": "tvmaze:20946",
        "title": "6 Chefs Compete",
        "season": 4,
        "episode": 10,
        "released": "2008-06-03",
        "overview": "Chef Ramsey hopes to inspire his wanna be chefs by bringing them to the restaurant of last years winner in London West Hollywood. Back in the kitchen, now with the teams merged each chef is given one main ingredient to uses in their dish. The dinner service finds one chef burning the rice and another scorching their hand."
      },
      {
        "id": "tvmaze:20947",
        "title": "5 Chefs Compete",
        "season": 4,
        "episode": 11,
        "released": "2008-06-10",
        "overview": "Chef Ramsey challenges the five remaining contestants to teach cooking impaired housewives how to prepare a gourmet meal, with a winner receiving personal lessons from Chefs Mark Peel and Ben Ford. The dinner service finds all the chefs struggling with a dozen of appetizers, main courses and desserts."
      },
      {
        "id": "tvmaze:20948",
        "title": "4 Chefs Compete",
        "season": 4,
        "episode": 12,
        "released": "2008-06-17",
        "overview": "The final four contestants prepare a specialty lunch for some surprise guests Chef Ramsay has invited to Hell's Kitchen. When the doors open, 80 very hungry, very picky and very pregnant moms-to-be walk through the door! The ladies choose the best dish and send the winner on a $1000 shopping spree. The remaining chefs are forced to stay behind and clean up after the luncheon. During dinner service tempers flare and tension is high, and one contestant gets careless and burns Chef Ramsay's hand, which sends Ramsay over the edge in the \"4 Chefs Compete\" episode."
      },
      {
        "id": "tvmaze:20949",
        "title": "3 Chefs Compete",
        "season": 4,
        "episode": 13,
        "released": "2008-06-24",
        "overview": "Chef Ramsay creates a breakfast for the 3 remaining contestants and a few chosen guests and then challenges them to recreate what they have just ate. Ramsay sabotages the dinner service as a way to see how the contestants will react to this adversity."
      },
      {
        "id": "tvmaze:20950",
        "title": "2 Chefs Compete",
        "season": 4,
        "episode": 14,
        "released": "2008-07-01",
        "overview": "The two finalists are prepared to be judged by chef Ramsey's executive chefs from around the world, as they visit Gordon Ramsey's New York restaurant to create their signature dishes. Back in Los Angeles, they will be challenged to design and run their own restaurant."
      },
      {
        "id": "tvmaze:20951",
        "title": "Winner Announced",
        "season": 4,
        "episode": 15,
        "released": "2008-07-08",
        "overview": "The final two contestants are tested in their last dinner service before Chef Ramsey makes his choice over who will run his L.A. restaurant."
      },
      {
        "id": "tvmaze:20952",
        "title": "16 Chefs Compete",
        "season": 5,
        "episode": 1,
        "released": "2009-01-29",
        "overview": "HELL'S KITCHEN is heating up and the pressure is on, as sixteen new contestants step into the restaurant for the first time. Immediately after the contestants' arrival, they are sent to the kitchen to prepare their signature dishes. During the presentation of the dishes, Gordon finds himself pleasantly surprised with what he sees until one contestant goes too far and instantly puts Gordon in a foul mood. During dinner service a fight breaks out in the kitchen before the doors even open! Emotions are running high because the contestants know that at the end of the journey Chef Ramsay will pick one lucky chef who will win the grand prize, a \"Head Chef\" position at the Borgata Hotel Casino &amp; Spa, the East Coast's leading resort destination."
      },
      {
        "id": "tvmaze:20953",
        "title": "15 Chefs Compete",
        "season": 5,
        "episode": 2,
        "released": "2009-02-05",
        "overview": "Chef Ramsey puts the Red and Blue teams in a new challenge, which causes tempers to flare and will result in the dismissal of one more contestant."
      },
      {
        "id": "tvmaze:20954",
        "title": "14 Chefs Compete",
        "season": 5,
        "episode": 3,
        "released": "2009-02-19",
        "overview": "Chef Ramsey has the remaining 14 chefs make a visit to the meat locker to learn about every cut of beef, then gives them a challenge by declaring the kitchen a steak house for the night."
      },
      {
        "id": "tvmaze:20955",
        "title": "13 Chefs Compete",
        "season": 5,
        "episode": 4,
        "released": "2009-02-26",
        "overview": "50 young football players and cheerleaders will be served breakfast by the 13 remaining chefs. One team runs short on eggs, and 1 more chef is released."
      },
      {
        "id": "tvmaze:20956",
        "title": "12 Chefs Compete",
        "season": 5,
        "episode": 5,
        "released": "2009-03-05",
        "overview": "After sending the chefs to an Asian market, Chef Ramsay challenges them to create three Asian-fusion dishes utilizing poultry, seafood and beef. The teams then present their dishes for judging by Chef Ramsay and Tanya Steel, Editor-in-Chief of Epicurious.com. The following night, the teams go head-to-head at dinner service, and tensions run high as chefs from both teams crack under pressure. Chef Ramsay throws in a last-minute twist before sending the losing chef home."
      },
      {
        "id": "tvmaze:20957",
        "title": "11 Chefs Compete",
        "season": 5,
        "episode": 6,
        "released": "2009-03-12",
        "overview": "The remaining 11 chefs are challenged to cook variations of the three favorite foods of the honoree for his Bar Mitzvah. The dinner service seems to go well, but not for one contestant."
      },
      {
        "id": "tvmaze:20958",
        "title": "10 Chefs Compete",
        "season": 5,
        "episode": 7,
        "released": "2009-03-19",
        "overview": "The remaining 10 chefs are challenged to use leftovers to create tapas-styled dishes (aka, small plates). Both teams are nearly derailed at dinner by one chef's mistake, and the lack of cohesion within the blue team steams chef Ramsey."
      },
      {
        "id": "tvmaze:20959",
        "title": "9 Chefs Compete",
        "season": 5,
        "episode": 8,
        "released": "2009-03-26",
        "overview": "The nine remaining chefs feel the pressure with the presence of guest diners Eric McCormack and Robert Patrick, plus they also face a taste-test competition."
      },
      {
        "id": "tvmaze:20960",
        "title": "8 Chefs Compete",
        "season": 5,
        "episode": 9,
        "released": "2009-04-02",
        "overview": "The remaining 8 chefs will be working with king crab, and each team will show Chef Ramsey their strongest presentation. Dinner service will find the teams creating a menu."
      },
      {
        "id": "tvmaze:20961",
        "title": "7 Chefs Compete",
        "season": 5,
        "episode": 10,
        "released": "2009-04-09",
        "overview": "The seven remaining chefs are on their own now that Chef Ramsey has dissolved the teams. This week's challenge is for the chefs to use 14 simple ingredients in a dish. Later, the chefs will once again need to work as one for dinner service, but things heat up and one chef finds themselves in need of medical attention."
      },
      {
        "id": "tvmaze:20962",
        "title": "6 Chefs Compete",
        "season": 5,
        "episode": 11,
        "released": "2009-04-16",
        "overview": "The remaining six chefs head to the Borgata Casino &amp; Spa in Atlantic City, where the show's winner will be named a top chef, and are challenged to create a signature dish in which would be served at the Borgata."
      },
      {
        "id": "tvmaze:20963",
        "title": "5 Chefs Compete",
        "season": 5,
        "episode": 12,
        "released": "2009-04-23",
        "overview": "The four remaining chefs have a meal cooked for them by Chef Ramsey, then are challenged to recreate what he had prepared. Later, a surprise proposal is planned for the dinner service's desert course."
      },
      {
        "id": "tvmaze:20964",
        "title": "3 Chefs Compete",
        "season": 5,
        "episode": 13,
        "released": "2009-04-30",
        "overview": "The remaining three chefs will be cooking up a meal for the 100 top chefs in L.A. The winner will make an appearance on FOX's local morning show, while the losers must clean and iron the Hell's Kitchen's linens and watch the winner on TV. At dinner service, each of the three must \"run the pass,\" a test which only two can pass."
      },
      {
        "id": "tvmaze:20965",
        "title": "2 Chefs Compete",
        "season": 5,
        "episode": 14,
        "released": "2009-05-07",
        "overview": "It's back to Atlantic City for the final 2 chefs as they discuss their possible menus with the chief operating officer of the Borgata Hotel, Casino &amp; Spa. But first they must discuss their space designs at the restaurant with an architect for the final dinner service competition."
      },
      {
        "id": "tvmaze:20966",
        "title": "Winner Announced",
        "season": 5,
        "episode": 15,
        "released": "2009-05-14",
        "overview": "The season 5 finale finds the remaining two chefs competing in their final dinner service competition. The winner will be named head-chef at a new restaurant at the Borgata Hotel Casino &amp; Spa in Atlantic City."
      },
      {
        "id": "tvmaze:20967",
        "title": "16 Chefs Compete",
        "season": 6,
        "episode": 1,
        "released": "2009-07-21",
        "overview": "Season six returns with one change. Instead of working alone, now the red and blue teams work will be a team effort. The first dinner service (which is a predictable disaster) comes next before the first chef is eliminated, but an old friend shows up. Dinner service 2 winds up being an even bigger disaster."
      },
      {
        "id": "tvmaze:20968",
        "title": "15 Chefs Compete",
        "season": 6,
        "episode": 2,
        "released": "2009-07-21",
        "overview": "The teams cook pasta dinners for a room full of firefighters; two contestants are sent to the hospital."
      },
      {
        "id": "tvmaze:20969",
        "title": "14 Chefs Compete",
        "season": 6,
        "episode": 3,
        "released": "2009-07-28",
        "overview": "The remaining 14 chefs get a surprise awakening in the middle of the night to make a spaghetti dinner for a group of hungry firefighters. The winner will be determined by which team can serve first, and the losers must wax the firetrucks. later, two contestants are rushed to the hospital after suffering injuries."
      },
      {
        "id": "tvmaze:20970",
        "title": "13 Chefs Compete",
        "season": 6,
        "episode": 4,
        "released": "2009-08-04",
        "overview": "The remaining 13 chefs are challenged to create perfectly proportioned 6-inch sausages. The dinner service will include Drew Lachey, John O'Hurley, Tom Green, Melinda Clarke, Chris \"Kid\" Reid and Kristy Swanson are among those being served cold and salty meal. Chef Ramsey is unhappy."
      },
      {
        "id": "tvmaze:20971",
        "title": "12 Chefs Compete",
        "season": 6,
        "episode": 5,
        "released": "2009-08-11",
        "overview": "The remaining 12 chefs have the honor of creating a welcome back home dinner for a returning U.S. marine, where the losers will be left in charge of cleaning and decorating the dinning room for a party under the watchful eye of Gordon Ramsey's wife, Tana. Later, chef Ramsey gets heated up during dinner service over cold food."
      },
      {
        "id": "tvmaze:20972",
        "title": "11 Chefs Compete",
        "season": 6,
        "episode": 6,
        "released": "2009-08-18",
        "overview": "The remaining 11 chefs are challenged to create a full three-course meal which only totals up to 700 calories. The winning team gets a day at the beach and volleyball pointers from 2000 Olympian Annette Davis, while the losers must prep both kitchens. One chef snaps back at Chef Ramsey, while another is taken to the hospital's emergency room."
      },
      {
        "id": "tvmaze:20973",
        "title": "10 Chefs Compete",
        "season": 6,
        "episode": 7,
        "released": "2009-08-25",
        "overview": "The remaining ten chefs are rolling the dice to see what ingredients they can use in their challenge dish, with the winners earning a trip to Las Vegas. Later, chefs from Gordon Ramsey's own restaurants help out in the dinner service, which is interrupted by repeating mistakes and one bossy teammate."
      },
      {
        "id": "tvmaze:20974",
        "title": "9 Chefs Compete",
        "season": 6,
        "episode": 8,
        "released": "2009-09-01",
        "overview": "The remaining nine chefs are given a blind taste test. The winners will receive a dinner with chef Ramsay...in a darkened dinning room where they'll have no idea what they are eating. Later, the dinner service is ruined by meat and potatoes."
      },
      {
        "id": "tvmaze:20975",
        "title": "8 Chefs Compete",
        "season": 6,
        "episode": 9,
        "released": "2009-09-08",
        "overview": "The remaining eight chefs are asked to make crepes, where the winners receiving a night out dining at a French restaurant and the losers creating a French-themed dinner service. During the prep time one contestant is injured, and the other three can't make it through the service."
      },
      {
        "id": "tvmaze:20976",
        "title": "7 Chefs Compete",
        "season": 6,
        "episode": 10,
        "released": "2009-09-22",
        "overview": "Winter Olympic medalists Sasha Cohen and Jonny Moseley will serve as judges of the meals created by the contestants using ingredients brought in from Whistler, B.C., site of the restaurant in which the winner will be stationed."
      },
      {
        "id": "tvmaze:20977",
        "title": "6 Chefs Compete",
        "season": 6,
        "episode": 11,
        "released": "2009-09-22",
        "overview": "The teams may merge now that there are six, as they re-create foods they've tasted. A frustrated Chef Ramsey storms out during dinner service."
      },
      {
        "id": "tvmaze:20978",
        "title": "5 Chefs Compete",
        "season": 6,
        "episode": 12,
        "released": "2009-09-29",
        "overview": "The five remaining chefs are challenged to create as pretty as it tastes. A winner will be chosen by experts from Bon Apetite magazine and will win a dinner with Chef Ramsay and Bon Apetite editor Barbara Fairchild at a luxury hotel in Santa Monica."
      },
      {
        "id": "tvmaze:20979",
        "title": "4 Chefs Compete",
        "season": 6,
        "episode": 13,
        "released": "2009-10-06",
        "overview": "The remaining four chefs meet British child actor-impressionist Felix Wright, a diminutive version of Chef Ramsey, then meet 80 other youngsters, who they will feed without serving any meat. Two chefs have a bad night at dinner service and one is let go."
      },
      {
        "id": "tvmaze:20980",
        "title": "3 Chefs Compete",
        "season": 6,
        "episode": 14,
        "released": "2009-10-13",
        "overview": "The three finalists will create dishes from various parts of the world, which will be judged by international culinary experts."
      },
      {
        "id": "tvmaze:20981",
        "title": "Winner Announced",
        "season": 6,
        "episode": 15,
        "released": "2009-10-13",
        "overview": "The final two chefs will battle it out in the final challenge and dinner service. Chef Gordon Ramsay will then choose the winner."
      },
      {
        "id": "tvmaze:20982",
        "title": "16 Chefs Compete",
        "season": 7,
        "episode": 1,
        "released": "2010-06-01",
        "overview": "Chef Ramsay introduces himself to the 16 new contestants by announcing that they are expected to complete their very first dinner service. He then divides them into two teams, men vs. women, and sends them to the kitchen to prepare their signature dishes. After presenting the dishes to Chef Ramsay, he sends them up to study the menu and prepare for dinner service, which, unfortunately, does not go as he had hoped."
      },
      {
        "id": "tvmaze:20983",
        "title": "15 Chefs Compete",
        "season": 7,
        "episode": 2,
        "released": "2010-06-08",
        "overview": "Both teams are challenged to prepare eggs four different ways. The team that cooks the most eggs properly wins a helicopter ride over Los Angeles. Meanwhile, an argument between one of the chefs and Chef Ramsay during dinner service causes one team to crash and burn."
      },
      {
        "id": "tvmaze:20984",
        "title": "14 Chefs Compete",
        "season": 7,
        "episode": 3,
        "released": "2010-06-15",
        "overview": "The chefs are challenged to serve lunch to the very hungry members of a marching band. During dinner service, one member on the red team gets burned and throws the entire team into chaos."
      },
      {
        "id": "tvmaze:20985",
        "title": "13 Chefs Compete",
        "season": 7,
        "episode": 4,
        "released": "2010-06-15",
        "overview": "The two teams are challenged two each create a dish based on ingredients chosen by rolling dice with letters on them. Though one team makes some strange choices, the results end up being close, with the final determination coming down to the quality of the cooking rather than the nature of the dishes."
      },
      {
        "id": "tvmaze:20986",
        "title": "12 Chefs Compete",
        "season": 7,
        "episode": 5,
        "released": "2010-06-22",
        "overview": "\"Hell's Kitchen\" does barbecue for the first time ever, and the chefs are challenged to prepare pork-themed dishes with their chosen ingredients. But when the red team fails to keep cool under pressure, Chef Ramsay gives them a piece of his mind."
      },
      {
        "id": "tvmaze:20987",
        "title": "11 Chefs Compete",
        "season": 7,
        "episode": 6,
        "released": "2010-06-22",
        "overview": "When it comes to judging good food, mother knows best. The chefs are tasked with preparing dishes representing each of the five \"mother sauces,\" and two surprise judges show up to decide which dishes stand out. For the evening's dinner service, it's family night and the pint-sized customers couldn't be more finicky, rowdy and demanding. As tempers flare, one contestant is sent home and Chef Ramsay surprises everyone by throwing in an unexpected twist."
      },
      {
        "id": "tvmaze:20988",
        "title": "10 Chefs Compete",
        "season": 7,
        "episode": 7,
        "released": "2010-06-29",
        "overview": "Chef Ramsay turns Hell's Kitchen into an upscale deli when he challenges each contestant to create an original gourmet sandwich. While the winning team is treated to an amazing retreat in wine country, the losing team is left behind to perfect the peanut butter and jelly sandwich. Later, Chef Ramsay gets into an angry confrontation – with a disgruntled customer – during a disastrous dinner service. Meanwhile, when Chef Ramsay switches up the teams, the contestants face a different challenge: adjusting to their new teammates while reinventing a wedding menu for a 50th anniversary party."
      },
      {
        "id": "tvmaze:20989",
        "title": "9 Chefs Compete",
        "season": 7,
        "episode": 8,
        "released": "2010-06-29",
        "overview": "The remaining aspiring chefs compete in the eighth episode of the competition."
      },
      {
        "id": "tvmaze:20990",
        "title": "8 Chefs Compete",
        "season": 7,
        "episode": 9,
        "released": "2010-07-06",
        "overview": "The remaining aspiring chefs compete in the ninth episode of the competition. A blind taste test challenges the palette of the chefs. Later, the two teams are tasked to create their own original menus."
      },
      {
        "id": "tvmaze:20991",
        "title": "7 Chefs Compete",
        "season": 7,
        "episode": 10,
        "released": "2010-07-06",
        "overview": "The chefs are challenged to create their own unique lobster dishes. The dishes are judged by Michelin-starred chefs, with Gordon Ramsay left to break a tie after two chefs' dishes are rejected for simply not being cooked to par. The winning team enjoys a visit to a caviar house followed by a shopping spree, while the losing team is made to clean the dorms, then prep both kitchens for service. Gordon Ramsay delivers a surprise by ordering the two teams to work together to complete a dinner service with a time limit of 2 and 1/2 hours. The pressure proves too much for one, leading to a complete meltdown and ejection during service. The dinner service, however, is ultimately a great success, leading to another surprise at the elimination."
      },
      {
        "id": "tvmaze:20992",
        "title": "6 Chefs Compete",
        "season": 7,
        "episode": 11,
        "released": "2010-07-20",
        "overview": "The six remaining aspiring chefs work together for the first time as one team. The chefs are presented with a challenge requiring them to come up with a creative dish using cheap ingredients. Switching stations create added pressure during service."
      },
      {
        "id": "tvmaze:20993",
        "title": "5 Chefs Compete",
        "season": 7,
        "episode": 12,
        "released": "2010-07-20",
        "overview": "The remaining aspiring chefs compete in the twelfth episode of the season."
      },
      {
        "id": "tvmaze:20994",
        "title": "4 Chefs Compete",
        "season": 7,
        "episode": 13,
        "released": "2010-07-27",
        "overview": "The remaining chefs compete in the thirteenth episode of the season and struggle against the pressure with only four chefs left. The chefs are challenged to teach bachelors how to prepare monkfish. During service, a chef is called out for sabotaging another. A budding romance forces Chef Ramsay to make a difficult decision."
      },
      {
        "id": "tvmaze:20995",
        "title": "2 Chefs Compete",
        "season": 7,
        "episode": 14,
        "released": "2010-08-03",
        "overview": "The remaining aspiring chefs must recreate a dish by taste; one of the aspiring chefs buckles under pressure."
      },
      {
        "id": "tvmaze:20996",
        "title": "Winner Announced",
        "season": 7,
        "episode": 15,
        "released": "2010-08-10",
        "overview": "The final two chefs compete to be the winner of Hell's Kitchen. Both are given a preview of what they could win and face their toughest challenge yet. One of the two is declared the winner of Hell's Kitchen, earning $250,000 and a position at the Savoy Hotel in London."
      },
      {
        "id": "tvmaze:20997",
        "title": "16 Chefs Complete",
        "season": 8,
        "episode": 1,
        "released": "2010-09-22",
        "overview": "Sixteen chefs compete in the premiere of the eighth season of Hell's Kitchen. Chef Ramsay divides the chefs into teams of women and men, and their first challenge is to create their signature dishes. An early injury sends one chef to the hospital. Massive delays during dinner service lead customers to exit Hell's Kitchen."
      },
      {
        "id": "tvmaze:20998",
        "title": "14 Chefs Compete",
        "season": 8,
        "episode": 2,
        "released": "2010-09-22",
        "overview": "The 14 remaining chefs receive a lesson in preparing sushi from Iron Chef Masaharu Morimoto before they must do it themselves. One competitor in particular can't seem to learn it."
      },
      {
        "id": "tvmaze:20999",
        "title": "13 Chefs Compete",
        "season": 8,
        "episode": 3,
        "released": "2010-09-29",
        "overview": "The 13 remaining chefs must prepare breakfast for 50 hungry EMTs. At dinner service, dover sole bollixes up both the blue and red teams."
      },
      {
        "id": "tvmaze:21000",
        "title": "12 Chefs Compete",
        "season": 8,
        "episode": 4,
        "released": "2010-09-29",
        "overview": "The 12 remaining chefs must make ravioli from scratch. And the dinner service features Italian dishes, but it's overcooked salmon and undercooked chicken that prove to be the bugaboos."
      },
      {
        "id": "tvmaze:21001",
        "title": "11 Chefs Compete",
        "season": 8,
        "episode": 5,
        "released": "2010-10-06",
        "overview": "The challenge facing the 11 remaining chefs: devise tasting menus for a retro-themed high-school prom, with the losing team having to set up for the prom. Then, appetizers and fish bedevil competitors at dinner service."
      },
      {
        "id": "tvmaze:21002",
        "title": "10 Chefs Compete",
        "season": 8,
        "episode": 6,
        "released": "2010-10-06",
        "overview": "The challenge facing the 10 remaining chefs: prepare entrée salads, with the winner to be featured in Bon Appetit magazine. Dinner-service bugaboos: scallops and garnishes."
      },
      {
        "id": "tvmaze:21003",
        "title": "9 Chefs Compete",
        "season": 8,
        "episode": 7,
        "released": "2010-10-13",
        "overview": "The 9 remaining chefs create dishes using five ingredients selected at random. The winners visit Las Vegas while the losers peel 1000 potatoes. Guests at the \"Family Night\" dinner service include Jerry Springer and members of Chef Ramsay's family."
      },
      {
        "id": "tvmaze:21004",
        "title": "9 Chefs Compete Again",
        "season": 8,
        "episode": 8,
        "released": "2010-10-13",
        "overview": "The teams must shop on a budget and prepare elegant dishes for four judges. The winners go sailing and dancing while the losers fumigate Hell's Kitchen. Guests at the black-tie dinner service include four previous winners and cast members of \"Glee.\""
      },
      {
        "id": "tvmaze:21005",
        "title": "8 Chefs Compete",
        "season": 8,
        "episode": 9,
        "released": "2010-11-10",
        "overview": "The 8 remaining contestants face a women-vs.-men blind taste test. The winners dine at the L.A. restaurant XIV while the losers sort trash. Undercooking and one chef's overheated conversation with Chef Ramsay mar the dinner service."
      },
      {
        "id": "tvmaze:21006",
        "title": "7 Chefs Compete",
        "season": 8,
        "episode": 10,
        "released": "2010-11-10",
        "overview": "The 7 remaining chefs are tested on their cooking precision and communication skills, but dinner service proves disappointing to Chef Ramsay and his guests, L.A. restaurateur Josiah Citrin and the NFL's Matt Cassel. In the end, six chefs remain."
      },
      {
        "id": "tvmaze:21007",
        "title": "6 Chefs Compete",
        "season": 8,
        "episode": 11,
        "released": "2010-11-17",
        "overview": "Chef Ramsay challenges the six contestants to create \"a single bite\" to make a bold first impression on the Michelin-starred L.A. chefs who do the biting. But dinner-service diners leave disappointed and hungry. Later, one chef is asked to leave."
      },
      {
        "id": "tvmaze:21008",
        "title": "5 Chefs Compete",
        "season": 8,
        "episode": 12,
        "released": "2010-11-24",
        "overview": "The 5 remaining contestants prepare and serve their signature dishes in downtown-L.A. food trucks at lunchtime. The winner receives a Beverly Hills makeover by hairstylist José Eber and fashion guru Steven Cojocaru, while the losers scrub their trucks and prepare Hell's Kitchen for a dinner service that won't go well."
      },
      {
        "id": "tvmaze:21009",
        "title": "4 Chefs Compete",
        "season": 8,
        "episode": 13,
        "released": "2010-12-01",
        "overview": "The 4 remaining chefs must re-create a dish without a recipe, using only their eyesight, their noses and their senses of taste. The winner gets a day at a spa while the losers do the Hell's Kitchen laundry before it's time for another dinner service."
      },
      {
        "id": "tvmaze:21010",
        "title": "4 Chefs Compete Again",
        "season": 8,
        "episode": 14,
        "released": "2010-12-08",
        "overview": "The challenge: create a balanced fusion dish. The judges: Top L.A. chefs Philip Dubose (Asia de Cuba), Helene An (Crustacean) and Lee Hefter (Spago). Then, at dinner service, tempers flare and Chef Ramsay must intervene."
      },
      {
        "id": "tvmaze:21011",
        "title": "Winner Announced",
        "season": 8,
        "episode": 15,
        "released": "2010-12-15",
        "overview": "In the Season 8 finale, the final two chefs must prepare five-course meals to be judged by five L.A.-area executive chefs and food-service executives. The winner receives a head-chef position at LA Market at the JW Marriott Hotel in Los Angeles."
      },
      {
        "id": "tvmaze:21012",
        "title": "18 Chefs Compete",
        "season": 9,
        "episode": 1,
        "released": "2011-07-18",
        "overview": "Eighteen new aspiring chefs dare to brave the heat of competition when Chef Gordon Ramsay opens the doors to a new season of HELL'S KITCHEN. The chefs must prove they have the skill, passion and dedication as they compete for the grand prize of a Head Chef position at BLT Steak in New York City. In the first team challenge of the season, Chef Ramsay asks the contestants to prepare their signature dish and splits the chefs into two teams: men vs. women. The winning team gets a taste of the sweet life when they wine and dine with Season Eight winner Nona Sivley at L.A. Market, while the losing team is left behind to scrub down the kitchen in preparation for their first dinner service. Following a sobering announcement moments before the grand reopening of HELL'S KITCHEN, tempers flare when the teams struggle to communicate effectively and the slow service forces diners to walk out before their entrees are served. Find out which contestant gets burned following the most disappointing opening dinner service."
      },
      {
        "id": "tvmaze:21013",
        "title": "16 Chefs Compete",
        "season": 9,
        "episode": 2,
        "released": "2011-07-19",
        "overview": "With just 16 chefs remaining, the tension among the contestants becomes palpable as Chef Ramsay pits the red team against the blue team in another intense challenge. The winning team celebrates in high style while the losing team is left behind to fulfill drab duties. During dinner service, both teams struggle to cook their dishes properly and on time, and the contestants' lack of cooperation and efficiency sends Chef Ramsay over the edge."
      },
      {
        "id": "tvmaze:21014",
        "title": "15 Chefs Compete",
        "season": 9,
        "episode": 3,
        "released": "2011-07-25",
        "overview": "With just 15 chefs remaining, Chef Ramsay pits the red team against the blue team in another intense challenge. The winning team celebrates in high style while the losing team is left behind to fulfill drab duties. Tune in to see which contestants are on the chopping block"
      },
      {
        "id": "tvmaze:21015",
        "title": "14 Chefs Compete",
        "season": 9,
        "episode": 4,
        "released": "2011-07-26",
        "overview": "After the contestants get a brief night's sleep, sous chefs Scott and Andy show up with overalls and boots for the contestants to use in the next challenge. They all go downstairs, where Chef Ramsay explains today's test. Each team must create four chicken dishes, but before retreating to the kitchen they must determine what they will be working with. For every live chicken they catch and deposit into a cage, they can retrieve an ingredient from a list including such items as bleu cheese, pickles, and grits."
      },
      {
        "id": "tvmaze:21016",
        "title": "13 Chefs Compete",
        "season": 9,
        "episode": 5,
        "released": "2011-08-01",
        "overview": "The remaining 13 chefs start a new day greeted by Chef Ramsay and the sight of a chemistry lab in the kitchen. Chef Ramsay introduces two guests who bring science and food together: Ben Roche and Homaro Cantu from Chicago's Moto Restaurant. In 45 seconds they make a dreamsicle sorbet using sound waves and liquid nitrogen."
      },
      {
        "id": "tvmaze:21017",
        "title": "12 Chefs Compete",
        "season": 9,
        "episode": 6,
        "released": "2011-08-02",
        "overview": "With just 12 chefs remaining, Chef Ramsay pits the red team against the blue team in another intense challenge. The winning team celebrates in high style while the losing team is left behind to fulfill drab duties. Tune in to see which contestants are on the chopping block."
      },
      {
        "id": "tvmaze:21018",
        "title": "11 Chefs Compete",
        "season": 9,
        "episode": 7,
        "released": "2011-08-08",
        "overview": "Following a difficult elimination in the previous episode, the teams return to the dormitories. The Blue Team is determined to win a service, having lost the last challenge. In the meantime, Krupa is celebrating the Red Team's win by relaxing with a few drinks. The next morning the chefs are up and ready to go, but Krupa is in a world of pain. All of the contestants then meet Chef Ramsay in the dining room. He asks them to create something delicious from a table of ingredients that includes grains, fruits, and oils. After hearing a few of the contestants' ideas, he introduces them to his guests, beer sommeliers Christina Perozzi and Hallie Beaune. The competitors are told to prepare individual dishes using one or more types of beer. Chef Ramsay has designed the challenge to test the chefs' creativity and their ability to make a well-balanced and delicious dish using a unique element. Krupa's night of celebration is catching up with her, and she's not performing at her best. Since the women have six chefs to the men's five, they are told to drop one dish, and they choose Krupa's rabbit."
      },
      {
        "id": "tvmaze:21019",
        "title": "10 Chefs Compete",
        "season": 9,
        "episode": 8,
        "released": "2011-08-09",
        "overview": "Chef Ramsay asks the remaining 10 contestants to nominate one chef from each team who possesses the best leadership skills. The Blue Team decides on Will, while the Red Team struggles to make a selection. When they meet Chef Ramsay in the kitchen the following morning, the Red Team picks Jennifer as their strongest player. But in true \"Hell's Kitchen\" style, Chef Ramsay turns the tables on the contestants as he describes today's challenge. He asks the two strongest players to name their weakest teammates. Jennifer does not hesitate to say Carrie, and Will immediately calls out Tommy. For this challenge, Carrie and Will must lead their respective kitchens. They will start by creating a menu for their versions of five classic comfort foods: spaghetti and meatballs, pizza, burgers, Cobb salad, and chicken noodle soup. The Red Team, especially the outspoken Elise, disagrees with Carrie's game plan, but at least she has one. Tommy can't pull it together, and the Blue Team waits for his guidance. Jonathan creates a pizza following Tommy's recipe but struggles to get his leader to focus. Still, both disorganized teams manage to finish the dishes before time runs out."
      },
      {
        "id": "tvmaze:21020",
        "title": "9 Chefs Compete",
        "season": 9,
        "episode": 9,
        "released": "2011-08-15",
        "overview": "With just nine chefs remaining, Chef Ramsay pits the red team against the blue team in another intense challenge. The winning team celebrates in high style while the losing team is left behind to fulfill drab duties."
      },
      {
        "id": "tvmaze:21021",
        "title": "8 Chefs Compete",
        "season": 9,
        "episode": 10,
        "released": "2011-08-22",
        "overview": "Chef Ramsay pits the red team against the blue team in two intense challenges. The winning team celebrates in high style while the losing team is left behind to fulfill drab duties."
      },
      {
        "id": "tvmaze:21022",
        "title": "7 Chefs Compete",
        "season": 9,
        "episode": 11,
        "released": "2011-08-22",
        "overview": "The 7 remaining chefs visit New York City, where they tour BLT Steak (the future home for the winner) and take bites of the Big Apple's cornucopia of ethnic foods. Their challenge when they return to Hell's Kitchen: prepare ethnic dishes themselves. For the winners it's a day at the beach, while the losers must prepare for dinner service, at which both teams have difficulty with sea bass. When it's over, Chef Ramsay cuts the field to six."
      },
      {
        "id": "tvmaze:21023",
        "title": "6 Chefs Compete",
        "season": 9,
        "episode": 12,
        "released": "2011-08-29",
        "overview": "6 chefs remain. The team challenge: prepare three dishes in 30 minutes. The winners go shopping while the losers prep for the dinner service, a black-tie gala benefiting American Cancer Society and the American Humane Association."
      },
      {
        "id": "tvmaze:21024",
        "title": "5 Chefs Compete",
        "season": 9,
        "episode": 13,
        "released": "2011-09-05",
        "overview": "The 5 remaining chefs trade in their red and blue-piped jackets for black ones and cook together in one kitchen. Four advance to the next round."
      },
      {
        "id": "tvmaze:21025",
        "title": "5 Chefs Compete Again",
        "season": 9,
        "episode": 14,
        "released": "2011-09-12",
        "overview": "With five chefs remaining, the competition intensifies as each chef must prove to Chef Ramsay that they have the sharpest skills, unwavering determination and utmost passion to survive HELL'S KITCHEN. After another intense challenge and grueling dinner service, the chefs face one of the most intense eliminations to date."
      },
      {
        "id": "tvmaze:21026",
        "title": "4 Chefs Compete",
        "season": 9,
        "episode": 15,
        "released": "2011-09-19",
        "overview": "Chefs Will Lustberg, Paul Niedermann, Tommy Stevens and Elise Wims compete, with two advancing to the final round and a shot at a chef-de-cuisine post at BLT Steak in New York City."
      },
      {
        "id": "tvmaze:21027",
        "title": "Winner Announced",
        "season": 9,
        "episode": 16,
        "released": "2011-09-19",
        "overview": "The two finalists compete in the Season 9 finale. The winner gets a chef-de-cuisine post at BLT Steak in New York City."
      },
      {
        "id": "tvmaze:21028",
        "title": "18 Chefs Compete",
        "season": 10,
        "episode": 1,
        "released": "2012-06-04",
        "overview": "The chefs must make their signature dishes; one contestant is sent home."
      },
      {
        "id": "tvmaze:21029",
        "title": "17 Chefs Compete",
        "season": 10,
        "episode": 2,
        "released": "2012-06-05",
        "overview": "In Part Two of the two-night season premiere, Chef Ramsay pits the women against the men in another intense challenge and demanding dinner service. While the winning team sails off to enjoy their good work, the losing team is left behind to fulfill drab duties. Tune in to see which contestants fall out of Chef Ramsay's good graces."
      },
      {
        "id": "tvmaze:21030",
        "title": "16 Chefs Compete",
        "season": 10,
        "episode": 3,
        "released": "2012-06-11",
        "overview": "The men compete against the women in a challenge in which they serve classic American fare to special diners; the winning team takes a day trip."
      },
      {
        "id": "tvmaze:21031",
        "title": "15 Chefs Compete",
        "season": 10,
        "episode": 4,
        "released": "2012-06-12",
        "overview": "The teams must tackle a challenge in order to get the ingredients they need to cook four different lamb dishes."
      },
      {
        "id": "tvmaze:21032",
        "title": "14 Chefs Compete",
        "season": 10,
        "episode": 5,
        "released": "2012-06-18",
        "overview": "The contestants prepare Mexican dishes."
      },
      {
        "id": "tvmaze:21033",
        "title": "13 Chefs Compete, Part 1",
        "season": 10,
        "episode": 6,
        "released": "2012-06-19",
        "overview": "Chef Ramsay challenges the contestants to find culinary inspiration from high fashion by creating a menu for some renowned designers. The winning team is rewarded with a brand new wardrobe while the losing team stays behind to prepare HELL'S KITCHEN for the first-ever dinner service runway fashion show. Tune in to see which contestants are culinary trendsetters and who falls apart at the seams."
      },
      {
        "id": "tvmaze:21034",
        "title": "13 Chefs Compete, Part 2",
        "season": 10,
        "episode": 7,
        "released": "2012-06-25",
        "overview": "In a continuation from the previous episode, it is fashion night in HELL'S KITCHEN and the teams must execute a full dinner service with timing perfectly in sync with three runway shows that are being held in the restaurant. While some contestants perform flawlessly, others are distracted by all that's going on around them and one has to fight to the end to keep his place in HELL'S KITCHEN. Tune in to see which contestants keep it together and which come apart at the seams."
      },
      {
        "id": "tvmaze:21035",
        "title": "12 Chefs Compete",
        "season": 10,
        "episode": 8,
        "released": "2012-06-26",
        "overview": "The contestants prepare food for UFC fighter Tito Ortiz and former boxer Sugar Ray Leonard."
      },
      {
        "id": "tvmaze:21036",
        "title": "11 Chefs Compete, Part 1",
        "season": 10,
        "episode": 9,
        "released": "2012-07-02",
        "overview": "It's steak night in HELL'S KITCHEN and the contestants are determined to impress Gordon Ramsay and prove that they have what it takes to be a head chef, working under Executive Chef Kevin Hee, at Gordon Ramsay Steak at Paris Las Vegas. Ramsay brings a little bit of Vegas into HELL'S KITCHEN, as he challenges the chefs' creativity by allowing a slot machine to determine ingredients for their dishes. Tune in to see who hits the jackpot and whose luck runs out."
      },
      {
        "id": "tvmaze:21037",
        "title": "11 Chefs Compete, Part 2",
        "season": 10,
        "episode": 10,
        "released": "2012-07-03",
        "overview": "It's family night in HELL'S KITCHEN, but the chefs' behavior is anything but family-friendly as tempers flare up on both teams. Although Chef Ramsay hopes that the contestants will focus on the dinner service ahead of them, many seem more concerned with all of the personal drama taking place than with cooking. Tune in to see who loses their cool and who keeps their eyes on the prize."
      },
      {
        "id": "tvmaze:21038",
        "title": "10 Chefs Compete",
        "season": 10,
        "episode": 11,
        "released": "2012-07-09",
        "overview": "The Blue Team competes against the Red Team in a challenge that forces the chefs to think on their feet; three special diners attend the dinner service."
      },
      {
        "id": "tvmaze:21039",
        "title": "9 Chefs Compete, Part 1",
        "season": 10,
        "episode": 12,
        "released": "2012-07-16",
        "overview": "A competitive eater and the chefs participate in a wing-eating contest; history is made during a blind taste test."
      },
      {
        "id": "tvmaze:21040",
        "title": "9 Chefs Compete, Part 2",
        "season": 10,
        "episode": 13,
        "released": "2012-07-17",
        "overview": "The remaining contestants have a chance to impress chef Ramsay when they create items for the dinner menu."
      },
      {
        "id": "tvmaze:21041",
        "title": "8 Chefs Compete",
        "season": 10,
        "episode": 14,
        "released": "2012-07-23",
        "overview": "The chefs are challenged to put a gourmet spin on traditional Southern dishes. Later, they work on their communication skills before an important dinner service."
      },
      {
        "id": "tvmaze:21042",
        "title": "7 Chefs Compete",
        "season": 10,
        "episode": 15,
        "released": "2012-07-24",
        "overview": "Ramsay puts the chefs' communication skills to the test; the contestants face their most important dinner service yet."
      },
      {
        "id": "tvmaze:21043",
        "title": "6 Chefs Compete",
        "season": 10,
        "episode": 16,
        "released": "2012-08-13",
        "overview": "The chefs compete against a team of former runners-up in a dinner-service showdown."
      },
      {
        "id": "tvmaze:21044",
        "title": "5 Chefs Compete",
        "season": 10,
        "episode": 17,
        "released": "2012-08-20",
        "overview": "The chefs each try to teach a student to re-create one of Ramsay's dishes."
      },
      {
        "id": "tvmaze:21045",
        "title": "4 Chefs Compete",
        "season": 10,
        "episode": 18,
        "released": "2012-08-27",
        "overview": "During the dinner service, each contestant gets a chance to direct the others."
      },
      {
        "id": "tvmaze:21046",
        "title": "2 Chefs Compete",
        "season": 10,
        "episode": 19,
        "released": "2012-09-04",
        "overview": "The top two finalists are determined; a team of renowned chefs evaluates the contestants' final dinner-service menu."
      },
      {
        "id": "tvmaze:21047",
        "title": "The Winning Chef is Announced",
        "season": 10,
        "episode": 20,
        "released": "2012-09-10",
        "overview": "After a long and trying competition, it's time for the final dinner service and for Chef Ramsay to choose the winner of HELL'S KITCHEN. The two finalists must carefully build their teams and create a stunning final menu as they enter into the most important dinner service of their lives. Tune in to see who will be crowned the Season 10 winner of HELL'S KITCHEN and become the next Head Chef working under Executive Chef Kevin Hee at Gordon Ramsay Steak in Las Vegas in the second part of the all-new \"Winner Chosen\" season finale episode."
      },
      {
        "id": "tvmaze:21048",
        "title": "20 Chefs Compete, Part 1",
        "season": 11,
        "episode": 1,
        "released": "2013-03-12",
        "overview": "For the first time in HELL'S KITCHEN history, the latest batch of 20 aspiring restaurateurs head to Las Vegas to present their signature dishes before Chef Ramsey and a live audience. The contestants will split into two teams - the red team and the blue team - to prove they have what it takes to win a life-changing grand prize of a head chef position working under Executive Chef Jeremy Berlin at Gordon Ramsay Pub &amp; Grill at Caesars Palace. Then, after the 20 contestants arrive in Los Angeles, the first dinner service gets off to a rocky start, and Chef Ramsay sends multiple contestants out of the kitchen. Find out which chef will be sent home for good."
      },
      {
        "id": "tvmaze:21049",
        "title": "20 Chefs Compete, Part 2",
        "season": 11,
        "episode": 2,
        "released": "2013-03-12",
        "overview": "The contestants arrive at the dorms; Ramsay sends contestants out of the kitchen after a rocky first dinner service."
      },
      {
        "id": "tvmaze:21050",
        "title": "19 Chefs Compete",
        "season": 11,
        "episode": 3,
        "released": "2013-03-19",
        "overview": "Chef Ramsay teaches the chefs a lesson in teamwork when he puts them through a physical challenge involving lobsters, but claws come out when the real team challenge continues in the kitchen. The winning team earns a luxurious day on a yacht while the losing team is tasked with cleaning hundreds of pounds of fish. Later, a disorganized dinner service disappoints Chef Ramsay, so two contestants from each team are sent into the elimination round."
      },
      {
        "id": "tvmaze:21051",
        "title": "17 Chefs Compete",
        "season": 11,
        "episode": 4,
        "released": "2013-03-26",
        "overview": "Olympic athletes Maurice Greene, Natalie Coughlin and Danell Leyva help Ramsay lead a 3K race, with the red and blue teams racing to prepare lunch for the runners; communication issues lead to fights during the dinner service."
      },
      {
        "id": "tvmaze:21052",
        "title": "16 Chefs Compete, Part 1",
        "season": 11,
        "episode": 5,
        "released": "2013-04-02",
        "overview": "Chef Ramsay puts the contestants to the ultimate taste test when he challenges the red and blue teams to taste and identify the type of protein used in five dishes. The team that completes the challenge in the least amount of time toasts to victory under the sun at a gorgeous beach house while the losing team spends the day grinding and milling grains to make bread from scratch. Later, the contestants get an early wake-up call to prepare a hearty breakfast for emergency medical workers. While some contestants rise to challenge, others scramble to complete the simplest dishes, and Chef Ramsay grills the losing team during an emotional elimination round."
      },
      {
        "id": "tvmaze:21053",
        "title": "16 Chefs Compete, Part 2",
        "season": 11,
        "episode": 6,
        "released": "2013-04-09",
        "overview": "In the continuation of a heated elimination, Chef Ramsay makes an unexpected decision that changes the competition for good. Later, HELL'S KITCHEN's maitre d begs Chef Ramsay for extra help in the dining room, so he sends one chef from each team to assist the wait staff during dinner service. But when the chefs-turned-servers send illegible tickets to the kitchen, dinner service is at a virtual standstill. After one of the most infuriating dinner services yet, Chef Ramsay asks each team to nominate two contestants to be put up for elimination. Find out whose dreams of winning HELL'S KITCHEN might go up in flames."
      },
      {
        "id": "tvmaze:21054",
        "title": "15 Chefs Compete",
        "season": 11,
        "episode": 7,
        "released": "2013-04-16",
        "overview": "Chef Martin Yan judges six Chinese dishes created by the remaining contestants; during dinner service, one team disappoints a VIP guest; a contestant is eliminated."
      },
      {
        "id": "tvmaze:21055",
        "title": "14 Chefs Compete",
        "season": 11,
        "episode": 8,
        "released": "2013-04-23",
        "overview": "The contestants enter an animal pen to determine which type of protein they will cook in the team challenge; during dinner service, the contestants must impress chef Ramsay's family."
      },
      {
        "id": "tvmaze:21056",
        "title": "13 Chefs Compete",
        "season": 11,
        "episode": 9,
        "released": "2013-04-30",
        "overview": "The teams must create five steak dishes; a diner finds an unpleasant surprise in her dish during dinner service; the elimination round brings out bad tempers."
      },
      {
        "id": "tvmaze:21057",
        "title": "12 Chefs Compete",
        "season": 11,
        "episode": 10,
        "released": "2013-05-07",
        "overview": "The teams host a quinceanera; a disagreement between chefs brings dinner service to a standstill; Ramsay makes an unexpected decision."
      },
      {
        "id": "tvmaze:21058",
        "title": "10 Chefs Compete",
        "season": 11,
        "episode": 11,
        "released": "2013-05-13",
        "overview": "The chefs compete to participate in a photo shoot and host a dinner for members of the Army."
      },
      {
        "id": "tvmaze:21059",
        "title": "9 Chefs Compete",
        "season": 11,
        "episode": 12,
        "released": "2013-05-13",
        "overview": "The chefs must design and execute their own dinner menus."
      },
      {
        "id": "tvmaze:21060",
        "title": "8 Chefs Compete",
        "season": 11,
        "episode": 13,
        "released": "2013-05-23",
        "overview": "The chefs create ethnic dishes with select ingredients; a team falls behind before dinner service begins."
      },
      {
        "id": "tvmaze:21061",
        "title": "7 Chefs Compete, Part 1",
        "season": 11,
        "episode": 14,
        "released": "2013-05-30",
        "overview": "Every great chef has a discerning palate, so Chef Ramsay tests each chef's ability to identify ingredients relying solely on their taste buds in the blind taste challenge. The winning team is granted a luxurious sushi meal overlooking the ocean followed by a relaxing day of horseback riding. Meanwhile, the losing team is charged with delivery day duties and backbreaking labor in HELL'S KITCHEN. Later, Chef Ramsay presents the chefs with a surprising challenge in order to determine which contestant deserves immunity in the next dinner service and will move one step closer to a life-changing prize."
      },
      {
        "id": "tvmaze:21062",
        "title": "7 Chefs Compete, Part 2",
        "season": 11,
        "episode": 15,
        "released": "2013-06-06",
        "overview": "In the continuation of the signature dish challenge, Chef Ramsay determines which chef has made the greatest strides in the competition, and the chef with the best dish earns immunity in the next dinner service. Later, pressure mounts in HELL'S KITCHEN as the chefs must prepare a stunning meal to impress very special guests dining at Chef's Tables, TV host Maria Menounos and actor Jeremy Sisto. Dinner service gets off to a strong start, but one team's service quickly heads downhill, forcing Chef Ramsay to step in at one station. Two members from the losing team go head-to-head in an emotional elimination round."
      },
      {
        "id": "tvmaze:21063",
        "title": "6 Chefs Compete",
        "season": 11,
        "episode": 16,
        "released": "2013-06-13",
        "overview": "Ramsay tests the contestants' ability to communicate and work together with a three entree relay race, with the winners getting a helicopter tour and a caviar tasting."
      },
      {
        "id": "tvmaze:21064",
        "title": "5 Chefs Compete, Part 1",
        "season": 11,
        "episode": 17,
        "released": "2013-06-20",
        "overview": "The remaining chefs get a very special surprise from their family members, and Chef Ramsay hands out the coveted black jackets. Later, Chef Ramsay tests the chefs' originality in an intense pressure cooker test. The winner of the challenge earns an unforgettable meal with their family, while the losing team recycles and plant trees. With only five chefs remaining, Chef Ramsay adds a shocking twist in the next dinner service."
      },
      {
        "id": "tvmaze:21065",
        "title": "5 Chefs Compete, Part 2",
        "season": 11,
        "episode": 18,
        "released": "2013-06-27",
        "overview": "The challenges don't stop now that the chefs have received their black jackets, as Chef Ramsay surprises them by bringing back a team of previous HELL'S KITCHEN winners to challenge them at dinner service. Ramsay lets the teams design their own menus for dinner service and the finalists will go head-to-head with the returning champs. Tune in to see if this season's competitors can take the heat."
      },
      {
        "id": "tvmaze:21066",
        "title": "5 Chefs Compete, Part 3",
        "season": 11,
        "episode": 19,
        "released": "2013-07-11",
        "overview": "The final five chefs must prove that they deserve to stay in the competition by creating their most impressive gourmet burger. They face a tough room of critics as Chef Ramsay and room filled with dining professionals will determine the best and the worst burgers. The winning chef earns a relaxing day at the spa, while the remaining chefs are tasked with endless chores. Later, pressure mounts when the chefs must serve a VIP guest, but huge missteps in the kitchen put dinner service at a virtual standstill. Find out which contestant is sent home after a dramatic elimination round."
      },
      {
        "id": "tvmaze:21067",
        "title": "4 Chefs Compete",
        "season": 11,
        "episode": 20,
        "released": "2013-07-18",
        "overview": "The chefs must use sight, taste and smell to identify ingredients in a dish and re-create it, with the chef who comes closest earning a shopping spree and time with Chef Ramsay; Ramsay sends two chefs home."
      },
      {
        "id": "tvmaze:21068",
        "title": "2 Chefs Compete",
        "season": 11,
        "episode": 21,
        "released": "2013-07-25",
        "overview": "Chef Ramsay announces the final two chefs who will compete for the HELL'S KITCHEN title and a life-changing grand prize: a Head Chef position under Executive Chef Jeremy Berlin at Gordon Ramsay Pub &amp; Grill at Caesars Palace. After Chef Ramsay surprises the chefs with a luxurious trip to Las Vegas, the adventures continue when the chefs compete head-to-head in a live cooking challenge judged by some of the most famous chefs in Los Angeles."
      },
      {
        "id": "tvmaze:21069",
        "title": "Winner Chosen",
        "season": 11,
        "episode": 22,
        "released": "2013-07-25",
        "overview": "With the help of former HELL'S KITCHEN contestants, the top two chefs prepare their menus for the most important dinner service of their life. Later, pressure mounts on both teams to execute a flawless dinner service, but in the end, only one chef will be crowned HELL'S KITCHEN winner."
      },
      {
        "id": "tvmaze:21070",
        "title": "20 Chefs Compete",
        "season": 12,
        "episode": 1,
        "released": "2014-03-13",
        "overview": "Twenty aspiring restaurateurs hoping to impress Ramsay present their signature dishes; after the opening night dinner service, contestants face elimination."
      },
      {
        "id": "tvmaze:21071",
        "title": "19 Chefs Compete",
        "season": 12,
        "episode": 2,
        "released": "2014-03-20",
        "overview": "Teamwork plays an important role during a relay race in which duos must accomplish basic culinary tasks; while challenge winners go to San Francisco, the losing team picks carrots at a farm; both teams disappoint during dinner service."
      },
      {
        "id": "tvmaze:21072",
        "title": "18 Chefs Compete",
        "season": 12,
        "episode": 3,
        "released": "2014-03-27",
        "overview": "The contestants learn about teamwork during a challenge involving pigs and potatoes; while the winning team enjoys a day on a yacht, the losers bathe their new livestock friends; a disorganized dinner service leaves chef Ramsay disappointed."
      },
      {
        "id": "tvmaze:21073",
        "title": "17 Chefs Compete",
        "season": 12,
        "episode": 4,
        "released": "2014-04-03",
        "overview": "The contestants take part in a team competition involving lobster ravioli."
      },
      {
        "id": "tvmaze:21074",
        "title": "16 Chefs Compete",
        "season": 12,
        "episode": 5,
        "released": "2014-04-10",
        "overview": "The teams must pair side dishes with four different types of protein; while the losing team makes honey taffy from scratch, the winners spend a day at Laguna Beach; the teams prepare a breakfast reception for a wedding."
      },
      {
        "id": "tvmaze:21075",
        "title": "15 Chefs Compete",
        "season": 12,
        "episode": 6,
        "released": "2014-04-17",
        "overview": "The teams must pick a team leader for the next dinner service; a chef serves an undercooked dish; a contestant is eliminated."
      },
      {
        "id": "tvmaze:21076",
        "title": "14 Chefs Compete",
        "season": 12,
        "episode": 7,
        "released": "2014-04-24",
        "overview": "Contestants from each team must work in pairs and present a unique pizza dish to Ramsay; the losers clean up and prepare both kitchens for dinner service, while the winners go to a luxurious hotel; one team runs out of a crucial ingredient."
      },
      {
        "id": "tvmaze:21077",
        "title": "13 Chefs Compete",
        "season": 12,
        "episode": 8,
        "released": "2014-05-01",
        "overview": "The team that prepares the most-impressive Southern-inspired menu for a sorority's anniversary party wins a trip to Las Vegas; both teams struggle with communication during dinner service."
      },
      {
        "id": "tvmaze:21078",
        "title": "12 Chefs Compete",
        "season": 12,
        "episode": 9,
        "released": "2014-05-08",
        "overview": "The contestants are given 30 minutes to create an entree from surprise ingredients; Ramsay conducts one-on-one evaluations."
      },
      {
        "id": "tvmaze:21079",
        "title": "11 Chefs Compete",
        "season": 12,
        "episode": 10,
        "released": "2014-05-15",
        "overview": "The contestants visit one of Gordon Ramsay's restaurants; the teams prepare meals inspired by Ramsay's cuisine; the contestants face elimination."
      },
      {
        "id": "tvmaze:21080",
        "title": "10 Chefs Compete",
        "season": 12,
        "episode": 11,
        "released": "2014-05-22",
        "overview": "A team competition tests the contestants' knowledge of pork, with the winners receiving an indoor sky-diving experience; during dinner service, both teams face struggles."
      },
      {
        "id": "tvmaze:21081",
        "title": "10 Chefs Compete Again",
        "season": 12,
        "episode": 12,
        "released": "2014-05-29",
        "overview": "After Chef Ramsay reorganizes the members on the Red and Blue teams, contestants must learn to trust their senses - and each other - as he challenges contestants to a \"dark grocery store\" challenge. Each contestant blindly chooses his/her ingredients and must create a unique dish that uses all of them. The contestant with the best dish wins the challenge, as well as a day full of pampering at a Beverly Hills spa for his/her entire team, while the losing team unloads the dinner service deliveries. Later, Chef Ramsay announces that they will be serving a five-course meal to VIP attendees from UNICEF, including actress and UNICEF ambassador Angie Harmon (\"Rizzoli &amp; Isles\"). Both teams struggle to deliver the dishes on time, and Chef Ramsay asks for both teams to present contestants for elimination. Find out which contestant leaves the kitchen for good."
      },
      {
        "id": "tvmaze:21082",
        "title": "9 Chefs Compete",
        "season": 12,
        "episode": 13,
        "released": "2014-06-05",
        "overview": "The red team and the blue team each create their own menus, from which guests can order during dinner service; the team that impresses diners with its food and service wins the challenge; contestants face elimination."
      },
      {
        "id": "tvmaze:21083",
        "title": "8 Chefs Compete",
        "season": 12,
        "episode": 14,
        "released": "2014-06-12",
        "overview": "The remaining contestants face the blind taste test, with the winning team getting an ice skating lesson with figure skater Rachael Flatt; the contestants struggle to stay organized during the dinner service."
      },
      {
        "id": "tvmaze:21084",
        "title": "7 Chefs Compete",
        "season": 12,
        "episode": 15,
        "released": "2014-06-19",
        "overview": "Ramsay challenges the teams with creating entrees with the highest dollar values with ingredients purchased on a small budget; three previous winners judge individual contestant's entrees."
      },
      {
        "id": "tvmaze:21085",
        "title": "7 Chefs Compete Again",
        "season": 12,
        "episode": 16,
        "released": "2014-06-26",
        "overview": "After spending time with three former HELL'S KITCHEN contestants, this season's remaining seven contestants prepare for a dinner service with special guests from Oxfam America, including Academy Award nominee and Oxfam America ambassador, Minnie Driver (\"Good Will Hunting\"). Later, during the dinner service, two contestants struggle with their stations, leading to an early elimination in the middle of the dinner service. Find out which contestant can't take the heat and who earns their black jackets."
      },
      {
        "id": "tvmaze:21086",
        "title": "6 Chefs Compete",
        "season": 12,
        "episode": 17,
        "released": "2014-07-03",
        "overview": "The six remaining chefs receive their black jackets and prepare tailgate food for football fans; tempers flare during dinner service."
      },
      {
        "id": "tvmaze:21087",
        "title": "5 Chefs Compete",
        "season": 12,
        "episode": 18,
        "released": "2014-07-10",
        "overview": "The remaining contestants use leftovers to create a dish; Better Homes &amp; Gardens Editor Laurie Buckle chooses which dish will be featured in the magazine; the contestants face elimination."
      },
      {
        "id": "tvmaze:21088",
        "title": "4 Chefs Compete",
        "season": 12,
        "episode": 19,
        "released": "2014-07-17",
        "overview": "The remaining four chefs sample one of Ramsay's complex entrees and then must re-create it correctly; two of the chefs face elimination."
      },
      {
        "id": "tvmaze:21089",
        "title": "Winner Chosen",
        "season": 12,
        "episode": 20,
        "released": "2014-07-24",
        "overview": "The final two contestants must prepare five unique dishes, to be judged by renowned Los Angeles chefs; former contestants help with the final dinner service; a winner is chosen."
      },
      {
        "id": "tvmaze:21090",
        "title": "18 Chefs Compete",
        "season": 13,
        "episode": 1,
        "released": "2014-09-10",
        "overview": "On the Season 13 premiere of HELL'S KITCHEN, Gordon Ramsay welcomes 18 aspiring chefs into the kitchen. In the first challenge of the season, Chef Ramsay splits the chefs into two teams: men (Blue) vs. women (Red) and asks them to present their signature dishes. The winning team gets treated to an exclusive dinner with Chef Ramsay, along with special guest and renowned chef, Wolfgang Puck, while the losing team must set up the new living arrangements and kitchen for this season. Then, Chef Ramsay tests the teams' attention to detail and challenges them to recreate his Geoduck sashimi. The team that creates 15 perfect dishes will soak up the sun on a luxury yacht with Chef Ramsay, while the losing team will clean up the sand outside and prepare the Geoduck nigiri and chowder for dinner service."
      },
      {
        "id": "tvmaze:21091",
        "title": "17 Chefs Compete",
        "season": 13,
        "episode": 2,
        "released": "2014-09-10",
        "overview": "The team that wins the Geoduck sashimi challenge spends time on a luxury yacht with Ramsay, while the losers clean and prepare for dinner service."
      },
      {
        "id": "tvmaze:21092",
        "title": "16 Chefs Compete",
        "season": 13,
        "episode": 3,
        "released": "2014-09-17",
        "overview": "Ramsay uses a unique recipe challenge to strengthen team communication; the teams work together to prepare a dinner service with special guests, including TV host Wendy Williams."
      },
      {
        "id": "tvmaze:21093",
        "title": "15 Chefs Compete",
        "season": 13,
        "episode": 4,
        "released": "2014-09-24",
        "overview": "The teams have just 20 minutes to prepare breakfast for culinary school graduates and their guests; while the winning team goes to San Francisco to meet chef Dominique Chen, the losers grind meat by hand for dinner service."
      },
      {
        "id": "tvmaze:21094",
        "title": "14 Chefs Compete",
        "season": 13,
        "episode": 5,
        "released": "2014-10-01",
        "overview": "The teams must identify proteins and match them to their dishes, with the winners getting a day at the beach with water polo players Genai Kerr, Shea Buckner and Tumua Anae; family night dinner service."
      },
      {
        "id": "tvmaze:21095",
        "title": "13 Chefs Compete",
        "season": 13,
        "episode": 6,
        "released": "2014-10-08",
        "overview": "The teams must herd farm animals into their proper pens and decide which proteins and starches they will use next; the winning team goes on a wine tour, while the losers prepare stock bones; tempers flare during the dinner service."
      },
      {
        "id": "tvmaze:21096",
        "title": "12 Chefs Compete",
        "season": 13,
        "episode": 7,
        "released": "2014-10-15",
        "overview": "The teams compete to create the best Italian opera-inspired dishes, with the winning team getting a shopping trip and a VIP dinner; the teams provide dinner service for guests, including members of the Italian Consulate."
      },
      {
        "id": "tvmaze:40639",
        "title": "11 Chefs Compete, Part 1",
        "season": 13,
        "episode": 8,
        "released": "2014-11-05",
        "overview": "The teams meet new members before heading into a team challenge in which each member must prepare a tasting menu for a Best in Show Competition with the American Kennel Club."
      },
      {
        "id": "tvmaze:40636",
        "title": "11 Chefs Compete, Part 2",
        "season": 13,
        "episode": 9,
        "released": "2014-11-12",
        "overview": "The teams roll the dice to determine the ingredients for their next team challenge; a contestant leaves due to an injury; the cooks serve music legends, including Stewart Copeland and Steven Tyler."
      },
      {
        "id": "tvmaze:45247",
        "title": "9 Chefs Compete",
        "season": 13,
        "episode": 10,
        "released": "2014-11-19",
        "overview": "Contestants must create four Indian-inspired meals; the teams attempt to impress VIP dinner guests during Indian Cuisine night."
      },
      {
        "id": "tvmaze:45834",
        "title": "8 Chefs Compete",
        "season": 13,
        "episode": 11,
        "released": "2014-11-26",
        "overview": "The remaining eight chefs compete in a blind taste test, during which wrong answers lead to a dip in a dunk tank, and the winning team gets to spend the day at the Santa Monica Pier. Later, there's a special dinner service honoring firefighters that doesn't go as well as Chef Ramsay wanted."
      },
      {
        "id": "tvmaze:57590",
        "title": "7 Chefs Compete",
        "season": 13,
        "episode": 12,
        "released": "2014-12-03",
        "overview": "The remaining seven chefs are challenged to make an artistic amuse-bouche inspired by speed painter Tim Decker; and later, the teams struggle with communication and getting their food out on time during a dinner service that sees one contestant sent home before the elimination ceremony begins."
      },
      {
        "id": "tvmaze:57606",
        "title": "6 Chefs Compete",
        "season": 13,
        "episode": 13,
        "released": "2014-12-10",
        "overview": "Having receiving their black jackets, the remaining chefs have to make a dish using Omaha steaks."
      },
      {
        "id": "tvmaze:58181",
        "title": "5 Chefs Compete",
        "season": 13,
        "episode": 14,
        "released": "2014-12-10",
        "overview": "The finals five battle it out to try and secure a place in the next phase of the competition."
      },
      {
        "id": "tvmaze:58182",
        "title": "4 Chefs Compete",
        "season": 13,
        "episode": 15,
        "released": "2014-12-17",
        "overview": "Four chefs remain for the \"Taste It, Now Make It\" challenge; and the winner gets to spend the afternoon with loved ones, while the other contestants prepare for the 200th dinner service."
      },
      {
        "id": "tvmaze:58183",
        "title": "Winner Chosen",
        "season": 13,
        "episode": 16,
        "released": "2014-12-17",
        "overview": "In the Season 13 finale, the two remaining contestants must create five unique dishes, which will be judged by a group of esteemed Los Angeles chefs. Later, a new head chef for Gordon Ramsay Pub &amp; Grill at Caesars Palace Atlantic City is chosen."
      },
      {
        "id": "tvmaze:98972",
        "title": "18 Chefs Compete",
        "season": 14,
        "episode": 1,
        "released": "2015-03-03",
        "overview": "The chefs present their signature dishes, with the winners getting a night with William Shatner."
      },
      {
        "id": "tvmaze:142543",
        "title": "17 Chefs Compete",
        "season": 14,
        "episode": 2,
        "released": "2015-03-10",
        "overview": "Crab cakes are prepared by the 17 remaining contestants after they retrieve the main ingredient for their dishes from the ocean. Later, seafood is a problem for one team, which leads to their early expulsion from the kitchen."
      },
      {
        "id": "tvmaze:142544",
        "title": "16 Chefs Compete",
        "season": 14,
        "episode": 3,
        "released": "2015-03-17",
        "overview": "A seafood battle finds the 16 cooks having to successfully match the heads and tails of some popular fish and then create dishes to impress guest judge Michael Cimarusti. Later, dinner service gets off to a rough start as one team struggle to make it past the first course."
      },
      {
        "id": "tvmaze:144466",
        "title": "15 Chefs Compete",
        "season": 14,
        "episode": 4,
        "released": "2015-03-24",
        "overview": "The Top 15 contestants face chopping more than 500 pounds of onions if they lose the first challenge, which is to prepare American comfort food for two guest judges. Later, a special family-style dinner service ends with an elimination."
      },
      {
        "id": "tvmaze:151380",
        "title": "14 Chefs Compete",
        "season": 14,
        "episode": 5,
        "released": "2015-03-31",
        "overview": "An ocean adventure is up for grabs as the teams try to impress chef Gordon Ramsay during a cheese challenge. Later, emotions are elevated as the 14 remaining contestants work to avoid elimination and complete a star-studded dinner service."
      },
      {
        "id": "tvmaze:153416",
        "title": "13 Chefs Compete",
        "season": 14,
        "episode": 6,
        "released": "2015-04-07",
        "overview": "The 13 remaining contestants prepare a special lunch for two charitable organizations involving active and retired firefighters in Los Angeles. Later, dinner service becomes tense and multiple chefs are ordered to leave the kitchen."
      },
      {
        "id": "tvmaze:153417",
        "title": "12 Chefs Compete",
        "season": 14,
        "episode": 7,
        "released": "2015-04-14",
        "overview": "The contestants compete to create Greek-inspired dishes, with the winners getting a trip to the go-kart track; chef Michael Psilakis guest judges; Ramsay kicks one team out during dinner service, leaving the other to cover."
      },
      {
        "id": "tvmaze:153418",
        "title": "11 Chefs Compete",
        "season": 14,
        "episode": 8,
        "released": "2015-04-21",
        "overview": "John Ratzenberger judges the contestants' food pairings; while the challenge winners spend the day at a famous roller rink and go on a beer tasting, the losers prepare linens for dinner service; gastropub night doesn't go smoothly."
      },
      {
        "id": "tvmaze:155253",
        "title": "9 Chefs Compete",
        "season": 14,
        "episode": 9,
        "released": "2015-04-28",
        "overview": "A challenge involving exotic proteins, including alligator, ostrich and wild boar, is followed by chef Ramsay giving the remaining nine contestants one-on-one evaluations and sending one of the weakest team members home."
      },
      {
        "id": "tvmaze:155254",
        "title": "8 Chefs Compete",
        "season": 14,
        "episode": 10,
        "released": "2015-05-05",
        "overview": "The remaining 8 contestants must present three courses to the discerning palates of the Calabasas High School Homecoming committee, which has requested Mardi Gras-inspired cuisine."
      },
      {
        "id": "tvmaze:155604",
        "title": "8 Chefs Compete Again",
        "season": 14,
        "episode": 11,
        "released": "2015-05-12",
        "overview": "After last week's fiery high school homecoming challenge, the teams have undergone a surprising twist and will embark on one of HELL'S KITCHEN's most popular challenges - the blind taste test. The team that blindly and successfully identifies the most foods will win a shopping spree and day at Los Angeles restaurant and boutique Petrossian, specializing in caviar. Later, a special five-course dinner service will be presented to two major charitable organizations: actress Fran Drescher's \"Cancer Schmancer Movement\" and \"Step Up Women's Network.\" Find out which team dominates and which will have to nominate their own teammates to go home."
      },
      {
        "id": "tvmaze:157386",
        "title": "7 Chefs Compete",
        "season": 14,
        "episode": 12,
        "released": "2015-05-19",
        "overview": "Seven contestants remain to prepare a premiere dish using various cuts of steak in less than 35 minutes."
      },
      {
        "id": "tvmaze:157387",
        "title": "6 Chefs Compete",
        "season": 14,
        "episode": 13,
        "released": "2015-05-19",
        "overview": "Six chefs compete in pairs during the \"Taste It and Make It\" challenge for the chance to win a visit aboard the Queen Mary ocean liner."
      },
      {
        "id": "tvmaze:157388",
        "title": "5 Chefs Compete",
        "season": 14,
        "episode": 14,
        "released": "2015-05-26",
        "overview": "The top five chefs must prepare a unique and elegant small-plate dish in under 45 minutes for people attending a private symphony performance; the challenge winner earns a private helicopter tour of Los Angeles; the top four chefs are revealed."
      },
      {
        "id": "tvmaze:157389",
        "title": "4 Chefs Compete",
        "season": 14,
        "episode": 15,
        "released": "2015-06-02",
        "overview": "Protein is off limits when the final four chefs compete in a vegetarian challenge. Later, they receive a surprise visit from friends and family before a dinner service that determines who's going to the finale."
      },
      {
        "id": "tvmaze:157390",
        "title": "Finale: Season 14 Winner is Announced",
        "season": 14,
        "episode": 16,
        "released": "2015-06-09",
        "overview": "The finalists prepare five dishes to be judged by renowned chefs, including Wolfgang Puck."
      },
      {
        "id": "tvmaze:529226",
        "title": "18 Chefs Compete",
        "season": 15,
        "episode": 1,
        "released": "2016-01-15",
        "overview": "This season's contestants head to Las Vegas where they participate in the signature dish challenge; the winners of the challenge ride on the world's tallest Ferries wheel while the losers peel 50 pounds of shrimp and 1,000 pounds of potatoes."
      },
      {
        "id": "tvmaze:529227",
        "title": "17 Chefs Compete",
        "season": 15,
        "episode": 2,
        "released": "2016-01-22",
        "overview": "The teams have 20 minutes to see which team can produce the most shrimp dumplings; rapper The Game attends the dinner service."
      },
      {
        "id": "tvmaze:529228",
        "title": "16 Chefs Compete",
        "season": 15,
        "episode": 3,
        "released": "2016-01-27",
        "overview": "The contestants are faced with a communications challenge; the winning team goes on a relaxing retreat while the losers prepare for dinner service, which involves gutting 100 pounds of sea bass. VIP guests include astronaut Buzz Aldrin."
      },
      {
        "id": "tvmaze:529229",
        "title": "15 Chefs Compete",
        "season": 15,
        "episode": 4,
        "released": "2016-02-03",
        "overview": "A rubber-duck determines which ingredients the contestants will use with duck in a team challenge; the winning team spends the day on a yacht while the losing team prepares a duck appetizer; guests include Kris Jenner and Dita Von Teese."
      },
      {
        "id": "tvmaze:529230",
        "title": "14 Chefs Compete",
        "season": 15,
        "episode": 5,
        "released": "2016-02-10",
        "overview": "The contestants pair up and prepare three main dishes, each with one of the following holiday themes: July Fourth, Mardi Gras and Cinco de Mayo; challenge winners are flown to Santa Inez Valley, where they blend their own wine."
      },
      {
        "id": "tvmaze:529231",
        "title": "12 Chefs Compete",
        "season": 15,
        "episode": 6,
        "released": "2016-02-17",
        "overview": "A new member joins the Blue Team before a grocery spelling challenge, after which the winners go flying in a stunt plane, while the losers make sangria. Later, Thomas Ian Nicholas and Omar Benson Miller are VIP guests for a tense dinner service that offers some chefs the chance to shine as their competitors fall apart."
      },
      {
        "id": "tvmaze:529232",
        "title": "11 Chefs Compete",
        "season": 15,
        "episode": 7,
        "released": "2016-02-24",
        "overview": "The teams must create six unique dishes for former sous chef Andi; while the challenge winners spend the night in Las Vegas, the losing team makes a mountain of macaroons; dinner service has the contestants cooking for Andi's wedding reception."
      },
      {
        "id": "tvmaze:529233",
        "title": "10 Chefs Compete",
        "season": 15,
        "episode": 8,
        "released": "2016-03-02",
        "overview": "Grammy-winning guitarist Steve Vai performs; the contestants must create unique dishes with a limited number of ingredients; the winning team plays a game of paintball while the losing team is faced with delivery day at the kitchen."
      },
      {
        "id": "tvmaze:611499",
        "title": "10 Chefs Compete Again",
        "season": 15,
        "episode": 9,
        "released": "2016-03-09",
        "overview": "The contestants compete in a bison-dish challenge that tests their archery and cooking skills; cowboy steak night with news commentator Stacey Dash and Olympic gold medalist Phil Dalhausser."
      },
      {
        "id": "tvmaze:622401",
        "title": "9 Chefs Compete",
        "season": 15,
        "episode": 10,
        "released": "2016-03-16",
        "overview": "The teams make vegetarian, meat, seafood and sweet dishes for the surprise judges; the winners go to Palm Springs while the losing team has to squeeze oranges"
      },
      {
        "id": "tvmaze:638205",
        "title": "8 Chefs Compete",
        "season": 15,
        "episode": 11,
        "released": "2016-03-23",
        "overview": "The teams can only have one chef in the kitchen at a time as they prepare three entrees, each with a different protein; actress Lainie Kazan and comic Bill Engvall are guests at the dinner service."
      },
      {
        "id": "tvmaze:638234",
        "title": "7 Chefs Compete",
        "season": 15,
        "episode": 12,
        "released": "2016-04-01",
        "overview": "The chefs must identify ice cream flavors in a blind taste test challenge; actress Meredith Baxter and Olympic swimmer Haley Anderson attend the dinner service."
      },
      {
        "id": "tvmaze:650276",
        "title": "6 Chefs Compete",
        "season": 15,
        "episode": 13,
        "released": "2016-04-08",
        "overview": "The remaining six chefs must rely on their loved ones to complete chef Ramsay's Branzino dish; the winning team will be awarded a day at a luxurious spa while the losers have to clean the entire dormitory."
      },
      {
        "id": "tvmaze:670466",
        "title": "5 Chefs Compete",
        "season": 15,
        "episode": 14,
        "released": "2016-04-15",
        "overview": "The chefs prepare high school lunch dishes, and teenagers act as the judges; the winner gets a trip to San Francisco's Levi Stadium, while the losers must sort recyclables from an abundance of trash; actors Randy Couture and Neil Jackson visit."
      },
      {
        "id": "tvmaze:670625",
        "title": "3 Chefs Compete",
        "season": 15,
        "episode": 15,
        "released": "2016-04-22",
        "overview": "The chefs must create a steak dish and two sides in 40 minutes to be submitted to the scrutiny of chef Ari Rosenson; during dinner service, the chefs take turns leading the kitchen; two chefs advance."
      },
      {
        "id": "tvmaze:698124",
        "title": "Winner Chosen",
        "season": 15,
        "episode": 16,
        "released": "2016-04-29",
        "overview": "After facing a number of grueling challenges and dinner services, this season's finalists will compete one last time to see who will be victorious and claim the winning prize of $250,000 and a Head Chef position at BLT Steak at Bally's Las Vegas. During the finale, the Top Two finalists will create five stunning dishes, cold and hot appetizers and main entrées featuring chicken, beef and fish. Each dish will be rated by a group of esteemed judges."
      },
      {
        "id": "tvmaze:835411",
        "title": "When the Wall Comes Tumbling Down",
        "season": 16,
        "episode": 1,
        "released": "2016-09-23",
        "overview": "On the Season 16 premiere of Hell's Kitchen, Chef Gordon Ramsay welcomes the newest crop of hopefuls on the grounds of a U.S. Army training facility. The 18 aspiring chefs will have to demonstrate they have the discipline to succeed in Hell's Kitchen, before proving their culinary skills in the kitchen. Once Ramsay is confident they have a chance to survive, they are then split up into two teams – men (blue) vs. women (red) – and greeted by the Signature Dish Challenge! The winning team will enjoy a special dinner hosted by Ramsay at Takami Restaurant in downtown Los Angeles. Meanwhile, the losing team will be tasked with cleaning both kitchens and preparing the dining room for the season's first dinner service. Later, during the dinner service, and joined by VIP guests actor Nolan Gould and actress Erica Ash, one team will deliver a fantastic service that impresses Chef Ramsay."
      },
      {
        "id": "tvmaze:920834",
        "title": "Crepe Grand Prix",
        "season": 16,
        "episode": 2,
        "released": "2016-09-30",
        "overview": "The teams go head-to-head during the first-ever HELL'S KITCHEN Crepe Grand Prix challenge, with the contestants racing to present Chef Ramsay with 10 acceptable savory crepes. The winning team will head to Santa Barbara for a luxurious dining experience on a yacht. Meanwhile, the losing team will face a fishy punishment as they take on the responsibility of handling fish delivery day. Later, during the dinner service featuring VIP guests – actress Noureen DeWulf and actor Dash Mihok – one team will struggle right out of the gate before someone's lack of passion leads to another elimination."
      },
      {
        "id": "tvmaze:929956",
        "title": "The Yolks on Them",
        "season": 16,
        "episode": 3,
        "released": "2016-10-07",
        "overview": "With tensions running high in the house, the chefs must set aside their feelings and prepare for their next challenge. This week, Gordon greets the chefs with a surprising selection of meat as each team will need to prepare eight unique dishes using a selection of ostrich cuts. The rest of their ingredients will be selected as the contestants take turns breaking through giant ostrich eggs to collect as many ingredients as they can in just four minutes. Gordon has recruited special guest judges, David McMillan and Frederic Morin, the chefs/owners of Joe Beef, to help critique this week's challenge. The winning team will be jetted off to Big Bear for a zip lining excursion in the mountains. Meanwhile, the losing team has no choice but to face the tedious job of plucking pine nuts out of pinecones and cleaning the kitchen. Later during the dinner service, find out which chefs can't handle the pressure."
      },
      {
        "id": "tvmaze:938255",
        "title": "Surf Riding & Turf Fighting",
        "season": 16,
        "episode": 4,
        "released": "2016-10-14",
        "overview": "Chef Ramsay introduces the contestants to the latest challenge - a Surf &amp; Turf protein relay. As the teams struggle to identify their proteins, they must work together in pairs to succeed in the challenge. The winning team will spend the day surfing at the Wavehouse in San Diego, CA, while the losing team will find themselves spending the day making sausages from scratch. Later, during the dinner service, Ramsay informs the teams that tonight they will need to cook with extra confidence because they will be welcoming a VIP 12-top. Find out which chefs will impress Ramsay."
      },
      {
        "id": "tvmaze:944752",
        "title": "Walking the Plank",
        "season": 16,
        "episode": 5,
        "released": "2016-10-21",
        "overview": "After a shocking elimination, both teams must regroup and chart a new course. During The Seven Seas Seafood Challenge, the chefs will go head-to-head against a chef of their choice from the opposing team. Each pair will choose a body of water that will reveal a type of fish that they will have 30 minutes to prepare using a variety of fresh ingredients provided by Chef Ramsay. The winning team, accompanied by Ramsay himself, will enjoy an exciting meal at one of LA's hottest restaurants, Petty Cash. Meanwhile, the losing team will stay behind for delivery day and haul in pounds of potatoes and vegetables. Later during the dinner service, Chef Ramsay invites Grammy award-winning artists guitarist Joe Perry and R&amp;B singer Estelle."
      },
      {
        "id": "tvmaze:959173",
        "title": "Let the Catfights Begin",
        "season": 16,
        "episode": 6,
        "released": "2016-11-04",
        "overview": "The remaining contestants use cookbooks from Gordon's Hell's Kitchen library to spell out the ingredients they want to use for their next challenge. During this week's Ingredient Crossword Challenge, they'll have 25 minutes to use as many or as few ingredients they've successfully spelled out. The losing team will spend their evening preparing for the upcoming dinner service, while the winning team will enjoy a night of fun that will include a delicious steak dinner and Ice Bunker cars. Later, the dinner service will embrace Family Night with VIP diners including actresses Lauren Lapkus (\"Jurassic World\") and Ciara Hanna (\"Power Rangers Megaforce\")."
      },
      {
        "id": "tvmaze:967459",
        "title": "Don't Tell My Fiancé",
        "season": 16,
        "episode": 7,
        "released": "2016-11-11",
        "overview": "The remaining contestants are tasked with cooking their own interpretation of a southern staple, and are judged by Chef Ramsay and surprise guest judge Chris Hastings, the executive chef of Hot and Hot Fish Club. The winners will enjoy a Southern-themed reward, while the losing team must prepare for both team's dinner service by grinding pieces of corn and shelling shrimp. The dinner service begins with determination to impress Chef Ramsay and the VIP Guests: NBA player J.J Redick, recording artist Blake Lewis, actress Mircea Monroe and entrepreneur and reality TV star Adrienne Maloof. Stress rises within the teams, and Ramsay makes a shocking decision that leaves the chefs speechless."
      },
      {
        "id": "tvmaze:974920",
        "title": "Dancing with the Chefs",
        "season": 16,
        "episode": 8,
        "released": "2016-11-18",
        "overview": "After the shocking change that was implemented by Chef Ramsay, the chefs must work together and come out strong. Chef Ramsay informs the teams that HELL'S KITCHEN will be hosting the International Ballroom Invitational and that they will prepare a special menu for the event. The winning team is rewarded with kayaking in the Pacific Ocean and lunch at The Lark, while the losing team must prepare a raw bar for the ballroom event and break down lobster, scrub clams and oysters, and steam up crab. Find out which team will fall short during the final challenge."
      },
      {
        "id": "tvmaze:991309",
        "title": "Spoon Fed",
        "season": 16,
        "episode": 9,
        "released": "2016-12-09",
        "overview": "The remaining contestants prepare for their next challenge - a blind taste test during which each team must determine the taste of pureed baby foods. The winning team will enjoy a relaxing day of massages and a nice lunch, while the losing team must prepare the kitchen, all while hauling in bags of ice and boxes of wine. During service, both teams start off strong, as they try to impress guest celebrity diners - actor Josh McDermitt (\"The Walking Dead\") and TV host Jeannie Mai (\"The Real\") - but excuses and miscommunication ultimately lead both teams to failure."
      },
      {
        "id": "tvmaze:991310",
        "title": "Dancing in the Grotto",
        "season": 16,
        "episode": 10,
        "released": "2016-12-16",
        "overview": "Following the recent eliminations, the teams must balance out, and a member of one will move to the other. Then, the chefs tackle sliders for their challenge. The chefs are later introduced to three guest judges - Adam Fleischman, the founder of Umami Burger; Sang Yoon, the chef and owner of Father's Office; and Christina Wilson, the executive chef of Gordon Ramsay's BURGR - who will all determine which team gets to party at the Playboy Mansion and which team gets stuck cleaning up the LA River. Later, the teams try to impress celebrity guest diners, including 2009 Playmate of the Month Crystal Hefner, \"Fashion Police\" executive producer Melissa Rivers, TV hosts and producers Drew and Jonathan Scott and actress Ashley Green. However, a tough dinner service for both teams ultimately leads to a shocking elimination."
      },
      {
        "id": "tvmaze:1015829",
        "title": "Aerial Maneuvers",
        "season": 16,
        "episode": 11,
        "released": "2017-01-05",
        "overview": "The chefs pair up for a taste challenge in which the winners receive Vitamix blenders and a special trapeze lesson on the Santa Monica Pier. Later, the chefs learn that the night's dinner service will be a unique one, as they will host a private, invitation only service that honors major contributors to the charity \"Stand Up to Cancer.\" After a few hiccups, one team must chose two people for elimination, which causes an unexpected deliberation. Then, the chefs must pair up for their challenge in which they must try and combine two countries' flavors to impress guest judge, Roy Yamaguchi, owner and executive chef of Roy's. Later during dinner service, the chefs try to impress Chef Ramsay, as well as special guest diners that include actors Kellita Smith (\"Z Nation\"), Jasika Nicole (\"Fringe\"), Patrick Renna (\"The Sandlot\") and Tommy Savas (\"State of Affairs\")."
      },
      {
        "id": "tvmaze:1015830",
        "title": "Fusion Confusion",
        "season": 16,
        "episode": 12,
        "released": "2017-01-05",
        "overview": "In the second hour, the chefs must pair up for their challenge in which they must try and combine two countries' flavors to impress guest judge, Roy Yamaguchi, owner and executive chef of Roy's. Later during dinner service, the chefs try to impress Chef Ramsay, as well as special guest diners that include actors Kellita Smith (\"Z Nation\"), Jasika Nicole (\"Fringe\"), Patrick Renna (\"The Sandlot\") and Tommy Savas (\"State of Affairs\")."
      },
      {
        "id": "tvmaze:1007990",
        "title": "Black Jacket Lounge",
        "season": 16,
        "episode": 13,
        "released": "2017-01-12",
        "overview": "Chef Ramsay shakes things up and introduces a series of three challenges that will determine the recipients of a black jacket. For the first time, there will be no reward, no punishment and no dinner service. During the first challenge, each chef must create a dish, knowing that surprise ingredients will be introduced to them along the way that they must use. In the second challenge, all chefs will receive the same ingredients to begin with and must create a unique dish based upon them. Finally, the competition heats up in the last challenge as two chefs go head-to-head for the final black jacket."
      },
      {
        "id": "tvmaze:1007991",
        "title": "Playing Your Cards Right",
        "season": 16,
        "episode": 14,
        "released": "2017-01-19",
        "overview": "The remaining chefs go head-to-head in a challenge for which Chef Ramsay provides the first three ingredients, but the chefs must race to hit a buzzer in order to get their final three. Tension is high as the chefs try to impress not only Chef Ramsay, but guest judge, Jenn Louis - chef and owner of Lincoln/Sunshine Tavern. The winner receives a special prize - a luxurious overnight trip to Las Vegas, where they will stay in the Presidential Suite at The Venetian Hotel. Meanwhile, the other chefs are left to sort trash for recycling day. During dinner service, the chefs try to keep it together as guest diners TV anchor Neil Everett (\"Sportscenter\"), comedian Pauly Shore (host of podcast \"Interested\") and actor Erik Griffin (\"Workaholics\") watch from the dining room. Find out who will impress."
      },
      {
        "id": "tvmaze:1007992",
        "title": "Tequila Shots?",
        "season": 16,
        "episode": 15,
        "released": "2017-01-26",
        "overview": "After two chefs are eliminated, the remaining contestants must create a unique dining experience for a large group of well-known chefs that include guest judges Bruce Kalman (executive chef and owner of Union), Steve Samson (chef and owner of Sotto), Mette Williams (executive chef of Culina) and Alessio Biagini (chef de cusine at Cecconi's). The winner of this challenge is taken on a helicopter tour of Los Angeles with Chef Andi and is treated to a delicious lunch at Firefly with Chef Ramsay. The losing chefs on the other hand, are forced to wrap presents for the Hell's Kitchen staff, steam their clothes and polish their shoes. At the dinner service, actress Tara Reid (\"Sharknado\"), pro baseball player Adrian Gonzalez, actor Matt Letscher (\"Her,\" \"The Carrie Diaries\") and TV personality Taylor Ann Hasselhoff join as guest diners, and each chef is given the opportunity to run the pass, while Chef Andi and Chef Aaron surreptitiously try to sabotage them."
      },
      {
        "id": "tvmaze:1007993",
        "title": "Leaving It on the Line",
        "season": 16,
        "episode": 16,
        "released": "2017-02-02",
        "overview": "It's down to the Top Two in the Season 16 finale of HELL'S KITCHEN. As both finalists work on their menus for the last dinner service, Chef Ramsay surprises them with a special trip to the luxurious Ken Paves Salon, where they will receive a makeover before heading to the premiere of a new musical. When the two arrive at the theater, they are greeted by actor Rob Morrow and learn they are not actually seeing a musical, but are instead jumping into their final challenge, for which they must create four dishes in the span of an hour, all while in front of a huge audience! Walter Manzke, Michael Cimarusti, Susan Feniger and John Kunel serve as guest judges and help decide the winner of the challenge. As the contestants move into their final dinner service, they are welcomed by celebrity guest diners MLB Player C.J. Wilson, actress Andrea Roth, actor Danny Trejo and actress Naomi Grossman. Find out who is the winner."
      },
      {
        "id": "tvmaze:1232004",
        "title": "All-Stars Arrive",
        "season": 17,
        "episode": 1,
        "released": "2017-09-29",
        "overview": "It's an all-new season and for the first time ever in HELL'S KITCHEN history, Chef Ramsay invites 16 All-Stars back to the kitchen for a second chance to prove they have what it takes. Old rivalries are renewed and new alliances are formed, but in the end, only one of these all-stars will claim the grand prize – a head chef position at the brand-new Gordon Ramsay Hell's Kitchen Restaurant at Caesars Palace Las Vegas and $250,000. During the premiere episode, Chef Ramsay surprises the 16 former Black Jacket chefs with a twist on the infamous Signature Dish Challenge. The winning team will enjoy the ride of their lives at Skyslide in downtown Los Angeles, followed by a dinner with Chef Ramsay and special guest Wolfgang Puck at his restaurant, WP24. Meanwhile, the losing team will stay behind to clean up and prep both kitchens for the upcoming dinner service. The next day, Ramsay gathers the chefs in the newly redesigned dining room for a huge announcement that will leave them stunned. Find out which all-star makes the biggest first impression."
      },
      {
        "id": "tvmaze:1297164",
        "title": "Raising the Bar",
        "season": 17,
        "episode": 2,
        "released": "2017-10-06",
        "overview": "The 16 chefs are given 40 minutes to execute their first individual challenge – the Bar Menu Challenge. Then, the chefs prep for the season's first dinner service, as they adapt to an all-new menu. For the first time ever, the restaurant will host Chef Tables on opening night with special VIP guests – singer Jordin Sparks, actor Joe Montegna, actor French Stewart, R&amp;B singer Keith Sweat and singer Kirstin Maldonado from Pentatonix. One team struggles to bounce back after a rocky start, while the other team hits its stride and finishes strong. And after a disappointing dinner service, Chef Ramsay makes a shocking decision during elimination."
      },
      {
        "id": "tvmaze:1312587",
        "title": "Tower of Terror",
        "season": 17,
        "episode": 3,
        "released": "2017-10-13",
        "overview": "Chef Ramsay challenges the remaining chefs to complete a four-tiered shellfish tower with \"fast hands.\" Each team is divided into four teams of two, with each pair completing one tier at a time. The first team to finish all four tiers wins and is rewarded with a glamorous day in Malibu. Meanwhile, the losing team must prep for a massive fish delivery. Then, the dinner service begins with a rocky start, as Chef Ramsay sends multiple entrees back to the kitchen and temporarily kicks out one of the All-Stars. In the end, one team manages to improve its performance, while the other fails to impress. During an intense elimination, another contestant is sent home for showing a lack of commitment."
      },
      {
        "id": "tvmaze:1318369",
        "title": "Just Letter Cook",
        "season": 17,
        "episode": 4,
        "released": "2017-10-20",
        "overview": "The remaining chefs must face off in a \"game of chance\" to divvy up their ingredients and create their own unique dishes. During this challenge, each chef has 45 minutes to create a dish, combining a protein of their choice with all the ingredients selected from the game of chance. After Chef Ramsay judges each dish, the winners are chosen and rewarded with a private jet whisking them away for an exclusive stay at the Belmond El Encanto in Santa Barbara, CA. During dinner service, the contestants are determined to impress Chef Ramsay and the VIP Guests: Mixed martial artist Paige VanZant and actress/model Shannon Tweed. After mistakes are made in the kitchen, Chef Ramsay decides to shake things up."
      },
      {
        "id": "tvmaze:1330249",
        "title": "Josh Josh Josh",
        "season": 17,
        "episode": 5,
        "released": "2017-11-03",
        "overview": "After a shocking change, many are left unhappy and the tension in the dorms is at an all-time high. The next day, the chefs are challenged to work in pairs and cook different types of fish on cedar and hickory wood planks. Special guest judge Chef Ben Ford helps Chef Ramsay decide which team delivered the best and most consistent dishes. Later that evening during dinner service, the chefs aim to impress special guest diner actor Shaun Brown. Chef Ramsay has had enough with one contestant and makes a drastic decision."
      },
      {
        "id": "tvmaze:1335321",
        "title": "A Little Slice of Hell",
        "season": 17,
        "episode": 6,
        "released": "2017-11-10",
        "overview": "The remaining chefs meet at DeSano Pizzeria and learn about their next challenge, for which they will be given 30 minutes to create a pizza inspired by their assigned country. Marino, the owner of the pizzeria and HELL'S KITCHEN'S Maître D', joins Chef Ramsay and special guest judge Steve Samson (Head Chef at Sotto in Los Angeles), to determine the winning team. Later during dinner service, actress Melissa Fumero and Victoria's Secret model Devon Windsor join as special guests, and while both teams struggle, one just can't keep up."
      },
      {
        "id": "tvmaze:1341112",
        "title": "Trimming Fat",
        "season": 17,
        "episode": 7,
        "released": "2017-11-17",
        "overview": "Chef Ramsay decides to give the 12 remaining contestants a tutorial on how to best prepare six of the most popular HELL'S KITCHEN dishes. Following the lesson, Ramsay informs them of their next challenge - each team will have 25 minutes to recreate all six dishes. But what the contestants don't know is that every three minutes, each team will have to select one chef to kick out of the kitchen, thus leaving more work for the remaining chefs and intensifying the \"Last Man Standing\" challenge. Later, the contestants receive a big surprise when they find out that in lieu of a Dinner Service, they will compete in this week's \"Fight For Your Life\" Challenge -- during which the three weakest chefs from each team will be tasked to recreate Gordon's signature dish, Tagliatelle with Oysters. The chef with the worst dish will be immediately eliminated."
      },
      {
        "id": "tvmaze:1352428",
        "title": "Welcome to the Jungle",
        "season": 17,
        "episode": 8,
        "released": "2017-12-01",
        "overview": "This week's challenge takes place in the HELL'S KITCHEN \"Jungle,\" where the contestants must create a dish using exotic meats – Boar, Venison and Elk – that were eaten by early humans. Each team will use a spear to hunt for five ingredients to prepare as sides for their dish. Gordon invites special guests Chef Jon Shook and Chef Vinny Dotolo (Animal, Son of a Gun, and Trois Mec restaurants) to help judge the challenge. Later, during the dinner service, Goo Goo Dolls lead singer John Rzeznik is a guest at the chef's table, causing a change in momentum for one team."
      },
      {
        "id": "tvmaze:1357217",
        "title": "Catch of the Day",
        "season": 17,
        "episode": 9,
        "released": "2017-12-08",
        "overview": "Special guest judge and fish-cooking expert Chef Michael Cimarusti joins Chef Ramsay, as the remaining contestants compete in a special challenge involving creatures of the sea. Then, during dinner service, the chefs aim to impress a host of VIP guests, including actor Aleks Paunovic, rapper E-40, professional dancer Cheryl Burke and actor Dan Bucatinsky. With two chefs fighting bitterly for authority and another struggling to communicate, Chef Ramsay is less than pleased. Find out who doesn't make the cut."
      },
      {
        "id": "tvmaze:1360655",
        "title": "It's All Gravy",
        "season": 17,
        "episode": 10,
        "released": "2017-12-15",
        "overview": "The remaining all-stars head to the dining room to be greeted by Gordon and a camel, before diving into the infamous Blind Taste Test Challenge – during which they must decipher spices with the risk of being blasted by mashed potatoes and gravy. Later, during a special dinner service, the restaurant hosts a private charity event for the Leukemia &amp; Lymphoma Society and Shane's Inspiration. Each team must prepare a five-course meal for the guests, including actress Mindy Sterling (\"Austin Powers: International Man of Mystery\") and actor David Koechner (\"The Office,\" \"Talladega Nights: The Ballad of Ricky Bobby\"). Find out who gets cut after Chef Ramsay calls this the worst charity dinner service ever."
      },
      {
        "id": "tvmaze:1373052",
        "title": "Trying to Pasta Test",
        "season": 17,
        "episode": 11,
        "released": "2018-01-05",
        "overview": "This week, the All-Stars get a late night call from Chef Gordon Ramsay with instructions on their next challenge. They're given $20 to purchase ingredients and create three restaurant-quality pasta dishes, to demonstrate their ability to maximize a profit off the ingredients purchased. Gordon invites special guest judges, Lachlan Mackinnon-Patterson (James Beard Award Winner) and Bruce Kalman (Chef/Owner of Union Restaurant). Find out whose head will be on the chopping block."
      },
      {
        "id": "tvmaze:1374327",
        "title": "Five is the New Black",
        "season": 17,
        "episode": 12,
        "released": "2018-01-12",
        "overview": "Chef Ramsay reveals to the remaining All-Stars that they will be competing for the coveted black jacket by facing a series of three difficult challenges: \"Taste It, Now Make It,\" in which contestants must use their senses to recreate a dish; \"Five Domes,\" in which contestants have 30 minutes to create a cohesive restaurant quality dish using mystery ingredients hidden under domes; and \"Free For All,\" in which the All-Stars must make a dish of their choice using ingredients picked out by Ramsay."
      },
      {
        "id": "tvmaze:1374328",
        "title": "Stars Heating Up Hell",
        "season": 17,
        "episode": 13,
        "released": "2018-01-19",
        "overview": "The remaining All-Stars must instruct athletes Candice Park (WNBA), Jordan Wieber (2012 Olympic Gold Medalist), Ricky Williams (Heisman Trophy Winner, Univ. Of Texas), Shawne Merriman (NFL football linebacker) and Reggie Miller (NBA Hall of Famer) to cook their signature dishes – using only verbal instructions. Later, for the first time ever, the all-star contestants will be cooking in one kitchen during dinner service, with special guests rapper and musician Wyclef Jean and actor Mathew Moy (\"2 Broke Girls\"). Find out who makes it to the final four."
      },
      {
        "id": "tvmaze:1374329",
        "title": "Families Come to Hell",
        "season": 17,
        "episode": 14,
        "released": "2018-01-26",
        "overview": "When the families come to visit, the four remaining All-Stars are feeling extra-motivated to succeed. For this week's challenge, the chefs must choose a gift, each of which contains a secret ingredient on which they must base their dish. They will then anonymously serve their dishes to each family, and whoever gets the most votes, wins a day in Malibu with Chef Ramsay and his/her family. Then, actresses Gabrielle Dennis (\"The Game\") and Anna Konkle (NEW GIRL) join dinner service, during which each contestant will have the opportunity to run the kitchen, but will be tested, as certain dishes will have the wrong ingredient. Find out who makes it to the final three."
      },
      {
        "id": "tvmaze:1376171",
        "title": "Final Three",
        "season": 17,
        "episode": 15,
        "released": "2018-02-02",
        "overview": "Chef Ramsay informs the remaining three All-Stars that all of them will compete in the finale. As a reward, Ramsay invites the contestants to a pampered retreat at Calamigos Ranch in Malibu. However, what the contestants think is a relaxing vacation is soon turned upside-down when Ramsay reveals this will be their last challenge before the finale. The three finalists must cook and perfect their menus and only two will advance. Then, the final two All-Stars pick from the season's past contestants to join them on their team for the final dinner service. With a head chef position at the first ever Hell's Kitchen flagship restaurant at Caesars Palace Las Vegas, and a salary of a quarter of a million dollars on the line it all comes down to this. Find out who is named the winner."
      },
      {
        "id": "tvmaze:1407163",
        "title": "All-Star Finale",
        "season": 17,
        "episode": 16,
        "released": "2018-02-02",
        "overview": "In the season finale, the final two All-Stars pick from the season's past contestants to join them on their team for the final dinner service. And a winner is chosen."
      },
      {
        "id": "tvmaze:1486757",
        "title": "Rookies vs. Veterans",
        "season": 18,
        "episode": 1,
        "released": "2018-09-28",
        "overview": "For the first time ever on HELL'S KITCHEN, Chef Gordon Ramsay invites eight previous contestants back to the kitchen to battle against eight ambitious rookies for a chance at a life-changing grand prize: an Executive Chef position at the world's first Gordon Ramsay Hell's Kitchen Restaurant at Caesars Palace Las Vegas. In the first challenge of the season, the rookie chefs will cook up the best versions of their signature dishes within 45 minutes, while the veterans will attempt to create the same dishes, foregoing the making of their own signatures in the process. The winning team will be rewarded with a first-class meal at restaurant Charcoal and will be joined by Chef Ramsay, while the losers must prep the kitchen for dinner service the next day."
      },
      {
        "id": "tvmaze:1529405",
        "title": "A Fond Farewell",
        "season": 18,
        "episode": 2,
        "released": "2018-10-05",
        "overview": "When Chef Ramsay announces that he is taking his risotto off of the Hell's Kitchen menu, the contestants are tasked with preparing their own risotto dish in the hopes of replacing the old one for the remainder of the season. Then, in preparation for the first dinner service of the competition, Chef Christina calls both teams down to the kitchen to demonstrate how to make the night's menu. While the veterans are prompt and attentive, the rookies drag their feet, making it clear that they still have a lot to learn. Find out which chefs survive another day."
      },
      {
        "id": "tvmaze:1533656",
        "title": "Hell's Riders",
        "season": 18,
        "episode": 3,
        "released": "2018-10-12",
        "overview": "The chefs are tasked with serving lunch to a room full of Marines and prepare dishes that represent the air (chicken parmesan), the land (NY Strip) and the sea (fish and chips). The first team to serve all of the Marines on their side of the dining room wins the challenge and is awarded a day at Paramount Ranch, where they will have the opportunity to star in their own western film. Later, the most dramatic dinner service ever ends with a shocking contestant walk-out."
      },
      {
        "id": "tvmaze:1536320",
        "title": "Hell Freezes Over",
        "season": 18,
        "episode": 4,
        "released": "2018-10-19",
        "overview": "The chefs are surprised with winter jackets and then must compete in a sled race for an advantage in the upcoming challenge, during which the two teams must prepare their best winter soups. The winning team is rewarded with a luxurious day and night in Palm Springs. After a troublesome dinner service, Chef Ramsay makes an extreme change in the teams."
      },
      {
        "id": "tvmaze:1536321",
        "title": "Fish Out of Water",
        "season": 18,
        "episode": 5,
        "released": "2018-11-02",
        "overview": "The contestants are greeted by Grammy nominated pianist and composer, Stephan Moccio and Chef Ramsay explains that like a great musician, great chefs must be versatile in a wide variety of cooking styles. During the challenge, each team is tasked with cooking halibut 7 different ways for Michelin star chef David LeFevre. During the dinner services, both teams struggle with communication and supporting one another which ultimately results in a contestant's elimination. Tune-in to find out which front-running contestant is cut, creating a major wake-up call for the rest of the chefs."
      },
      {
        "id": "tvmaze:1536322",
        "title": "Hot Potato",
        "season": 18,
        "episode": 6,
        "released": "2018-11-09",
        "overview": "Chef Ramsay introduces the chefs to a culinary legend known all over the world, Mr. Potato Head. For their challenge, the chefs must create a dish with the potato as the key component. Then, tensions rise and the pressure becomes unbearable for one of the chefs, leading to the most chaotic dinner service yet."
      },
      {
        "id": "tvmaze:1536323",
        "title": "Last Chef Standing",
        "season": 18,
        "episode": 7,
        "released": "2018-11-16",
        "overview": "After a lesson on the importance of teamwork in the kitchen, Chef Ramsay reveals that for today's challenge, the chefs will be cooking five commonly served \"staple\" dishes. In true HELL'S KITCHEN style, the challenge comes with a twist – minutes into the challenge, each team will have to pick one member to leave the kitchen, and continue kicking a team member out until only one is left, relying on teamwork to make sure the remaining chef can finish all the dishes. That night, the teams are surprised when Chef Ramsay changes up the dining service."
      },
      {
        "id": "tvmaze:1565513",
        "title": "One Hell of a Party",
        "season": 18,
        "episode": 8,
        "released": "2018-12-07",
        "overview": "The final 10 chefs are surprised when Chef Ramsay brings in his daughter, Tilly, to celebrate her Sweet 16. During the challenge, each chef is tasked with creating a worthy dish to be served at Tilly's party. The team that gets the most dishes on her menu wins the challenge. While the winners enjoy time at the Malibu mansion, a member of the losing team requires medical attention after the pressure becomes too much. Meanwhile, after a difficult dinner service, a fan-favorite veteran winds up on the chopping block."
      },
      {
        "id": "tvmaze:1569117",
        "title": "What Happens in Vegas",
        "season": 18,
        "episode": 9,
        "released": "2018-12-14",
        "overview": "Chef Ramsay challenges the nine remaining chefs to prepare authentic Chinese dishes and each chef must crack open fortune cookies to reveal their ingredients for the challenge. Ramsay invites renowned chef Shirley Chung to judge each dish and the winning team is rewarded with a VIP trip to Las Vegas! During dinner service, tensions rise as one team struggles to work together, resulting in a kitchen riddled with errors."
      },
      {
        "id": "tvmaze:1577670",
        "title": "Poor Trev",
        "season": 18,
        "episode": 10,
        "released": "2019-01-04",
        "overview": "Both teams are down to four chefs each, as the competition continues to heat up. The dining room gets an Italian transformation for one of the most anticipated challenges of the season – the blind taste test. Hell's Kitchen then closes its doors to the public for a special charity dinner service, during which the two teams cook to honor supporters of St. Jude Children's Research Hospital and the Waterkeeper Alliance, with a new five-course Italian menu. The night turns disastrous when Chef Ramsay must step in and finish cooking for one team before a dramatic elimination."
      },
      {
        "id": "tvmaze:1581090",
        "title": "Devilish Desserts",
        "season": 18,
        "episode": 11,
        "released": "2019-01-11",
        "overview": "The competition heats up with only seven chefs left in the competition. During the challenge, guest judge and renowned pastry chef and chocolatier Valerie Gordon cracks down hard on both teams' take on dessert. The dinner service starts without a hitch, but one team's lack of communication causes pure chaos in the kitchen, resulting in a dramatic elimination. Tune in to see both teams battle it out for Chef Ramsay's approval."
      },
      {
        "id": "tvmaze:1584474",
        "title": "Break on Through",
        "season": 18,
        "episode": 12,
        "released": "2019-01-18",
        "overview": "Tension mounts when Chef Ramsay explains to the six remaining chefs that they will go through three extensive challenges to determine which five chefs receive a black jacket."
      },
      {
        "id": "tvmaze:1586352",
        "title": "An Episode of Firsts",
        "season": 18,
        "episode": 13,
        "released": "2019-01-25",
        "overview": "All hell breaks loose as the final five chefs struggle through a new challenge, leading to a bitter elimination that dramatically alters the dynamic of the group. As the remaining chefs reach the final stages of the competition, pressure is at an all-time high. Tune in to find out which chef will be sent home."
      },
      {
        "id": "tvmaze:1589228",
        "title": "What's Your Motto?",
        "season": 18,
        "episode": 14,
        "released": "2019-02-01",
        "overview": "The final four chefs participate in a tableside challenge, preparing them for the showmanship that the Las Vegas Executive Chef position will require. After the guest judges vote, the winner of the challenge receives a luxurious day in Malibu and invites one of the other four chefs to join. Later on, the pressure returns when the chefs endure the showmanship challenge, which is plagued with rookie mistakes. Nobody can keep their heads above water and in the most shocking twist of the season, not one, but two chefs go home."
      },
      {
        "id": "tvmaze:1589561",
        "title": "A Rollercoaster Ride",
        "season": 18,
        "episode": 15,
        "released": "2019-02-08",
        "overview": "After a shocking elimination, the final two chefs receive unexpected help for their final menus. They share their highs and lows with Chef Ramsay over brunch and are surprised with a visit from their families. But, the fun is short-lived, as Chef Ramsay sends the teams back to Hell's Kitchen to learn the menus and plan for the biggest service of the finalists' lives, taking place at Six Flags Magic Mountain. Find out who has what it takes to win the life-changing grand prize: a position at the world's first Gordon Ramsay HELL'S KITCHEN Restaurant at Caesars Palace in Las Vegas and $250,000."
      },
      {
        "id": "tvmaze:1589562",
        "title": "The Grand Finale",
        "season": 18,
        "episode": 16,
        "released": "2019-02-08",
        "overview": "Chef Ramsay sends the teams back to Hell's Kitchen to learn menus and plan for the biggest service of the finalists' lives, taking place at Six Flags Magic Mountain. Find out who has what it takes to win the life-changing grand prize: a position at the world's first Gordon Ramsay HELL'S KITCHEN Restaurant at Caesars Palace in Las Vegas and $250,000."
      },
      {
        "id": "tvmaze:1956313",
        "title": "Welcome to Vegas",
        "season": 19,
        "episode": 1,
        "released": "2021-01-07",
        "overview": "A new series of Gordon Ramsay's culinary competition begins, but who will earn the big prize - the head chef position at Gordon Ramsay Hell's Kitchen Lake Tahoe?"
      },
      {
        "id": "tvmaze:1956314",
        "title": "Shrimply Spectacular",
        "season": 19,
        "episode": 2,
        "released": "2021-01-14",
        "overview": "The chefs take on a shrimp challenge, in which one hopeful makes a grave error, before a tough opening service for both teams."
      },
      {
        "id": "tvmaze:1956315",
        "title": "Hell Caesar!",
        "season": 19,
        "episode": 3,
        "released": "2021-01-21",
        "overview": "The day begins with a Caesar salad challenge. As service begins, Olympic gold medallist Apolo Ohno and NFL star Marshall Faulk take the VIP seats, but which team will shine?"
      },
      {
        "id": "tvmaze:1956316",
        "title": "Wedding Bells in Hell",
        "season": 19,
        "episode": 4,
        "released": "2021-01-28",
        "overview": "Trouble brews in the Red team, with Amber questioning their choice of head chef. The challenge sees the teams tackling a reception for newlyweds, before a difficult service."
      },
      {
        "id": "tvmaze:1956317",
        "title": "Hell Starts Taking Its Toll",
        "season": 19,
        "episode": 5,
        "released": "2021-02-04",
        "overview": "The teams are tasked with creating Mexican dishes, but only one can enjoy a treat, with the others having to clean out the animal pens. Later, a shock is in store at service."
      },
      {
        "id": "tvmaze:1956318",
        "title": "Metal & Marina",
        "season": 19,
        "episode": 6,
        "released": "2021-02-11",
        "overview": "The teams are challenged to put a twist on some classic Italian dishes, with a top reward for the winning group and a morale-sapping punishment for the losers."
      },
      {
        "id": "tvmaze:1956319",
        "title": "A Pair of Aces",
        "season": 19,
        "episode": 7,
        "released": "2021-02-18",
        "overview": "The teams compete in a challenge to see who can identify the proteins in three Surf &amp; Turf dishes the fastest. Later at dinner service, one team has the best dinner service in Hell's Kitchen history, while the other team falls flat."
      },
      {
        "id": "tvmaze:1956320",
        "title": "Crapping Out in Hell",
        "season": 19,
        "episode": 8,
        "released": "2021-02-25",
        "overview": "The chefs are met by a craps table. The winning team earns a special lunch, while a miserable fate awaits the losers. There's no dinner service, but someone must leave..."
      },
      {
        "id": "tvmaze:1956321",
        "title": "Blind Taste Test",
        "season": 19,
        "episode": 9,
        "released": "2021-03-04",
        "overview": "It's time for the iconic Blind Taste Test. The winners enjoy a helicopter ride, while punishment awaits the losers. Both teams struggle during service, but who will be sent home?"
      },
      {
        "id": "tvmaze:1956322",
        "title": "There's Something About Marc",
        "season": 19,
        "episode": 10,
        "released": "2021-03-11",
        "overview": "The eight remaining chefs cook various types of burgers, finding their additional ingredients in a massive deck of cards. During dinner service, one team is kicked out for poor service, leaving the other to finish the remaining orders."
      },
      {
        "id": "tvmaze:1956323",
        "title": "Sink or Swim",
        "season": 19,
        "episode": 11,
        "released": "2021-03-18",
        "overview": "The chefs compete in the inaugural Spell's Kitchen challenge, with a private pool party the reward. Dinner service caters for important charities, but who will be going home?"
      },
      {
        "id": "tvmaze:1956324",
        "title": "There's Magic in Hell?",
        "season": 19,
        "episode": 12,
        "released": "2021-03-25",
        "overview": "The Chefs compete in three difficult challenges to prove if they are worthy of a Black Jacket, which all comes down to Nikki and Amber fighting for the final one."
      },
      {
        "id": "tvmaze:1956325",
        "title": "It's Time!",
        "season": 19,
        "episode": 13,
        "released": "2021-04-01",
        "overview": "The remaining Chefs celebrate their success of making it to the final five. Cody and Mary Lou, who have a budding romance, decide to take their celebration to the hot tub."
      },
      {
        "id": "tvmaze:1956326",
        "title": "Snuggling with the Enemy",
        "season": 19,
        "episode": 14,
        "released": "2021-04-08",
        "overview": "The final four cook for club goers who have taken over Hell's Kitchen. Dinner service gives each of the chefs a chance to run the pass, but Gordon is out to sabotage them."
      },
      {
        "id": "tvmaze:1956327",
        "title": "What Happens in Vegas...",
        "season": 19,
        "episode": 15,
        "released": "2021-04-15",
        "overview": "The chefs are treated to a visit from their families and a tour of Las Vegas. However, their trip to the Jubilee Theatre at Caesar's Palce soon turns into their final challenge."
      },
      {
        "id": "tvmaze:1956329",
        "title": "Hitting the Jackpot",
        "season": 19,
        "episode": 16,
        "released": "2021-04-22",
        "overview": "The chefs brief their teams ahead of the most important service of their lives. Following service, the winner and new head chef of Hell's Kitchen Lake Tahoe is announced."
      },
      {
        "id": "tvmaze:2064861",
        "title": "Young Guns Come Out Shooting",
        "season": 20,
        "episode": 1,
        "released": "2021-05-31",
        "overview": "Hit culinary competition series HELL'S KITCHEN returns for its 20th season, with Chef Gordon Ramsay back in Las Vegas. For the first time ever, 18 aspiring chefs from across the country, and all aged 23 years old or younger at the start of the competition, will challenge Lady Luck in the hopes of winning big."
      },
      {
        "id": "tvmaze:2066675",
        "title": "Temping the Meat",
        "season": 20,
        "episode": 2,
        "released": "2021-06-07",
        "overview": "Both teams are put to the test as they take on their first dinner service, preparing dinner for boxing legend Mike Tyson and NASCAR driver Kurt Busch."
      },
      {
        "id": "tvmaze:2066676",
        "title": "Come Hell or High Water!",
        "season": 20,
        "episode": 3,
        "released": "2021-06-14",
        "overview": "The chefs are challenged to replicate the very first challenge in HELL'S KITCHEN history - breaking down squid perfectly for Chef Ramsay. Later, it's \"Chicken Gate\" when Gordon discovers the Blue Team has served up raw chicken during Dinner Service."
      },
      {
        "id": "tvmaze:2066677",
        "title": "Young Guns Going Big",
        "season": 20,
        "episode": 4,
        "released": "2021-06-21",
        "overview": "The chefs are challenged to make brunch for 60 hungry Caesars Palace employees, fresh off the night shift. Later, one chef takes the fall during the use of a punishment pass, earning the respect of both teams, and dinner service leads some chefs to crack under the pressure."
      },
      {
        "id": "tvmaze:2066678",
        "title": "Stirring the Pot",
        "season": 20,
        "episode": 5,
        "released": "2021-06-28",
        "overview": "After a big shakeup during the last elimination, both teams must work together to decipher recipes written in emojis. Later, one team has its best dinner service performance yet, while the other team struggles to find its groove."
      },
      {
        "id": "tvmaze:2104991",
        "title": "A Ramsay Birthday in Hell!",
        "season": 20,
        "episode": 6,
        "released": "2021-07-05",
        "overview": "The chefs take on a new type of challenge when the restaurant is closed for Chef Ramsay's daughter's 21st birthday party. The teams must endure double-Ramsay scrutiny during the challenge and dinner service, in which one team rises to the occasion, while the other serves up its biggest disappointment thus far."
      },
      {
        "id": "tvmaze:2118475",
        "title": "If You Can't Stand the Heat...",
        "season": 20,
        "episode": 7,
        "released": "2021-07-12",
        "overview": "The chefs go head-to-head in today's challenge, each cooking up a different international cuisine against a chef from the opposing team. Later during dinner service, Chef Ramsay kicks a chef out of the kitchen for the first time this season."
      },
      {
        "id": "tvmaze:2118476",
        "title": "A Devilish Challenge",
        "season": 20,
        "episode": 8,
        "released": "2021-07-19",
        "overview": "The remaining chefs compete in a tag-team relay race competition, in which they must cook entrees against the other team. Later, five chef-testants face the first \"Cook For Your Life\" challenge of the season."
      },
      {
        "id": "tvmaze:2118477",
        "title": "A Game Show From Hell",
        "season": 20,
        "episode": 9,
        "released": "2021-08-09",
        "overview": "The chefs' spelling and cooking skills are put to the test in a game of Spells Kitchen, during which one team struggles to work together on its dish. Later, during a special Charity Dinner Service, both teams make big mistakes, and one chef gets heated over who should be put on the chopping block."
      },
      {
        "id": "tvmaze:2118478",
        "title": "More Than a Sticky Situation",
        "season": 20,
        "episode": 10,
        "released": "2021-08-16",
        "overview": "The chefs take on the classic HELL'S KITCHEN Blind Taste Test challenge with messy consequences. Later, the strategic use of a punishment pass makes one team come unglued during dinner service, and both sides must pull it together."
      },
      {
        "id": "tvmaze:2118479",
        "title": "Swiping Right",
        "season": 20,
        "episode": 11,
        "released": "2021-08-23",
        "overview": "The chefs jump back into the dating game on hkchefsonly.com, hoping to swipe right on the perfect match of ingredients for their dish. Later, the stakes are high during a special Steak Night dinner service, and all hell breaks loose when one team struggles with overcooking their dish."
      },
      {
        "id": "tvmaze:2118480",
        "title": "All Hell Breaks Loose",
        "season": 20,
        "episode": 12,
        "released": "2021-08-30",
        "overview": "The competition is taken to a new level when the chefs have to prove they are worthy of a legendary Black Jacket. While some chefs quickly make the cut, others struggle to prove they have what it takes."
      },
      {
        "id": "tvmaze:2118481",
        "title": "Social Media in Hell",
        "season": 20,
        "episode": 13,
        "released": "2021-09-06",
        "overview": "It's all about the presentation when the chefs are challenged to create visually stunning dishes to impress Chef Ramsay's 7.5 million Instagram followers. Then, during the challenge, a clash of egos causes tensions to run high, and during a dinner service filled with sabotage, the chefs struggle to prove they have what it takes to be Chef Ramsay's next head chef."
      },
      {
        "id": "tvmaze:2118482",
        "title": "Hell Hath No Fury...",
        "season": 20,
        "episode": 14,
        "released": "2021-09-06",
        "overview": "A clash of egos causes tensions to run high; during a dinner service filled with sabotage, the chefs struggle to prove they have what it takes."
      },
      {
        "id": "tvmaze:2118483",
        "title": "What the Hell",
        "season": 20,
        "episode": 15,
        "released": "2021-09-13",
        "overview": "Chef Ramsay plans an emotional reunion for the three remaining chefs, before they are tasked with cooking a five-course dinner service scored by celebrity judges. Then, the final two chefs will pick their brigades from a pool of their former competitors and compete in their final dinner service, after which the last chef standing will win the grand prize title of Head Chef at Gordon Ramsay Steak at Paris Las Vegas."
      },
      {
        "id": "tvmaze:2118484",
        "title": "Two Young Guns Shoot It Out",
        "season": 20,
        "episode": 16,
        "released": "2021-09-13",
        "overview": "The final two chefs compete, after which the last chef standing wins the grand prize."
      },
      {
        "id": "tvmaze:2340873",
        "title": "Let the Battle Begin",
        "season": 21,
        "episode": 1,
        "released": "2022-09-29",
        "overview": "Each chef must cook a signature dish, to be rated on a scale of 1 to 5."
      },
      {
        "id": "tvmaze:2395222",
        "title": "Just Wingin' It",
        "season": 21,
        "episode": 2,
        "released": "2022-10-06",
        "overview": "Each contestant is challenged to make their best chicken wings; teams take on a dinner service."
      },
      {
        "id": "tvmaze:2399557",
        "title": "Clawing Your Way to the Top",
        "season": 21,
        "episode": 3,
        "released": "2022-10-13",
        "overview": "Teams must shell and cook a lobster after watching Gordon demonstrate it to perfection."
      },
      {
        "id": "tvmaze:2409617",
        "title": "Slipping Down to Hell",
        "season": 21,
        "episode": 4,
        "released": "2022-10-20",
        "overview": "The contestants go to a water park and are launched down a giant slide into a pool of ingredients."
      },
      {
        "id": "tvmaze:2411937",
        "title": "Breakfast 911",
        "season": 21,
        "episode": 5,
        "released": "2022-10-27",
        "overview": "The teams are tasked with serving breakfast to a group of first responders, firefighters and EMTs."
      },
      {
        "id": "tvmaze:2418666",
        "title": "Til Chef Do Us Part",
        "season": 21,
        "episode": 6,
        "released": "2022-11-10",
        "overview": "The contestants must create a menu for a couple's upcoming wedding; a dinner service."
      },
      {
        "id": "tvmaze:2421797",
        "title": "Wok This Way",
        "season": 21,
        "episode": 7,
        "released": "2022-11-17",
        "overview": "The chefs must make dishes with obscure ingredients using a wok; special guest Stephanie Izard."
      },
      {
        "id": "tvmaze:2424644",
        "title": "Game On!",
        "season": 21,
        "episode": 8,
        "released": "2022-12-01",
        "overview": "The chefs step up to compete one-on-one in an ingredient game show."
      },
      {
        "id": "tvmaze:2436431",
        "title": "Putting the Carne in Carnival",
        "season": 21,
        "episode": 9,
        "released": "2022-12-08",
        "overview": "One chef from each team goes head-to-head in different carnival games for an advantage."
      },
      {
        "id": "tvmaze:2446593",
        "title": "Everyone's Taco'ing About It",
        "season": 21,
        "episode": 10,
        "released": "2023-01-05",
        "overview": "The final nine chefs must create elevated tacos and impress actor-turned-restaurateur Danny Trejo."
      },
      {
        "id": "tvmaze:2458439",
        "title": "21st Annual Blind Taste Test",
        "season": 21,
        "episode": 11,
        "released": "2023-01-12",
        "overview": "Chefs face the ultimate test of their pallets in the 21st annual blind taste test challenge."
      },
      {
        "id": "tvmaze:2468735",
        "title": "What in Hell's Kitchen?",
        "season": 21,
        "episode": 12,
        "released": "2023-01-19",
        "overview": "The final seven chefs compete in several challenges to earn their coveted black jackets."
      },
      {
        "id": "tvmaze:2472262",
        "title": "The Fab Five Take Flight",
        "season": 21,
        "episode": 13,
        "released": "2023-01-26",
        "overview": "The chefs cook dishes with ingredients from different cities; chef Michael Cimarusti guest judges."
      },
      {
        "id": "tvmaze:2472263",
        "title": "Lights, Camera, Sabotage!",
        "season": 21,
        "episode": 14,
        "released": "2023-02-02",
        "overview": "The remaining four chefs are challenged to create a stunning seafood dish."
      },
      {
        "id": "tvmaze:2472264",
        "title": "A Finale for the Ages, Part 1",
        "season": 21,
        "episode": 15,
        "released": "2023-02-09",
        "overview": "Gordon Ramsay hosts a fiery cooking competition in which the winner receives a head chef position."
      },
      {
        "id": "tvmaze:2479221",
        "title": "A Finale for the Ages, Part 2",
        "season": 21,
        "episode": 16,
        "released": "2023-02-09",
        "overview": "Gordon Ramsay hosts a fiery cooking competition in which the winner receives a head chef position."
      },
      {
        "id": "tvmaze:2594226",
        "title": "The Dream Begins",
        "season": 22,
        "episode": 1,
        "released": "2023-09-28",
        "overview": "Contestants compete in the signature dish challenge after being divided into two teams."
      },
      {
        "id": "tvmaze:2630981",
        "title": "Tad Overwhelming",
        "season": 22,
        "episode": 2,
        "released": "2023-10-05",
        "overview": "A rocky first dinner service for both teams involves raw meat and bad communication."
      },
      {
        "id": "tvmaze:2630982",
        "title": "Citizens of Hell's Kitchen",
        "season": 22,
        "episode": 3,
        "released": "2023-10-12",
        "overview": "Preparing brunch for new American citizens; serving Victor Cruz, Bobby Berk, Alaska and Liam Pace."
      },
      {
        "id": "tvmaze:2630983",
        "title": "Gimme an H!",
        "season": 22,
        "episode": 4,
        "released": "2023-10-19",
        "overview": "The contestants must create elevated American comfort food dishes."
      },
      {
        "id": "tvmaze:2630984",
        "title": "Just Bring the DARN Fish!",
        "season": 22,
        "episode": 5,
        "released": "2023-10-26",
        "overview": "The chefs must identify mystery proteins as quickly as possible; a dinner service."
      },
      {
        "id": "tvmaze:2630985",
        "title": "Fusion Confusion",
        "season": 22,
        "episode": 6,
        "released": "2023-11-02",
        "overview": "The chefs face a soccer-themed fusion cuisine challenge; fusion chef Tony Messina guest judges."
      },
      {
        "id": "tvmaze:2630986",
        "title": "All Up in Your Grills",
        "season": 22,
        "episode": 7,
        "released": "2023-11-09",
        "overview": "An intense barbecue challenge judged by pit master Aaron Franklin; a star-studded dinner service."
      },
      {
        "id": "tvmaze:2630987",
        "title": "Cooking for Your Life",
        "season": 22,
        "episode": 8,
        "released": "2023-11-16",
        "overview": "Tensions rise as the chefs face their most difficult challenge yet -- communication."
      },
      {
        "id": "tvmaze:2630988",
        "title": "More Bang for Your Buck",
        "season": 22,
        "episode": 9,
        "released": "2023-11-30",
        "overview": "Chef Suzanne Goin rates the chefs' dishes; dinner service guests Elodie Yung and Liza Koshy."
      },
      {
        "id": "tvmaze:2670639",
        "title": "The Pastabilities Are Endless",
        "season": 22,
        "episode": 10,
        "released": "2023-12-07",
        "overview": "Olympic champion Jordan Chiles shows the chefs how to find balance in a gymnastics-themed challenge."
      },
      {
        "id": "tvmaze:2670641",
        "title": "A Hellish Food Fight",
        "season": 22,
        "episode": 11,
        "released": "2023-12-14",
        "overview": "The infamous blind food taste test returns with a new out-of-this-world challenge."
      },
      {
        "id": "tvmaze:2670642",
        "title": "A Hell's Kitchen Special Delivery",
        "season": 22,
        "episode": 12,
        "released": "2024-01-04",
        "overview": "The chefs face three challenges to win the coveted black jackets."
      },
      {
        "id": "tvmaze:2699561",
        "title": "#HellishHangover",
        "season": 22,
        "episode": 13,
        "released": "2024-01-11",
        "overview": "Celebrity guests Kate Flannery, Mary Lynn Rajskub, Gavin Rossdale and Bob the Drag Queen."
      },
      {
        "id": "tvmaze:2699562",
        "title": "Don't Be Fooled",
        "season": 22,
        "episode": 14,
        "released": "2024-01-18",
        "overview": "The chefs' attention to detail is tested."
      },
      {
        "id": "tvmaze:2699563",
        "title": "And Then There Were Two",
        "season": 22,
        "episode": 15,
        "released": "2024-01-25",
        "overview": "The final three contestants face their last challenge before the final dinner service."
      },
      {
        "id": "tvmaze:2718280",
        "title": "One Hell of an American Dream",
        "season": 22,
        "episode": 16,
        "released": "2024-01-25",
        "overview": "The final three contestants face their last challenge before the final dinner service."
      },
      {
        "id": "tvmaze:2944700",
        "title": "Hell Heads East",
        "season": 23,
        "episode": 1,
        "released": "2024-09-26",
        "overview": "Eighteen contestants set out to impress Chef Ramsay in the Signature Dish Challenge before embarking on their first dinner service."
      },
      {
        "id": "tvmaze:3008389",
        "title": "The Flame Game",
        "season": 23,
        "episode": 2,
        "released": "2024-10-03",
        "overview": "The punishment pass is introduced to the chefs; a fiery flambé challenge."
      },
      {
        "id": "tvmaze:3013831",
        "title": "Shucking Hell",
        "season": 23,
        "episode": 3,
        "released": "2024-10-10",
        "overview": "The chefs face a seafood showdown where only one team can reign supreme."
      },
      {
        "id": "tvmaze:3020201",
        "title": "In a Pickle",
        "season": 23,
        "episode": 4,
        "released": "2024-10-17",
        "overview": "Chef Dan Barber joins chef Ramsay to judge the chef's pickling challenge."
      },
      {
        "id": "tvmaze:3022754",
        "title": "Homesick in Hell",
        "season": 23,
        "episode": 5,
        "released": "2024-10-24",
        "overview": "The chefs are challenged with putting together some fabulous burgers using an assortment of wild ingredients thrown their way by chef Ramsay."
      },
      {
        "id": "tvmaze:3031073",
        "title": "Hell on Wheels",
        "season": 23,
        "episode": 6,
        "released": "2024-10-31",
        "overview": "Chefs face a pasta challenge judged by pasta experts Angie Rito and Scott Tacinelli."
      },
      {
        "id": "tvmaze:3035308",
        "title": "Harmony in Hell",
        "season": 23,
        "episode": 7,
        "released": "2024-11-07",
        "overview": "The Yale Whiffenpoofs singing group perform; the chefs must model their expertise and work in harmony for their next challenge...balancing an array of ingredients to create a dish that really sings."
      },
      {
        "id": "tvmaze:3040324",
        "title": "Get a Clue!",
        "season": 23,
        "episode": 8,
        "released": "2024-11-14",
        "overview": "Team members work together in a secret ingredient challenge."
      },
      {
        "id": "tvmaze:3045073",
        "title": "Lonely in the Kitchen",
        "season": 23,
        "episode": 9,
        "released": "2024-11-21",
        "overview": "The chefs must complete their dishes and also their fellow contestant's dishes using verbal cues."
      },
      {
        "id": "tvmaze:3055377",
        "title": "A Sticky Situation",
        "season": 23,
        "episode": 10,
        "released": "2024-12-05",
        "overview": "In a special dinner service, both teams must prove they have what it takes to stay."
      },
      {
        "id": "tvmaze:3067177",
        "title": "A Soap Opera in Hell",
        "season": 23,
        "episode": 11,
        "released": "2025-01-02",
        "overview": "The top eight chefs will begin the week with a challenge; they will randomly be assigned a cuisine."
      },
      {
        "id": "tvmaze:3090521",
        "title": "Black Jacket Time",
        "season": 23,
        "episode": 12,
        "released": "2025-01-09",
        "overview": "Ramsay announces this week determines which chefs will receive one of the coveted black jackets."
      },
      {
        "id": "tvmaze:3095933",
        "title": "Five Comedians Walk Into Hell...",
        "season": 23,
        "episode": 13,
        "released": "2025-01-16",
        "overview": "Each chef must teach a comedian how to prepare a signature chef Ramsay recipe; the final five must prove they have what it takes to proceed to the final four."
      },
      {
        "id": "tvmaze:3107676",
        "title": "Hell at the Pass",
        "season": 23,
        "episode": 14,
        "released": "2025-01-23",
        "overview": "The remaining four chefs are challenged to cook and present a tableside dish; a cutthroat dinner service determines who advances to the final three."
      },
      {
        "id": "tvmaze:3115607",
        "title": "One Hell of a Ride",
        "season": 23,
        "episode": 15,
        "released": "2025-01-30",
        "overview": "The top three are ready to prove they have what it takes in a final menu planning challenge! The chefs will be inspired with a glimpse into their possible future, going into their final challenge. The final three give their all, but only two will move on to the dramatic season finale."
      },
      {
        "id": "tvmaze:3123629",
        "title": "Hell's Finish Line",
        "season": 23,
        "episode": 16,
        "released": "2025-02-06",
        "overview": "With the help of some old friends, the finalists compete in a final dinner service with their very own custom menu tailored to their unique tastes and signature dishes; Chef Ramsay crowns one chef champion."
      },
      {
        "id": "tvmaze:3316649",
        "title": "Making a State-ment",
        "season": 24,
        "episode": 1,
        "released": "2025-09-25",
        "overview": "Semi-finalists are whittled down to a Top 20 that advance to the iconic kitchen where the chefs carry the torch for their state throughout the competition."
      },
      {
        "id": "tvmaze:3348552",
        "title": "Hell on a Halfshell",
        "season": 24,
        "episode": 2,
        "released": "2025-10-02",
        "overview": "The chefs are challenged with shucking and preparing the perfect scallop dish."
      },
      {
        "id": "tvmaze:3348558",
        "title": "The Heat is Coming to Hell's Kitchen",
        "season": 24,
        "episode": 3,
        "released": "2025-10-09",
        "overview": "The remaining chefs compete in a speed breakfast challenge; in the most dramatic dinner service yet, both the Red and Blue teams melt under pressure at the fish and meat stations."
      },
      {
        "id": "tvmaze:3377982",
        "title": "There's Something Fishy Going On",
        "season": 24,
        "episode": 4,
        "released": "2025-10-16",
        "overview": "The chefs visit Stonington, Connecticut, to compete in a very fishy relay race; during dinner service, both teams step up their game but will it be enough to keep them in the competition?"
      },
      {
        "id": "tvmaze:3389662",
        "title": "A State of Confusion",
        "season": 24,
        "episode": 5,
        "released": "2025-10-23",
        "overview": "The chefs are challenged to blend two distinct state delicacies into one cohesive dish; during dinner service, the teams must come together to serve a dining room packed with VIPs, including a bachelor party and UCONN basketball legends."
      },
      {
        "id": "tvmaze:3394735",
        "title": "Hell's Chicken",
        "season": 24,
        "episode": 6,
        "released": "2025-10-30",
        "overview": "The chefs face their toughest critic yet when they are challenged to elevate a classic Southern specialty."
      },
      {
        "id": "tvmaze:3400727",
        "title": "Guac a mole in Hell's Kitchen",
        "season": 24,
        "episode": 7,
        "released": "2025-11-06",
        "overview": "The chefs are challenged to prepare an elevated Mexican dish; celebrity chef Gabriela Camara guest judges; at dinner service, the teams struggle with pork chops and garnishes which could send chefs packing."
      },
      {
        "id": "tvmaze:3424213",
        "title": "Cook for Your Life",
        "season": 24,
        "episode": 8,
        "released": "2025-11-13",
        "overview": "For the team challenge, the chefs compete in a \"State to Plate\" challenge and must decode ingredients spelled in the style of license plates; they must integrate contrasting ingredients into one cohesive dish to impress chef Ramsey."
      },
      {
        "id": "tvmaze:3427383",
        "title": "Hell Hath No Fury Like Anaiya Scorned",
        "season": 24,
        "episode": 9,
        "released": "2025-11-20",
        "overview": "Teams put their culinary techniques to the test and compete to earn their dish a spot on the tasting menu of a VIP Johnson and Wales 50th anniversary dinner honoring the legendary culinary school; team drama and secrets are revealed to chef Ramsay."
      }
    ]
  }
}