{
  "meta": {
    "id": "tvmaze:15121",
    "type": "series",
    "name": "The Yorkshire Vet",
    "description": "The Yorkshire Vet is a documentary series about Yorkshire vet Julian Norton, his business partner Peter Wright and their team as they administer modern-day medical and surgical aid to creatures great and small. From bulldogs to bullocks, there are no creatures too large or too small for these vets.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/527/1318737.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/527/1318737.jpg",
    "videos": [
      {
        "id": "tvmaze:3464668",
        "title": "A Decade in the Moors and Dales",
        "season": 21,
        "episode": null,
        "released": "2025-12-10",
        "overview": "Celebrating 10 years of this much-loved series, the vets, along with the nurses and farming favourites such as Rob and Dave Nicholson and Jean and Steve Green, gather around TV screens to relive classic stories. They remember creatures like the famous five-legged lamb, as well as landmark moments such as Jean and Steve Green having to sell their dairy herd."
      },
      {
        "id": "tvmaze:687168",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2015-09-15",
        "overview": "Documentary series following life in James Herriot's former practice. The vets treat a cat with a swollen eye, a ewe in labour and a bull terrier with horrendous halitosis."
      },
      {
        "id": "tvmaze:687169",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2015-09-22",
        "overview": "Julian risks life and limb to inject a ferocious pig, and stud alpaca Lothario fails to live up to his namesake's reputation"
      },
      {
        "id": "tvmaze:687170",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2015-09-29",
        "overview": "Julian is called out to help a cow that is struggling to deliver a huge calf. Sarah sees Polly the poorly chicken who is off her food and suffering in pain."
      },
      {
        "id": "tvmaze:687171",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2015-10-06",
        "overview": "Julian relieves heavily-pregnant Bluebell in time for the birth of her calf, and Peter treats a hand-reared lamb that is causing chaos in his adopted family."
      },
      {
        "id": "tvmaze:687172",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2015-10-13",
        "overview": "Julian treats a bad-tempered goat, a horse has cut open its hoof, a pooch struggles to deliver her pups, and Julian and Peter visit the Great Yorkshire Show."
      },
      {
        "id": "tvmaze:687173",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2015-10-20",
        "overview": "Julian performs emergency surgery on the pet cat of staff member Molly, which appears to have been shot in the head. An exotic bird of prey, a sheepdog run over by a tractor, and an injured tortoise also feature."
      },
      {
        "id": "tvmaze:687174",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2016-04-12",
        "overview": "A dog's life hangs in the balance as it undergoes an emergency operation for a tumour in its abdomen. Julian Norton has to treat a sheep with a prolapse in the car park, while his partner Peter Wright finds a baby emu with an injured eye in a basket."
      },
      {
        "id": "tvmaze:703540",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2016-04-19",
        "overview": "Julian and Sarah are called out to rescue an injured swan, new vet Haddie has to decide whether to perform a caesarean, Luggy the pampered cat's owner has a strange request for the vets, Bobby the police sniffer dog needs an operation and farmer John Swales is hoping for good news from his new stock bull."
      },
      {
        "id": "tvmaze:727210",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2016-04-26",
        "overview": "This time the vets tend a wildly eclectic assortment of patients including hairy Hungarian pigs, a precious pug dog, South American alpacas, a bearded dragon, an extremely fat cat, a heavily pregnant sheep and a chameleon."
      },
      {
        "id": "tvmaze:740103",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2016-05-03",
        "overview": "Julian takes some bullocks by the horns, a dog needs an emergency operation to remove a bone in its oesophagus, Peter braces himself to treat a feisty ferret, a ram cannot walk after too much mating and the Greens are concerned about their rescue donkey."
      },
      {
        "id": "tvmaze:769376",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2016-05-10",
        "overview": "Julian answers an emergency call-out to a herd of Alpacas, Peter tries to save the eyesight of a two-day-old lamb, Helen performs an emergency caesarean on a beagle, and seven-year-old Ben brings in his bunnies Hip and Hop to see Peter for a manicure."
      },
      {
        "id": "tvmaze:777134",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2016-05-17",
        "overview": "Julian visits Jacki Barlow's alpaca farm to investigate a strange lump in the mouth of one of her animals, and Peter is challenged by a yorkshire terrier and Crufts hopeful who has the diva personality to go with his celebrity status."
      },
      {
        "id": "tvmaze:797022",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2016-05-24",
        "overview": "Julian and Peter cope with two nighttime emergencies, new vet Esme performs her first emergency caesarian, Treacle the calf has fallen ill at the Green's farm, Squeaky the cockerel has lost his voice and a pack of bloodhound pups cause chaos in the Skeldale surgery.(Episode 7, Followed by 5 News Update, Subtitles, Series 2)"
      },
      {
        "id": "tvmaze:803650",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2016-05-31",
        "overview": "Julian gets a 5am emergency call about a horse with colic. One of the Skeldale nurses helps out at a local farm during lambing season. Plus, Truffles the guinea pig has a huge lump on her face, Harvey the randy rabbit is out of control, as is Billy the dog's backside..."
      },
      {
        "id": "tvmaze:818123",
        "title": "Episode 9",
        "season": 2,
        "episode": 9,
        "released": "2016-06-07",
        "overview": "Julian is called out to a cow struggling to give birth to her first calf, Peter treats a horse with toothache and a duck with an unusual and embarrassing injury, and the female staff are going giddy over a group of baby goats."
      },
      {
        "id": "tvmaze:825623",
        "title": "Episode 10",
        "season": 2,
        "episode": 10,
        "released": "2016-06-14",
        "overview": "After tending a poodle with a problem penis, an injured female duck named Kevin, a rabbit with a tooth abcess, an over-amorous donkey and a cow with a massive wound to her neck, the Skeldale staff say goodbye to vet Sarah, who is leaving to have a baby."
      },
      {
        "id": "tvmaze:939162",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2016-10-04",
        "overview": "Julian helps deliver an Alpaca cria who is in a breech position, Larry the chinchilla is brought in to be castrated and a parrot with a Yorkshire accent needs a trim."
      },
      {
        "id": "tvmaze:952800",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2016-10-11",
        "overview": "Alfie has suffered an unusual baking incident - the greedy but blind labrador has swallowed a spatula! Elsewhere Julian attends a cow birth and an overweight rat, while Peter helps a champion race horse get his teeth fixed."
      },
      {
        "id": "tvmaze:958432",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2016-10-18",
        "overview": "Julian is called out to a young heifer in agony with a strange object embedded in her foot, Peter removes a huge lump from Holly the golden retriever's head, and Squeaky the swan has been having treatment for an injured wing."
      },
      {
        "id": "tvmaze:965619",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2016-10-25",
        "overview": "Some aggressive alpacas need castrating. Other patients include an oversexed Yorkshire terrier, a young lamb, racing pigeons and a stray cat with a broken leg."
      },
      {
        "id": "tvmaze:975020",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2016-11-01",
        "overview": "The Skeldale vets deal with an unproductive ram, a severely injured spaniel, fighting terrapins and a herd of cows that object to a time-honoured tradition."
      },
      {
        "id": "tvmaze:978679",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2016-11-08",
        "overview": "Julian tries to save a much-loved farm dog, an albino wallaby and a cheeky pygmy goat give Peter the runaround. Other patients include Monster, the spiky hedgehog, and an alpaca who needs help to become a mum."
      },
      {
        "id": "tvmaze:983934",
        "title": "Episode 7",
        "season": 3,
        "episode": 7,
        "released": "2016-11-15",
        "overview": "The vets treat a horse with infected hooves, a cat struggling to give birth and an angry monitor lizard. They also take time out to visit the Great Yorkshire Show."
      },
      {
        "id": "tvmaze:988878",
        "title": "Episode 8",
        "season": 3,
        "episode": 8,
        "released": "2016-11-22",
        "overview": "Julian is called out to a suspected case of foot-and-mouth. Other patients include a Great Dane with cancer, a ram that needs castrating, a rat with a suspicious lump and a rare breed of pig that needs inseminating."
      },
      {
        "id": "tvmaze:991633",
        "title": "Episode 9",
        "season": 3,
        "episode": 9,
        "released": "2016-11-29",
        "overview": "Julian treats a calf with a large and worrying lump, two pygmy goats face castration at the surgery, and after chasing after a badly behaved sheep, Peter flies like a bird."
      },
      {
        "id": "tvmaze:992866",
        "title": "Episode 10",
        "season": 3,
        "episode": 10,
        "released": "2016-12-06",
        "overview": "Julian is woken by an emergency call in the middle of the night, Moobaloo the heifer has been struggling in labour but there is no sign of the calf. And tiny Teeny, a seven-day-old Shetland foal, is rushed in to see vet Helen."
      },
      {
        "id": "tvmaze:998253",
        "title": "Winter Special",
        "season": 3,
        "episode": 11,
        "released": "2016-12-13",
        "overview": "With Yorkshire in the grip of another bitter winter, the vets battle against the elements to visit their clients in remote farm locations. The pace of life slows in rural communities around Thirsk, but there is no rest for the team as they contend with cold, dark nights, rain and snow to treat creatures great and small, from owls to cattle."
      },
      {
        "id": "tvmaze:1001961",
        "title": "The Yorkshire Vet at Christmas",
        "season": 3,
        "episode": 12,
        "released": "2016-12-24",
        "overview": "It's Christmas in Thirsk, but the vets cannot join in the celebrations until they have tended to their flock. A cow has collapsed on Chris's farm leading Peter to fear the worst, Barney the spaniel may have to have a leg amputated and a piglet named Tiny Tim needs some urgent care. When things settle down, Peter and Julian have the honour of switching on Thirsk's Christmas lights."
      },
      {
        "id": "tvmaze:1055625",
        "title": "The Yorkshire Vet Home Visits",
        "season": 3,
        "episode": 13,
        "released": "2017-02-07",
        "overview": "One off special in which Peter and Julian catch up with old friends including Dougie - the parrot with a strong Yorkshire accent and a passion for Yorkshire puddings."
      },
      {
        "id": "tvmaze:1099385",
        "title": "On Call",
        "season": 3,
        "episode": 14,
        "released": "2017-03-21",
        "overview": "Skeldale vets Peter and Julian catch up with old friends and tend to some new cases. Peter returns to the Greensit brothers' farm to tend to their 15-year-old brood mare Caysue who needs urgent attention, Julian revisits an alpaca who was born breech, and Julian calls on Squeaky the swan to see if she's been lucky in love."
      },
      {
        "id": "tvmaze:1130710",
        "title": "Episode 1",
        "season": 4,
        "episode": 1,
        "released": "2017-04-18",
        "overview": "A badly injured llama has smashed his jaw and lost several teeth. The Greens have taken in a stray cat who needs a health check. New mother Butterfly's calving caused a potentially deadly prolapse. Ella is in agonising labour to birth her puppies."
      },
      {
        "id": "tvmaze:1133714",
        "title": "Episode 2",
        "season": 4,
        "episode": 2,
        "released": "2017-04-25",
        "overview": "Julian is called out to a desperately ill calf. Peter treats an elderly cat with severe constipation. Other patients include a young, wild stag trapped by its antlers, a dog with a dislocated leg, a postnatal cow and five noisy, young goats whose horn buds need removing."
      },
      {
        "id": "tvmaze:1157205",
        "title": "Episode 3",
        "season": 4,
        "episode": 3,
        "released": "2017-05-02",
        "overview": "Patients include a semi-feral cat named Pretty Tom, a ewe in labour, a lame doberman named Obi Wan, a sexually frisky young donkey and a hyperactive hamster."
      },
      {
        "id": "tvmaze:1157206",
        "title": "Episode 4",
        "season": 4,
        "episode": 4,
        "released": "2017-05-09",
        "overview": "Julian Norton has a large lump to remove from between a Highland cow's horns, then must find out why an event horse has broken out in lumps from head to hoof. Meanwhile, Peter helps a first-time mum deliver her lambs and treats a micro-pig who has outgrown his house and is under the weather."
      },
      {
        "id": "tvmaze:1165151",
        "title": "Episode 5",
        "season": 4,
        "episode": 5,
        "released": "2017-05-16",
        "overview": "Julian is called out to a poorly three-day-old calf who has collapsed, before turning his attention to Elsie - a piggy who needs a pedicure. And unlucky terrier Holly is brought into the surgery after falling off a bed and fracturing her leg in two places."
      },
      {
        "id": "tvmaze:1179352",
        "title": "Episode 6",
        "season": 4,
        "episode": 6,
        "released": "2017-05-23",
        "overview": "Julian races against time to save two alpacas, Peter treats two sheep with eye problems, two pet calves with suspected pneumonia and a cow in labour"
      },
      {
        "id": "tvmaze:1179353",
        "title": "Episode 7",
        "season": 4,
        "episode": 7,
        "released": "2017-05-30",
        "overview": "Julian gets dragged around a barn by one-ton bull Merchant, and operates on police dog Thor. Peter helps a baby goat open its eyes and fixes a cat with loose teeth."
      },
      {
        "id": "tvmaze:1202483",
        "title": "Episode 8",
        "season": 4,
        "episode": 8,
        "released": "2017-06-06",
        "overview": "Peter tries to save the life of a cow whose uterus prolapsed while calving. Julian must remove the sharp and dangerous tusks from an unco-operative 300kg boar."
      },
      {
        "id": "tvmaze:1211559",
        "title": "Episode 9",
        "season": 4,
        "episode": 9,
        "released": "2017-06-13",
        "overview": "It's the last in the series as we bid goodbye to Skeldale, Julian and the rest of the team."
      },
      {
        "id": "tvmaze:1308949",
        "title": "The Great Yorkshire Show",
        "season": 5,
        "episode": 1,
        "released": "2017-09-26",
        "overview": "Peter Wright and partner Julian Norton help several local participants get their livestock into peak condition, as the town and clients prepare for the Great Yorkshire Show."
      },
      {
        "id": "tvmaze:1322996",
        "title": "A 5 Legged Lamb & Other Curious Creatures",
        "season": 5,
        "episode": 2,
        "released": "2017-10-03",
        "overview": "Percy the peacock pays a visit to a council estate. Julian gets up close and personal with a burly young bullock with a damaged eye."
      },
      {
        "id": "tvmaze:1329001",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2017-10-10",
        "overview": "Peter rushes to save a ewe experiencing a difficult labour to find there is another expectant mother who needs help. Benji the terrier has something in his stomach that needs removing, and Helen battles to save a newborn calf with a life-threatening hernia."
      },
      {
        "id": "tvmaze:1330127",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2017-10-17",
        "overview": "Julian dashes to an emergency as a heifer struggles to give birth, and also goes on a wild swan chase. Katy rushes to an emergency lambing, and Peter suspects a border terrier has eaten something he shouldn't have."
      },
      {
        "id": "tvmaze:1331911",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2017-10-24",
        "overview": "Collette and her son Cailean are fanatical ferret fanciers but their prize-winning ferret Teddy has a problematic lump. Julian rushes to an emergency with an unborn calf. Peter treats Tara the rabbit and a pregnant Boston Terrier called Dolly."
      },
      {
        "id": "tvmaze:1338770",
        "title": "Episode 6",
        "season": 5,
        "episode": 6,
        "released": "2017-10-31",
        "overview": "Peter attends to a feisty Highland cow. Julian makes a mess while trying to save a poisoned pygmy goat. Helen joins forces with Julian to help a young alpaca and her newborn through a tough pregnancy."
      },
      {
        "id": "tvmaze:1350972",
        "title": "Episode 7",
        "season": 5,
        "episode": 7,
        "released": "2017-11-07",
        "overview": "Having recently been re-united with their dog after it was stolen a family are desperate to now cure her of ill health."
      },
      {
        "id": "tvmaze:1442610",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2018-04-17",
        "overview": "Griff the terrier has swallowed a tennis ball - is it safe to leave it there? Wendy the wallaby is under the weather, but Peter has trouble catching the crafty critter. Lawrence the bull's fertility is in question."
      },
      {
        "id": "tvmaze:1458006",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2018-04-24",
        "overview": ""
      },
      {
        "id": "tvmaze:1461727",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2018-05-01",
        "overview": "Peter battles to save a young cow in labour, whose calf does not want to come out. Much-loved hamster Christopher Nibbles has an ugly skin condition. Rescue sausage dog Bella needs surgery for a fast-growing lump. Dobby the llama needs castrating. Older farmers the Greens need Peter's help with their young calves."
      },
      {
        "id": "tvmaze:1461728",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2018-05-08",
        "overview": "Julian is called out to lovely llama Gus, while his beloved jack russell Emmie has an injury. Peter is asked to help relocate a young male deer and he also drops in on elderly farmers the Greens to care for their beloved lurcher Ruben."
      },
      {
        "id": "tvmaze:1467731",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2018-05-15",
        "overview": "Peter gets up close and personal with a couple of boisterous calves. Daisy the bloodhound has a fast-growing lump. Essex moggie Socks has just moved oop North and is clashing with the locals. Miss Timothy the tortoise is a force to be reckoned with."
      },
      {
        "id": "tvmaze:1467732",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2018-05-22",
        "overview": "Peter rushes out to save a newborn calf, while Julian pays a visit to Tazmin, a huge eagle at Thirsk Bird of Prey Centre. Meanwhile, Zoe's language skills are put to the test when a dog comes in with paperwork from overseas."
      },
      {
        "id": "tvmaze:1474460",
        "title": "Episode 7",
        "season": 6,
        "episode": 7,
        "released": "2018-05-29",
        "overview": "Julian is called out to help a mother who is having trouble calving, Old Bob, a dearly beloved hamster, comes in for surgery, and four polecats pay the practice a visit seemingly intent on getting their teeth into something."
      },
      {
        "id": "tvmaze:1474461",
        "title": "Episode 8",
        "season": 6,
        "episode": 8,
        "released": "2018-06-05",
        "overview": "Julian is called to help Rupert the trekking llama, who is in agony. Peter is on one of his favourite jobs - pregnancy checks for Arthur's prized cow herd. But Peter is then worried when he spots a lump of his own beloved boxer Alf."
      },
      {
        "id": "tvmaze:1518868",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2018-08-28",
        "overview": "Peter helps a pregnant ewe deliver twin lambs. Griff the terrier has swallowed a tennis ball. At Monk Park Visitor Centre, Wendy the wallaby is sick but evading capture. Julian performs a fertility test on Lawrence the bull."
      },
      {
        "id": "tvmaze:1526013",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2018-09-04",
        "overview": "Julian Norton meets Mia the meerkat, who suffered brutal injuries being rejected from her gang. Peter Wright handles a scary-looking doberman with some dental work, and a newborn lamb in life-threatening danger. Matt meets miserable-looking moggie Jess, who went missing for days and came back injured."
      },
      {
        "id": "tvmaze:1529355",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2018-09-11",
        "overview": "Julian Norton dashes to the scene of a freak accident, then helps elderly but loveable pussycat Gizmo. Peter Wright meets a badly injured tawny owl who has been brought in by a worried member of the public, then helps elderly and cherished horse Hazel."
      },
      {
        "id": "tvmaze:1532880",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2018-09-18",
        "overview": "Julian Norton must castrate Big Dillon, the largest ferret he has ever seen. Peter Wright treats Mary the badly injured black swan, and must save a sheep who has prolapsed after giving birth."
      },
      {
        "id": "tvmaze:1532881",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2018-09-25",
        "overview": "Julian Norton meets Toby the tortoise, who has lost his appetite after coming out of hibernation. Peter Wright must choose whether to save a young ewe or her lamb, and deal with a castrated horse who refuses to wake up."
      },
      {
        "id": "tvmaze:1539190",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2018-10-02",
        "overview": "Julian Norton needs to perform an emergency caesarean for a struggling cow. Peter must rescue Calamity Bunny from under her owner's bed. Can Helen x-ray a poorly carp called Jaws?"
      },
      {
        "id": "tvmaze:1539191",
        "title": "Episode 7",
        "season": 7,
        "episode": 7,
        "released": "2018-10-09",
        "overview": "Julian Norton tries to help labrador Murphy, who has a tumour that another vet declined to remove. Peter rushes to an emergency - treasured racing horse Magnum has been involved in an horrendous accident and has sustained a horrific injury."
      },
      {
        "id": "tvmaze:1550419",
        "title": "Episode 8",
        "season": 7,
        "episode": 8,
        "released": "2018-10-16",
        "overview": "Julian rushes to the aid of a mum-to-be whose baby is breech. Peter tries to remove two suspicious lumps from pet pooch Scruff. Plus, Smartie the pony has a potentially life-threatening blockage, and a baby alpaca needs help to walk again."
      },
      {
        "id": "tvmaze:1550420",
        "title": "Episode 9",
        "season": 7,
        "episode": 9,
        "released": "2018-10-23",
        "overview": "Pampered papillon Belle is out of sorts, and the only way Julian Norton can determine the problem is to open her up. Snakee the corn snake has an unusual lump and a hostile look in his eye, leading Peter Wright to err on the side of caution. Candela pays Shetland pony Sparkle a visit, as her teeth need looking at."
      },
      {
        "id": "tvmaze:1550422",
        "title": "Episode 10",
        "season": 7,
        "episode": 10,
        "released": "2018-10-30",
        "overview": "Peter is called out to help a ewe whose labour is worsening. Julian has 50 little goats to disbud, but Doris the kid is playing hide and seek. Border terrier cross Poppy has bone cancer in one of her hind legs, and the only hope of saving her is to remove the limb."
      },
      {
        "id": "tvmaze:1564667",
        "title": "Episode 11",
        "season": 7,
        "episode": 11,
        "released": "2018-11-06",
        "overview": "In a varied caseload, the vets treat a rapidly deteriorating cow, a cocker spaniel in labour, a hen with diarrhoea and a jammed food pipe, a lamb with an injured leg, a ferret with a suspicious lump, a calf foaming at the mouth and a swarm of bees."
      },
      {
        "id": "tvmaze:1564668",
        "title": "Episode 12",
        "season": 7,
        "episode": 12,
        "released": "2018-11-13",
        "overview": "Peter is mystified by the contents of Khufu the cat's stomach, and must administer anti-mite spray to one of the biggest eagles in the world. Julian helps Millie the Shetland pony with her placenta, and tries his hand at dentistry for Audrey the alpaca."
      },
      {
        "id": "tvmaze:1569168",
        "title": "Episode 13",
        "season": 7,
        "episode": 13,
        "released": "2018-11-20",
        "overview": ""
      },
      {
        "id": "tvmaze:1616198",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2019-02-26",
        "overview": "Julian Norton operates on a dog's liver tumour and faces the Revenge of the Mangalitsas. Peter Wright helps a ewe birth triplets and castrates a bull named Eddie the Eagle."
      },
      {
        "id": "tvmaze:1616711",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2019-03-12",
        "overview": "Peter has to cobble together a shoe for a lame cow, a cat that has come off second best in a fight has a badly-injured eye, and a springer spaniel undergoes pioneering surgery when fish skin is grafted on to its infected leg."
      },
      {
        "id": "tvmaze:1626779",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2019-03-19",
        "overview": ""
      },
      {
        "id": "tvmaze:1629817",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2019-03-26",
        "overview": ""
      },
      {
        "id": "tvmaze:1635101",
        "title": "Episode 5",
        "season": 8,
        "episode": 5,
        "released": "2019-04-02",
        "overview": "Patients include an alpaca with a large lump on her foot, a labrador with a taste for gardening gloves, a hermaphrodite dog and a bull that has blown up like a barrage balloon!"
      },
      {
        "id": "tvmaze:1641880",
        "title": "Episode 6",
        "season": 8,
        "episode": 6,
        "released": "2019-04-16",
        "overview": "Lisa's horse Teal has an unexplained gash on his neck. Tux the black Labrador has a nasty-looking mouth tumour. Smokey the cat, who normally eats anything and everything, has suddenly stopped eating at all. Julian must test 50 cows for pregnancy."
      },
      {
        "id": "tvmaze:1645578",
        "title": "Episode 7",
        "season": 8,
        "episode": 7,
        "released": "2019-04-23",
        "overview": "Peter rushes to help a ewe struggling with childbirth and a billy goat who needs the snip. Julian helps a pug with a broken leg and gives Lucy the llama a nail trim."
      },
      {
        "id": "tvmaze:1647648",
        "title": "Episode 8",
        "season": 8,
        "episode": 8,
        "released": "2019-04-30",
        "overview": "Peter is called out to help a 10-day-old calf who has been rejected by her mum. Semi-retired sheepdog Mick has a tumour wrapped around his spleen, prompting Julian to engage in some risky surgery."
      },
      {
        "id": "tvmaze:1647649",
        "title": "Episode 9",
        "season": 8,
        "episode": 9,
        "released": "2019-05-07",
        "overview": "Julian is called to relieve a bull who has a huge abscess on his bum that needs lancing, Peter treats a horse with a mysterious cut that won't heal, and Vega the rat goes under the knife to remove a tumour."
      },
      {
        "id": "tvmaze:1655987",
        "title": "Episode 10",
        "season": 8,
        "episode": 10,
        "released": "2019-05-14",
        "overview": "Both Julian and Peter face long nights as they help two struggling animals give birth. Dudley the hedgehog is brought in with pneumonia. And, Julian attends to school guinea pig Betty."
      },
      {
        "id": "tvmaze:1705943",
        "title": "Episode 1",
        "season": 9,
        "episode": 1,
        "released": "2019-08-27",
        "overview": "Julian must treat a pregnant heifer with a pelvis that may be too small to give birth, while a cat that lost a leg after being run over by a car suffers another injury in a road accident, but this time, no treatment may be possible. A pygmy goat keeps getting its head stuck in a wire fence, a dog needs an operation on its lungs, and farmers the Greens celebrate their anniversary with a trip to Whitby."
      },
      {
        "id": "tvmaze:1705944",
        "title": "Episode 2",
        "season": 9,
        "episode": 2,
        "released": "2019-09-03",
        "overview": "Peter treats a ewe that is struggling to give birth to twin lambs, and also performs a complicated and risky surgery on a tawny owl to remove the bird's ruptured eyeball. Julian examines a herd of cows from a breed that is on the endangered species list, a young alpaca has been unable to stand or walk since birth, and a dog lover is left distraught when one of his four-legged friends brutally attacks another."
      },
      {
        "id": "tvmaze:1705945",
        "title": "Episode 3",
        "season": 9,
        "episode": 3,
        "released": "2019-09-10",
        "overview": "Peter treats a lamb that was born with a life-threatening cyst full of spinal fluid on its head, which will require delicate and painstaking surgery to safely remove. Julian is called out in the middle of the night to save a cow that has experienced dangerous complications while giving birth, a pig is resistant to being castrated, and a dog swallows a bottle of e-cigarette liquid."
      },
      {
        "id": "tvmaze:1718056",
        "title": "Episode 4",
        "season": 9,
        "episode": 4,
        "released": "2019-09-17",
        "overview": ""
      },
      {
        "id": "tvmaze:1721575",
        "title": "Episode 5",
        "season": 9,
        "episode": 5,
        "released": "2019-09-24",
        "overview": ""
      },
      {
        "id": "tvmaze:1724910",
        "title": "Episode 6",
        "season": 9,
        "episode": 6,
        "released": "2019-10-01",
        "overview": "Julian Norton treats a cow with a rare and complex problem. The cow's stomach has become displaced and moved to the wrong side of her body, causing pain and stopping her eating. Meanwhile in Thirsk, a baby roe deer is brought into the practice as it has stopped taking milk, and a dog has a large tumour removed in a tricky operation."
      },
      {
        "id": "tvmaze:1818174",
        "title": "Episode 1",
        "season": 10,
        "episode": 1,
        "released": "2020-03-17",
        "overview": "Peter gets an emergency call from sheep farmer Clive, whose ewe has gone into labour, but the lambs are tangled up inside their mother. One arrives safely but the second isn't breathing, and Peter's skills are put to the test when he realises there is a third lamb still to come. In Boroughbridge, Julian and Anne operate on a dog with a tumour in its chest."
      },
      {
        "id": "tvmaze:1818175",
        "title": "Episode 2",
        "season": 10,
        "episode": 2,
        "released": "2020-03-24",
        "overview": "Julian treats a lhasa apso with a mouth tumour which other vets have given up on, and comes up with an alternative course of action to save the dog's life. He also locks horns with an aggressive ram that has a sore eye. Over in Thirsk, Peter treats a Shetland pony with a painful foot condition and a cow with a prolapsed uterus."
      },
      {
        "id": "tvmaze:1826792",
        "title": "Episode 3",
        "season": 10,
        "episode": 3,
        "released": "2020-03-31",
        "overview": "Peter faces a struggle to save a baby alpaca that was born prematurely during a storm, and Julian performs a delicate eye operation on a labrador preparing for a dog show. A wallaby dies at a local visitor farm, raising concerns that its joey will not survive without its mother's milk and pouch. A newborn lamb suffers a potentially fatal injury, and a rabbit named Boris needs to be castrated if it is to stay in its new home."
      },
      {
        "id": "tvmaze:1833543",
        "title": "Episode 4",
        "season": 10,
        "episode": 4,
        "released": "2020-04-07",
        "overview": "A rare cattle breeder fears for the life of his favourite cow, which has been diagnosed with cancer and will need major surgery to have any chance of survival. A rottweiler puppy becomes seriously ill after eating 15 stones, a ram undergoes fertility tests, and a donkey has a problem with one of its legs. Plus, receptionist Sylvia leaves the Skeldale practice, so the staff prepares a special surprise for her."
      },
      {
        "id": "tvmaze:1854821",
        "title": "Episode 5",
        "season": 10,
        "episode": 5,
        "released": "2020-04-21",
        "overview": ""
      },
      {
        "id": "tvmaze:1858245",
        "title": "Episode 6",
        "season": 10,
        "episode": 6,
        "released": "2020-04-28",
        "overview": ""
      },
      {
        "id": "tvmaze:1858246",
        "title": "Episode 7",
        "season": 10,
        "episode": 7,
        "released": "2020-05-05",
        "overview": ""
      },
      {
        "id": "tvmaze:1858247",
        "title": "Episode 8",
        "season": 10,
        "episode": 8,
        "released": "2020-05-12",
        "overview": "Peter heads to a neighbour's farm hoping he can save the life of a seriously ill sheep, whose infected foot has become infested with maggots. Cocker Spaniel Paddy has an unusual hernia which is stopping it going to the toilet, and if Julian can't fix the problem it could lead to serious complications. With Katy on hand to help, there's a dirty job to do before they can begin the complex operation."
      },
      {
        "id": "tvmaze:1862273",
        "title": "Episode 9",
        "season": 10,
        "episode": 9,
        "released": "2020-05-19",
        "overview": "Peter operates on Wesley, a greedy terrier that has taken its food obsession too far and eaten an oven glove. Julian makes the difficult decision to remove the eye of Patch the rabbit, but an unexpected lump raises further concerns. Julian is then called out to help a ewe that is struggling to give birth to a large lamb. A makeshift operating theatre is set up in the barn, where he performs an emergency caesarean section, hoping to save both mother and baby."
      },
      {
        "id": "tvmaze:1865073",
        "title": "The Peter Wright Story",
        "season": 10,
        "episode": 10,
        "released": "2020-05-26",
        "overview": "Peter looks back on the highs and lows of his veterinary career. He returns to his childhood home for the first time in 50 years and visiting his former teachers from primary school to sixth form, who reveal the events that inspired his medical career. He also looks back on his experiences as a work experience student for Alf Wight, also known to the world as James Herriot."
      },
      {
        "id": "tvmaze:1869931",
        "title": "New Life",
        "season": 10,
        "episode": 11,
        "released": "2020-06-02",
        "overview": "The series concludes with an episode focusing on births and new beginnings. While delivering a calf, Julian also helps a new graduate to begin her veterinary career. At the Boroughbridge surgery, nurse Sally waits to discover if a labrador impregnated by her own dog has successfully conceived, and hopes to be able to take one of the litter home when they are born. Peter Wright is more concerned with preventing pregnancies, and has four cats to castrate in one day before they can go to new homes."
      },
      {
        "id": "tvmaze:1911409",
        "title": "Episode 1",
        "season": 11,
        "episode": 1,
        "released": "2020-08-11",
        "overview": "Julian rushes to an emergency at Jackie's alpaca farm, where a new mum desperately needs his help - but rural North Yorkshire isn't always the best place for driving when time is of the essence, and Julian gets stuck behind not one, but two tractors. There's a glimpse of what lockdown life was like for Steve and Jean, whose daughter Sarah kept a video diary and, with things returning to normal, Peter returns to the Greens' farm, where there's now lots of veterinary work to do."
      },
      {
        "id": "tvmaze:1911410",
        "title": "Episode 2",
        "season": 11,
        "episode": 2,
        "released": "2020-08-18",
        "overview": "Julian comes to the aid of a cow that is unable to stand up due to a condition called milk fever, caused by calcium deficiency. One false move in the treatment could put the animal's life in danger. Peter works to save the life of a three-week-old kitten with pneumonia. A Chihuahua has a worrying lump that requires surgery, a goose acquires a mating injury from an overenthusiastic partner, and a horse is not going to sit back and allow itself to be castrated."
      },
      {
        "id": "tvmaze:1916879",
        "title": "Episode 3",
        "season": 11,
        "episode": 3,
        "released": "2020-08-25",
        "overview": "A special episode to mark International Dog Day, in which Julian faces the challenge of having to perform surgery on his own four-legged friend Emmy - who is not too keen on needles. Peter removes a tumour from a Great Dane's leg, and a spaniel is rushed in with her side ripped open on a barbed wire fence. Julian pays a visit to a sheepdog whose broken leg he fixed with a metal plate - and which he now has to take out again."
      },
      {
        "id": "tvmaze:1916880",
        "title": "Episode 4",
        "season": 11,
        "episode": 4,
        "released": "2020-09-01",
        "overview": "A one-ton bull needs a foot trim, but is reluctant to lie down for the procedure, so Peter has to approach its feet very carefully to avoid his patient falling on him. Julian and Katy operate on a beagle with damaged ligaments, and a cat undergoes a caesarean section - a procedure that is very rarely used on feline patients. The Greens release their calves and donkeys into the field together for the first time, and a tortoise displays a loss of appetite."
      },
      {
        "id": "tvmaze:1927082",
        "title": "Episode 5",
        "season": 11,
        "episode": 5,
        "released": "2020-09-08",
        "overview": "The vets treat some of North Yorkshire's more exotic residents, including Amadeus the alpaca, whose owner Christina found him with a stick in his eye. Julian Norton knows he probably would not survive an operation to remove the eye, and the kindest thing might be to put him to sleep, but he is hoping to find another solution. Peter Wright greets a familiar face from Down Under when a baby wallaby comes to the practice a little down in the dumps."
      },
      {
        "id": "tvmaze:1927084",
        "title": "Episode 6",
        "season": 11,
        "episode": 6,
        "released": "2020-09-15",
        "overview": "Julian has to help a ewe through a difficult birth in the middle of a field in the rain, while Peter performs an emergency C-section on a heavily pregnant shih tzu. A male goat presents a serious problem for its owners when it impregnates all the females in the pen, a cat undergoes emergency eye surgery, and a calf is in urgent need of its mother's milk."
      },
      {
        "id": "tvmaze:1927085",
        "title": "Episode 7",
        "season": 11,
        "episode": 7,
        "released": "2020-09-22",
        "overview": "Julian has to deliver the biggest calf he has ever encountered, while Peter has to perform testicular surgery on a show dog that may bring a premature end to his performance career. A Clydesdale horse that recently needed foot surgery now also needs dental treatment - and the specialist equipment Candela uses for treating teeth is too small for the massive animal."
      },
      {
        "id": "tvmaze:1945618",
        "title": "Episode 8",
        "season": 11,
        "episode": 8,
        "released": "2020-09-29",
        "overview": ""
      },
      {
        "id": "tvmaze:1949388",
        "title": "Episode 9",
        "season": 11,
        "episode": 9,
        "released": "2020-10-06",
        "overview": "Peter tries to save a lamb that was badly injured during birth. A rottweiler locates a bag of class A drugs - but his owner is more concerned that he has eaten another bag. Anne discovers that wearing glasses can create problems for a vet, a one-week llama takes a turn for the worst, and a difficult birth leaves a cow struggling to feed its calf."
      },
      {
        "id": "tvmaze:1949389",
        "title": "Episode 10",
        "season": 11,
        "episode": 10,
        "released": "2020-10-13",
        "overview": "Julian heads to the historic Harewood House near Leeds to check on a group of goats that are moving to a new enclosure, but catching them proves quite painful. Peter heads over to lend a hand when a young farmer struggles with a tricky lambing, while Caroline and Ben arrive at the practice in Boroughbridge very worried about their old Jack Russell, Scamp. He's jumped off a stile and badly damaged a ligament in one of his legs."
      },
      {
        "id": "tvmaze:1949390",
        "title": "Episode 11",
        "season": 11,
        "episode": 11,
        "released": "2020-10-20",
        "overview": "Julian revisits an alpaca that he has treated through two previous complicated pregnancies, and who now needs help once again with a third difficult birth. Three cows need dehorning for the safety of the rest of the herd, while a pregnant sheep is rushed to Huddersfield's new emergency animal hospital. The owner of a German shepherd fears a lump on the dog's neck may be cancerous."
      },
      {
        "id": "tvmaze:1949391",
        "title": "Episode 12",
        "season": 11,
        "episode": 12,
        "released": "2020-10-27",
        "overview": "The owner of the famous farm in the middle of the M62 fears his cows have TB - and if even a single animal is diagnosed, it could prove disastrous for the rest of the herd. Julian rushes to the Taylors' farm to treat a sheep that has prolapsed days after giving birth, an eight-week-old shih tzu puppy needs surgery for a hernia, and Peter and Matt work together to castrate a goat."
      },
      {
        "id": "tvmaze:1958425",
        "title": "Episode 13",
        "season": 11,
        "episode": 13,
        "released": "2020-11-03",
        "overview": "A cow needs urgent attention after suffering a serious leg wound that leaves the bone exposed - but it is not clear if anything can be done to save the animal. A dog is brought in to surgery with a lump that is making it hard to walk, a hedgehog's foot is operated on, and five girls are worried about their pony, whose eyes have begun to swell up."
      },
      {
        "id": "tvmaze:1958427",
        "title": "Episode 14",
        "season": 11,
        "episode": 14,
        "released": "2020-11-10",
        "overview": "The Greens rescue a kitten that was found on a main road in the middle of the night, which is only five weeks old and is far too young to cope without its mother's milk. A border terrier is brought into the surgery with a lump on its back leg, a bull undergoes a fertility test, and Peter visits a sheep farmer to check up on a breeding ram that has been injured in a fight."
      },
      {
        "id": "tvmaze:1971304",
        "title": "Episode 15",
        "season": 11,
        "episode": 15,
        "released": "2020-11-17",
        "overview": "Peter carefully examines a boar that is off its food, a rescue dog brought over from Spain undergoes surgery on a painful eye condition, and Rodney invests in an unusual device for administering medical treatment to his sheep - but neither he nor Julian know how it works and the sheep seem less than keen. A rare cattle breeder waits for the pregnancy test results on his Jack Russell."
      },
      {
        "id": "tvmaze:1971305",
        "title": "Episode 16",
        "season": 11,
        "episode": 16,
        "released": "2020-11-24",
        "overview": "Julian investigates when a pregnant cow delivers an afterbirth but no calf, while Peter and Matt compete to see if modern or traditional pregnancy tests are more reliable. A German Shepherd puppy belonging to a woman who has recently lost two dogs is lame and in pain, requiring delicate keyhole surgery to remove a fragment of bone."
      },
      {
        "id": "tvmaze:1971306",
        "title": "Episode 17",
        "season": 11,
        "episode": 17,
        "released": "2020-12-01",
        "overview": "Peter provides urgent dental treatment to his niece's horse, while Julian visits a group of vets in training to pass on what he knows about treating farm animals. A ewe in a difficult labour is rushed into hospital, but Matt and the other vets fear it may not be possible to save either mother or lamb. Vets from West Yorkshire attend a special celebration of the 50th anniversary of James Herriot's first book."
      },
      {
        "id": "tvmaze:2068550",
        "title": "Episode 1",
        "season": 12,
        "episode": 1,
        "released": "2021-04-13",
        "overview": "Peter Wright rushes to help a cow struggling to give birth and it is believed the calf may be coming out backwards. Meanwhile, Joanne and her three-year-old son Jack are sure their kitten Jasmine has been in a road accident, and later Julian and Matt head out to a farm where there are two boisterous patients to treat."
      },
      {
        "id": "tvmaze:2071599",
        "title": "Episode 2",
        "season": 12,
        "episode": 2,
        "released": "2021-04-20",
        "overview": "Julian treats a seriously ill llama called Echo who is struggling to breathe, and he has the tricky job of conducting his very first llama chest X-ray. Elsewhere, Walter the pug arrives at Huddersfield hospital with a painful knee problem, so Matt and Martin put him through the CT scanner as they try to work out what is causing the pain."
      },
      {
        "id": "tvmaze:2071600",
        "title": "Episode 3",
        "season": 12,
        "episode": 3,
        "released": "2021-04-27",
        "overview": "Peter Wright tries to save a cow who has suffered a huge prolapse after giving birth, and Matt and David attempt make-or-break surgery on a sheep with a foot infection. Elsewhere, Jasper the 13-year-old golden retriever has a nasty looking cancerous tumour on his mouth, and Julian embarks on a tricky surgery to try and remove it."
      },
      {
        "id": "tvmaze:2076321",
        "title": "Episode 4",
        "season": 12,
        "episode": 4,
        "released": "2021-05-04",
        "overview": "Peter Wright is concerned about a tawny owl whose eye he removed 18 months ago and now has a serious problem with its remaining eye, which means its life is in danger. Meanwhile, Julian Norton visits a local dairy farm to help a new mother, and back at the surgery he and his team battle to save a litter of unborn puppies."
      },
      {
        "id": "tvmaze:2088020",
        "title": "Episode 5",
        "season": 12,
        "episode": 5,
        "released": "2021-05-11",
        "overview": "Julian Norton heads to the Taylors' farm, where there is a double sheep emergency in the form of a new mother and an expectant ewe that have both prolapsed. Peter Wright operates on a collie that requires emergency surgery and also heads out to see Shetland pony called Banjo, which is struggling badly because of a sore hoof."
      },
      {
        "id": "tvmaze:2088021",
        "title": "Episode 6",
        "season": 12,
        "episode": 6,
        "released": "2021-05-18",
        "overview": "A ewe in labour is rushed into the animal hospital from Cannon Hall Farm, and vet Matt prepares to deal with this urgent case in the car park. Meanwhile, Peter has a reunion with a feisty feline, and Morris the beagle is rushed into the practice by his worried owners after suffering a sudden illness."
      },
      {
        "id": "tvmaze:2093073",
        "title": "Episode 7",
        "season": 12,
        "episode": 7,
        "released": "2021-05-25",
        "overview": "Matt performs delicate eye surgery on a peacock in a bird lover's back garden, and Julian heads to a sheep farm where one of the rams needs a vasectomy. Meanwhile, Peter heads to see a worried farmer whose newborn calf is unable to stand up."
      },
      {
        "id": "tvmaze:2104761",
        "title": "Episode 8",
        "season": 12,
        "episode": 8,
        "released": "2021-06-01",
        "overview": "Peter and Matt head to Cannon Hall Farm, where their old friend Prince the reindeer having problems with its antler. Later, Julian operates on a little West Highland White Terrier called Ted, and Shona visits a litter of puppies on a farm in the middle of a motorway."
      },
      {
        "id": "tvmaze:2104762",
        "title": "Episode 9",
        "season": 12,
        "episode": 9,
        "released": "2021-06-08",
        "overview": "Peter Wright is struggling to find his feet in his new practice, but when a farmer rushes in with a heavily pregnant sheep who is struggling to give birth, instinct takes over as the vet deals with the emergency. Julian Norton and his team rush a Bernese mountain puppy straight into surgery, while Matt gives Rohin a taste of exotic vetting in Cannon Hall Farm's reptile house."
      },
      {
        "id": "tvmaze:2125595",
        "title": "Episode 10",
        "season": 12,
        "episode": 10,
        "released": "2021-07-06",
        "overview": "Julian Norton deals with one of his noisiest patients ever in the shape of Mako the alpaca who requires treatment on a lump on the size half a football. Meanwhile, Matt heads to see a horse that has been suffering with a nasty choking episode, and an elderly terrier needs surgery on a serious eye problem."
      },
      {
        "id": "tvmaze:2125596",
        "title": "Episode 11",
        "season": 12,
        "episode": 11,
        "released": "2021-07-13",
        "overview": "Julian Norton treats a hedgehog that has been brought into the Boroughbridge practice with a badly injured leg, and in Huddersfield, a farmer brings in a heavily pregnant ewe that is struggling to give birth. Elsewhere, Peter Wright heads back to the Teasdales' farm, where he recently delivered a healthy calf."
      },
      {
        "id": "tvmaze:2133383",
        "title": "Episode 12",
        "season": 12,
        "episode": 12,
        "released": "2021-07-20",
        "overview": "A sheep is rushed into the practice to see Peter, after seriously injuring herself on a piece of metal. Peter thinks he can deal with the wound, but the bigger problem is that the ewe is pregnant with twins, and the lambs' lives are in danger. Tilly the tortoise is the star of the Cannon Hall Farm reptile house. But she's not been herself lately, and Matt's worried she might need extremely rare and complicated surgery to remove three eggs that she hasn't been able to pass."
      },
      {
        "id": "tvmaze:2157990",
        "title": "Episode 1",
        "season": 13,
        "episode": 1,
        "released": "2021-09-07",
        "overview": "Peter is called out to an emergency when a cow has a life-threatening stomach problem, and Julian welcome an expectant dog to the new Wetherby practice. In Huddersfield, Matt treats an exotic animal in the form of water dragon Bandit, who needs his tail amputating."
      },
      {
        "id": "tvmaze:2170061",
        "title": "Episode 2",
        "season": 13,
        "episode": 2,
        "released": "2021-09-14",
        "overview": "A pregnant ewe is rushed to the animal hospital from Cannon Hall Farm, while for young vet Rohin, there's a day gaining vital experience on the farm. With Matt's guidance, he has to remove the very large horns from some cows, and soon learns that traditional vet work is tiring. Meanwhile, Julian rushes a cat into emergency surgery before heading to Jacki's farm for some well-earned relaxation, with some alpaca yoga."
      },
      {
        "id": "tvmaze:2170064",
        "title": "Episode 3",
        "season": 13,
        "episode": 3,
        "released": "2021-09-21",
        "overview": "A farmer rushes in a struggling pregnant sheep who belongs to his two-year-old son, and Julian and Anne head to Jacki's alpaca farm to deal with Ebony's worrying lump on her lip. Springer Spaniel Poppy has an aggressive cancer, so Shona and Martin are facing complex surgery to remove the tumour from inside her rib cage."
      },
      {
        "id": "tvmaze:2181437",
        "title": "Episode 4",
        "season": 13,
        "episode": 4,
        "released": "2021-09-28",
        "overview": "Two brothers are worried about their cow, which is foaming at the mouth, and ask for Peter's help to get to the bottom of the issue. Peter also has a daunting visit to the Greens' farm - Dusty the feline has an injury, but won't be easy to help - she's affectionately known as the `Devil Cat\". Elsewhere, an animal lover finds a pigeon with a deformed leg and takes her to Julian, who decides to operate."
      },
      {
        "id": "tvmaze:2181438",
        "title": "Episode 5",
        "season": 13,
        "episode": 5,
        "released": "2021-10-05",
        "overview": "A goat with a painful foot condition is brought in to see Peter, who takes some X-rays to try and find out the cause. A bulldog is rushed in after eating some chewing gum, and Julian heads to a local care home to visit one of his favourite former clients."
      },
      {
        "id": "tvmaze:2193963",
        "title": "Episode 6",
        "season": 13,
        "episode": 6,
        "released": "2021-10-12",
        "overview": "Peter receives an emergency call from his old friend Ivor, who has found one of his calves limping, and Peter suspects her leg is broken. Julian is slightly overwhelmed when 18 rats are brought to the practice, while Matt visits a blind sheep whose eye has become dangerously enlarged and David deals with a stray dog that's been brought into the animal hospital."
      },
      {
        "id": "tvmaze:2196181",
        "title": "Episode 7",
        "season": 13,
        "episode": 7,
        "released": "2021-10-19",
        "overview": "A much-loved pet pig called Pigley Scott is brought to the practice, and Matt and David head to a local farm where it looks like a pregnant cow requires an emergency C-section. Later, when a German shorthaired pointer requires surgery, his owner is beside herself with worry."
      },
      {
        "id": "tvmaze:2196182",
        "title": "Episode 8",
        "season": 13,
        "episode": 8,
        "released": "2021-10-26",
        "overview": "Kaiser the alpaca has a mysterious and painful skin problem, and Matt calls for Julian to help him work out what is causing it, while Shona feels the pressure when she visits a herd of pedigree cows to fix a hernia in a calf for the first time. Peter tends a donkey that has has a nasty-looking cut on his eyelid, and Julian is anxious when he tries to clip the claws and beak of an aggressive parrot."
      },
      {
        "id": "tvmaze:2196183",
        "title": "Episode 9",
        "season": 13,
        "episode": 9,
        "released": "2021-11-02",
        "overview": "There's a royal appointment at Cannon Hall Farm as Matt helps a goat with a broken leg in front of a very high-profile onlooker - Her Royal Highness Princess Anne. Julian has his own special visitor - a tiny tortoise called Henry - who is the smallest patient he's ever treated, while Nigel is hoping his cows are pregnant, but will Julian be able to deliver good news?"
      },
      {
        "id": "tvmaze:2207240",
        "title": "Episode 10",
        "season": 13,
        "episode": 10,
        "released": "2021-11-09",
        "overview": "A four-week old lamb is rushed in to see Peter, and after being kicked in the face by a horse, Julian worries a black Labrador may have sustained a fracture. Meanwhile, Matt and David go back to school to introduce potential future vets to some unusual creatures."
      },
      {
        "id": "tvmaze:2207241",
        "title": "Episode 11",
        "season": 13,
        "episode": 11,
        "released": "2021-11-16",
        "overview": "Julian helps his friend and former colleague Katy with one of her sheep, that has developed a serious eye problem. Meanwhile, one of Peter's oldest clients brings in her heavily pregnant, former Crufts prize-winner Maisi into the practice, and Matt and his fiancee Katherine set off to adopt a puppy."
      },
      {
        "id": "tvmaze:2313689",
        "title": "Episode 1",
        "season": 14,
        "episode": 1,
        "released": "2022-04-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2318999",
        "title": "Episode 2",
        "season": 14,
        "episode": 2,
        "released": "2022-05-03",
        "overview": "Matt rushes to a local cattle farm to help Tilly the cow give birth. Elsewhere, Mike and Rebecca have an amorous pony, who needs an appointment with Peter, and Julian operates on a young girl's poorly guinea pig, but he is shocked by what he finds."
      },
      {
        "id": "tvmaze:2320222",
        "title": "Episode 3",
        "season": 14,
        "episode": 3,
        "released": "2022-05-10",
        "overview": "A three-week-old orphaned lamb with a swollen leg is brought into the practice to see Peter, and a greyhound with a badly broken leg requires complex surgery. Elsewhere, Julian pays a visit to Jackie as one of her alpacas has a large lump on its lip that ma need operating on."
      },
      {
        "id": "tvmaze:2325319",
        "title": "Episode 4",
        "season": 14,
        "episode": 4,
        "released": "2022-05-17",
        "overview": "Matt needs to perform an emergency C-section on a cow struggling to deliver her calf. Elsewhere, Julian meets a unique sheep called Cliff, and Peter treats a French bulldog puppy called Blue with a large lump on his eye."
      },
      {
        "id": "tvmaze:2326193",
        "title": "Episode 5",
        "season": 14,
        "episode": 5,
        "released": "2022-05-24",
        "overview": "A three-legged sheep called Star might be given a new lease on life with a prosthetic leg, but the rare procedure proves to be far from straightforward. Meanwhile, Julian meets Teddy, a very special 10-month-old dachshund and his owner Kerry, who believes Teddy saved her life when she went into cardiac arrest."
      },
      {
        "id": "tvmaze:2333045",
        "title": "Episode 6",
        "season": 14,
        "episode": 6,
        "released": "2022-05-31",
        "overview": "Matt responds to an urgent call from a 16-year-old farmer who is worried about his pregnant ewe, which has been struggling to give birth. Peter takes young vet Hannah to meet a huge bull called Cyril. He needs a pedicure, but doesn't seem too keen on the idea and when Peter and his apprentice are finally able to get started, the clock is ticking and nerves are jangling, because they know that the big fella might wake up at any moment."
      },
      {
        "id": "tvmaze:2333092",
        "title": "Episode 7",
        "season": 14,
        "episode": 7,
        "released": "2022-06-07",
        "overview": "Peter rushes a pregnant husky into surgery, hoping he can deliver some live puppies, but he fears it might be too late to save the entire litter. Meanwhile, Julian's old friend Rodney arrives at his practice in Thirsk with one of his lambs with a badly broken leg, and Matt treats a very poorly cow called Matilda."
      },
      {
        "id": "tvmaze:2339605",
        "title": "Episode 8",
        "season": 14,
        "episode": 8,
        "released": "2022-06-14",
        "overview": "Peter heads up Sutton Bank for a lambing with a view. But there's no time to admire it because, when he arrives, farmers Craig and Liz have been struggling for a while. The lamb is stuck, but with its legs already out, it's too late for a C-section. At the practice in Thirsk, Julian meets a pug with an unusual problem to match her unusual name. Runtleigh has a painful, prolapsed eyeball, which is bulging, and the team rush her straight into surgery. Rohin meets Juliet  but it's no romantic tale. The young heifer has a large, unpleasant tumour like nothing he's never seen before. He needs to remove it and send it to the lab to find out if it's malignant. Meanwhile, Peter has a more pleasant cow conundrum  working out how many cows are pregnant thanks to big bull Cyril. And he shows graduate vet Hannah the ropes. Julian tries to conquer his fears when nurse Natalie brings in some of her exotic pets. Unlike his colleagues, he isn't keen on getting close to the snakes or the tarantula. And Matt's with some rhinos  the Leeds Rhinos rugby league team! His dad Alan played professionally for Leeds and Great Britain, and they take a trip to Headingley to watch a match, while comparing this most physical of sports to Matt tackling sheep and cows."
      },
      {
        "id": "tvmaze:2347602",
        "title": "Episode 9",
        "season": 14,
        "episode": 9,
        "released": "2022-06-21",
        "overview": "Peter has to deal with the most overgrown tortoise beak he has ever seen, and Julian treats a Vizsla puppy that has eaten a washing up-sponge for the second time. Meanwhile, David rushes out to a local farm where a ewe has suffered an unusual, life-threatening prolapse."
      },
      {
        "id": "tvmaze:2347969",
        "title": "Episode 10",
        "season": 14,
        "episode": 10,
        "released": "2022-06-28",
        "overview": "Rare Mangalitsa pig breeder Lisa is worried about her boar Hal, that has developed a large lump on its neck. Later, a famous client brings his dog to the practice, and Matt is in unchartered waters as he heads to a local college to operate on one of their fish."
      },
      {
        "id": "tvmaze:2376708",
        "title": "Episode 1",
        "season": 15,
        "episode": 1,
        "released": "2022-09-06",
        "overview": "In this first episode of the new series, Peter deals with an emergency at the practice in Kirkbymoorside, when a local farming couple rush in their pregnant Texel ewe. At the Thirsk practice, Julian operates on a much-loved terrier called Lovejoy. He's suffering with bladder stones, just like owners Andrew and Nick's previous dog, who didn't survive. And they're worried they're set for more heartache over Lovejoy. Matt heads into challenging, stressful surgery on a chameleon called Miss Pickles, who has lots of eggs stuck inside her. Huddersfield vet Shona and her boyfriend James are approaching the big moment in their home-breeding adventure, with their first lambs due to be born. But they aren't coming as quickly as expected, and their time off work is nearly over. Julian enjoys a landmark birthday, but, although they're showering him with gifts, the Wetherby team aren't exactly in the most sensitive of moods! And it's been a difficult time at the Greens' farm as they've just lost their old donkey Mabel. Peter heads over to check on Mabel's old pal Cybil, who seems sad and lonely. So Peter has an idea to cheer them all up, and calls on the help of a couple of farming friends  two brothers from Barnsley."
      },
      {
        "id": "tvmaze:2380993",
        "title": "Episode 2",
        "season": 15,
        "episode": 2,
        "released": "2022-09-13",
        "overview": "Peter rushes to help a heavily pregnant cow who isn't getting on with it' and, as she's expecting twins, which isn't common for cows, farmer Will is worried that neither calf will survive. Julian meets a champion ferret', who's struggling with a badly infected swollen foot. Shona heads to see an old horse who is suffering with sore eyes: Barney has been by his owner Rachel's side for 24 years and she's desperate for him to be out of pain. Peter joins Matt at Jake Ratcliffe's animal sanctuary, where Leonard the miniature donkey needs taking in hand  he's been trying his luck with the bigger boys and his stablemate Catherine. Meanwhile, at the practice in Wetherby, new vet Ed has brought some fresh ideas with him, including dog acupuncture. And Julian's keen to try it for himself!"
      },
      {
        "id": "tvmaze:2394167",
        "title": "Episode 3",
        "season": 15,
        "episode": 3,
        "released": "2022-09-20",
        "overview": "With a baby alpaca's life hanging in the balance, Julian performs an emergency blood plasma transfusion on the front lawn of the Thirsk practice. Peter meets a cat that has been on an unusual journey - she lives at a coach station after being taken in as a stray. However, she has made an unwanted stop at the surgery with a serious eye problem."
      },
      {
        "id": "tvmaze:2396780",
        "title": "Episode 4",
        "season": 15,
        "episode": 4,
        "released": "2022-09-27",
        "overview": "Peter Wright battles to deliver lambs who are stuck inside their mum, but is shocked by what he finds, while Julian Norton deals with an angry parrot that escapes in the surgery. A peaceful walk turns into a nightmare when a rescue lurcher is attacked by another dog, and Peter has a bright idea and calls on his new, young, farming friend Abbie to help his old pals Jean and Steve."
      },
      {
        "id": "tvmaze:2404666",
        "title": "Episode 5",
        "season": 15,
        "episode": 5,
        "released": "2022-10-04",
        "overview": "A rare-breed pony is in danger when she suffers a prolapsed uterus soon after giving birth, and while it's a relatively common problem in sheep and cows, it's the first time Shona has ever encountered the condition in a mare. A Great Dane called Phoebe has suffered a debilitating knee injury and Julian has a plan to fix the problem with complex surgery, and Peter heads out to treat a not-so-micro pig, who lives in the back garden of the man who runs his local chip shop."
      },
      {
        "id": "tvmaze:2420401",
        "title": "Episode 6",
        "season": 15,
        "episode": 6,
        "released": "2022-10-11",
        "overview": "Julian visits a familiar patient, a house pig who screamed the place down the first time."
      },
      {
        "id": "tvmaze:2420402",
        "title": "Episode 7",
        "season": 15,
        "episode": 7,
        "released": "2022-10-18",
        "overview": "Julian rushes into surgery with a Shih Tzu called Walter."
      },
      {
        "id": "tvmaze:2420403",
        "title": "Episode 8",
        "season": 15,
        "episode": 8,
        "released": "2022-10-25",
        "overview": "Julian is reunited with an alpaca he delivered when she develops a mystery eye problem."
      },
      {
        "id": "tvmaze:2420404",
        "title": "Episode 9",
        "season": 15,
        "episode": 9,
        "released": "2022-11-01",
        "overview": "Julian meets a five-month-old cockapoo with a badly broken leg. Elsewhere, Peter gets a scare when he tries to help a horse with some worrying cancerous growths, Matt operates on a cow with a nasty-looking tail problem, and Shona enters a showjumping competition."
      },
      {
        "id": "tvmaze:2420405",
        "title": "Episode 10",
        "season": 15,
        "episode": 10,
        "released": "2022-11-08",
        "overview": "A lamb is rushed to the Huddersfield hospital with a ruptured eye, but Matt also worries that there may be a problem with the lamb's other eye. Peter operates on a lovable Staffordshire Bull Terrier called Coco, and later Julian castrates a miniature pony."
      },
      {
        "id": "tvmaze:2432510",
        "title": "Episode 11",
        "season": 15,
        "episode": 11,
        "released": "2022-11-15",
        "overview": "In the final episode, Julian meets a very unusual creature, a European polecat called Poldark, and Peter heads to an old friend's farm on his day off to help with a tough lambing. Elsewhere, staff treat a French bulldog puppy that needs complex surgery on both elbows, and at Cannon Hall Farm, concern is growing for Dotty the sheep, who seems seriously ill."
      },
      {
        "id": "tvmaze:2433386",
        "title": "Episode 12",
        "season": 15,
        "episode": 12,
        "released": "2022-11-22",
        "overview": ""
      },
      {
        "id": "tvmaze:2529879",
        "title": "Episode 1",
        "season": 16,
        "episode": 1,
        "released": "2023-04-25",
        "overview": "Julian operates on a French Bulldog that has injured one of his three legs, and vet Matt Smith rushes to a local farm to try and save a ewe and her unborn lamb. Elsewhere, Peter and Shona have some donkey work to do at the Greens' farm to solve a problem."
      },
      {
        "id": "tvmaze:2529880",
        "title": "Episode 2",
        "season": 16,
        "episode": 2,
        "released": "2023-05-02",
        "overview": "Matt Smith heads to Cannon Hall Farm where Rob and Dave's latest arrival, a Highland calf for whom they have high hopes as a future show champion, has serious breathing problems. Elsewhere, Rohin Aojula takes his dad on a call to help a horse that has suffered a nasty injury while out riding."
      },
      {
        "id": "tvmaze:2538774",
        "title": "Episode 3",
        "season": 16,
        "episode": 3,
        "released": "2023-05-09",
        "overview": "Peter Wright treats a pet sheep with an unpleasant case of flystrike, resulting in an abundance of maggots living within its ear. Elsewhere, the Huddersfield team perform complicated spinal surgery on a French bulldog, and Julian Norton is called out to meet a pet pig called Pumba that has hay netting tangled around its teeth."
      },
      {
        "id": "tvmaze:2539910",
        "title": "Episode 4",
        "season": 16,
        "episode": 4,
        "released": "2023-05-16",
        "overview": "Peter has his hands full when not one, but two wild owls are brought into his practice in need of help, and Shona rushes to the aid of a horse that has tread on a nail, but she needs to assess the damage before she can remove it. Elsewhere, Julian has to learn sign language in order to communicate with a deaf dachshund in need of surgery."
      },
      {
        "id": "tvmaze:2555780",
        "title": "Episode 5",
        "season": 16,
        "episode": 5,
        "released": "2023-05-23",
        "overview": "Peter treats a farmer's trusty Labrador that is struggling to walk after cutting herself badly on a nail. Elsewhere, Julian operates on a chicken with an infected leg, and Robin rushes to the aid of a pregnant ewe at one of the Huddersfield practice's smaller surgeries."
      },
      {
        "id": "tvmaze:2555781",
        "title": "Episode 6",
        "season": 16,
        "episode": 6,
        "released": "2023-05-30",
        "overview": "Julian has a mysterious case on his hands when he treats two pet goats that have been attacked by an unknown animal. Elsewhere, Peter visit an old friend's farm where he meets a pig that is under the weather, and one of two dogs is guilty of eating some children's vitamin pills that could be fatal for whichever animal it was."
      },
      {
        "id": "tvmaze:2563602",
        "title": "Episode 7",
        "season": 16,
        "episode": 7,
        "released": "2023-06-06",
        "overview": "Peter Wright treats two kittens that have been through unimaginable suffering after they were found dumped in a bag and set on fire. Elsewhere, Shona performs an emergency Caesarean to try and save a cow and her calf, and Julian hopes to help a dog suffering from a rare spinal condition."
      },
      {
        "id": "tvmaze:2563603",
        "title": "Episode 8",
        "season": 16,
        "episode": 8,
        "released": "2023-06-13",
        "overview": "A farmer's favourite calf struggles with a suspected hernia, but as Matt investigates, all might not be as expected. Julian heads into theatre to remove one of the largest lumps his team have ever seen on a dog, while Rohin faces challenging and delicate surgery to remove a pet mouse's eyeball."
      },
      {
        "id": "tvmaze:2564162",
        "title": "Episode 9",
        "season": 16,
        "episode": 9,
        "released": "2023-06-20",
        "overview": "An old friend of Peter's heads to the practice with a sheep who birthed a lamb last night, but is struggling with her second. But neither vet nor farmer are optimistic about the unborn lamb's chances.David rushes into the hospital with a terrier he knows well. His own rescue dog's best friend has ripped her ear on some barbed wire, so feels added pressure as he performs surgery.Matt and a Herriot-loving American vet student operate on a cow with a twisted stomach. And, in Julian's words, it's \"eyeball to eyeball, pig against vet\" as he tries to remove a boar called Prince's tusks. But arguably he faces a bigger personal challenge with his latest dabble at DIY - trying to fix the door on the practice's new fridge."
      },
      {
        "id": "tvmaze:2577321",
        "title": "Episode 10",
        "season": 16,
        "episode": 10,
        "released": "2023-06-27",
        "overview": "A newborn lamb is brought to the hospital after being found abandoned by the roadside, and Matt and David have their work cut out to save its life. Elsewhere, Peter performs delicate surgery on a rat with a large tumour, and later, Julian's bank holiday barbecue is interrupted by a horse with suspected colic."
      },
      {
        "id": "tvmaze:2577325",
        "title": "Episode 11",
        "season": 16,
        "episode": 11,
        "released": "2023-07-04",
        "overview": "It is a landmark day at the hospital in Huddersfield as Shona Searson and the team use a new electro-chemotherapy treatment on a pet pygmy goat's cancerous tumour. Peter Wright heads into surgery with an elderly Lhasa apso that has been suffering with a painful eye problem, while Julian Norton deals with some rowdy alpacas."
      },
      {
        "id": "tvmaze:2577453",
        "title": "Episode 12",
        "season": 16,
        "episode": 12,
        "released": "2023-07-11",
        "overview": "After enjoying a relaxing cycle into work, Julian faces an uphill struggle at the Thirsk practice. A Large Munsterlander has a cancerous tumour on his jaw, and another vet has already recommended having him put to sleep. Can Julian offer any hope?Peter's also on his bike, as he gears up for a 170-mile cross country challenge, as well as trying to help a red deer with a face abscess.Matt meets a cow who's struggling to walk on a badly swollen knee, and David visits a rookie sheep farmer who has a poorly ram. But the bigger concern is that Blueberry might have made Muffin the ewe pregnant."
      },
      {
        "id": "tvmaze:2612100",
        "title": "Episode 1",
        "season": 17,
        "episode": 1,
        "released": "2023-08-08",
        "overview": "A frog called Kermit has a very delicate problem at his rear end. But he's so slippery and jumpy, it's Matt who's feeling like the Muppet. Julian operates on a cat with a strange lump, while two of the vet's farming friends head to the practice with a ewe who's struggling to give birth to large twin lambs."
      },
      {
        "id": "tvmaze:2619114",
        "title": "Episode 2",
        "season": 17,
        "episode": 2,
        "released": "2023-08-15",
        "overview": "Matt performs al fresco surgery on a heifer, who has a huge lump that's growing at a worryingly fast rate. Peter helps a young vet perform emergency surgery on a sick spaniel, who they suspect has eaten something she shouldn't have. Rohin is shocked by a Siamese cat's sizeable problem. On a glorious Bank Holiday weekend, Julian's family barbecue is interrupted by a horse with suspected colic. But Matt and David's dogs should get to enjoy some tasty homemade treats, as the two vets attempt to cook up a canine birthday surprise."
      },
      {
        "id": "tvmaze:2619115",
        "title": "Episode 3",
        "season": 17,
        "episode": 3,
        "released": "2023-08-22",
        "overview": "It's all hands on deck as Shona tries to deliver a cow called Tinkerbell's calf. But Tinkerbell isn't very fairy like, and her kicking doesn't make it easy for Shona and the team to get to work.Julian's also trying to bring new life into the world, but it's not your everyday job: Shetland sheepdog Honey has already had two puppies, so Julian's hoping he can induce the next birth without needing to perform surgery.A nurse from Peter's practice is very worried about one of her own unusual outdoor pets, so Peter's feeling the pressure as, for the first time in over 40 years as a vet, he attempts a tricky procedure on an alpaca.Meanwhile, Matt meets two iguanas, brought in from Cannon Hall Farm with nasty looking skin conditions. And one of them seems especially unhappy to be at the hospital."
      },
      {
        "id": "tvmaze:2619116",
        "title": "Episode 4",
        "season": 17,
        "episode": 4,
        "released": "2023-08-29",
        "overview": "Julian rushes out to a night-time emergency at his old friend's farm. Rodney is an experienced sheep farmer so as he's unable to deliver a lamb, Julian knows there's a serious problem.Peter's reunited with Nurse Rachel from his former practice, but there isn't time for much catching up  with an owner terrified he might lose his struggling Staffie, Peter and Rachel are rushing into theatre together once more.Matt meets a cat called Bagpuss, but unlike the old TV character, this one is no \"fat, friendly cat puss\". The grumpy old feline has a strange lump on her head that requires surgery.Meanwhile, Shona travels to a place that's very special to her: the stables where she learnt to ride. And she's hoping to give her old instructor positive news about two of her new horses."
      },
      {
        "id": "tvmaze:2637646",
        "title": "Episode 5",
        "season": 17,
        "episode": 5,
        "released": "2023-09-05",
        "overview": "A freak accident leaves a young Irish Wolfhound stuck in a tiny gap between two walls, and Peter treats a pet fish brought to the practice in a bucket of water. Elsewhere, Matt Smith has to perform a rare and complex operation, and Julian Norton treats some sheep feet and helps himself to a tasty farm shop treat."
      },
      {
        "id": "tvmaze:2637647",
        "title": "Episode 6",
        "season": 17,
        "episode": 6,
        "released": "2023-09-12",
        "overview": "David Melleney and Rohin Aojula team up to try to save a cow and her unborn calf, and Julian Norton is shocked to find a ping pong ball-sized lump inside a shar-pei cross's mouth. Meanwhile, Peter Wright embarks on a three day, 170-mile charity bike ride to raise money for a cause close to his heart."
      },
      {
        "id": "tvmaze:2646807",
        "title": "Episode 7",
        "season": 17,
        "episode": 7,
        "released": "2023-09-19",
        "overview": "Peter battles to save a ewe and her unborn triplets, David visits a calf with an infected navel that requires potentially life-saving surgery, and Julian helps some university students with their scheme to provide free veterinary services for people who can't afford them."
      },
      {
        "id": "tvmaze:2649842",
        "title": "Episode 8",
        "season": 17,
        "episode": 8,
        "released": "2023-10-03",
        "overview": "Peter Wright fears a sick cat with a mysterious wound has been bitten by a snake. Elsewhere, Matt Smith performs an emergency C-Section on one of Cannon Hall Farm's pygmy goats, and Julian Norton also brings his own pet rabbit to the practice - a scruffy, rather dozy rabbit called Boris."
      },
      {
        "id": "tvmaze:2662658",
        "title": "Episode 9",
        "season": 17,
        "episode": 9,
        "released": "2023-10-10",
        "overview": "A cow with a newborn calf struggles to walk because of an infected toe, leaving Shona Searson to perform outdoor surgery in heavy rainfall. Matt Smith suspects an ailing lhasa apso puppy has eaten something it shouldn't have and rushes the dog into theatre. Julian Norton tries to help two pigeons who've been victims of cruelty, suspecting one of them has been shot, and Peter Wright prepares a champion horse for a big race."
      },
      {
        "id": "tvmaze:2662659",
        "title": "Episode 10",
        "season": 17,
        "episode": 10,
        "released": "2023-10-17",
        "overview": "A cow pushes out its uterus after giving birth, and with gravity working against Rohin Aojula, he has to call in the heavy machinery to get the cow in the best position to save her. Peter Wright operates on a barn owl who has been rescued with a badly damaged wing and Shona Searson and Martin Paterson perform keyhole surgery on a golden retriever. Julian Norton enjoys a day at the river to watch his son's rowing race - but work is never far away."
      },
      {
        "id": "tvmaze:2815915",
        "title": "Episode 1",
        "season": 18,
        "episode": 1,
        "released": "2024-04-23",
        "overview": "In the first episode, Peter heads out into England's green and pleasant land of Yorkshire once more. He faces a difficult lambing at an old friend's farm - the baby's legs are hanging out and it's in a nightmare position.Rohin meets a Lord who lives in a back garden \"chateau\" - Lord Pablo Porcini 1st is a pot-bellied pig, whose owner makes sure the young vet knows is her entire world.Julian heads into surgery, hoping to give another anxious owner more precious time with her elderly dog. Meanwhile, the milkshakes bring the boys to the farmyard, as Matt and David sample some locally produced dairy products. And Matt has to help a very cool visitor to the hospital  a Harris hawk with sore legs."
      },
      {
        "id": "tvmaze:2837615",
        "title": "Episode 2",
        "season": 18,
        "episode": 2,
        "released": "2024-04-30",
        "overview": "Peter Wright rushes to help a three-hour old donkey called Elvis whose life is in danger because he can't feed from his mum.Julian Norton meets a very special therapy sheep with an ear problem. When a young French bulldog becomes suddenly paralysed, she requires complex spinal surgery at the animal hospital.And dogs do their bit for fellow canines as volunteers turn up at the pet blood bank.Meanwhile, there's lots of team spirit - but no shortage of rivalry - in a charity cricket match: vets versus farmers!"
      },
      {
        "id": "tvmaze:2837616",
        "title": "Episode 3",
        "season": 18,
        "episode": 3,
        "released": "2024-05-07",
        "overview": "Love is in the Yorkshire air as Julian Norton and alpaca farmer Jacki look for the perfect match to create some crias.David Melleney rushes to a 5am lambing at a farm where two farmers found romance on a rural dating site.A dog owner is heartbroken when she accidentally runs over her own terrier  can Peter Wright repair its fractured pelvis?And for Matt Smith, it's a case of Beauty and the Beak when he meets a disabled chicken. Beauty's besotted owners take her to the garden centre and feed her cooked breakfasts! But they're worried her overgrown beak has become a big problem."
      },
      {
        "id": "tvmaze:2860508",
        "title": "Episode 4",
        "season": 18,
        "episode": 4,
        "released": "2024-05-14",
        "overview": "A newborn lamb is rushed to the hospital with his insides out, Rohin Aojula attempts to defy the odds and save the baby. Peter Wright helps an elderly cattle breeder, who can no longer keep her last two Highland cows and Julian Norton heads into surgery with a golden retriever. Plus the vets, with the help of their farming friends, give a young Herriot fan a Yorkshire trip to remember."
      },
      {
        "id": "tvmaze:2860509",
        "title": "Episode 5",
        "season": 18,
        "episode": 5,
        "released": "2024-05-21",
        "overview": "A farmer rushes his ewe to the practice with her lamb stuck mid delivery and Matt Smith takes aim to dart antibiotics into a poorly, young deer. At Cannon Hall Farm, Rohin Aojula scans to see if some musically named alpacas are pregnant."
      },
      {
        "id": "tvmaze:2881862",
        "title": "Episode 6",
        "season": 18,
        "episode": 6,
        "released": "2024-05-28",
        "overview": "An emaciated sheep is rushed to Huddersfield hospital after being abandoned outside a local rescue centre. Matt Smith scans the ewe, suspecting she could be pregnant. Julian Norton takes a labrador puppy with a hip injury into surgery, hoping to give her a new lease of life. Plus, Rob and Dave Nicholson hope to win a rosette with their Highland bull."
      },
      {
        "id": "tvmaze:2899782",
        "title": "Episode 7",
        "season": 18,
        "episode": 7,
        "released": "2024-06-04",
        "overview": "Shona Searson hits the fast lane to the farm in the middle of the motorway, where a ewe is struggling to give birth. Julian Norton heads back to the place he trained to be a vet, Cambridge University. Plus, a goat struggling to feed her three kids is brought to the practice to see Peter Wright."
      },
      {
        "id": "tvmaze:2899783",
        "title": "Episode 8",
        "season": 18,
        "episode": 8,
        "released": "2024-06-11",
        "overview": "David Melleney travels to Cannon Hall Farm in order to care for an alpaca called Roxette, who has badly injured herself. Julian Norton sets out to help a lamb with swollen legs and Peter Wright rushes his neighbour's poorly terrier straight into surgery with an infected uterus. An injured badger is brought to the Huddersfield hospital and Rohin Aojula wants to take some X-rays."
      },
      {
        "id": "tvmaze:2916515",
        "title": "Episode 9",
        "season": 18,
        "episode": 9,
        "released": "2024-06-18",
        "overview": "Vinnie the vulture is brought into the Thirsk practice due to problems with his leg, Shona and David team up to deliver a calf by caesarean and Julian operates on his friend Chris Jeffery's naughty dog, Timmy. The vets gather at the famous Great Yorkshire Show, where Matt joins the Nicholson brothers as models in the fashion parade."
      },
      {
        "id": "tvmaze:2932814",
        "title": "Episode 10",
        "season": 18,
        "episode": 10,
        "released": "2024-07-02",
        "overview": "Peter Wright has an equipment malfunction at the Greens' farm and Julian Norton performs emergency surgery on a poorly spaniel, who is suspected of eating a family-sized tub of chocolates. Matt Smith searches for a way to get two snakes out of a watercooler bottle, where they're stuck, and check if they're healthy. Plus, David Melleney heads to a farm to try to deliver a stuck lamb."
      },
      {
        "id": "tvmaze:2932815",
        "title": "Episode 11",
        "season": 18,
        "episode": 11,
        "released": "2024-07-09",
        "overview": "Shona Searson rushes to an emergency calving and suspects a caesarean might be the only way to save the mother and baby. Peter Wright operates on a much-loved sheepdog, who's broken his leg while working. The vets swap their scrubs and waterproofs for suits and gowns, as they gather in France's Dordogne valley for a big celebration."
      },
      {
        "id": "tvmaze:2977609",
        "title": "Episode 1",
        "season": 19,
        "episode": 1,
        "released": "2024-08-13",
        "overview": "Yorkshire Vet Peter Wright thought he'd seen it all before in over 40 years as a vet, but he's never had to deliver a stuck lamb with building work going on all around him.At Cannon Hall Farm, Rohin Aojula tries to help a poorly sheepdog puppy. There's a two vet emergency operation for Shona Searson and David Melleney as they try to save a cow with a twisted stomach.And Julian Norton treats some very underweight alpacas at a flower farm and hopes he can impress Anne when he picks a nice bouquet."
      },
      {
        "id": "tvmaze:2977611",
        "title": "Episode 2",
        "season": 19,
        "episode": 2,
        "released": "2024-08-20",
        "overview": "When he tries to find out why a Scottish wildcat from the local zoo is lame, Matt takes some X-Rays and is shocked by what he finds.Julian operates on a very special Cavalier King Charles Spaniel, who's been much more than just a pet to his family.Shona visits a sheep whose nasty looking wound has the farmer wondering if he's been shot.Peter enjoys a very different kind of sheep visit, as he shows Matt the sights of North Yorkshire. It's wet, rather than woolly, and might just quench the hard-working vets' thirst!"
      },
      {
        "id": "tvmaze:2977613",
        "title": "Episode 3",
        "season": 19,
        "episode": 3,
        "released": "2024-08-27",
        "overview": "A heavily pregnant basset hound is rushed into Julian's Thirsk practice, where it's all hands on deck to save her puppies. Peter's feeling the pressure from the pupils as he performs a procedure on a school's pet sheep. One of Cannon Hall Farm's most charismatic residents, Gary the amorous donkey, is struggling to walk and needs Matt's help. There's a night time emergency for Rohin, as a poorly goat is rushed to the hospital. And Peter shares passion for football with Jean Green, taking her to watch his beloved Middlesbrough."
      },
      {
        "id": "tvmaze:2981268",
        "title": "Episode 4",
        "season": 19,
        "episode": 4,
        "released": "2024-09-03",
        "overview": "When a farmer isn't able to deliver a lamb with \"massive legs\" it becomes a huge job for Peter. There's a surprise discovery at the local farming museum  some abandoned kittens. And Julian can see they all need help. Shona's night shift extends into the morning after an emergency call from a friend who's worried about her young Shire horse. Meanwhile, with a three-year old cocker spaniel clearly in pain on his walks, Matt and Martin perform pioneering spinal surgery."
      },
      {
        "id": "tvmaze:2987448",
        "title": "Episode 5",
        "season": 19,
        "episode": 5,
        "released": "2024-09-10",
        "overview": "Peter Wright learns how to use the practice's CT scanner which helps him discover that a Labrador has a cancerous lump behind his eye. There's a surgical first at the animal hospital as the team operate on asheep to hunt for a missing testicle. Matt Smith tries to cure a lame cow. Julian Norton examines a pet turkey with a raspy cough. And he knows he risks upsetting lots of besotted owners, so is feeling thepressure when he becomes a dog show judge."
      },
      {
        "id": "tvmaze:2993536",
        "title": "Episode 6",
        "season": 19,
        "episode": 6,
        "released": "2024-09-17",
        "overview": "It's the tortoise and the hare! Matt Smith assists a tortoise with an unpleasant maggot infestation, while Julian Norton tries to save a baby hare who's been attacked by a dog. Peter Wright sees some slow sprinters when he adjudicates a snail race at Thirsk Racecourse. Later he rushes to help a pregnant cow, hoping for a better outcome than when he delivered a calf at the same farm recently. Rohin Aojula teams up with the hospital's cancer specialist to perform life-saving surgery on a black Labrador."
      },
      {
        "id": "tvmaze:3000039",
        "title": "Episode 7",
        "season": 19,
        "episode": 7,
        "released": "2024-09-24",
        "overview": "A cat with a thorn in his eye causes panic at Peter Wright's practice. At his old friend Rodney's farm, Julian Norton operates on a ram, but he's feeling the pressure as the patient is Rodney's granddaughter's favourite. David Melleney treats a horse who suffered nasty wounds to three of his legs out in the field. Rohin Aojula visits a farm at a quarry, where some new-born goat kids are struggling to get milk from theirmum."
      },
      {
        "id": "tvmaze:3013266",
        "title": "Episode 8",
        "season": 19,
        "episode": 8,
        "released": "2024-10-01",
        "overview": "Peter Wright is reunited with a baby donkey called Elvis, who he saved when he was a newborn. Elvis has suddenly become lame, which is worrying his young owner. An old, one-eyed dog has a problem with his remaining eye, putting extra pressure on Julian Norton's surgery. Shona Searson battles to deliver a calf. Matt Smith rushes to help a pregnant sheep who has prolapsed. And husky lover Rohin Aojula tries somehigh-speed sledding without snow."
      },
      {
        "id": "tvmaze:3016791",
        "title": "Episode 9",
        "season": 19,
        "episode": 9,
        "released": "2024-10-08",
        "overview": "Peter Wright heads to his old friend Clive's farm, where a lamb has just been born. The experienced vet quickly delivers a problematic second... but the third baby is an even trickier proposition, because it's coming backwards. Can Peter save lamb and mum? Julian Norton meets a greedy black Labrador called Buddy, who will eat just about anything he sees! And his latest illicit snack is an important family letter. Can postman Julian deliver it, one way or another? Meanwhile there are some interesting and challenging patients for Matt Smith at the animal hospital - three meerkats from the local zoo."
      },
      {
        "id": "tvmaze:3026659",
        "title": "Episode 10",
        "season": 19,
        "episode": 10,
        "released": "2024-10-15",
        "overview": "A newborn lamb with a nasty wound is rushed into the animal hospital. Rohin Aojula knows she might not survive an anaesthetic but the procedure would be too painful for her without it. Peter Wright heads over to the Greens' farm, where young calf Pear has an upset stomach. After performing cruciate ligament surgery on a little Westie, Julian Norton must suddenly prepare for his own big knee operation when he suffers aserious mountain bike accident."
      },
      {
        "id": "tvmaze:3031740",
        "title": "Episode 11",
        "season": 19,
        "episode": 11,
        "released": "2024-10-22",
        "overview": "It's minus two degrees in Yorkshire, as Matt Smith heads out during the night to deliver a calf. But, in the freezing conditions, even with the farmers lending a hand it's a real struggle. An old friend and client who normally warms Peter Wright's heart has problems with his pony. Rohin Aojula's heart is melted by a stray kitten brought to the animal hospital. He's considering adopting her, but first she needs to come throughsurgery to see what she's eaten that's making her so poorly. After rupturing his knee ligament in a mountain bike accident, Julian Norton visits the mountain rescue team who saved him."
      },
      {
        "id": "tvmaze:3037966",
        "title": "Episode 12",
        "season": 19,
        "episode": 12,
        "released": "2024-10-29",
        "overview": "On Julian Norton's first day back in theatre after his serious knee injury, a little French bulldog needs life-saving emergency surgery. Shona Searson rushes to see a cow who's just had a calf, but is struggling with a seemingly dislocated hip. Plus, all the vets head out together to enjoy some of James Herriot's favourite parts of Yorkshire."
      },
      {
        "id": "tvmaze:3037967",
        "title": "Episode 13",
        "season": 19,
        "episode": 13,
        "released": "2024-11-05",
        "overview": "Julian Norton cares for a Mandarin duck with a badly injured leg and Peter Wright heads out to a local farm to help an inexperienced farmer with his ewe that is struggling to give birth. Shona Searson and the team put on their own lambing masterclass to help West Yorkshire farmers at the busiest time of year. Plus, Martin Paterson faces a challenging super surgery on a chihuahua puppy."
      },
      {
        "id": "tvmaze:3042952",
        "title": "Episode 14",
        "season": 19,
        "episode": 14,
        "released": "2024-11-12",
        "overview": "Julian tackles a tricky case with Lancelot the sheep, while Matt operates on Buggs, a giant rabbit with a concerning lump. Peter races to assist a farmer's beloved cow in labor after a previous calving tragedy on the same farm. David tends to Siamese kittens, worried about the tiniest one. Meanwhile, Peter surprises his friend Steve with a visit to his childhood farm in Whitby, marking 80 years since he left."
      },
      {
        "id": "tvmaze:3044920",
        "title": "Episode 15",
        "season": 19,
        "episode": 15,
        "released": "2024-11-19",
        "overview": "The Yorkshire Vet captures the real-life drama, laughter, and tears as vets across four Yorkshire practices treat animals of all shapes and sizes. This week, Matt has a daunting encounter with Manu, a caiman alligator at the zoo, and Julian's delicate surgery on a degu with an eye issue. Shona stays cautious around a bull, and Peter's urgent care helps a bichon fris struggling in labour."
      },
      {
        "id": "tvmaze:3050480",
        "title": "The Yorkshire Vet: From Herriot Land to the Highlands",
        "season": 19,
        "episode": 16,
        "released": "2024-11-26",
        "overview": "In this special episode, Julian Norton leaves Herriot Country for the Scottish Highlands, visiting the practice where he began his veterinary career in Thurso. It's not long before he is reminded just how tough a place it is to be a vet, because he's not just there for a catchup with his old mentor - he has to get his hands dirty and assist with a cow who has prolapsed, as well as an extremely challenging lambing. Back in Thirsk, Jean Green is worried about one of her cats who is passing blood."
      },
      {
        "id": "tvmaze:3071299",
        "title": "Episode 17",
        "season": 19,
        "episode": 17,
        "released": "2024-12-10",
        "overview": "David Melleney rushes out to help a farmer and her young son, whose pet ewe is struggling to give birth. Peter Wright's client is a much more experienced farmer. But his old friend Brian's cow has a strange problem that has both him and the veteran vet scratching their heads. Rohin Aojula needs to operate on his own pet cat for the second time. The first surgery saved her life after she arrived at the animal hospital as a stray. Now he's adopted her, he's feeling the nerves even more. Meanwhile, at Julian Norton's practice, the team head into theatre with an excitable springer spaniel puppy who has injured his tail."
      },
      {
        "id": "tvmaze:3077921",
        "title": "Episode 18",
        "season": 19,
        "episode": 18,
        "released": "2024-12-23",
        "overview": "With a ewe and her unborn babies in danger, Peter Wright heads to one of his most unusual lambing locations. The flock are under a railway bridge but, thanks to some rogue sheep in the road, Peter's arrival is delayed. Julian Norton hopes that cutting-edge technology can end a rough collie's serious leg problems. There's something fishy going on at the Huddersfield hospital, as Matt Smith performs surgery to remove aKoi carp's tumours. Shona Searson visits a pony with mysterious lumps on her skin. And budding young vet Lizzie, who owns Peter's favourite little donkey patient Elvis, gets her first taste of work experience on the road."
      },
      {
        "id": "tvmaze:3186033",
        "title": "Episode 1",
        "season": 20,
        "episode": 1,
        "released": "2025-03-27",
        "overview": "Can Peter Wright help a young farmer who's inherited her farm from her late father? She's having a taxing day, with her sheep struggling to give birth. Matt Smith's latest unusual patients are father and son otters atthe local zoo. Julian Norton operates on a much-loved Collie called Callie. When a rescue piglet has a badly torn ear, Rohin Aojula heads into the pig sanctuary in the woods. And it's even darker at the animal hospital in Huddersfield - all systems are down because of a power cut. But the vital surgeries have to continue, so how will the team cope?"
      },
      {
        "id": "tvmaze:3192059",
        "title": "Episode 2",
        "season": 20,
        "episode": 2,
        "released": "2025-04-03",
        "overview": "Julian Norton is called to help an elderly matriarchal alpaca, while Shona Searson's patient is a young male Shire horse called Dante, who needs surgery to calm him down. And Peter Wright's heart is melted by a nine-week old Cockapoo puppy with a deformed leg. Can he perform a successful operation to help him find a new home?"
      },
      {
        "id": "tvmaze:3192060",
        "title": "The Yorkshire Vet: Back to the 70s",
        "season": 20,
        "episode": 3,
        "released": "2025-04-10",
        "overview": "1970s fever hits Julian Norton's practice in Wetherby! But at Cannon Hall Farm, Dave Nicholson's worried about a different kind of fever. A mystery illness has struck down their prized Swiss Valais tup Albert, and Shona Searson is worried it could be serious. Peter Wright's patient is a grumpy goose called Jemima, who has a nasty-looking eye infection. And a worrying problem interrupts a happy retirement for former sheep farming team Steve and Stomp, as Rohin Aojula can see that old Collie Stomp needs life-saving surgery."
      },
      {
        "id": "tvmaze:3203579",
        "title": "Episode 4",
        "season": 20,
        "episode": 4,
        "released": "2025-04-24",
        "overview": "Martin Paterson from the Huddersfield animal hospital heads into war-torn Ukraine, travelling over 1000 miles in an ambulance loaded with medical supplies. And while he's briefly switched to helping people, he also visits a homeless animal shelter to see the effects the war is having on the country's pets. Back in Thirsk, Julian Norton's treating a rescue dog called Woody, who has a worrying tumour in a very delicate spot, which might make it tricky to remove. Peter Wright heads to visit his old farmer friend's sheep, who has a huge lump on her jaw. Matt Smith's patient at a local college is a duck with penis problems - and amputation might the only option."
      },
      {
        "id": "tvmaze:3209785",
        "title": "Episode 5",
        "season": 20,
        "episode": 5,
        "released": "2025-05-01",
        "overview": "Julian Norton visits a farm on a historic estate in Leeds to help Unicorn, a goat with one horn. Then he has to take the bull by the horns and deal with their Shetland bull. Peter Wright operates on 11-year old Jack Russell Basil, who's the customers' favourite at his owner's hair salon. Basil has a serious-looking eye problem and, if Peter can perform successful surgery, there might just be a haircut in it for him!"
      },
      {
        "id": "tvmaze:3229510",
        "title": "Episode 6",
        "season": 20,
        "episode": 6,
        "released": "2025-05-08",
        "overview": "When Julian Norton's beloved Jack Russell Emmy is sick, it gives him an idea. While he can use his vet skills to help her, he calls on his good friend, popular animal artist Lucy Pittaway, to immortalise Emmy on canvas. Peter Wright deals with a life-threatening emergency at the practice, when a pet goat called Fred is unable to urinate because of a blockage. Fearing Fred's bladder may already be ruptured, the team head into theatre to try and save him."
      },
      {
        "id": "tvmaze:3241346",
        "title": "Episode 7",
        "season": 20,
        "episode": 7,
        "released": "2025-05-15",
        "overview": "Rohin Aojula attempts to save a pregnant goat and her kid, and Peter Wright treats a working spaniel who suffered a toe injury on the moors. And Matt Smith visits some lively cows that need dehorning, providing him with a demanding workout."
      },
      {
        "id": "tvmaze:3241347",
        "title": "Episode 8",
        "season": 20,
        "episode": 8,
        "released": "2025-05-22",
        "overview": "Shona Searson tackles an unusual emergency with a pregnant sheep who has pushed out her uterus before giving birth. Peter Wright performs surgery on an elderly German shepherd whose life is in danger because of an infected womb, and Julian Norton operates on a young girl's much-loved pet goat."
      },
      {
        "id": "tvmaze:3241348",
        "title": "Episode 9",
        "season": 20,
        "episode": 9,
        "released": "2025-05-29",
        "overview": "Matt Smith is called to Cannon Hall Farm, where their star show horse has suffered a nasty cut to her eyelid. Pip the parrot is something of a rebel who even terrifies his owner Danny, so, Peter Wright is very apprehensive about cutting its claws."
      },
      {
        "id": "tvmaze:3263747",
        "title": "Episode 10",
        "season": 20,
        "episode": 10,
        "released": "2025-06-05",
        "overview": "Matt Smith rushes to save unborn twin calves, Peter Wright worries about a rabbit who has a potentially life-threatening maggot infestation, and Julian Norton operates on a French bulldog with breathing problems."
      },
      {
        "id": "tvmaze:3263748",
        "title": "Episode 11",
        "season": 20,
        "episode": 11,
        "released": "2025-06-12",
        "overview": "The team attend the Great Yorkshire Show where Peter Wright is in the show ring with Highland bull Murphy and Rob and Dave Nicholson from Cannon Hall Farm call for help. Julian Norton and Lucy enjoy a day off work trying to win a cuddly toy prize."
      },
      {
        "id": "tvmaze:3339047",
        "title": "Episode 1",
        "season": 21,
        "episode": 1,
        "released": "2025-08-26",
        "overview": "Julian Norton heads out onto the waves with his labrador patient and intrepid owner - a young lady who has broken records for swimming and sailing across oceans. Peter Wright rushes to his friend Abbie's farm up on the moors, where one of her sheep is struggling to give birth."
      },
      {
        "id": "tvmaze:3339049",
        "title": "Episode 2",
        "season": 21,
        "episode": 2,
        "released": "2025-09-02",
        "overview": "Julian Norton and nurse Lucy head to a local llama trekking centre to see Ozzy, who has an unusual eye problem. With Ozzy needing surgery, they have to set up a makeshift theatre in the barn. Peter Wright heads to see his friend's sheep who are suffering from a nasty virus which has given them swollen faces and can be passed on to people. Before Peter treats the flock, he has to round up the rebels in the field."
      },
      {
        "id": "tvmaze:3343998",
        "title": "Episode 3",
        "season": 21,
        "episode": 3,
        "released": "2025-09-09",
        "overview": "Matt Smith responds to an emergency call about a rhea who's been attacked by a pack of dogs and David Melleney treats a lamb with five legs and six feet. Julian Norton heads into theatre with on an old basset hound who has a badly damaged eye. Peter Wright enjoys a reunion with a former Skeldale colleague."
      },
      {
        "id": "tvmaze:3367519",
        "title": "Episode 4",
        "season": 21,
        "episode": 4,
        "released": "2025-09-16",
        "overview": "Peter Wright performs emergency surgery on a greedy spaniel with a history of eating clothes, and Shona Searson rushes out in the night to save a cow who's having serious problems after giving birth. A newborn lamb with eye trouble needs Rohin Aojula's help. Also, Matt Smith and Julian Norton head to the coast to operate on a zoo's miniature donkey."
      },
      {
        "id": "tvmaze:3367520",
        "title": "Episode 5",
        "season": 21,
        "episode": 5,
        "released": "2025-09-23",
        "overview": "Julian Norton embarks on an adventure through his old English sheepdog patient, and Peter Wright gets a shock when operating on a stallion. David Melleney rushes to Cannon Hall Farm, where a rare breed sheep is struggling to give birth. Rohin Aojula and nurse Jade head into theatre with Jade's pet chicken, who lays an egg on the operating table."
      },
      {
        "id": "tvmaze:3377569",
        "title": "Episode 6",
        "season": 21,
        "episode": 6,
        "released": "2025-09-30",
        "overview": "Shona Searson performs hi-tech laser surgery on a pony, and Peter Wright rushes to a newborn calf with a nasty cut. With the calf struggling to feed from her mum and especially vulnerable, Peter must act quickly. Julian Norton meets a large, intimidating Belgian hare, and Matt Smith operates on an elderly spaniel to fix an uncomfortable and embarrassing issue with her rear end."
      },
      {
        "id": "tvmaze:3377570",
        "title": "Episode 7",
        "season": 21,
        "episode": 7,
        "released": "2025-10-07",
        "overview": "With Cannon Hall Farm's alpha male alpacas at war, David Melleney rushes over when one of them suffers a nasty injury. Polo is known as 'The Sport of Kings', but one 28-year-old pony isn't feeling grand due to an eye problem. Shona Searson heads to a local dairy farm, where she must amputate a cow's badly infected tail. Julian Norton prescribes and administers cuddles to a nervous Cavapoo before surgery."
      },
      {
        "id": "tvmaze:3391374",
        "title": "Episode 8",
        "season": 21,
        "episode": 8,
        "released": "2025-10-14",
        "overview": "A farmer rushes down from the moors in need of Peter Wright's help, as his ewe is struggling with an unusual labour. Julian Norton operates on a rescue hedgehog with a badly injured foot, while Martin Paterson performs complex spinal surgery on a little French bulldog. Also, after the recent alpaca wars at Cannon Hall Farm, David Melleney hopes to restore peace once and for all by taking Stanley in hand."
      },
      {
        "id": "tvmaze:3391375",
        "title": "Episode 9",
        "season": 21,
        "episode": 9,
        "released": "2025-10-21",
        "overview": "Shona prepares for her wedding, which is due to take place in her garden, surrounded by her sheep, goats and dogs. After a night-time emergency call to help a pregnant cow give birth, she goes from wellies and waterproofs to a wedding dress fitting. At the practice in Wetherby, Julian has to operate to remove a worrying tumour from a pug, while Peter rushes to the birth of a donkey at the Greens' farm."
      },
      {
        "id": "tvmaze:3406471",
        "title": "Episode 10",
        "season": 21,
        "episode": 10,
        "released": "2025-10-28",
        "overview": "Peter Wright rushes out to help two sisters whose heifer is struggling to give birth, and Julian Norton is worried about his own 12-year-old jack russell Emmy, who has become lame. Rohin Aojula has a big problem with a little guinea pig called Vader. Also, Matt Smith has his own pig of a job - he makes a call to castrate two pet piglets."
      },
      {
        "id": "tvmaze:3431258",
        "title": "Episode 11",
        "season": 21,
        "episode": 11,
        "released": "2025-11-04",
        "overview": "Peter Wright teams up with famous dog trainer Graeme Hall to help a friend whose relentlessly loud labrador is scaring customers away from his garage. When an orphaned baby tawny owl is brought to the practice, Julian Norton comes up with a plan to nurse him back to health. Rohin Aojula rushes to help a cow that has pushed out her uterus after giving birth."
      },
      {
        "id": "tvmaze:3431259",
        "title": "Episode 12",
        "season": 21,
        "episode": 12,
        "released": "2025-11-11",
        "overview": "David Melleney rushes home from a family holiday when his own dog is badly injured, while Julian Norton operates on a lovesick skunk called Pepe. Alongside handling an emergency lambing, Peter Wright helps nurture farming's next generation by working with an agriculture student."
      }
    ]
  }
}