{
  "meta": {
    "id": "tvmaze:80486",
    "type": "series",
    "name": "Mysteries Unearthed with Danny Trejo",
    "description": "Mysteries Unearthed with Danny Trejo examines the fascinating stories surrounding buried artifacts and lost civilizations, shedding light, and offering new insight and information, on various mysteries of the past and present. Anchored by Trejo's affinity for history and his natural curiosity into exploring the unknown and coupled with captivating archival material, expert interviews, and compelling recreations, the series seeks to unearth what the human eye cannot easily detect, as objects, structures and creatures concealed under earth, ice and water are suddenly, and often accidentally, revealed. From ancient animals uncovered as permafrost melts to excavations that make international headlines, each episode explains the significance of these discoveries and offers surprising context to these amazing finds. What exciting revelations can these preserved objects expose about our history and the legends and myths that surround them?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/597/1493943.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/597/1493943.jpg",
    "videos": [
      {
        "id": "tvmaze:3439923",
        "title": "Monstrous Marvels",
        "season": 2,
        "episode": 6,
        "released": "2025-12-16",
        "overview": "Forget the monsters under your bed. The real ones, from dinosaurs to mythic beasts, are out there just waiting to be unearthed."
      },
      {
        "id": "tvmaze:3439924",
        "title": "Divine Discoveries",
        "season": 2,
        "episode": 7,
        "released": "2025-12-23",
        "overview": "Secrets of popes, rewritten laws, and cities lost to the waves — these divine discoveries shake our beliefs and uncover mysteries of truly epic proportions."
      },
      {
        "id": "tvmaze:3468853",
        "title": "Secrets from the Skies",
        "season": 2,
        "episode": 8,
        "released": "2025-12-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3439922",
        "title": "Famous Finds",
        "season": 2,
        "episode": 5,
        "released": "2025-12-09",
        "overview": "A forgotten manuscript in a dusty trunk. A priceless painting discovered in plain sight. A royal tomb hidden for millennia beneath the sands. These famous finds prove history's greatest treasures often resurface when least expected."
      },
      {
        "id": "tvmaze:3038726",
        "title": "Mysterious Structures",
        "season": 1,
        "episode": 1,
        "released": "2024-12-06",
        "overview": "From a revolutionary war era ship hiding under the streets of Manhattan, to a sprawling Roman villa unearthed in the backyard of an English home, or even an ancient Grecian maze long thought to be a myth--the strange structures uncovered in this episode sometimes lead to more questions than answers."
      },
      {
        "id": "tvmaze:3053562",
        "title": "Hidden Treasures",
        "season": 1,
        "episode": 2,
        "released": "2024-12-13",
        "overview": "We explore some of the most valuable treasures found in the most unlikely of ways. Like a priceless Ancient Roman mosaic hiding in a New York city apartment, or the most valuable piece of Americana tucked away in a $4 flea market find. You never know where the next million-dollar discovery could be uncovered."
      },
      {
        "id": "tvmaze:3053563",
        "title": "Chamber of Secrets",
        "season": 1,
        "episode": 3,
        "released": "2024-12-20",
        "overview": "From priceless treasure found inside a lost city, to an ancient manuscript hidden behind a wall, explore mysterious secrets lost deep inside various unseen chambers, like tunnels, caves, or even burial sites."
      },
      {
        "id": "tvmaze:3053565",
        "title": "Military Secrets",
        "season": 1,
        "episode": 4,
        "released": "2024-12-27",
        "overview": "From clandestine nuclear weapons programs to a secret Cold War bunker hidden in the mountains, or even World War 2 technology at the bottom of the sea, we explore the unlikely people, and surprising places behind the discoveries of the most top-secret information."
      },
      {
        "id": "tvmaze:3084164",
        "title": "Sacred Discoveries",
        "season": 1,
        "episode": 5,
        "released": "2025-01-03",
        "overview": "From ancient religious texts buried in Egypt, to cultural relics found at sea, or even a terrifying tower of skulls hiding under the earth--these lost artifacts change what we thought we knew about certain sacred beliefs."
      },
      {
        "id": "tvmaze:3084165",
        "title": "Killer Finds",
        "season": 1,
        "episode": 6,
        "released": "2025-01-17",
        "overview": "From a deadly discovery hiding under one of America's most loved national parks, to a Nazi era weapon sunk off the coast of New Jersey, or even a blood thirsty predator found in Canada--you never know where a killer find is hiding or who may stumble upon it."
      },
      {
        "id": "tvmaze:3084167",
        "title": "Beastly Revelations",
        "season": 1,
        "episode": 7,
        "released": "2025-01-24",
        "overview": "Sometimes the biggest and scariest beasts are actually a lot closer to us than we think. From a mythical monster that turns out to be real, to one of the deadliest prehistoric animals on the planet, and a frozen tundra hiding a pandora's box full of lethal pathogens--these startling discoveries shock and terrify the world."
      },
      {
        "id": "tvmaze:3122824",
        "title": "Dark and Deadly",
        "season": 1,
        "episode": 8,
        "released": "2025-01-31",
        "overview": "From a Chinese curse that turns out to be real, to human remains in a Founding Father's basement, or even a mysterious island in Central Asia with enough pathogens to kill the entire global population several times over...we uncover some of the world's most dangerous and deadly accidental discoveries."
      },
      {
        "id": "tvmaze:3391008",
        "title": "National Treasures",
        "season": 2,
        "episode": 1,
        "released": "2025-11-11",
        "overview": "From a bat swung by one of baseball's boldest pioneers, to an iconic painting hidden behind a false wall, these astonishing finds prove that America's greatest treasures can turn up in the most unlikely places."
      },
      {
        "id": "tvmaze:3423767",
        "title": "Blasts From the Past",
        "season": 2,
        "episode": 2,
        "released": "2025-11-18",
        "overview": "From WWII bombs pulled from the sea and Nazi bunkers buried in sand, to chemical weapons hidden beneath Washington, D.C., these explosive discoveries prove that history's blasts from the past can still shake our world today."
      },
      {
        "id": "tvmaze:3423768",
        "title": "Shady Secrets",
        "season": 2,
        "episode": 3,
        "released": "2025-11-25",
        "overview": "Some secrets refuse to stay buried. Whether it's illicit cargo in a frozen lake, a stolen masterpiece worth millions, or a brothel hidden in the shadow of the Capitol—the truth always resurfaces."
      },
      {
        "id": "tvmaze:3439921",
        "title": "Hidden Giants",
        "season": 2,
        "episode": 4,
        "released": "2025-12-02",
        "overview": "From a legendary city swallowed by the jungle, to an underground metropolis stretching 18 levels deep, and even a forgotten pyramid from a lost civilization, sometimes the biggest mysteries on Earth are closer than we think."
      }
    ]
  }
}