{
  "meta": {
    "id": "tvmaze:83406",
    "type": "series",
    "name": "Twelve Dates 'Til Christmas",
    "description": "Talented Saville Row textile pattern designer Kate lives in the quaint village of Blexford, England, next door to her father Mac, who is long-divorced from Kate's mother Delilah, a globe-trotting American always on an adventure.  When not at work, Kate looks after Mac, who's recovering from a motorbike accident and is inclined to spend his days sitting in his recliner.  Unbeknownst to Kate, her best friend Laura signs her up for The 12 Dates of Christmas – a holiday-themed matchmaking program in the days leading up to the holiday featuring carefully curated, yuletide dating experiences, in an attempt to get Kate out of her rut.  Lovingly coerced by Laura and longtime best friend Callum, a reluctant Kate ultimately gets into the spirit of the program and is caught off guard when she meets someone who reinvigorates her zest for life.  But when Delilah unexpectedly shows up on her doorstep – literally – Kate and Mac's life and holiday season get upended.  Meanwhile, Mac may be embarking on his own romance with local Evelyn, a widow who slowly helps him step outside the confines of his house and open his heart.  As Kate wends her way through the 12 dates, she takes a circuitous route to romance while also making some important discoveries about herself.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504735.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504735.jpg",
    "videos": [
      {
        "id": "tvmaze:3453515",
        "title": "'Tis the Season for Karma",
        "season": 1,
        "episode": 3,
        "released": "2025-12-12",
        "overview": "Kate confronts past dating patterns after she matches with someone she ghosted; Mac and Evelyn roadtrip to Brighton; Callum holds a pop-up at the Pear Tree."
      },
      {
        "id": "tvmaze:3453516",
        "title": "'Tis the Season for Mama Drama",
        "season": 1,
        "episode": 4,
        "released": "2025-12-12",
        "overview": "Kate's mother, Delilah, shows up for a holiday visit, throwing Mac and Kate for a loop; history repeating itself causes Callum and Kate to remember their past."
      },
      {
        "id": "tvmaze:3459742",
        "title": "'Tis the Season for Do-Overs",
        "season": 1,
        "episode": 5,
        "released": "2025-12-19",
        "overview": "Kate has difficult decisions to make and turns to Delilah for help; despite Laura's commitment to not meddle, she wants to make things right for Callum and Kate."
      },
      {
        "id": "tvmaze:3459743",
        "title": "'Tis the Season for Taking Chances",
        "season": 1,
        "episode": 6,
        "released": "2025-12-19",
        "overview": "As the twelfth date draws near, Kate is feeling confident in her choices; when new information comes to light, she can no longer deny her true feelings."
      },
      {
        "id": "tvmaze:3450673",
        "title": "'Tis the Season",
        "season": 1,
        "episode": 1,
        "released": "2025-12-05",
        "overview": "When Kate's best friends sign her up for a holiday-themed dating service, she reluctantly joins, but has no idea just how much her life is about to change."
      },
      {
        "id": "tvmaze:3450674",
        "title": "'Tis the Season for Red Flags",
        "season": 1,
        "episode": 2,
        "released": "2025-12-05",
        "overview": "Kate's would-be date number one, Richard, tries to reconnect; Mac attempts to prove his independence, but learns he might need to ask for help."
      }
    ]
  }
}