{
  "meta": {
    "id": "tvmaze:1526",
    "type": "series",
    "name": "RuPaul's Drag Race",
    "description": "RuPaul's Drag Race is a Primetime Emmy Award winning American reality competition television series, hosted by five time Emmy Award Winning Host and international Drag superstar RuPaul. The show features drag queen contestants competing in weekly challenges such as photo shoots, comedy performances and stomping the runway in the hopes of avoiding the bottom two - where they will have to lip sync for their lives.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/601/1503551.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/601/1503551.jpg",
    "videos": [
      {
        "id": "tvmaze:3457941",
        "title": "Episode 1",
        "season": 18,
        "episode": 1,
        "released": "2026-01-02",
        "overview": ""
      },
      {
        "id": "tvmaze:138984",
        "title": "Drag on a Dime",
        "season": 1,
        "episode": 1,
        "released": "2009-02-02",
        "overview": "On the premiere season of the hit reality television series RuPaul's Drag Race, the first queens to grace the main stage enter the work room where they begin to compete for the crown and title of America's Next Drag Superstar."
      },
      {
        "id": "tvmaze:138985",
        "title": "Girl Group Challenge",
        "season": 1,
        "episode": 2,
        "released": "2009-02-09",
        "overview": "The remaining queens form girl groups and divvy up responsibilities including hair, make up, choreography and wardrobe. For the main challenge the dolls lip sync to hit songs by Destiny's Child."
      },
      {
        "id": "tvmaze:138986",
        "title": "Queens of All Media",
        "season": 1,
        "episode": 3,
        "released": "2009-02-16",
        "overview": "The queens participate in an ode to Oprah and other talk shows and famous interviewers. On the runway the queens share their own drag creations."
      },
      {
        "id": "tvmaze:138987",
        "title": "M.A.C/Viva Glam Challenge",
        "season": 1,
        "episode": 4,
        "released": "2009-02-23",
        "overview": "In this episode, the remaining queens conceptualize their own Mac Viva Glam PSA. On the runway, the dolls serve calm before being critiqued on their video packages."
      },
      {
        "id": "tvmaze:138988",
        "title": "Drag School of Charm",
        "season": 1,
        "episode": 5,
        "released": "2009-03-02",
        "overview": "The remaining dolls get into the ring with female wrestlers. For the main challenge the queens must transform their fighter into their drag family member."
      },
      {
        "id": "tvmaze:138989",
        "title": "Absolut Drag Ball",
        "season": 1,
        "episode": 6,
        "released": "2009-03-09",
        "overview": "The final four queens compete in an old school ball challenge sponsored by Absolut Vodka. The queens are each assigned a flavor of Absolut and must then create three looks inspired by one of the following Mango, Citron, Raspberry and Mandarin."
      },
      {
        "id": "tvmaze:138990",
        "title": "Extra Special Edition",
        "season": 1,
        "episode": 7,
        "released": "2009-03-16",
        "overview": "Ru takes us through the highlights, lowlights, and never-before-seen footage from the first six episodes before the finale!"
      },
      {
        "id": "tvmaze:138991",
        "title": "Grand Finale",
        "season": 1,
        "episode": 8,
        "released": "2009-03-23",
        "overview": "The final three queens write and perform for RuPaul's music video Covergirl. After the queens walk their final runway and a winner is named."
      },
      {
        "id": "tvmaze:138992",
        "title": "Re-United!",
        "season": 1,
        "episode": 9,
        "released": "2009-03-23",
        "overview": "The contestants reunite to discuss what has happened since the competition ended."
      },
      {
        "id": "tvmaze:138993",
        "title": "Gone with the Window",
        "season": 2,
        "episode": 1,
        "released": "2010-02-01",
        "overview": "Twelve new queens compete to be America's Next Drag Superstar. The queens must reinvent their drag looks using only a set of curtains and household items."
      },
      {
        "id": "tvmaze:138994",
        "title": "Starrbootylicious",
        "season": 2,
        "episode": 2,
        "released": "2010-02-08",
        "overview": "The remaining queens make their own doll, then hit the streets and the club in an all out bootylicious challenge before hitting the runway on the main stage."
      },
      {
        "id": "tvmaze:138995",
        "title": "Country Queens",
        "season": 2,
        "episode": 3,
        "released": "2010-02-15",
        "overview": "The queens chow down on some good ole' southern hospitality before they participate in a commercial campaign for home goods. Then, they hit the runway in their best western wear."
      },
      {
        "id": "tvmaze:138996",
        "title": "The Snatch Game",
        "season": 2,
        "episode": 4,
        "released": "2010-02-22",
        "overview": "The queens participate in the first ever Snatch Game, where they must impersonate popular figures from pop culture."
      },
      {
        "id": "tvmaze:138997",
        "title": "Here Comes the Bride",
        "season": 2,
        "episode": 5,
        "released": "2010-03-08",
        "overview": "The queens participate in a photo challenge featuring the contestants in and out of drag before they hit the runway in their best wedding gown couture."
      },
      {
        "id": "tvmaze:138998",
        "title": "Rocker Chick",
        "season": 2,
        "episode": 6,
        "released": "2010-03-15",
        "overview": "The queens compete in a rock n roll challenge on the main stage. An emotional lip-sync leaves one queen on the floor."
      },
      {
        "id": "tvmaze:138999",
        "title": "Once Upon a Queen",
        "season": 2,
        "episode": 7,
        "released": "2010-03-22",
        "overview": "In the main challenge the queens write and start on the cover of their own book. On the runway, the queens show off their book release press part realness."
      },
      {
        "id": "tvmaze:139000",
        "title": "Golden Gals",
        "season": 2,
        "episode": 8,
        "released": "2010-03-29",
        "overview": "The remaining queens are paired with older gay gentlemen who they must transform into their mothers complete with cohesive looks and a sickening performance."
      },
      {
        "id": "tvmaze:139001",
        "title": "The Diva Awards",
        "season": 2,
        "episode": 9,
        "released": "2010-04-12",
        "overview": "The remaining four queens compete in the Diva Awards, a special awards show just for them. On the runway they must present multiple looks to the judges in the style of a classic NYC ball."
      },
      {
        "id": "tvmaze:139002",
        "title": "The Main Event Clip Show",
        "season": 2,
        "episode": 10,
        "released": "2010-04-19",
        "overview": "Past queens review RuPaul's Drag Race season 2. Guests include Shannel, Ongina, and many more!"
      },
      {
        "id": "tvmaze:139003",
        "title": "Grand Finale",
        "season": 2,
        "episode": 11,
        "released": "2010-04-26",
        "overview": "One queen is crowned America's Next Drag Superstar!"
      },
      {
        "id": "tvmaze:139004",
        "title": "Reunion",
        "season": 2,
        "episode": 12,
        "released": "2010-04-26",
        "overview": "The queens of RuPaul's Drag Race season 2 reunite and the claws come out."
      },
      {
        "id": "tvmaze:139005",
        "title": "The Queen Who Mopped Xmas",
        "season": 3,
        "episode": 1,
        "released": "2011-01-24",
        "overview": "The claws come out in the first challenge of the season when the girls are asked to create a holiday look with nothing but some tinsel, ornaments and a few well placed mistletoe."
      },
      {
        "id": "tvmaze:139006",
        "title": "Queens in Space",
        "season": 3,
        "episode": 2,
        "released": "2011-01-31",
        "overview": "The queens participate in a psychic challenge. After, they film spoof space films before hitting the runway in their best space themed drag."
      },
      {
        "id": "tvmaze:139007",
        "title": "Totally Leotarded",
        "season": 3,
        "episode": 3,
        "released": "2011-02-07",
        "overview": "The girls get physical as they produce their own inspirational workout videos directed by fitness guru Susan Powter."
      },
      {
        "id": "tvmaze:139008",
        "title": "QNN News",
        "season": 3,
        "episode": 4,
        "released": "2011-02-14",
        "overview": "The queens get a wake up call in the competition when they're asked to produce two morning news shows."
      },
      {
        "id": "tvmaze:139009",
        "title": "The Snatch Game",
        "season": 3,
        "episode": 5,
        "released": "2011-02-21",
        "overview": "The queens compete in a star-studded TV game show where they must pull out their best celebrity impersonations."
      },
      {
        "id": "tvmaze:139010",
        "title": "Face, Face, Face of Cakes",
        "season": 3,
        "episode": 6,
        "released": "2011-02-28",
        "overview": "The queens look good enough to eat in this episode where they're challenged to find fashion inspiration from the world of cakes."
      },
      {
        "id": "tvmaze:139011",
        "title": "Ru Ha Ha",
        "season": 3,
        "episode": 7,
        "released": "2011-03-07",
        "overview": "The queens perform stand-up comedy routines in front of a live studio audience!"
      },
      {
        "id": "tvmaze:139012",
        "title": "Life, Liberty & the Pursuit of Style",
        "season": 3,
        "episode": 8,
        "released": "2011-03-14",
        "overview": "The queens create patriotic video messages for the troops."
      },
      {
        "id": "tvmaze:139013",
        "title": "RuPaul-a-Palooza",
        "season": 3,
        "episode": 9,
        "released": "2011-03-21",
        "overview": "The queens record and perform their own version of Ru's new song, \"Superstar\", in one of six distinct musical styles!"
      },
      {
        "id": "tvmaze:139014",
        "title": "RuPaul's Hair Extravaganza",
        "season": 3,
        "episode": 10,
        "released": "2011-03-28",
        "overview": "The queens wig out when they have to compete in a fantasy hair show."
      },
      {
        "id": "tvmaze:139015",
        "title": "Jocks in Frocks",
        "season": 3,
        "episode": 11,
        "released": "2011-04-04",
        "overview": "The queens must transform a group of All-American straight jocks into their drag sisters."
      },
      {
        "id": "tvmaze:139016",
        "title": "Make Dat Money",
        "season": 3,
        "episode": 12,
        "released": "2011-04-11",
        "overview": "The queens break the bank as they perform in a pageant of dresses made out of money."
      },
      {
        "id": "tvmaze:139017",
        "title": "RuPaul Rewind",
        "season": 3,
        "episode": 13,
        "released": "2011-04-18",
        "overview": "A look back at the highlights, low-lights and previously unseen footage from the first 13 episodes."
      },
      {
        "id": "tvmaze:139018",
        "title": "Grand Finale",
        "season": 3,
        "episode": 14,
        "released": "2011-04-25",
        "overview": "The remaining three queens face their final challenge when they're asked to transform into video vixens for the music video to Ru's latest single, \"Champion.\""
      },
      {
        "id": "tvmaze:139019",
        "title": "Reunited",
        "season": 3,
        "episode": 15,
        "released": "2011-05-02",
        "overview": "Wigs fly as the queens return to discuss the drama of the season."
      },
      {
        "id": "tvmaze:139020",
        "title": "RuPocalypse Now!",
        "season": 4,
        "episode": 1,
        "released": "2012-01-30",
        "overview": "In the season 4 premiere, a new crop of queens enter the workroom, participate in an atomic photoshoot then hit the runway in their best post-apocalyptic drag."
      },
      {
        "id": "tvmaze:139021",
        "title": "WTF!: Wrestling's Trashiest Fighters",
        "season": 4,
        "episode": 2,
        "released": "2012-02-06",
        "overview": "The remaining queens participate in a group acting challenge all about wrestling! On the runway, the queens don their most girly-girl drag."
      },
      {
        "id": "tvmaze:139022",
        "title": "Glamazons vs. Champions",
        "season": 4,
        "episode": 3,
        "released": "2012-02-13",
        "overview": "The queens participate in an informercial-style challenge where they must sell one of two albums, Glamazon and Champion. On the runway, the queens dress up in silver and gold."
      },
      {
        "id": "tvmaze:139023",
        "title": "Queens Behind Bars",
        "season": 4,
        "episode": 4,
        "released": "2012-02-20",
        "overview": "The queens participate in an acting challenge where they split into two casts and create a spoof of a classic sitcom. On the runway, the queens are asked to dress up for their television premiere."
      },
      {
        "id": "tvmaze:139024",
        "title": "Snatch Game",
        "season": 4,
        "episode": 5,
        "released": "2012-02-27",
        "overview": "The queens participate in the infamous Snatch Game, where they must impersonate pop culture celebrities. On the runway they are challenged to dress to impress."
      },
      {
        "id": "tvmaze:139025",
        "title": "Float Your Boat",
        "season": 4,
        "episode": 6,
        "released": "2012-03-05",
        "overview": "The remaining queens are assigned various colors of the pride flag and must decorate a parade boat to hit the main stage in."
      },
      {
        "id": "tvmaze:139026",
        "title": "Dragazines",
        "season": 4,
        "episode": 7,
        "released": "2012-03-12",
        "overview": "The remaining queens design magazine covers that are sure to sell hot off the press. On the runway, the queens dress for their magazine release party!"
      },
      {
        "id": "tvmaze:139027",
        "title": "Frenemies",
        "season": 4,
        "episode": 8,
        "released": "2012-03-19",
        "overview": "The queens participate in a polygraph test. After, the queens participate in a musical challenge where they are paired up with their perfect frenemy."
      },
      {
        "id": "tvmaze:139028",
        "title": "Frock the Vote!",
        "season": 4,
        "episode": 9,
        "released": "2012-03-26",
        "overview": "The remaining queens participate in an election challenge hosted by Dan Savage. After, the dolls hit the runway in their best inaugural drag."
      },
      {
        "id": "tvmaze:139029",
        "title": "DILFs: Dads I'd like to Frock",
        "season": 4,
        "episode": 10,
        "released": "2012-04-02",
        "overview": "In a shocking twist, one queen is brought back into the competition. After, the remaining queens must turn hot dads into their drag sisters."
      },
      {
        "id": "tvmaze:139030",
        "title": "The Fabulous B*tch Ball",
        "season": 4,
        "episode": 11,
        "released": "2012-04-09",
        "overview": "The final four must compete in the Fabulous Bitch Ball where they must serve their different looks and perform a musical number in front of the judges."
      },
      {
        "id": "tvmaze:139031",
        "title": "RuPaul Rewind",
        "season": 4,
        "episode": 12,
        "released": "2012-04-16",
        "overview": "In this special episode, we take a look back on season 4 of RuPaul's Drag Race."
      },
      {
        "id": "tvmaze:139032",
        "title": "The Final Three",
        "season": 4,
        "episode": 13,
        "released": "2012-04-23",
        "overview": "The final three film a music video for RuPaul's song Glamazon. Then the queens walk the runway in their best drag for their final walk on the main stage."
      },
      {
        "id": "tvmaze:139033",
        "title": "Reunion",
        "season": 4,
        "episode": 14,
        "released": "2012-04-30",
        "overview": "The queens of season 4 of RuPaul's Drag Race Reunite and a winner is announced!"
      },
      {
        "id": "tvmaze:139034",
        "title": "RuPaullywood or Bust",
        "season": 5,
        "episode": 1,
        "released": "2013-01-28",
        "overview": "In the season five premiere, fourteen new drag queens compete for the title of America's Next Drag Superstar with a prize package including a life time supply of Color Evolution cosmetics, a one of a kind trip courtesy of ALandCHUCK.travel, headline Logo's Drag Race tour featuring Absolut Vodka cocktails perfected, and $100,000. In the mini challenge, they have an \"underwater serving glamor\" photo shoot. In the main challenge, they dumpster dive for materials to create an \"award winning look that screams Hollywood red carpet couture\" to wear on the runway."
      },
      {
        "id": "tvmaze:139035",
        "title": "Lip Synch Extravaganza Eleganza",
        "season": 5,
        "episode": 2,
        "released": "2013-02-04",
        "overview": "The contestants must lip-synch to the spoken word, as they recreate classic moments from Drag Race history in scene-stealing viral videos."
      },
      {
        "id": "tvmaze:139036",
        "title": "Draggle Rock",
        "season": 5,
        "episode": 3,
        "released": "2013-02-11",
        "overview": "The queens connect with their inner child as they star in a fun-filled kids TV show!"
      },
      {
        "id": "tvmaze:139037",
        "title": "Black Swan: Why It Gotta Be Black?",
        "season": 5,
        "episode": 4,
        "released": "2013-02-18",
        "overview": "This week, the queens are challenged to prove their elegance and dancing skills by starring in a ballet based on the life of RuPaul, and on the runway, are asked to present 'extravaganza' looks."
      },
      {
        "id": "tvmaze:139038",
        "title": "Snatch Game",
        "season": 5,
        "episode": 5,
        "released": "2013-02-25",
        "overview": "The one we've all been waiting for! The queens compete in a star-studded TV game show that showcases their celebrity impersonations."
      },
      {
        "id": "tvmaze:139039",
        "title": "Can I Get an Amen?",
        "season": 5,
        "episode": 6,
        "released": "2013-03-04",
        "overview": "The queens test their vocal abilities as they sing in RuPaul's 1980s \"We Are The World\"-inspired charity single."
      },
      {
        "id": "tvmaze:139040",
        "title": "RuPaul Roast",
        "season": 5,
        "episode": 7,
        "released": "2013-03-11",
        "overview": "The queens' comedy skills are put on the spot as they must roast RuPaul and the celebrity judges in front of a live audience."
      },
      {
        "id": "tvmaze:139041",
        "title": "Scent of a Drag Queen",
        "season": 5,
        "episode": 8,
        "released": "2013-03-18",
        "overview": "The queens create, market and film a commercial for their own signature fragrance, then celebrate with a launch party!"
      },
      {
        "id": "tvmaze:139042",
        "title": "Drama Queens",
        "season": 5,
        "episode": 9,
        "released": "2013-04-01",
        "overview": "The competition gets spicy as the queens star with Wilmer Valderrama in a sexy Latin telenovela acting challenge"
      },
      {
        "id": "tvmaze:139043",
        "title": "Super Troopers",
        "season": 5,
        "episode": 10,
        "released": "2013-04-08",
        "overview": "The queens transform gay veterans into gorgeous queens! Then, they perform a patriotic flag salute before walking the runway showing off their new drag mothers and sisters."
      },
      {
        "id": "tvmaze:139044",
        "title": "Sugar Ball",
        "season": 5,
        "episode": 11,
        "released": "2013-04-15",
        "overview": "The race gets sticky and sweet when the queens compete in a pageant of candy inspired couture."
      },
      {
        "id": "tvmaze:139045",
        "title": "The Final Three, Hunty",
        "season": 5,
        "episode": 12,
        "released": "2013-04-22",
        "overview": "The top three queens go to court, as Judge Ru presents their final challenge - starring in the music video for RuPaul's hit \"The Beginning.\""
      },
      {
        "id": "tvmaze:139046",
        "title": "Countdown to the Crown",
        "season": 5,
        "episode": 13,
        "released": "2013-04-29",
        "overview": "A look back on the highlights, low-lights, and previously unseen footage from the season as we race toward the climactic crowning of America's Next Drag Superstar."
      },
      {
        "id": "tvmaze:139047",
        "title": "Reunited!",
        "season": 5,
        "episode": 14,
        "released": "2013-05-06",
        "overview": "Wigs fly as the queens discuss the drama of the season. Plus, both \"America's Next Drag Superstar\" and \"Miss Congeniality\" are crowned"
      },
      {
        "id": "tvmaze:139048",
        "title": "RuPaul's Big Opening: Part 1",
        "season": 6,
        "episode": 1,
        "released": "2014-02-24",
        "overview": "The first half of contestants enter the work room, participate in a photo challenge and hit the runway in television inspired couture."
      },
      {
        "id": "tvmaze:139049",
        "title": "RuPaul's Big Opening: Part 2",
        "season": 6,
        "episode": 2,
        "released": "2014-03-03",
        "overview": "The second half of contestants enter the workroom, participate in a photo shoot and create couture from celebratory themed boxes."
      },
      {
        "id": "tvmaze:139050",
        "title": "Scream Queens",
        "season": 6,
        "episode": 3,
        "released": "2014-03-10",
        "overview": "The remaining queens participate in a horror movie acting challenge after being split into two teams. On the runway the queens don their best drag and stun the judges."
      },
      {
        "id": "tvmaze:139051",
        "title": "Shade: The Rusical",
        "season": 6,
        "episode": 4,
        "released": "2014-03-17",
        "overview": "The remaining queens participate in a musical called Shade: The Rusical. After, the contestants take on the runway in their best red carpet gowns."
      },
      {
        "id": "tvmaze:139052",
        "title": "Snatch Game",
        "season": 6,
        "episode": 5,
        "released": "2014-03-24",
        "overview": "The remaining queens compete as celebrities in the infamous Snatch Game. On the runway the dolls dress up in RuPaul inspired drag."
      },
      {
        "id": "tvmaze:139053",
        "title": "Oh No She Betta Don't",
        "season": 6,
        "episode": 6,
        "released": "2014-03-31",
        "overview": "The queens make a music video for Oh No She Betta Don't and wear their crazy, sexy cool that accentuate their favourite body part."
      },
      {
        "id": "tvmaze:139054",
        "title": "Glamazon by Colorevolution",
        "season": 6,
        "episode": 7,
        "released": "2014-04-07",
        "overview": "On this episode, the remaining queens pair up into teams of two and create advertisements for RuPaul's Glamazon by Colorevolution. Then, the queens stomp the runway in black and white."
      },
      {
        "id": "tvmaze:139055",
        "title": "Drag Queens of Comedy",
        "season": 6,
        "episode": 8,
        "released": "2014-04-07",
        "overview": "The remaining queens participate in a stand up comedy challenge that results in one of the girls becoming emotional."
      },
      {
        "id": "tvmaze:139056",
        "title": "Drag Queens of Talk",
        "season": 6,
        "episode": 9,
        "released": "2014-04-14",
        "overview": "The remaining contestants host a talk show segment then hit the runway in their best animal inspired drag."
      },
      {
        "id": "tvmaze:139057",
        "title": "Drag My Wedding",
        "season": 6,
        "episode": 10,
        "released": "2014-04-21",
        "overview": "The queens are paired up with men that they must transform into wedding clad drag daughters before giving them away for marriage."
      },
      {
        "id": "tvmaze:139058",
        "title": "Glitter Ball",
        "season": 6,
        "episode": 11,
        "released": "2014-04-28",
        "overview": "The final five compete in The Glitter Ball where they must show three looks; Banjie Girl Realness, Executive Realness and Glitter Extravaganza."
      },
      {
        "id": "tvmaze:139059",
        "title": "Sissy That Walk!",
        "season": 6,
        "episode": 12,
        "released": "2014-05-05",
        "overview": "The final four queens star in RuPaul's 'Sissy That Walk' music video then campaign their reasons for being America's Next Drag Superstar"
      },
      {
        "id": "tvmaze:139060",
        "title": "Countdown to the Crown",
        "season": 6,
        "episode": 13,
        "released": "2014-05-12",
        "overview": "Take a look back at RuPaul's Drag Race Season 6!"
      },
      {
        "id": "tvmaze:139061",
        "title": "The Finale",
        "season": 6,
        "episode": 14,
        "released": "2014-05-19",
        "overview": "The queens of season 6 of RuPaul's Drag Race reunite and a winner is crowned."
      },
      {
        "id": "tvmaze:139062",
        "title": "Born Naked",
        "season": 7,
        "episode": 1,
        "released": "2015-03-02",
        "overview": "Fourteen new queens enter the work room, walk a spring and winter themed runway, then hit the main stage in their best nude illusion!"
      },
      {
        "id": "tvmaze:142523",
        "title": "Glamazonian Airways",
        "season": 7,
        "episode": 2,
        "released": "2015-03-09",
        "overview": "In this episode, the queens perform in Glamazonian Airways, a lip syncing group challenge. On the runway the queen show off their best first class jet setting looks."
      },
      {
        "id": "tvmaze:142524",
        "title": "ShakesQueer",
        "season": 7,
        "episode": 3,
        "released": "2015-03-16",
        "overview": "The queens perform in a Shakespeare-themed acting challenge then hit the main stage in their best bearded looks."
      },
      {
        "id": "tvmaze:151565",
        "title": "Spoof! (There It Is)",
        "season": 7,
        "episode": 4,
        "released": "2015-03-23",
        "overview": "The queens make spoof parody videos of RuPaul hits and stun Michelle in their best green looks."
      },
      {
        "id": "tvmaze:151566",
        "title": "The DESPY Awards",
        "season": 7,
        "episode": 5,
        "released": "2015-03-30",
        "overview": "The queens hit the main stage for an awards show challenge in their best and most glamorous gowns."
      },
      {
        "id": "tvmaze:151567",
        "title": "Ru Hollywood Stories",
        "season": 7,
        "episode": 6,
        "released": "2015-04-06",
        "overview": "The remaining queens act in Ru Hollywood Stories then hit the runway with Death Becomes Her inspired runway."
      },
      {
        "id": "tvmaze:153943",
        "title": "Snatch Game",
        "season": 7,
        "episode": 7,
        "released": "2015-04-13",
        "overview": "The remaining dolls compete in the infamous Snatch Game challenge! After, the queens take the runway in leather and lace couture."
      },
      {
        "id": "tvmaze:153910",
        "title": "Conjoined Queens",
        "season": 7,
        "episode": 8,
        "released": "2015-04-20",
        "overview": "In a turn of events, the past eliminated queens come back to the competition to vie for a coveted spot allowing them to return to the competition."
      },
      {
        "id": "tvmaze:153911",
        "title": "Divine Inspiration",
        "season": 7,
        "episode": 9,
        "released": "2015-04-27",
        "overview": "The queens perform in musical versions of cult director John Waters' most iconic films. With guest judges Demi Lovato and John Waters."
      },
      {
        "id": "tvmaze:155573",
        "title": "Prancing Queens",
        "season": 7,
        "episode": 10,
        "released": "2015-05-04",
        "overview": "The queens are challenged to prance their padded asses off in a live drag dance spectacular. With guest judges Alyssa Milano (Charmed) and comedian Rachael Harris (The Hangover)."
      },
      {
        "id": "tvmaze:155574",
        "title": "Hello, Kitty Girls!",
        "season": 7,
        "episode": 11,
        "released": "2015-05-11",
        "overview": "This episode, the queens are surprised by Hello Kitty, then compete in a Kitty Girl Ball!"
      },
      {
        "id": "tvmaze:155575",
        "title": "And the Rest Is Drag",
        "season": 7,
        "episode": 12,
        "released": "2015-05-18",
        "overview": "The remaining queens star in RuPaul's music video for Born Naked. After, they show off their best drag to the judges."
      },
      {
        "id": "tvmaze:161224",
        "title": "Countdown to the Crown",
        "season": 7,
        "episode": 13,
        "released": "2015-05-25",
        "overview": "Take a look back at RuPaul's Drag Race season 7!"
      },
      {
        "id": "tvmaze:161225",
        "title": "Reunited!",
        "season": 7,
        "episode": 14,
        "released": "2015-06-01",
        "overview": "The queens of RuPaul's Drag Race season 7 reunite and one queen is crowned the winner!"
      },
      {
        "id": "tvmaze:620097",
        "title": "Keeping It 100!",
        "season": 8,
        "episode": 1,
        "released": "2016-03-07",
        "overview": "Season 8 premieres with the 100th episode and the 100th queen competing to become America's Drag Superstar. The first test is to create an outfit from a legendary design challenge from a past season. Guest judge Nicole Richie."
      },
      {
        "id": "tvmaze:633833",
        "title": "Bitch Perfect",
        "season": 8,
        "episode": 2,
        "released": "2016-03-14",
        "overview": "The queens are challenged to perform in a collegiate, all-queen drag-appella sing-off. With guest judges Ester Dean (Pitch Perfect, Pitch Perfect 2), choreographer Jamal Sims and RuPaul's music producer Lucian Piane."
      },
      {
        "id": "tvmaze:653041",
        "title": "RuCo's Empire",
        "season": 8,
        "episode": 3,
        "released": "2016-03-21",
        "overview": "The queens get their Cookie on in two Empire-inspired scenes. With guest judges Tasha Smith (Empire) and singer-songwriter Faith Evans."
      },
      {
        "id": "tvmaze:516023",
        "title": "New Wave Queens",
        "season": 8,
        "episode": 4,
        "released": "2016-03-28",
        "overview": "The queens have to sing live in ‘80s style New Wave girl bands. Blondie's Debbie Harry and Chris Stein guest judge, plus RuPaul's music producer Lucian Piane."
      },
      {
        "id": "tvmaze:666116",
        "title": "Supermodel Snatch Game",
        "season": 8,
        "episode": 5,
        "released": "2016-04-04",
        "overview": "The queens impersonate celebrities in a quick-witted TV game show, and dress in iconic Madonna looks for the runway. With supermodel guest judges Gigi Hadid and Chanel Iman."
      },
      {
        "id": "tvmaze:678070",
        "title": "Wizards of Drag",
        "season": 8,
        "episode": 6,
        "released": "2016-04-11",
        "overview": "The queens give cast members of Little Women: LA drag makeovers in the style of The Wizard of Oz. Fashion designer Marc Jacobs and singer-songwriter Todrick Hall guest judge."
      },
      {
        "id": "tvmaze:697307",
        "title": "Shady Politics",
        "season": 8,
        "episode": 7,
        "released": "2016-04-18",
        "overview": "The queens shoot shady presidential campaign ads, throwing their wigs in the ring to become the first drag president of the USA. Vivica A. Fox (Independence Day: Resurgence) and MSNBC Live news anchor Thomas Roberts guest judge."
      },
      {
        "id": "tvmaze:708652",
        "title": "RuPaul Book Ball",
        "season": 8,
        "episode": 8,
        "released": "2016-04-25",
        "overview": "The queens compete in a pageant of book inspired couture, and perform a musical tribute to Jerri Blank from Strangers With Candy. Siblings Amy Sedaris and David Sedaris guest judge."
      },
      {
        "id": "tvmaze:738577",
        "title": "The Realness",
        "season": 8,
        "episode": 9,
        "released": "2016-05-02",
        "overview": "The queens compete in their final challenge, starring in the music video for RuPaul's hit \"The Realness\"; Michelle Visage, Carson Kressley and Ross Mathews judge."
      },
      {
        "id": "tvmaze:747157",
        "title": "Grand Finale",
        "season": 8,
        "episode": 10,
        "released": "2016-05-16",
        "overview": "Tensions run high as the queens return to discuss the drama of the season. Plus, both \"America's Next Drag Superstar\" and \"Miss Congeniality\" are crowned."
      },
      {
        "id": "tvmaze:1059106",
        "title": "Oh. My. Gaga!",
        "season": 9,
        "episode": 1,
        "released": "2017-03-24",
        "overview": "Lady Gaga drops by to meet the 13 new queens competing to become America's Next Drag Superstar. Their first test is to compete in the Miss Charisma Uniqueness Nerve and Talent pageant."
      },
      {
        "id": "tvmaze:1098800",
        "title": "She Done Already Done Brought It On",
        "season": 9,
        "episode": 2,
        "released": "2017-03-31",
        "overview": "Lisa Kudrow from Friends stops by, and the queens are challenged to perform in an epic cheer battle. With guest judges The B-52s."
      },
      {
        "id": "tvmaze:1106367",
        "title": "Draggily Ever After",
        "season": 9,
        "episode": 3,
        "released": "2017-04-07",
        "overview": "The queens must create fairytale drag princesses, and transform themselves into sassy sidekicks. With guest judges Todrick Hall and Cheyenne Jackson."
      },
      {
        "id": "tvmaze:1106368",
        "title": "Good Morning Bitches",
        "season": 9,
        "episode": 4,
        "released": "2017-04-14",
        "overview": "The queens join the cutthroat Morning Talk Show wars. Naya Rivera (Glee) and Jeffrey Bowyer-Chapman guest judge."
      },
      {
        "id": "tvmaze:1126312",
        "title": "Kardashian: The Musical",
        "season": 9,
        "episode": 5,
        "released": "2017-04-21",
        "overview": "Todrick Hall directs the queens in Broadway's newest mega-sensation, the Kardashian musical. Singer Meghan Trainor guest judges."
      },
      {
        "id": "tvmaze:1133742",
        "title": "Snatch Game",
        "season": 9,
        "episode": 6,
        "released": "2017-04-28",
        "overview": "The Queens impersonate celebrities in a TV game show. Candis Cayne and Denis O'Hare guest judge."
      },
      {
        "id": "tvmaze:1135710",
        "title": "9021-HO",
        "season": 9,
        "episode": 7,
        "released": "2017-05-05",
        "overview": "The queens act in a classic '90s high-school drama directed by original \"Beverly Hills 90210\" stars Tori Spelling and Jennie Garth."
      },
      {
        "id": "tvmaze:1135711",
        "title": "RuPaul Roast",
        "season": 9,
        "episode": 8,
        "released": "2017-05-12",
        "overview": "The queens perform a comedy roast on Michelle Visage in front of a live audience. Singer Tamar Braxton and Fortune Feimster (The Mindy Project) guest judge."
      },
      {
        "id": "tvmaze:1135712",
        "title": "Your Pilot's on Fire",
        "season": 9,
        "episode": 9,
        "released": "2017-05-19",
        "overview": "The queens create, write, and star in their own TV pilots. Noah Galvin (The Real O'Neals) and QVC queen Lisa Robertson guest judge."
      },
      {
        "id": "tvmaze:1175014",
        "title": "Makeovers: Crew Better Work",
        "season": 9,
        "episode": 10,
        "released": "2017-05-26",
        "overview": "The six remaining drag queens were asked by RuPaul to give make-overs of themselves, and six crew members of RuPaul's Drag Race."
      },
      {
        "id": "tvmaze:1177558",
        "title": "Gayest Ball Ever",
        "season": 9,
        "episode": 11,
        "released": "2017-06-02",
        "overview": "The queens must participate in the Gayest Ball Ever and create three different outfits based off three categories: Rainbow-She-Betta-Do, Sexy Unicorn and Village People Eleganza Extravaganza."
      },
      {
        "id": "tvmaze:1178042",
        "title": "Category Is",
        "season": 9,
        "episode": 12,
        "released": "2017-06-09",
        "overview": "The four remaining drag queens were asked by RuPaul to write, produce and choreograph an original verse for the remix of his song \"Category Is\"; additionally, each queen were ask to guest star on RuPaul's podcast What's the Tee?, featuring panel judge Michelle Visage."
      },
      {
        "id": "tvmaze:1178043",
        "title": "Reunion",
        "season": 9,
        "episode": 13,
        "released": "2017-06-16",
        "overview": "In a reunion episode, the contestants reminisce over the season and Miss Congeniality is announced!"
      },
      {
        "id": "tvmaze:1213916",
        "title": "Finale",
        "season": 9,
        "episode": 14,
        "released": "2017-06-23",
        "overview": "The final four contestants lip-sync in groups of two to see who will become America's Next Drag Superstar."
      },
      {
        "id": "tvmaze:1412576",
        "title": "10s Across The Board",
        "season": 10,
        "episode": 1,
        "released": "2018-03-22",
        "overview": "Christina Aguilera stunts on the mainstage. Plus, fan favorite queens from the past decade of Drag Race return as 14 new queens compete to become America's Next Drag Superstar and win $100,000."
      },
      {
        "id": "tvmaze:1432559",
        "title": "PharmaRusical",
        "season": 10,
        "episode": 2,
        "released": "2018-03-29",
        "overview": "The queens perform a dance number with some lip-syncing that is inspired by pharmaceutical TV ads."
      },
      {
        "id": "tvmaze:1437183",
        "title": "Tap That App",
        "season": 10,
        "episode": 3,
        "released": "2018-04-05",
        "overview": "The queens create and star in commercials for new Drag-themed dating apps."
      },
      {
        "id": "tvmaze:1442854",
        "title": "The Last Ball On Earth",
        "season": 10,
        "episode": 4,
        "released": "2018-04-12",
        "overview": "The queens cook up global warming friendly looks for the last ball ever."
      },
      {
        "id": "tvmaze:1442856",
        "title": "The Bossy Rossy Show",
        "season": 10,
        "episode": 5,
        "released": "2018-04-19",
        "overview": "The queens' improv skills are put to the test for a new talk show, \"Bossy Rossy,\" hosted by Ross Mathews."
      },
      {
        "id": "tvmaze:1456566",
        "title": "Drag Con Panel Extravaganza",
        "season": 10,
        "episode": 6,
        "released": "2018-04-26",
        "overview": "The queens have to produce and host their very own Drag Con panels on Makeup, Hair and Body. Kumail Nanjiani and Emily Gordon, the husband-and-wife duo behind the Oscar-nominated film \"The Big Sick,\" guest judge."
      },
      {
        "id": "tvmaze:1460209",
        "title": "Snatch Game",
        "season": 10,
        "episode": 7,
        "released": "2018-05-03",
        "overview": "The queens must impersonate their favorite celebrities for the legendary Snatch Game. Audra McDonald and Kate Upton guest judge; Bianca Del Rio and Alex Trebek are special guests."
      },
      {
        "id": "tvmaze:1460210",
        "title": "The Unauthorized Rusical",
        "season": 10,
        "episode": 8,
        "released": "2018-05-10",
        "overview": "The queens pay tribute to one of the greatest stars of all time in \"Cher: The Unauthorized Rusical.\""
      },
      {
        "id": "tvmaze:1466555",
        "title": "Breastworld",
        "season": 10,
        "episode": 9,
        "released": "2018-05-17",
        "overview": "The queens are assigned parts and must act in the new hit series, \"Breastworld\". Broad City stars Ilana Glazer and Abbi Jacobson guest judge; Randy Rainbow and Steven Colbert are special guests."
      },
      {
        "id": "tvmaze:1469042",
        "title": "Social Media Kings Into Queens",
        "season": 10,
        "episode": 10,
        "released": "2018-05-24",
        "overview": "The queens give drag makeovers to social media superstars."
      },
      {
        "id": "tvmaze:1472801",
        "title": "Evil Twins",
        "season": 10,
        "episode": 11,
        "released": "2018-06-07",
        "overview": "The queens present two characters on the runway."
      },
      {
        "id": "tvmaze:1472800",
        "title": "American",
        "season": 10,
        "episode": 12,
        "released": "2018-06-14",
        "overview": "The top four queens must write and perform a verse in a performance of RuPaul's hit single, 'American', and guest on RuPaul's podcast with Michelle Visage."
      },
      {
        "id": "tvmaze:1471203",
        "title": "Queens Reunited",
        "season": 10,
        "episode": 13,
        "released": "2018-06-21",
        "overview": "One week from the Grand Finale, all Season 10 queens return to discuss the season's gaggiest moments. Includes never-before-seen footage, jaw-dropping revelations, and a recap of the seasons' most amazing looks."
      },
      {
        "id": "tvmaze:1471204",
        "title": "Grand Finale",
        "season": 10,
        "episode": 14,
        "released": "2018-06-28",
        "overview": "RuPaul crowns America's Next Drag Superstar in an epic lip-sync smack-down for the crown."
      },
      {
        "id": "tvmaze:1606612",
        "title": "Whatcha Unpackin'?",
        "season": 11,
        "episode": 1,
        "released": "2019-02-28",
        "overview": "Miley Cyrus goes undercover in the workroom to spy on the new cast of queens competing for $100,000. The first test is to create signature looks from materials belonging to former Drag Race legends."
      },
      {
        "id": "tvmaze:1606613",
        "title": "Good God, Girl, Get Out",
        "season": 11,
        "episode": 2,
        "released": "2019-03-07",
        "overview": "The queens must act in drag queen versions of recent Black Empowerment blockbuster movies. Actors Sydelle Noel (Black Panther) and Bobby Moynihan (Saturday Night Live) guest judge."
      },
      {
        "id": "tvmaze:1606614",
        "title": "Diva Worship",
        "season": 11,
        "episode": 3,
        "released": "2019-03-14",
        "overview": "The queens put their pop icon knowledge to the test when they have to perform in diva worship talk shows; actor Troye Sivan (\"Boy Erased\") and actor Guillermo Diaz (\"Scandal\") guest judge."
      },
      {
        "id": "tvmaze:1606615",
        "title": "Trump: The Rusical",
        "season": 11,
        "episode": 4,
        "released": "2019-03-21",
        "overview": "The queens get political in a \"Grease\" inspired musical set in the \"Trump School For Girls\". Rachel Maddow makes a guest appearance, while Tiffany \"New York\" Pollard and Joel McHale guest judge."
      },
      {
        "id": "tvmaze:1606616",
        "title": "Monster Ball",
        "season": 11,
        "episode": 5,
        "released": "2019-03-28",
        "overview": "The queens compete in a spooky pageant of monster inspired couture and showcase three Halloween inspired looks. Supermodel Cara Delevingne and pop culture icon Elvira guest judge."
      },
      {
        "id": "tvmaze:1606617",
        "title": "The Draglympics",
        "season": 11,
        "episode": 6,
        "released": "2019-04-04",
        "overview": "The queens get physical in the 69th International Draglympics. Choreographer Travis Wall and Olympian figure skaters Mirai Nagasu and Adam Rippon guest judge. Camp aerobicize queen Love Connie makes a guest appearance."
      },
      {
        "id": "tvmaze:1606618",
        "title": "From Farm to Runway",
        "season": 11,
        "episode": 7,
        "released": "2019-04-11",
        "overview": "The queens use organic ingredients to create sickening but sustainable high fashion looks. Supermodel Amber Valletta and reality star Kandi Burruss guest judge. Drag queen Alyssa Edwards makes a guest appearance."
      },
      {
        "id": "tvmaze:1606619",
        "title": "Snatch Game At Sea",
        "season": 11,
        "episode": 8,
        "released": "2019-04-18",
        "overview": "The queens compete in a nautical-themed version of the legendary Snatch Game. Veep co-stars Tony Hale and Clea DuVall guest judge. Drag queen Jinkx Monsoon makes a guest appearance."
      },
      {
        "id": "tvmaze:1606620",
        "title": "LADP!",
        "season": 11,
        "episode": 9,
        "released": "2019-04-25",
        "overview": "The queens clash with the law in the hit TV series \"Los Angeles Drag Patrol\". Natasha Lyonne (Russian Doll), Cheyenne Jackson (American Horror Story) and Fortune Feimster (The Mindy Project) guest judge."
      },
      {
        "id": "tvmaze:1606621",
        "title": "Dragracadabra",
        "season": 11,
        "episode": 10,
        "released": "2019-05-02",
        "overview": "The queens must razzle and dazzle in their very own magic show. Gina Rodriguez (Jane the Virgin) and Katherine Langford (13 Reasons Why) guest judge."
      },
      {
        "id": "tvmaze:1606622",
        "title": "Bring Back My Queens!",
        "season": 11,
        "episode": 11,
        "released": "2019-05-09",
        "overview": "The queens makeover returning queens, transforming them into a member of their own drag family. Lena Waithe (The Chi) and comedian Wanda Sykes guest judge."
      },
      {
        "id": "tvmaze:1606623",
        "title": "Queens Everywhere",
        "season": 11,
        "episode": 12,
        "released": "2019-05-16",
        "overview": "The queens must write and record a verse in a performance of RuPaul's hit single \"Queens Everywhere\", and guest on RuPaul's podcast with Michelle Visage. Choreographer Todrick Hall, style superstar Carson Kressley and Ross Matthews guest judge."
      },
      {
        "id": "tvmaze:1606624",
        "title": "Reunited",
        "season": 11,
        "episode": 13,
        "released": "2019-05-23",
        "overview": "One episode away from the Grand Finale, the contestants return to discuss the season's gaggiest moments."
      },
      {
        "id": "tvmaze:1606625",
        "title": "Grand Finale",
        "season": 11,
        "episode": 14,
        "released": "2019-05-30",
        "overview": "RuPaul crowns America's next drag superstar in an epic lip-sync smack-down for the crown."
      },
      {
        "id": "tvmaze:1781985",
        "title": "I'm That Bitch",
        "season": 12,
        "episode": 1,
        "released": "2020-02-28",
        "overview": "Seven queens enter the work room, composing of Brita, Nicky Doll, Widow Von'Du, Jackie Cox, Heidi N. Closet, Gigi Goode, and Crystel Methyd. RuPaul announces the first mini-challenge is to present two sets of runway looks: one for spring and one for fall, akin to Season 7's first mini-challenge."
      },
      {
        "id": "tvmaze:1796900",
        "title": "You Don't Know Me",
        "season": 12,
        "episode": 2,
        "released": "2020-03-06",
        "overview": "In the second season premiere, the queens must write and perform a Fosse-inspired jazz number. Thandie Newton (Westworld) and Swedish singer Robyn guest judge."
      },
      {
        "id": "tvmaze:1796901",
        "title": "World's Worst",
        "season": 12,
        "episode": 3,
        "released": "2020-03-13",
        "overview": "For the first time this season, someone will sashay away! The queens must flex their comedy improv skills for the new TV show \"World's Worst\" - a talent show for people with little talent. Olivia Munn (X-Men: Apocalypse) guest judges."
      },
      {
        "id": "tvmaze:1796902",
        "title": "The Ball Ball",
        "season": 12,
        "episode": 4,
        "released": "2020-03-20",
        "overview": "The queens compete in a pageant of sports-inspired couture, and showcase three ball-themed looks. Leslie Jones (Saturday Night Live) guest judges."
      },
      {
        "id": "tvmaze:1796903",
        "title": "Gay's Anatomy",
        "season": 12,
        "episode": 5,
        "released": "2020-03-27",
        "overview": "The queens are challenged to overact in TV's longest running drag queen scripted show, \"Gay's Anatomy.\" Singer and dancer Normani guest judges."
      },
      {
        "id": "tvmaze:1796904",
        "title": "Snatch Game",
        "season": 12,
        "episode": 6,
        "released": "2020-04-03",
        "overview": "The queens impersonate celebrities in the legendary Snatch Game. Mean Girls co-stars Jonathan Bennett and Daniel Franzese guest judge. Drag queen Miss Vanjie makes a guest appearance."
      },
      {
        "id": "tvmaze:1796905",
        "title": "Madonna: The Unauthorized Rusical",
        "season": 12,
        "episode": 7,
        "released": "2020-04-10",
        "overview": "The queens get into the groove in a Queen of Pop inspired musical. U.S. Representative Alexandria Ocasio-Cortez and supermodel Winnie Harlow guest judge."
      },
      {
        "id": "tvmaze:1796906",
        "title": "Droop",
        "season": 12,
        "episode": 8,
        "released": "2020-04-17",
        "overview": "The queens must create and market ridiculously extravagant products, for the new drag queen lifestyle brand \"Droop.\" Chaka Khan guest judges. Personal trainer Bob Harper makes a guest appearance."
      },
      {
        "id": "tvmaze:1796907",
        "title": "Choices 2020",
        "season": 12,
        "episode": 9,
        "released": "2020-04-24",
        "overview": "It's time for America's first drag queen president! The queens argue in a fabulous presidential debate. Actors Jeff Goldblum (Jurassic Park) and Rachel Bloom (Crazy Ex-Girlfriend) guest judge."
      },
      {
        "id": "tvmaze:1796908",
        "title": "Superfan Makeover",
        "season": 12,
        "episode": 10,
        "released": "2020-05-01",
        "overview": "The queens must makeover Drag Race superfans. But there's one thing… the superfans have no idea what's about to happen to them. Actress Daisy Ridley (Rey in Star Wars) guest judges."
      },
      {
        "id": "tvmaze:1796909",
        "title": "One-Queen Show",
        "season": 12,
        "episode": 11,
        "released": "2020-05-08",
        "overview": "The queens must create and perform their own solo show. Whoopi Goldberg (The View; Ghost) coaches the queens and guest judges."
      },
      {
        "id": "tvmaze:1796910",
        "title": "Viva Drag Vegas",
        "season": 12,
        "episode": 12,
        "released": "2020-05-15",
        "overview": "The queens must perform a medley of songs from RuPaul's Drag Race Live!, a hit show that is wowing audiences on the Las Vegas strip. Choreographer Jamal Sims (Disney's Aladdin) guest judges."
      },
      {
        "id": "tvmaze:1796911",
        "title": "Reunited: Alone Together",
        "season": 12,
        "episode": 13,
        "released": "2020-05-22",
        "overview": "One episode away from the Grand Finale, the contestants reunite virtually to discuss the season's gaggiest moments."
      },
      {
        "id": "tvmaze:1866809",
        "title": "Grand Finale",
        "season": 12,
        "episode": 14,
        "released": "2020-05-29",
        "overview": "The Top 3 face off virtually in a lip sync smackdown for $100,000 and the title of America's Next Drag Superstar. Miss Congeniality is also crowned."
      },
      {
        "id": "tvmaze:1961776",
        "title": "The Pork Chop",
        "season": 13,
        "episode": 1,
        "released": "2021-01-01",
        "overview": "After making their werk room entrances, the queens face off in a series of Lip Sync for Your Life battles."
      },
      {
        "id": "tvmaze:1985286",
        "title": "Condragulations",
        "season": 13,
        "episode": 2,
        "released": "2021-01-08",
        "overview": "After the first contestant of the season is voted out, the queens stomp the runway in a fashion show, then perform a special version of RuPaul's song \"Condragulations.\""
      },
      {
        "id": "tvmaze:1985287",
        "title": "Phenomenon",
        "season": 13,
        "episode": 3,
        "released": "2021-01-15",
        "overview": "The previously chopped queens return to walk in a fashion runway show, then perform a choreographed number to RuPaul's song \"Phenomenon,\" and comedian Nicole Byer guest judges."
      },
      {
        "id": "tvmaze:1985288",
        "title": "RuPaulmark Channel",
        "season": 13,
        "episode": 4,
        "released": "2021-01-22",
        "overview": "After the queens come together for the first time, RuPaul hosts a holiday movie marathon featuring Hallmark Channel-inspired parodies, and Loni Love sits in with the judges."
      },
      {
        "id": "tvmaze:1985289",
        "title": "The Bag Ball",
        "season": 13,
        "episode": 5,
        "released": "2021-01-29",
        "overview": "The queens create three different bag-inspired couture lewks for RuPaul's Bag Ball, and comedian Nicole Byer joins the judges' panel."
      },
      {
        "id": "tvmaze:1985290",
        "title": "Disco-Mentary",
        "season": 13,
        "episode": 6,
        "released": "2021-02-05",
        "overview": "The queens perform in a disco documentary that chronicles the different phases of the dance phenomenon, the category on the runway is Little Black Dress, and Loni Love guest judges."
      },
      {
        "id": "tvmaze:1985291",
        "title": "Bossy Rossy Ruboot",
        "season": 13,
        "episode": 7,
        "released": "2021-02-12",
        "overview": "The queens read each other for filth in the Reading Challenge and improvise as guests on Ross Mathews's trashy talk show, \"Bossy Rossy After Dark,\" and Ts Madison sits in the with the judges."
      },
      {
        "id": "tvmaze:1985292",
        "title": "Social Media: The Unverified Rusical",
        "season": 13,
        "episode": 8,
        "released": "2021-02-19",
        "overview": "The queens get performance advice from Anne Hathaway and star in a social media-influenced musical, and choreographer Jamal Sims sits in with the judges."
      },
      {
        "id": "tvmaze:1985293",
        "title": "Snatch Game",
        "season": 13,
        "episode": 9,
        "released": "2021-03-05",
        "overview": "Before walking the runway in Fascinating Fascinators, the queens bring out their best celebrity impressions for Snatch Game, and Ts Madison sits in with the judges."
      },
      {
        "id": "tvmaze:1985294",
        "title": "Freaky Friday Queens",
        "season": 13,
        "episode": 10,
        "released": "2021-03-12",
        "overview": "The queens are paired up by psychic Char Margolis and challenged to make over their partners as their own drag doppelgangers, and Loni Love joins the judges."
      },
      {
        "id": "tvmaze:1985295",
        "title": "Pop! Goes the Queens",
        "season": 13,
        "episode": 11,
        "released": "2021-03-19",
        "overview": "The queens compete in a RuPaul's Drag Race-themed trivia game, write and star in commercials for their own self-branded sodas, and walk the runway in Beast Couture."
      },
      {
        "id": "tvmaze:1985296",
        "title": "Nice Girls Roast",
        "season": 13,
        "episode": 12,
        "released": "2021-03-26",
        "overview": "The queens roast past Miss Congeniality winners Heidi N Closet, Nina West and Valentina, special guest Norvina stops by, and comedian Loni Love sits in with the judges."
      },
      {
        "id": "tvmaze:1985297",
        "title": "Henny, I Shrunk the Drag Queens!",
        "season": 13,
        "episode": 13,
        "released": "2021-04-02",
        "overview": "The queens get acting advice from Scarlett Johansson before starring in a sci-fi spoof, then walk the runway in Haute Pockets couture, and Cynthia Erivo joins the judges."
      },
      {
        "id": "tvmaze:1985298",
        "title": "Gettin' Lucky",
        "season": 13,
        "episode": 14,
        "released": "2021-04-09",
        "overview": "Before heading into the grand finale, the Top Four queens record a verse to the song \"Lucky,\" choreograph a performance with Jamal Sims and sit for an interview with RuPaul and Michelle Visage."
      },
      {
        "id": "tvmaze:1985299",
        "title": "Reunited",
        "season": 13,
        "episode": 15,
        "released": "2021-04-16",
        "overview": "In this virtual reunion, the eliminated queens share music video performances, the Top Four answer revealing questions, RuPaul gets the backstage tea, and two lip-sync assassins face off."
      },
      {
        "id": "tvmaze:1985300",
        "title": "Grand Finale",
        "season": 13,
        "episode": 16,
        "released": "2021-04-23",
        "overview": "The Top Four queens compete in a Britney Spears-themed lip sync smackdown, Heidi N Closet reveals Season 13's Miss Congeniality winner, and RuPaul crowns America's Next Drag Superstar."
      },
      {
        "id": "tvmaze:2229171",
        "title": "Big Opening, Pt. 1",
        "season": 14,
        "episode": 1,
        "released": "2022-01-07",
        "overview": "Lizzo guest judges part one of the Season 14 premiere, and a new set of queens stars in a dizzying photo shoot, performs in a talent show and walks the runway in Signature Showstopping Drag."
      },
      {
        "id": "tvmaze:2235605",
        "title": "Big Opening, Pt. 2",
        "season": 14,
        "episode": 2,
        "released": "2022-01-14",
        "overview": "Alicia Keys guest judges in part two of the Season 14 premiere, which features a second set of queens making their werk room debuts, posing in a photoshoot and performing in a talent show."
      },
      {
        "id": "tvmaze:2251513",
        "title": "A Pair of Balls",
        "season": 14,
        "episode": 3,
        "released": "2022-01-21",
        "overview": "RuPaul announces a twist in the lip sync elimination process, the queens serve lewks during two different balls, and reality TV star and producer Christine Chiu sits in with the judges."
      },
      {
        "id": "tvmaze:2262554",
        "title": "She's a Super Tease",
        "season": 14,
        "episode": 4,
        "released": "2022-01-28",
        "overview": "The queens star in self-produced Season 14 teaser trailers, Jennifer Lopez sends the girls a message before the Night of a Thousand JLos runway, and Loni Love sits in with the judges."
      },
      {
        "id": "tvmaze:2267117",
        "title": "Save a Queen",
        "season": 14,
        "episode": 5,
        "released": "2022-02-04",
        "overview": "First-eliminated queens from past seasons return to star in parody PSA commercials, the category on the runway is Spring Has Sprung, and singer Ava Max sits in with the judges."
      },
      {
        "id": "tvmaze:2267118",
        "title": "Glamazon Prime",
        "season": 14,
        "episode": 6,
        "released": "2022-02-11",
        "overview": "The queens repurpose unconventional materials from Glamazon Prime shipping boxes into high-fashion runway looks, and Taraji P. Henson sits in with the judges."
      },
      {
        "id": "tvmaze:2269607",
        "title": "The Daytona Wind",
        "season": 14,
        "episode": 7,
        "released": "2022-02-18",
        "overview": "The queens star in the over-the-top soap opera \"The Daytona Wind\" and serve Chaps on the Runway, and Ts Madison sits in with the judges."
      },
      {
        "id": "tvmaze:2269608",
        "title": "60s Girl Groups",
        "season": 14,
        "episode": 8,
        "released": "2022-02-25",
        "overview": "The queens read each other for filth, write and perform 60s girl group-inspired songs and pour their hearts into their runway lewks, and comedian Alec Mapa sits in with the judges."
      },
      {
        "id": "tvmaze:2269609",
        "title": "Menzeses",
        "season": 14,
        "episode": 9,
        "released": "2022-03-04",
        "overview": "The queens form DragCon panels to discuss the topic of men -- from toxic males to accepting dads -- and go big with shoulder pads on the runway, and Nicole Byer sits in with the judges."
      },
      {
        "id": "tvmaze:2269610",
        "title": "Snatch Game",
        "season": 14,
        "episode": 10,
        "released": "2022-03-11",
        "overview": "Actress Dove Cameron and Season 3 winner Raven guest star on Snatch Game as the queens try out their best celebrity impersonations, and the category is Holy Couture on the runway."
      },
      {
        "id": "tvmaze:2269611",
        "title": "An Extra Special Episode",
        "season": 14,
        "episode": 11,
        "released": "2022-03-18",
        "overview": "After a particularly disappointing Snatch Game, seven queens must face off in a Lip Sync Lalaparuza Smackdown as DeJa Skye, the only safe contestant, watches from the werk room."
      },
      {
        "id": "tvmaze:2269612",
        "title": "Moulin Ru: The Rusical",
        "season": 14,
        "episode": 12,
        "released": "2022-03-25",
        "overview": "Leslie Jordan directs the queens in a \"Moulin Rouge\" parody musical; the category on the runway is Mirror, Mirror; and the judges welcome Andra Day to the panel."
      },
      {
        "id": "tvmaze:2269613",
        "title": "The Ross Mathews Roast",
        "season": 14,
        "episode": 13,
        "released": "2022-04-01",
        "overview": "Anastasia Beverly Hills President Norvina stops by as the queens paint the faces of RuPaul and Dolly Parton on a mural, Ross Mathews gets roasted, and Dulcé Sloan sits in with the judges."
      },
      {
        "id": "tvmaze:2301565",
        "title": "Catwalk",
        "season": 14,
        "episode": 14,
        "released": "2022-04-08",
        "overview": "For their final challenge, the Top Five queens design costumes, learn choreography and write song lyrics for their music video debuts in RuPaul's \"Catwalk.\""
      },
      {
        "id": "tvmaze:2301567",
        "title": "Reunited",
        "season": 14,
        "episode": 15,
        "released": "2022-04-15",
        "overview": "The queens dish on the competition, including Daya Betty's controversial comments, Kornbread \"The Snack\" Jeté's shocking exit and some good old-fashioned reading."
      },
      {
        "id": "tvmaze:2301568",
        "title": "Grand Finale",
        "season": 14,
        "episode": 16,
        "released": "2022-04-22",
        "overview": "It's showtime for the final five queens as they compete for the title of America's next drag superstar in original musical performances and a series of lip sync battles."
      },
      {
        "id": "tvmaze:2447396",
        "title": "One Night Only, Part 1",
        "season": 15,
        "episode": 1,
        "released": "2023-01-06",
        "overview": "All-new queens make their debut in the werk room, kicking off Season 15 with a photo shoot and a musical number to introduce a talent show, and Ariana Grande returns to guest judge."
      },
      {
        "id": "tvmaze:2461132",
        "title": "One Night Only, Part 2",
        "season": 15,
        "episode": 2,
        "released": "2023-01-06",
        "overview": "For the Season 15 premiere talent show, the queens flaunt their unique skills and then walk the runway in looks that show their personal styles, and pop superstar Ariana Grande guest judges."
      },
      {
        "id": "tvmaze:2461131",
        "title": "All Queens Go to Heaven",
        "season": 15,
        "episode": 3,
        "released": "2023-01-13",
        "overview": "In this heavenly acting challenge, the queens must create infomercials for a queer afterlife. Country singer Maren Morris and LQBT activist Ts Madison guest judge."
      },
      {
        "id": "tvmaze:2461133",
        "title": "Supersized Snatch Game",
        "season": 15,
        "episode": 4,
        "released": "2023-01-20",
        "overview": "Ru serves up a double helping of the celebrity impersonation game show, with the queens playing in two rounds, with two different casts of characters. Amandla Stenberg (The Hate U Give) guest judges."
      },
      {
        "id": "tvmaze:2461134",
        "title": "House of Fashion",
        "season": 15,
        "episode": 5,
        "released": "2023-01-27",
        "overview": "The queens must turn home decor into haute couture; actress Janelle Monae guest judges."
      },
      {
        "id": "tvmaze:2473786",
        "title": "Old Friends Gold",
        "season": 15,
        "episode": 6,
        "released": "2023-02-03",
        "overview": "The queens fast forward 50 years to perform in old lady girl groups, singing about life, love, and growing old with your besties; actress and comedian Megan Stalter guest judges."
      },
      {
        "id": "tvmaze:2478046",
        "title": "The Daytona Wind 2",
        "season": 15,
        "episode": 7,
        "released": "2023-02-10",
        "overview": "The queens exchange flatulence for canned laughter, as the melodramatic acting challenge returns in sitcom form. Actor Harvey Guillén (What We Do in the Shadows) guest judges."
      },
      {
        "id": "tvmaze:2479993",
        "title": "Lip Sync Lalaparuza Smackdown",
        "season": 15,
        "episode": 8,
        "released": "2023-02-17",
        "overview": "The queens put their charisma and choreography to the test in a Lip Sync Lalaparuza Smackdown, where they compete in a series of eight lip sync battles that will culminate in one elimination."
      },
      {
        "id": "tvmaze:2488131",
        "title": "The Crystal Ball: Episode 200",
        "season": 15,
        "episode": 9,
        "released": "2023-02-24",
        "overview": "Drag Race celebrates its milestone 200th episode. The queens design outfits featuring the 15 year anniversary gift: crystal. Julia Garner (Inventing Anna; Ozark) guest judges."
      },
      {
        "id": "tvmaze:2488132",
        "title": "50/50's Most Gagworthy Stars",
        "season": 15,
        "episode": 10,
        "released": "2023-03-03",
        "overview": "The queens get up close and personal with celebrities for TV's sketchiest newsmagazine, 50/50; the runway, category is Night Of 1000 Beyoncés; special guests Charo, Frankie Grande and Love Connie."
      },
      {
        "id": "tvmaze:2488136",
        "title": "Two Queens, One Joke",
        "season": 15,
        "episode": 11,
        "released": "2023-03-10",
        "overview": "The queens perform stand-up comedy in pairs, but an odd number of queens causes for some drama. Comedian Ali Wong (Ali Wong: Baby Cobra) guest judges."
      },
      {
        "id": "tvmaze:2498319",
        "title": "Wigloose: The Rusical!",
        "season": 15,
        "episode": 12,
        "released": "2023-03-17",
        "overview": "This season's Rusical is set in the small town of West Bumtuck, where drag has been outlawed. An underground alliance forms to try and defeat the bigots. Country music sensation Orville Peck guest judges."
      },
      {
        "id": "tvmaze:2498320",
        "title": "Teacher Makeovers",
        "season": 15,
        "episode": 13,
        "released": "2023-03-24",
        "overview": "The queens give drag makeovers to hard-working teachers, from kindergarten to high school. Queer pop musician Hayley Kiyoko guest judges."
      },
      {
        "id": "tvmaze:2498321",
        "title": "Blame It on the Edit",
        "season": 15,
        "episode": 14,
        "released": "2023-03-31",
        "overview": "The final queens collab with RuPaul on a remix of his song \"Blame It On The Edit,\" recording their own verses and creating a space-themed music video."
      },
      {
        "id": "tvmaze:2498322",
        "title": "Reunited",
        "season": 15,
        "episode": 15,
        "released": "2023-04-07",
        "overview": "The queens of Season 15 reunite ahead of the finale to discuss the competition, react to controversial moments, watch unaired footage and weigh in on how drag is attacked in politics."
      },
      {
        "id": "tvmaze:2498323",
        "title": "Grand Finale",
        "season": 15,
        "episode": 16,
        "released": "2023-04-14",
        "overview": "In the Season 15 grand finale, RuPaul looks back over the queens' journeys and crowns America's next drag superstar."
      },
      {
        "id": "tvmaze:2705382",
        "title": "Rate-A-Queen",
        "season": 16,
        "episode": 1,
        "released": "2024-01-05",
        "overview": "The first seven queens of Season 16 pull double duty as contestants and critics as they rank each other's talent show performances and ru-vealing runways, and Charlize Theron guest judges."
      },
      {
        "id": "tvmaze:2728363",
        "title": "Queen Choice Awards",
        "season": 16,
        "episode": 2,
        "released": "2024-01-12",
        "overview": "The second set of Season 16 queens make their introductions before performing and judging each other in a talent show, and singer Becky G is a guest judge."
      },
      {
        "id": "tvmaze:2728364",
        "title": "The Mother of All Balls",
        "season": 16,
        "episode": 3,
        "released": "2024-01-19",
        "overview": "All the Season 16 queens meet in the werk room for the first time before showcasing their design skills with three mother-themed looks on the runway, and designer Isaac Mizrahi guest judges."
      },
      {
        "id": "tvmaze:2728365",
        "title": "RDR Live!",
        "season": 16,
        "episode": 4,
        "released": "2024-01-26",
        "overview": "The queens are challenged to serve up big laughs on a live late-night sketch comedy show, and actress Sarah Michelle Gellar joins as a guest judge."
      },
      {
        "id": "tvmaze:2742277",
        "title": "Girl Groups",
        "season": 16,
        "episode": 5,
        "released": "2024-02-02",
        "overview": "The queens are tasked with writing and performing their own verses for songs from RuPaul's album \"Black Butta,\" and Swedish synth-pop duo Icona Pop guest judge."
      },
      {
        "id": "tvmaze:2742278",
        "title": "Welcome to the DollHouse",
        "season": 16,
        "episode": 6,
        "released": "2024-02-09",
        "overview": "After a flamenco dance with Spanish sensation Charo, the queens must design their own dolls based on their drag personas, and stylist Law Roach guest judges."
      },
      {
        "id": "tvmaze:2760967",
        "title": "The Sound of Rusic",
        "season": 16,
        "episode": 7,
        "released": "2024-02-16",
        "overview": "This season's rusical is set high in the Swish Alps as a young queen named Mariah goes in search of a musical outlet for her inner freak, and director Adam Shankman guest judges."
      },
      {
        "id": "tvmaze:2771114",
        "title": "Snatch Game",
        "season": 16,
        "episode": 8,
        "released": "2024-02-23",
        "overview": "After the Reading Challenge and a visit from show alum Chad Michaels, the queens impersonate celebrities in the classic Snatch Game, and actress Kyra Sedgwick guest judges."
      },
      {
        "id": "tvmaze:2771118",
        "title": "See You Next Wednesday",
        "season": 16,
        "episode": 9,
        "released": "2024-03-01",
        "overview": "Morticia meets Mugler as the queens create a neo-goth look from scratch using only black, white and gray fabric, and model and actress Kaia Gerber guest judges."
      },
      {
        "id": "tvmaze:2771119",
        "title": "Werq the World",
        "season": 16,
        "episode": 10,
        "released": "2024-03-08",
        "overview": "The queens let their voices be heard in an inspirational political anthem and exercise their right to shake their groove thing, and choreographer Jamal Sims guest judges."
      },
      {
        "id": "tvmaze:2793162",
        "title": "Corporate Queens",
        "season": 16,
        "episode": 11,
        "released": "2024-03-15",
        "overview": "The queens must devise and present comical Drag Awareness seminars in front of a live audience of corporate employees, and actor and comedian Joel Kim Booster guest judges."
      },
      {
        "id": "tvmaze:2797603",
        "title": "Bathroom Hunties",
        "season": 16,
        "episode": 12,
        "released": "2024-03-22",
        "overview": "Nature calls as the queens star in the hot new design show \"Bathroom Hunties,\" decorating and showcasing over-the-top powder rooms, and actress Mayan Lopez guest judges."
      },
      {
        "id": "tvmaze:2798431",
        "title": "Drag Race Vegas LIVE! Makeovers",
        "season": 16,
        "episode": 13,
        "released": "2024-03-29",
        "overview": "Hunky male dancers from the RuPaul's Drag Race LIVE! show in Las Vegas drop by the werk room to be made over into devastating drag queens, and country star Kelsea Ballerini guest judges."
      },
      {
        "id": "tvmaze:2798432",
        "title": "Booked & Blessed",
        "season": 16,
        "episode": 14,
        "released": "2024-04-05",
        "overview": "The queens dig deep to write their memoirs, pose for a book cover photo shoot, and get grilled by podcaster Matt Rogers, and journalist and author Ronan Farrow guest judges."
      },
      {
        "id": "tvmaze:2798434",
        "title": "LipSync Lalaparuza Smackdown - Reunited",
        "season": 16,
        "episode": 15,
        "released": "2024-04-12",
        "overview": "All the eliminated queens return to battle it out in a LipSync Lalaparuza Smackdown, with nine lip syncs and a cash prize of $50,000 on the line."
      },
      {
        "id": "tvmaze:2798435",
        "title": "Grand Finale",
        "season": 16,
        "episode": 16,
        "released": "2024-04-19",
        "overview": "The top queens face off in an epic evening of performances and lip syncs as they compete for the title of America's Next Drag Superstar and a grand prize of $200,000."
      },
      {
        "id": "tvmaze:3076687",
        "title": "Squirrel Games",
        "season": 17,
        "episode": 1,
        "released": "2025-01-03",
        "overview": "Drag Race is back, doing what it does best: parodying the buzziest reality shows on TV. A new cast of queens must survive a deadly game of \"Ru Light, Green Light,\" before showing off their skills in a talent show. Superstar Katy Perry guest judges."
      },
      {
        "id": "tvmaze:3088651",
        "title": "Drag Queens Got Talent - Part 2",
        "season": 17,
        "episode": 2,
        "released": "2025-01-10",
        "overview": "Part 2 of the epic two part premiere. The second half of the new cast of 14 queens, competing to be crowned America's Next Drag Superstar, must show off their performance skills in a talent show. Rapper and singer Doechii guest judges."
      },
      {
        "id": "tvmaze:3088652",
        "title": "Monopulence!",
        "season": 17,
        "episode": 3,
        "released": "2025-01-17",
        "overview": "The queens take fashion inspiration from the board game Monopoly and must create from scratch an outfit that screams that they own everything; actress and comedian Sandra Bernhard becomes a guest judge."
      },
      {
        "id": "tvmaze:3088653",
        "title": "Bitch, I'm a Drag Queen!",
        "season": 17,
        "episode": 4,
        "released": "2025-01-24",
        "overview": "The queens receive the task of singing songs based on memorable moments from \"Drag Race\" history; actress Julia Schlaepfer guest judges."
      },
      {
        "id": "tvmaze:3113588",
        "title": "RDR Live!",
        "season": 17,
        "episode": 5,
        "released": "2025-01-31",
        "overview": "Live from Tuckahoe, it's RDR Live! The queens are challenged to serve up laughs in a hilarious send-up of the iconic sketch comedy show. Actor, writer and director Paul W. Downs (Hacks, Broad City) guest judges."
      },
      {
        "id": "tvmaze:3113594",
        "title": "Let's Get Sea Sickening Ball",
        "season": 17,
        "episode": 6,
        "released": "2025-02-07",
        "overview": "Tensions rise as the queens put their design skills to the test in a pageant of ocean-inspired couture and showcase three fishy looks; actress and model Hunter Schafer and stylist Law Roach guest judge."
      },
      {
        "id": "tvmaze:3123431",
        "title": "Werk the Game",
        "season": 17,
        "episode": 7,
        "released": "2025-02-14",
        "overview": "The queens impersonate celebrities in the classic quick-fire comedy game show. Global All Stars winner Alyssa Edwards drops by the werkroom; actress and comedian Quinta Brunson (Abbott Elementary) guest judges."
      },
      {
        "id": "tvmaze:3123433",
        "title": "The Wicked Wiz of Oz: The Rusical!",
        "season": 17,
        "episode": 8,
        "released": "2025-02-21",
        "overview": "This season's Rusical is inspired by a mashup of \"Wicked, The Wizard of Oz\" and \"The Wiz.\" Jamal Sims choreographs the queens; singer Adam Lambert guest judges."
      },
      {
        "id": "tvmaze:3144841",
        "title": "Heavens to Betsey!",
        "season": 17,
        "episode": 9,
        "released": "2025-02-28",
        "overview": "After the iconic Reading challenge, the queens rock out with their frocks out, as they create a look worthy of a Betsey Johnson fashion collection. The fashion icon herself, Betsey Johnson, guest judges."
      },
      {
        "id": "tvmaze:3147805",
        "title": "The Villains Roast",
        "season": 17,
        "episode": 10,
        "released": "2025-03-07",
        "overview": "The queens pay a comedy tribute to three of the shadiest queens in Drag Race herstory: Kandy Muse, Mistress Isabelle Brooks, and Plane Jane. Comedian Whitney Cummings guest judges."
      },
      {
        "id": "tvmaze:3147808",
        "title": "Ross Mathews vs. The Ducks",
        "season": 17,
        "episode": 11,
        "released": "2025-03-14",
        "overview": "As a tribute to Truman Capote and his Swans, the queens must act up a storm in a high camp tale of betrayal. Cheyenne Jackson (American Horror Story) directs; singer Sam Smith guest judges."
      },
      {
        "id": "tvmaze:3165916",
        "title": "Charisma, Uniqueness, Nerve & Talent Monologues",
        "season": 17,
        "episode": 12,
        "released": "2025-03-21",
        "overview": "The queens share hilarious and heartwarming true stories in a performance challenge with a twist: their partners must act out the stories through interpretive dance. Jerrod Carmichael (Jerrod Carmichael Reality Show) guest judges."
      },
      {
        "id": "tvmaze:3170261",
        "title": "Drag Baby Mamas",
        "season": 17,
        "episode": 13,
        "released": "2025-03-28",
        "overview": "The queens make over some extra special drag newbies: their moms and dads. June Diane Raphael (Grace and Frankie) guest judges."
      },
      {
        "id": "tvmaze:3177342",
        "title": "How's Your Headliner?",
        "season": 17,
        "episode": 14,
        "released": "2025-04-04",
        "overview": "The queens audition to star in RuPaul's Drag Race LIVE! at Flamingo Las Vegas. Tracee Ellis Ross (black-ish) guest judges."
      },
      {
        "id": "tvmaze:3181424",
        "title": "Lip Sync Lalaparuza Smackdown",
        "season": 17,
        "episode": 15,
        "released": "2025-04-11",
        "overview": "All of the eliminated queens return to battle it out in a Lip Sync Lalaparuza Smackdown, with eight lip syncs, and a cash prize of $50,000 on the line."
      },
      {
        "id": "tvmaze:3181907",
        "title": "Grand Finale",
        "season": 17,
        "episode": 16,
        "released": "2025-04-18",
        "overview": "The top queens face off in an epic evening of performances and lip syncs, as they compete for a grand prize of $200,000. Superstar Liza Minnelli joins RuPaul on stage."
      }
    ]
  }
}