{
  "meta": {
    "id": "tvmaze:35839",
    "type": "series",
    "name": "The Neighborhood",
    "description": "The Neighborhood telling about what happens when the friendly guy in the Midwest moves his family to a neighborhood in Los Angeles where not everyone looks like him or appreciates his extreme neighborliness. When Dave Johnson and his family arrive from Michigan, they're unfazed that their new dream home is located in a community quite different from their small town. However, their opinionated next-door neighbor, Calvin Butler, is wary of the newcomers, certain that they'll disrupt the culture on the block. Dave realizes that fitting into their new community is more complex than he expected, but if he can find a way to connect with Calvin, they have an excellent chance of making their new neighborhood their home.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/594/1487301.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/594/1487301.jpg",
    "videos": [
      {
        "id": "tvmaze:3443459",
        "title": "TBA",
        "season": 8,
        "episode": 9,
        "released": "2026-02-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3438703",
        "title": "Welcome to Secrets and Santa",
        "season": 8,
        "episode": 8,
        "released": "2025-12-08",
        "overview": "The Butlers' anniversary plans take an unexpected turn when a blast from the past, Calvin's ex-girlfriend, resurfaces. Meanwhile, Malcolm's meeting gets hijacked, Marty makes a big move toward commitment and Gemma finds herself caught in a holiday misunderstanding."
      },
      {
        "id": "tvmaze:1494033",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2018-10-01",
        "overview": "Dave Johnson, a friendly guy from the Midwest, moves his family to a Los Angeles neighborhood next door to Calvin Butler, who's concerned the Johnsons will disrupt the culture on the block and doesn't appreciate Dave's extreme neighborliness."
      },
      {
        "id": "tvmaze:1536492",
        "title": "Welcome to the Repipe",
        "season": 1,
        "episode": 2,
        "released": "2018-10-08",
        "overview": "When a water pipe bursts at the Johnsons' home, Calvin reluctantly agrees to help Dave repair the damage. Also, Gemma discovers a surprising secret about her new neighbor, Tina."
      },
      {
        "id": "tvmaze:1536493",
        "title": "Welcome to the Spare Key",
        "season": 1,
        "episode": 3,
        "released": "2018-10-15",
        "overview": "Dave gives Calvin a spare key to the Johnsons' house in case of an emergency and is pleasantly surprised when the gesture is reciprocated - or so he thinks."
      },
      {
        "id": "tvmaze:1536494",
        "title": "Welcome to the Housewarming",
        "season": 1,
        "episode": 4,
        "released": "2018-10-22",
        "overview": "Dave and Gemma decide to invite the Butlers to their housewarming party. However, when everyone but Calvin accepts, Dave decides he's finally had enough of Calvin's refusal to welcome him to town."
      },
      {
        "id": "tvmaze:1536495",
        "title": "Welcome to Game Night",
        "season": 1,
        "episode": 5,
        "released": "2018-10-29",
        "overview": "Unexpected revelations are in the cards during the Johnsons' first game night together with the Butlers, when Gemma is prompted to rectify a past wrong and Malcolm makes a play for a fresh start with his father, Calvin."
      },
      {
        "id": "tvmaze:1545349",
        "title": "Welcome to the Anniversary",
        "season": 1,
        "episode": 6,
        "released": "2018-11-05",
        "overview": "Dave plans a special anniversary celebration for Gemma while Calvin and Tina babysit the Johnsons' son, Grover, during an evening when nothing goes according to plan."
      },
      {
        "id": "tvmaze:1555969",
        "title": "Welcome to the Barbershop",
        "season": 1,
        "episode": 7,
        "released": "2018-11-12",
        "overview": "When Dave drops by Calvin's longtime barbershop, he's quickly embraced by its owner and patrons, much to Calvin's consternation."
      },
      {
        "id": "tvmaze:1555970",
        "title": "Welcome to Thanksgiving",
        "season": 1,
        "episode": 8,
        "released": "2018-11-19",
        "overview": "Dave and Gemma host a memorable Thanksgiving in their new home when Dave's politically incorrect mother, Paula, visits from out of town and meets Calvin, Tina and the rest of the Butler family for the first time."
      },
      {
        "id": "tvmaze:1565979",
        "title": "Welcome to the Dinner Guest",
        "season": 1,
        "episode": 9,
        "released": "2018-12-03",
        "overview": "When Calvin and Tina learn Marty has a new girlfriend, Chloe, they insist he invite her over for dinner, with surprising results."
      },
      {
        "id": "tvmaze:1565980",
        "title": "Welcome to the Stolen Sneakers",
        "season": 1,
        "episode": 10,
        "released": "2018-12-10",
        "overview": "When Malcolm is robbed and won't reveal the culprit, Calvin and Dave team up to crack the case of the missing sneakers. Also, Tina takes a unique approach to teaching Gemma self-defense."
      },
      {
        "id": "tvmaze:1568758",
        "title": "Welcome to the Fundraiser",
        "season": 1,
        "episode": 11,
        "released": "2018-12-17",
        "overview": "Tina gets carried away when she tries to help Gemma ace her first fundraiser as school principal. Also, Dave aids Calvin in his efforts to win a special silent-auction prize for his mom."
      },
      {
        "id": "tvmaze:1576810",
        "title": "Welcome to Grover's Birthday",
        "season": 1,
        "episode": 12,
        "released": "2019-01-14",
        "overview": "When Dave and Gemma's elaborate plans for Grover's 7th birthday party go awry, Malcolm and Marty come to the rescue. Also, Calvin's choice of gift winds up sending one person to the hospital."
      },
      {
        "id": "tvmaze:1588683",
        "title": "Welcome to Fight Night",
        "season": 1,
        "episode": 13,
        "released": "2019-02-04",
        "overview": "Calvin reluctantly invites Dave to join his guys' night at home with Malcolm and Marty, while Gemma and Tina take their first girls' trip to Vegas and find themselves unexpectedly in the spotlight."
      },
      {
        "id": "tvmaze:1592869",
        "title": "Welcome to the Yard Sale",
        "season": 1,
        "episode": 14,
        "released": "2019-02-11",
        "overview": "Dave convinces Calvin to hold a yard sale, but when longtime neighborhood resident Miss Simpson makes a purchase Calvin quickly regrets, he enlists Dave to help him get the valuable object back."
      },
      {
        "id": "tvmaze:1596995",
        "title": "Welcome to Malcolm's Job",
        "season": 1,
        "episode": 15,
        "released": "2019-02-18",
        "overview": "When Tina agrees to give Grover piano lessons and her son Malcolm lands a job in retail sales, neither Butler has a first day that goes quite according to plan."
      },
      {
        "id": "tvmaze:1601398",
        "title": "Welcome to the Big Payback",
        "season": 1,
        "episode": 16,
        "released": "2019-02-25",
        "overview": "When Gemma has her car repaired at Calvin's shop, Tina insists she doesn't need to pay for the work, to Calvin's consternation. Also, Malcolm and Marty find themselves on the same dating app—and vying for the same woman's attention."
      },
      {
        "id": "tvmaze:1609032",
        "title": "Welcome to the Climb",
        "season": 1,
        "episode": 17,
        "released": "2019-03-11",
        "overview": "When Gemma decides to fire a teacher at her school, she's unprepared for the aftermath. Also, Calvin gets a surprise when he faces off with his newspaper carrier."
      },
      {
        "id": "tvmaze:1615040",
        "title": "Welcome to Logan #2",
        "season": 1,
        "episode": 18,
        "released": "2019-03-25",
        "overview": "When Calvin and Dave's college basketball teams go head to head, Dave surprises the Butlers with tickets to the game and also invites one of his best friends from Michigan, Logan #2, who reveals to Calvin surprising new details about Dave."
      },
      {
        "id": "tvmaze:1619560",
        "title": "Welcome to the Camping Trip",
        "season": 1,
        "episode": 19,
        "released": "2019-04-01",
        "overview": "When the Johnsons invite the Butlers to go camping, Dave is taken aback by Calvin's idea of roughing it. Also, Gemma and Tina cross paths with Maynard, a general store proprietor who may not be as friendly as he seems."
      },
      {
        "id": "tvmaze:1616400",
        "title": "Welcome to the Repass",
        "season": 1,
        "episode": 20,
        "released": "2019-04-15",
        "overview": "When a curmudgeonly resident with few fans in the community passes away, the Butlers step up to host a memorial, leading Calvin to an unexpected revelation about himself."
      },
      {
        "id": "tvmaze:1629551",
        "title": "Welcome to the Conversation",
        "season": 1,
        "episode": 21,
        "released": "2019-04-22",
        "overview": "Dave is thrilled when Calvin invites him golfing, confident that it represents progress in their relationship, but Calvin may have another motive. Also, Gemma and Tina team up to pull off an unforgettable surprise for Malcolm, Marty and Grover"
      },
      {
        "id": "tvmaze:1669453",
        "title": "Welcome to the Re-Rack",
        "season": 2,
        "episode": 1,
        "released": "2019-09-23",
        "overview": "One year after the Johnsons moved next door to the Butlers, Dave is eager to take on a bigger role in Calvin's annual Yardecue and prove how much a part of the community he's become. But Calvin's reaction makes it clear that, while the relationship between the two families has grown, the friendship between Calvin and Dave still has a way to go."
      },
      {
        "id": "tvmaze:1690910",
        "title": "Welcome to the Bully",
        "season": 2,
        "episode": 2,
        "released": "2019-09-30",
        "overview": "When Grover gets into a fight with a bully at school, Gemma is torn between her role as principal and wanting to protect her son. Also, Calvin encourages Marty to stand up to his own bully, only to be shocked when he learns who it is."
      },
      {
        "id": "tvmaze:1690911",
        "title": "Welcome to the Fresh Coat",
        "season": 2,
        "episode": 3,
        "released": "2019-10-07",
        "overview": "When Tina decides it's time to make home improvements, Dave volunteers to re-paint the Butler house, violating Calvin's \"man code\" and setting off a chain of events that impacts both families."
      },
      {
        "id": "tvmaze:1722461",
        "title": "Welcome to Co-Habitation",
        "season": 2,
        "episode": 4,
        "released": "2019-10-14",
        "overview": "During a heat wave, Dave accidentally knocks out power to the Butler home with his drone, forcing Calvin and Tina to stay at the Johnson home to keep cool. While preparing to sleep that night, Calvin finds Dave's journal and reads an insulting entry about himself, causing a rift between the two. Meanwhile, Malcolm stays at Marty's apartment and pulls a prank by rearranging all of Marty's beloved collections, but Malcolm gets his comeuppance at work the next day."
      },
      {
        "id": "tvmaze:1725451",
        "title": "Welcome to Soul Food",
        "season": 2,
        "episode": 5,
        "released": "2019-10-21",
        "overview": "When the Butlers and Johnsons double date at a new soul food restaurant in town, Calvin is wowed by his meal, until he learns that the head chef is white. Meanwhile, Grover has Malcolm and Marty as guests on his school podcast project, and asks some very personal questions."
      },
      {
        "id": "tvmaze:1721926",
        "title": "Welcome to the Wagon",
        "season": 2,
        "episode": 6,
        "released": "2019-10-28",
        "overview": "With REO Speedwagon in town for a concert, Calvin is delighted that Dave likes the band so that he can take Tina in Calvin's place. When someone mistakes Dave and Tina for a married couple at the show, Tina laughs and says that could never happen, hurting Dave's feelings. She tells him they are just too different, and she's not talking about color. At home, Calvin and Malcolm try to help Gemma rid her house of a wild parrot that flew in. Meanwhile, Marty scares Grover as they watch a meteor shower, saying that one could hit the earth at any time and cause a major catastrophe."
      },
      {
        "id": "tvmaze:1744746",
        "title": "Welcome to the Vow Renewal",
        "season": 2,
        "episode": 7,
        "released": "2019-11-04",
        "overview": "As Calvin and Tina near a milestone anniversary, Dave and Gemma decide to help the Butlers have the wedding they missed out on the first time around. Also, Malcolm and Marty prepare an unforgettable performance for their parents' special occasion."
      },
      {
        "id": "tvmaze:1747989",
        "title": "Welcome to Bowling",
        "season": 2,
        "episode": 8,
        "released": "2019-11-18",
        "overview": "With Calvin down a teammate for his annual bowling championship, Dave offers to fill in and soon finds his mediation skills put to the test when he meets the competition: Calvin's arch-rivals, the Pink Ladies. Also, Gemma and Tina dare to face off against each other for the top ranking in an arcade game."
      },
      {
        "id": "tvmaze:1747990",
        "title": "Welcome to the Dealbreaker",
        "season": 2,
        "episode": 9,
        "released": "2019-11-25",
        "overview": "When Gemma sets a reluctant Malcolm up on a blind date with a teacher at her school, she discovers new details about the origins of her relationship with Dave. Also, Marty helps Calvin and Tina plan for their future."
      },
      {
        "id": "tvmaze:1761015",
        "title": "Welcome to the Digital Divide",
        "season": 2,
        "episode": 10,
        "released": "2019-12-09",
        "overview": "Calvin reluctantly agrees to let Marty create a website for his auto shop in the hopes of drumming up more business. Also, with Gemma out of town for a school retreat, Dave makes it his mission to prove to his son, Grover, that there's more to life than his favorite gadgets."
      },
      {
        "id": "tvmaze:1761016",
        "title": "Welcome to the Scooter",
        "season": 2,
        "episode": 11,
        "released": "2019-12-16",
        "overview": "When the Johnsons' Christmas present for Grover is stolen, Calvin and Dave team up to recover the gift in time for the holiday. Also, a nostalgic Tina tries to get into the Christmas spirit by reviving traditions from when Malcolm and Marty were kids."
      },
      {
        "id": "tvmaze:1772689",
        "title": "Welcome to the Freeloader",
        "season": 2,
        "episode": 12,
        "released": "2020-01-06",
        "overview": "Dave's patience is tested when Gemma's freeloading sister, Brittany, suddenly shows up with plans for an extended stay. Also, Calvin grows frustrated that Malcolm is still living at home, even with a new job."
      },
      {
        "id": "tvmaze:1784094",
        "title": "Welcome to the New Pastor",
        "season": 2,
        "episode": 13,
        "released": "2020-01-20",
        "overview": "As Tina spends considerable time with the charming new minister she helped select for her church, Pastor Don, Calvin begins to suspect the man may be coveting more than just job security. Also, Marty gets a surprise when he finally meets his disruptive new upstairs neighbor,."
      },
      {
        "id": "tvmaze:1787376",
        "title": "Welcome to Trivia Night",
        "season": 2,
        "episode": 14,
        "released": "2020-02-03",
        "overview": "When Calvin and Dave get shown up by Gemma and Marty at a local bar's trivia night, the pair hatch a plan for a do-over to redeem themselves. Also, a frustrated Tina decides to take matters into her own hands in order to finally meet Malcolm's girlfriend, Sofia."
      },
      {
        "id": "tvmaze:1791852",
        "title": "Welcome to the Bad Review",
        "season": 2,
        "episode": 15,
        "released": "2020-02-10",
        "overview": "Dave puts his professional conflict mediator skills to the test when he offers to help Calvin find out why his employees are quitting. Also, Marty devises an elaborate plan to help him earn a date with his new upstairs neighbor."
      },
      {
        "id": "tvmaze:1796690",
        "title": "Welcome to the Hockey Game",
        "season": 2,
        "episode": 16,
        "released": "2020-02-17",
        "overview": "After Calvin actually enjoys attending a hockey game with Dave, Malcolm and Marty wonder if their neighbor is rubbing off too much on their dad. Also, Tina decides to enjoy the perks that come with her \"stardom\" when she's mistaken for an A-list celebrity during a girls' trip with Gemma."
      },
      {
        "id": "tvmaze:1801296",
        "title": "Welcome to the Commercial",
        "season": 2,
        "episode": 17,
        "released": "2020-03-09",
        "overview": "When Calvin decides to film a local TV commercial for his business, he enlists Dave, Tina and Marty to help, but it doesn't take long for creative differences to arise. Also, Malcolm considers making a grand gesture when his girlfriend, Sofia, is offered her dream job abroad."
      },
      {
        "id": "tvmaze:1810290",
        "title": "Welcome to the Team",
        "season": 2,
        "episode": 18,
        "released": "2020-03-16",
        "overview": "When Grover joins Calvin's youth basketball team, Gemma finds herself at odds with some of her neighbor's coaching methods. Also, Tina and Marty are forced to confront a long-buried Butler family secret."
      },
      {
        "id": "tvmaze:1812103",
        "title": "Welcome to the Jump",
        "season": 2,
        "episode": 19,
        "released": "2020-04-06",
        "overview": "When Tina receives unexpected news, Calvin, Dave and Gemma encourage her to embrace a new chapter by taking a big leap of faith - literally - by learning to skydive. Also, Marty helps Grover create a \"battle bot\" for a school science competition."
      },
      {
        "id": "tvmaze:1818443",
        "title": "Welcome to the Standoff",
        "season": 2,
        "episode": 20,
        "released": "2020-04-13",
        "overview": "A surprise delivery prompts Dave and Gemma, as well as Calvin and Tina, to examine the power dynamics in their respective relationships."
      },
      {
        "id": "tvmaze:1839470",
        "title": "Welcome to the Speed Bump",
        "season": 2,
        "episode": 21,
        "released": "2020-05-04",
        "overview": "A near-accident awakens Dave's sense of civic duty, prompting him to team up with Calvin to try to improve the safety of their community. Also, a trip to the county fair turns into a nerve-wracking adventure for Malcolm, Marty and Grover."
      },
      {
        "id": "tvmaze:1839471",
        "title": "Welcome to the Campaign",
        "season": 2,
        "episode": 22,
        "released": "2020-05-04",
        "overview": "Dave makes a run for city council, working hard to earn Calvin's support, only to have a controversial photo threaten to derail his entire campaign. Wayne Brady guest stars as longtime incumbent Isaiah Evans."
      },
      {
        "id": "tvmaze:1949312",
        "title": "Welcome to the Movement",
        "season": 3,
        "episode": 1,
        "released": "2020-11-16",
        "overview": "The Butlers and Johnsons unite when a member of their community is the victim of racial injustice."
      },
      {
        "id": "tvmaze:1960239",
        "title": "Welcome to the Election",
        "season": 3,
        "episode": 2,
        "released": "2020-11-23",
        "overview": "Dave faces off against incumbent Isaiah Evans in a debate for a city council seat, and the race comes to a dramatic conclusion."
      },
      {
        "id": "tvmaze:1963770",
        "title": "Welcome to Couples Therapy",
        "season": 3,
        "episode": 3,
        "released": "2020-11-30",
        "overview": "After learning Dave and Gemma occasionally see a couples therapist to keep their marriage strong, Tina decides she and Calvin should do the same, to Calvin's consternation."
      },
      {
        "id": "tvmaze:1968429",
        "title": "Welcome to the Rooster",
        "season": 3,
        "episode": 4,
        "released": "2020-12-07",
        "overview": "An eco-conscious new neighbor, and his pet rooster disrupts the community, leading a desperate Dave and Calvin to team up on a covert mission to restore order. Also, when Tina stops by Marty's apartment for a surprise visit, the youngest Butler son is forced to come clean about a long-held secret."
      },
      {
        "id": "tvmaze:1972378",
        "title": "Welcome to the Road Trip",
        "season": 3,
        "episode": 5,
        "released": "2020-12-14",
        "overview": "Calvin and Dave embark on their first road trip together to a classic car show, only to hit an unexpected roadblock that tests their friendship. Also, while their husbands are away, Tina and Gemma decide to take home repairs at the Butlers' into their own hands."
      },
      {
        "id": "tvmaze:1977861",
        "title": "Welcome to the Turnaround",
        "season": 3,
        "episode": 6,
        "released": "2021-01-04",
        "overview": "Gemma's troublemaking sister, Brittany, returns, claiming she's turned over a new leaf, thanks to a surprising new business venture. Also, Dave finally convinces Calvin to accompany him to an escape room, where they both get more than they bargained for."
      },
      {
        "id": "tvmaze:2000094",
        "title": "Welcome to the Motorcycle",
        "season": 3,
        "episode": 7,
        "released": "2021-01-18",
        "overview": "Malcolm surprises Calvin and Tina when he brings home a new motorcycle, while Dave and Gemma aim to rev up their social life with a spontaneous trip to Las Vegas."
      },
      {
        "id": "tvmaze:2000095",
        "title": "Welcome to the Property",
        "season": 3,
        "episode": 8,
        "released": "2021-01-25",
        "overview": "When Calvin discovers a member of the community plans to sell to greedy developers, he vows to find a buyer closer to home instead. However, the Butlers and Johnsons soon realize that the dilapidated property will require more work than they expected."
      },
      {
        "id": "tvmaze:2013035",
        "title": "Welcome to the Shakedown",
        "season": 3,
        "episode": 9,
        "released": "2021-02-08",
        "overview": "When Gemma's phone is stolen, Dave and Calvin team up to get it back, only to have their mission take an unexpected turn. Also, Malcolm and Marty move into their new house."
      },
      {
        "id": "tvmaze:2023498",
        "title": "Welcome to the Procedure",
        "season": 3,
        "episode": 10,
        "released": "2021-02-22",
        "overview": "When Dave discovers Calvin hasn't seen a physician in nearly a decade, he insists the Butler patriarch schedule a physical stat. But Calvin gets more than he bargained for when Dr. Fisher insists he undergo a routine colonoscopy."
      },
      {
        "id": "tvmaze:2030784",
        "title": "Welcome to the Dad Band",
        "season": 3,
        "episode": 11,
        "released": "2021-03-08",
        "overview": "When Dave's amateur band loses its lead singer just before a gig, Tina offers to fill in, however her high standards are out of tune with the rest of the group. Also, Marty quickly regrets letting his needy boss, Jerry, crash at his new place."
      },
      {
        "id": "tvmaze:2039742",
        "title": "Welcome to the Treehouse",
        "season": 3,
        "episode": 12,
        "released": "2021-03-15",
        "overview": "Concerned about the safety of a treehouse Calvin's building for Grover, Dave recruits Marty to supervise covertly. Also, an innocent mistake on Malcolm's part leads to a heated bake-off between Tina and Gemma."
      },
      {
        "id": "tvmaze:2052243",
        "title": "Welcome to the Art Class",
        "season": 3,
        "episode": 13,
        "released": "2021-04-12",
        "overview": "When Tina and Gemma get more than they bargained for in a revealing art class, Calvin can't hide his jealousy and takes drastic action. Also, Dave, Marty and Malcolm team up to crack the case of an unfinished mystery novel."
      },
      {
        "id": "tvmaze:2052244",
        "title": "Welcome to the Hero",
        "season": 3,
        "episode": 14,
        "released": "2021-04-19",
        "overview": "Dave earns Calvin's respect when he thwarts a robbery at the barbershop, until the recognition goes to his head and he starts exaggerating the truth. Also, Marty invites an anxious Gemma to give his new stress-busting hobby a try."
      },
      {
        "id": "tvmaze:2052245",
        "title": "Welcome to the Challenge",
        "season": 3,
        "episode": 15,
        "released": "2021-04-26",
        "overview": "Owner of auto-repair chain Motor Boys, tries to steal Calvin's customers, the Butlers and Johnsons join forces on a plan to drum up business and give back to their community."
      },
      {
        "id": "tvmaze:2052246",
        "title": "Welcome to the Test Run",
        "season": 3,
        "episode": 16,
        "released": "2021-05-03",
        "overview": "When Gemma surprises Dave with wanting another baby, he worries she's forgotten how difficult a newborn is, so he enlists a robotic doll and Marty's engineering skills to remind her. Also, Calvin and Tina disagree on how to proceed when they unexpectedly discover a stash of cash."
      },
      {
        "id": "tvmaze:2052247",
        "title": "Welcome to the Invasion",
        "season": 3,
        "episode": 17,
        "released": "2021-05-10",
        "overview": "When Calvin's arch-rivals, the Pink Ladies, move their manicure business into the local barbershop, Dave encourages him to make peace until the women take a prank too far and the guys decide to plot revenge. Also, Gemma helps Tina find a creative way to keep tabs on Marty and Malcolm's dating lives."
      },
      {
        "id": "tvmaze:2079500",
        "title": "Welcome to the Surprise",
        "season": 3,
        "episode": 18,
        "released": "2021-05-17",
        "overview": "When Calvin receives a surprise birthday gift involving his father, Dave suggests they spend the day celebrating in a way that honors the late Butler patriarch. Also, an unexpected development changes the Johnsons' lives forever."
      },
      {
        "id": "tvmaze:2130300",
        "title": "Welcome to the Family",
        "season": 4,
        "episode": 1,
        "released": "2021-09-20",
        "overview": "When Dave starts researching his genealogy, he makes a surprising discovery: he and Calvin are more than just neighbors. Also, Tina offers to help Gemma when she's overcome with morning sickness, and inadvertently stumbles on a new business idea."
      },
      {
        "id": "tvmaze:2161293",
        "title": "Welcome to the Intervention",
        "season": 4,
        "episode": 2,
        "released": "2021-09-27",
        "overview": "When a member of the community's behavior becomes increasingly erratic, Calvin and Dave step up to help. Also, Marty undergoes a dramatic makeover to impress a longtime crush."
      },
      {
        "id": "tvmaze:2166141",
        "title": "Welcome to the Sister from Another Mister",
        "season": 4,
        "episode": 3,
        "released": "2021-10-04",
        "overview": "When Gemma hires Alexis to teach at her school, Tina suspects the new teacher may not be quite who she claims to be."
      },
      {
        "id": "tvmaze:2172293",
        "title": "Welcome to the Porch Pirate",
        "season": 4,
        "episode": 4,
        "released": "2021-10-11",
        "overview": "When Dave and Gemma face a devastating loss, Calvin and Tina offer emotional support and reflect on a period that tested their own family."
      },
      {
        "id": "tvmaze:2177255",
        "title": "Welcome to Your Match",
        "season": 4,
        "episode": 5,
        "released": "2021-10-18",
        "overview": "When Calvin and Tina enlist the services of a professional matchmaker for Marty, they can't help but get too caught up in the process. Also, Dave and Gemma adopt new roles during an unexpected date night."
      },
      {
        "id": "tvmaze:2189701",
        "title": "Welcome to the Haunting",
        "season": 4,
        "episode": 6,
        "released": "2021-11-01",
        "overview": "As Halloween draws near, Calvin tries to determine what's behind the sudden strange occurrences at the Butlers' house. Also, Gemma and Tina question if their days of sexy costumes should be behind them."
      },
      {
        "id": "tvmaze:2192820",
        "title": "Welcome to the Ex-Files",
        "season": 4,
        "episode": 7,
        "released": "2021-11-08",
        "overview": "Calvin is thrilled when he unexpectedly crosses paths with NFL legend Jerome \"The Bus\" Bettis - until he discovers the Hall of Fame football player shares a history with Tina. Also, Dave deals with the fallout of a romantic revelation of his own."
      },
      {
        "id": "tvmaze:2208224",
        "title": "Welcome to the Family Business",
        "season": 4,
        "episode": 8,
        "released": "2021-11-29",
        "overview": "When Tina struggles to keep up with her job at Calvin's auto shop, due to her burgeoning baking business, he faces a tough decision: should he fire his own wife? Also, Malcolm delays breaking up with a girlfriend when her son becomes an unexpected asset to his youth baseball team."
      },
      {
        "id": "tvmaze:2218688",
        "title": "Welcome to the Splurge",
        "season": 4,
        "episode": 9,
        "released": "2021-12-06",
        "overview": "Calvin decides to splurge on an expensive jacket, then worries it's too special to risk wearing outside the house. Also, Dave and Gemma worry their new friends' daughter is a bad influence on Grover."
      },
      {
        "id": "tvmaze:2229531",
        "title": "Welcome to Jury Duty",
        "season": 4,
        "episode": 10,
        "released": "2022-01-03",
        "overview": "Calvin and Dave are both chosen to serve as jurors on the same trial. Also, Malcolm and Marty get a big surprise when they fail to ask what the movie's about after they rent out their house for a film shoot."
      },
      {
        "id": "tvmaze:2245376",
        "title": "Welcome to the Knockout",
        "season": 4,
        "episode": 11,
        "released": "2022-01-17",
        "overview": "As Dave nears his 40th birthday, Calvin offers to coach his friend for an amateur boxing tournament. Also, sparks fly when Marty meets a new woman at the gym."
      },
      {
        "id": "tvmaze:2245377",
        "title": "Welcome to the Big One",
        "season": 4,
        "episode": 12,
        "released": "2022-01-24",
        "overview": "The Butlers and Johnsons are rattled in different ways after an earthquake strikes, with Calvin and Tina moving in with Malcolm and Marty while their home is repaired, and Dave going to extremes trying to prepare his family for the next time."
      },
      {
        "id": "tvmaze:2273066",
        "title": "Welcome to the Stakeout",
        "season": 4,
        "episode": 13,
        "released": "2022-02-28",
        "overview": "When there's a break-in at Calvin's business, he teams up with Dave for a stakeout to catch the culprit in the act. Also, Gemma is uncharacteristically reluctant to share her new hobby with Tina."
      },
      {
        "id": "tvmaze:2273067",
        "title": "Welcome to the Big Little Leagues",
        "season": 4,
        "episode": 14,
        "released": "2022-03-07",
        "overview": "Calvin and Malcolm butt heads on coaching styles as Malcolm's little league team approaches its first game of the season. Also, Tina tries to win over a food critic she inadvertently offended before he reviews her cupcakes."
      },
      {
        "id": "tvmaze:2277706",
        "title": "Welcome to the Remodel",
        "season": 4,
        "episode": 15,
        "released": "2022-03-14",
        "overview": "After months of crashing with Malcolm and Marty, Calvin and Tina finally reveal the impressive results of their major home renovation. Also, Dave and Gemma decide it's time to have \"the talk\" with Grover."
      },
      {
        "id": "tvmaze:2279988",
        "title": "Welcome to the Man Code",
        "season": 4,
        "episode": 16,
        "released": "2022-03-21",
        "overview": "When Calvin discovers his friend, Lorenzo, is harboring a secret, he struggles with whether to share the info with Tina. Also, Dave becomes concerned about Gemmas growing closeness to a coach at her school."
      },
      {
        "id": "tvmaze:2279989",
        "title": "Welcome to Bro Money, Bro Problems",
        "season": 4,
        "episode": 17,
        "released": "2022-03-28",
        "overview": "Calvin's wealthy and impulsive brother Curtis makes a surprise visit, creating chaos in the Butlers' lives. Also, Dave and Gemma run into challenges while trying to declutter their home."
      },
      {
        "id": "tvmaze:2301295",
        "title": "Welcome to the Feud",
        "season": 4,
        "episode": 18,
        "released": "2022-04-18",
        "overview": "When Dave's job requires him to mediate a feud between two wealthy brothers, Calvin tries to help find common ground but winds up complicating the process. Also, Gemma turns to Tina for assistance in navigating Grover's first crush."
      },
      {
        "id": "tvmaze:2310016",
        "title": "Welcome to the Quinceañera",
        "season": 4,
        "episode": 19,
        "released": "2022-05-02",
        "overview": "A teen Calvin is mentoring at his auto shop. Also, Dave and Gemma introduce Malcolm to a college baseball coach who has the potential to change his future."
      },
      {
        "id": "tvmaze:2313315",
        "title": "Welcome to the Mama Drama",
        "season": 4,
        "episode": 20,
        "released": "2022-05-09",
        "overview": "When Calvin is honored by the Chamber of Commerce for the positive impact his business has had on the community, he hopes to finally gain the approval of his mother, Marilyn."
      },
      {
        "id": "tvmaze:2313316",
        "title": "Welcome to the Dream Girls",
        "season": 4,
        "episode": 21,
        "released": "2022-05-16",
        "overview": "When Tina reunites with her former girl group after decades apart, old issues are reignited, threatening to derail the trio's big performance."
      },
      {
        "id": "tvmaze:2317836",
        "title": "Welcome to the Ring",
        "season": 4,
        "episode": 22,
        "released": "2022-05-23",
        "overview": "As Marty prepares to propose to his girlfriend, Calvin and Tina work with party planner Chika to throw a celebration that properly honors their future daughter-in-law's Nigerian heritage."
      },
      {
        "id": "tvmaze:2351652",
        "title": "Welcome Back to the Neighborhood",
        "season": 5,
        "episode": 1,
        "released": "2022-09-19",
        "overview": "When Dave decides to disconnect the Johnson home from the grid, he inadvertently causes a community-wide power outage, much to Calvin's frustration. Also, in the wake of Marty's engagement, Tina struggles with no longer being the primary woman in her son's life."
      },
      {
        "id": "tvmaze:2385592",
        "title": "Welcome to the Pit Stop How May I Help You",
        "season": 5,
        "episode": 2,
        "released": "2022-09-26",
        "overview": "When Calvin takes Dave's suggestion to try a new method of promoting his business, he soon comes to regret it. Also, Gemma recruits Tina to rescue her struggling after-school music program."
      },
      {
        "id": "tvmaze:2391179",
        "title": "Welcome to the Ballgame",
        "season": 5,
        "episode": 3,
        "released": "2022-10-03",
        "overview": "When Malcolm treats Calvin, Dave, Gemma and Grover to VIP tickets to a Dodgers game, the outing isn't quite a home run. Also, Marty's movie night with fiancée Necie goes sideways when Tina decides to join."
      },
      {
        "id": "tvmaze:2399098",
        "title": "Welcome to the New Deal",
        "season": 5,
        "episode": 4,
        "released": "2022-10-10",
        "overview": "When Calvin is overwhelmed by work, Dave volunteers to counsel his friend, while also logging hours necessary for his therapist certification at the VA. Also, Tina confides in Gemma that she's eager to make a career change."
      },
      {
        "id": "tvmaze:2399099",
        "title": "Welcome to the Art of Negotiation",
        "season": 5,
        "episode": 5,
        "released": "2022-10-17",
        "overview": "When Dave is up for a promotion at work, Calvin tries to help him negotiate a raise from his penny-pinching new boss, Gregory. Also, Tina struggles with whether to share some sensitive information with Gemma."
      },
      {
        "id": "tvmaze:2404435",
        "title": "Welcome to the Hot Prospect",
        "season": 5,
        "episode": 6,
        "released": "2022-10-24",
        "overview": "When Calvin stumbles upon a big business opportunity, he must convince Malcolm to help him so he can seal the deal. Also, Gemma is forced to confront a secret from her beauty pageant past when a friend from her hometown arrives."
      },
      {
        "id": "tvmaze:2418667",
        "title": "Welcome to the Working Week",
        "season": 5,
        "episode": 7,
        "released": "2022-11-14",
        "overview": "When a man moves his family from Michigan to Los Angeles, he realizes that the secret to fitting in with his new neighborhood is befriending the opinionated man who lives next door."
      },
      {
        "id": "tvmaze:2422058",
        "title": "Welcome to What Used to be the Neighborhood",
        "season": 5,
        "episode": 8,
        "released": "2022-11-21",
        "overview": "When Calvin's favorite restaurant closes and is replaced by a flashy pet spa, he worries the community is losing too many small businesses and starts a campaign to only buy local. Also, Tina helps Necie prepare a special surprise for Marty."
      },
      {
        "id": "tvmaze:2414550",
        "title": "Welcome to Our Time",
        "season": 5,
        "episode": 9,
        "released": "2022-12-05",
        "overview": "Calvin weighs the pros and cons of making a major life change. Also, Marty turns to Dave for help dealing with a troubling discovery."
      },
      {
        "id": "tvmaze:2441038",
        "title": "Welcome to the Getaway",
        "season": 5,
        "episode": 10,
        "released": "2023-01-16",
        "overview": "Calvin and Tina decide to take the honeymoon they never had to Madrid. Also, Dave and Gemma team up with Malcolm and Marty on a project intended to surprise Calvin upon his return."
      },
      {
        "id": "tvmaze:2469138",
        "title": "Welcome to the Cornhole",
        "season": 5,
        "episode": 11,
        "released": "2023-01-23",
        "overview": "When Tina insists Calvin find something to do in retirement, he decides to enter a competitive cornhole tournament - even though he's never played before. Also, Marty plans an elaborate \"groom-posal\" to ask Malcolm to be his best man."
      },
      {
        "id": "tvmaze:2469139",
        "title": "Welcome to the Bachelor Party",
        "season": 5,
        "episode": 12,
        "released": "2023-02-06",
        "overview": "A bombshell about Marty's future plans leaves Calvin and Tina reeling, and Dave unleashes his wild side at Marty's bachelor party."
      },
      {
        "id": "tvmaze:2479521",
        "title": "Welcome to the Last Dance",
        "season": 5,
        "episode": 13,
        "released": "2023-02-13",
        "overview": "The Butlers and Johnsons come together to support Marty in the aftermath of a major life change."
      },
      {
        "id": "tvmaze:2484355",
        "title": "Welcome to New Beginnings",
        "season": 5,
        "episode": 14,
        "released": "2023-02-27",
        "overview": "When a new business in the community begins using Calvin's likeness without his permission, Dave volunteers to mediate on his friend's behalf."
      },
      {
        "id": "tvmaze:2492349",
        "title": "Welcome to the Next Big Thing",
        "season": 5,
        "episode": 15,
        "released": "2023-03-13",
        "overview": "Calvin and Marty consider starting a new business together. Also, Dave sets up a mini library stocked with a self-help book he authored."
      },
      {
        "id": "tvmaze:2498932",
        "title": "Welcome to the Jungle",
        "season": 5,
        "episode": 16,
        "released": "2023-03-20",
        "overview": "When a mountain lion gets loose in the area, the Butlers and Johnsons must shelter in place together, leading to some unexpected revelations."
      },
      {
        "id": "tvmaze:2502923",
        "title": "Welcome to the Milestone",
        "season": 5,
        "episode": 17,
        "released": "2023-04-10",
        "overview": "Calvin struggles to find the perfect birthday gift for Tina. Also, Gemma works a connection to actor Jerry O'Connell, whose kids attend Walcott Academy, to secure VIP tickets to THE TALK for her school's fundraiser."
      },
      {
        "id": "tvmaze:2506036",
        "title": "Welcome to the Future",
        "season": 5,
        "episode": 18,
        "released": "2023-04-17",
        "overview": "Calvin and Marty encounter difficulties trying to secure financing for their new business. Also, Dave invites his boss, Gregory, to Grover's 13th birthday party, much to Gemma's frustration."
      },
      {
        "id": "tvmaze:2506037",
        "title": "Welcome to the New Do",
        "season": 5,
        "episode": 19,
        "released": "2023-05-01",
        "overview": "With her usual stylist unavailable, Gemma decides to use Tina's hairdresser for an important work event; Malcolm discovers a connection with his new professor."
      },
      {
        "id": "tvmaze:2506038",
        "title": "Welcome to the Other Neighborhood",
        "season": 5,
        "episode": 20,
        "released": "2023-05-08",
        "overview": "Calvin and Marty are surprised when their new business sparks protests from residents concerned about gentrification; Grover's family tree project reveals unexpected fresh details about both a ancestor and the whereabouts of Dave's estranged father, who left when he was a child."
      },
      {
        "id": "tvmaze:2506039",
        "title": "Welcome to the Fatherhood",
        "season": 5,
        "episode": 21,
        "released": "2023-05-15",
        "overview": "When Dave's estranged father, Lamar, arrives in town eager to reconnect, his son finally learns the truth about his disappearance 30 years prior. Also, Marty struggles to fire an underperforming employee."
      },
      {
        "id": "tvmaze:2506040",
        "title": "Welcome to the Opening Night",
        "season": 5,
        "episode": 22,
        "released": "2023-05-22",
        "overview": "Calvin pushes Marty to move up the opening of their new business to get a valuable celebrity endorsement from D.L. Hughley, while Dave continues to struggle with the return of his father, Lamar, and Tina and Gemma prepare for the opening of their new school play."
      },
      {
        "id": "tvmaze:2687443",
        "title": "Welcome to the Foos Box",
        "season": 6,
        "episode": 1,
        "released": "2024-02-12",
        "overview": "Gemma and Dave are adjusting to Grover growing up and becoming a teenager, and Marty and Calvin are struggling with different management styles at work. Also, we meet one of Marty's new employees, Courtney, who might become something more."
      },
      {
        "id": "tvmaze:2752562",
        "title": "Welcome to the Awkward Conversations",
        "season": 6,
        "episode": 2,
        "released": "2024-02-19",
        "overview": "Marty and Courtney are navigating the pregnancy news and what it all means for their future, while Malcolm is dealing with his own workplace relationship."
      },
      {
        "id": "tvmaze:2769548",
        "title": "Welcome to the Other Butlers",
        "season": 6,
        "episode": 3,
        "released": "2024-02-26",
        "overview": "Calvin and Tina are looking to remodel their home when they uncover discriminatory processes with their bank's appraiser. Meanwhile, Marty asks Trey for fatherly advice on co-parenting with Courtney."
      },
      {
        "id": "tvmaze:2771203",
        "title": "Welcome to Grandfatherhood",
        "season": 6,
        "episode": 4,
        "released": "2024-03-11",
        "overview": "Calvin is adjusting to getting older and the new stages of parenting, while Malcolm questions his career path. Lamar shows up to spend more time with Grover, which forces Gemma and Dave to loosen the reins a bit."
      },
      {
        "id": "tvmaze:2783284",
        "title": "Welcome to the Front Window",
        "season": 6,
        "episode": 5,
        "released": "2024-03-25",
        "overview": "While Calvin is cooped up at home recovering, he begins spying on his neighbors from the window. He comes to believe that something sketchy is going on across the street, so the whole crew helps him figure out how to catch their new neighbor in the act."
      },
      {
        "id": "tvmaze:2793884",
        "title": "Welcome to the Walkout",
        "season": 6,
        "episode": 6,
        "released": "2024-04-01",
        "overview": "While Gemma is holding a fundraiser for a new school pool, Tina and the other teachers are being overworked. Meanwhile, Dave convinces Calvin to finally commit to doing physical therapy for his knee."
      },
      {
        "id": "tvmaze:2802173",
        "title": "Welcome to the Stand-Off",
        "season": 6,
        "episode": 7,
        "released": "2024-04-15",
        "overview": "Gemma and Tina are at odds with one another and Dave and Calvin try to bring them back together. Meanwhile, Marty is sick and not handling it well, so Malcolm fills in for him and goes to a baby class with Courtney."
      },
      {
        "id": "tvmaze:2809346",
        "title": "Welcome to the Baby Shower",
        "season": 6,
        "episode": 8,
        "released": "2024-04-22",
        "overview": "Courtney and Marty deal with some baby shower drama with Tina, while Lamar adjusts to a new job at the Fuse Box."
      },
      {
        "id": "tvmaze:2818439",
        "title": "Welcome to the Name Drop",
        "season": 6,
        "episode": 9,
        "released": "2024-04-29",
        "overview": "Marty and Courtney's baby name gets spread around because nobody can keep a secret. Meanwhile, Dave is assigned the ever-complicated task of assembling the diaper changing table."
      },
      {
        "id": "tvmaze:2824033",
        "title": "Welcome to the World",
        "season": 6,
        "episode": 10,
        "released": "2024-05-06",
        "overview": "The whole crew heads out to see Toni Braxton live in concert, but just as the show begins, Courtney's water breaks."
      },
      {
        "id": "tvmaze:2941508",
        "title": "Welcome to the Neighborhood, Daphne",
        "season": 7,
        "episode": 1,
        "released": "2024-10-21",
        "overview": "Marty and Courtney bring baby Daphne home from the hospital and Calvin is surprised to learn that Marty plans to take the paternity leave Dave offered in the employee handbook for the Fuse Box. Also, Tina will do anything to earn Daphne's love."
      },
      {
        "id": "tvmaze:3020447",
        "title": "Welcome to the Big Sleep",
        "season": 7,
        "episode": 2,
        "released": "2024-10-28",
        "overview": "As Marty and Courtney struggle to get their newborn to sleep, the entire Butler family suffers along with them. While Calvin prefers to let the new parents figure it out, Tina insists on jumping in to help with Baby Daphne any way she can. When searching for their old baby swing, Dave finds an old list he made of cool things to do before age 40, which sends him spiraling as he realizes he hasn't accomplished any of them"
      },
      {
        "id": "tvmaze:3025845",
        "title": "Welcome to the Vote",
        "season": 7,
        "episode": 3,
        "released": "2024-11-04",
        "overview": "Dave gathers everyone for a lengthy ballot-palooza party to discuss the merits of every candidate and prop on each of their election ballots. Also, Gemma is determined to run a tight ship as their local precinct captain when polls open at Walcott Academy."
      },
      {
        "id": "tvmaze:3029711",
        "title": "Welcome to the Great Beyond",
        "season": 7,
        "episode": 4,
        "released": "2024-11-11",
        "overview": "The Butlers and Johnsons receive shocking news about their neighbor that changes their outlook on life."
      },
      {
        "id": "tvmaze:3046846",
        "title": "Welcome to Commitment",
        "season": 7,
        "episode": 5,
        "released": "2024-11-25",
        "overview": "Marty and Courtney prepare for Daphne's christening. Meanwhile, Malcolm is dating someone new and Tina is delighted to meet her."
      },
      {
        "id": "tvmaze:3046847",
        "title": "Welcome to Daddy Issues",
        "season": 7,
        "episode": 6,
        "released": "2024-12-02",
        "overview": "Tina's newly single father visits. Meanwhile, Dave and Gemma try to curb their spending so they can afford to send Grover to a private high school."
      },
      {
        "id": "tvmaze:3052622",
        "title": "Welcome to the Wicked Stepmother",
        "season": 7,
        "episode": 7,
        "released": "2024-12-09",
        "overview": "Tina discovers her father has age-related impairments, making it crucial to reunite him with his wife. Meanwhile, Daphne gets her first little baby boo-boo."
      },
      {
        "id": "tvmaze:3052623",
        "title": "Bienvenidos a Nosotros",
        "season": 7,
        "episode": 8,
        "released": "2024-12-16",
        "overview": "Marty prepares to head back to work but isn't emotionally prepared to send Daphne to daycare. Meanwhile, Gemma notices an issue with the grade Grover's receiving in his Spanish class."
      },
      {
        "id": "tvmaze:3052624",
        "title": "Welcome to Pickleball",
        "season": 7,
        "episode": 9,
        "released": "2025-01-27",
        "overview": "The new neighbors who moved into Miss Kim's old house are keeping the Butlers and Johnsons up all night. Meanwhile, Courtney tells Marty she is going on a date."
      },
      {
        "id": "tvmaze:3107643",
        "title": "Welcome to the Pickle",
        "season": 7,
        "episode": 10,
        "released": "2025-02-03",
        "overview": "The Johnsons and Butlers are curious about their new neighbors' lifestyle and their interest raises some surprising questions. Also, Marty feels pressure to enroll Daphne in the best preschool."
      },
      {
        "id": "tvmaze:3112108",
        "title": "Welcome to the e-Neighborhood",
        "season": 7,
        "episode": 11,
        "released": "2025-02-10",
        "overview": "A new community social app shakes up the neighborhood. Also, Marty and Courtney attend a family class with Daphne and unexpectedly bump into Marty's high school sweetheart."
      },
      {
        "id": "tvmaze:3129889",
        "title": "Welcome to Getting Lucky",
        "season": 7,
        "episode": 12,
        "released": "2025-02-24",
        "overview": "Calvin and Dave join Lamar on a road trip to the casino. Also, Tina and Gemma babysit Daphne while Marty desperately tries to spend time with Courtney alone."
      },
      {
        "id": "tvmaze:3140062",
        "title": "Welcome to Not Being in It",
        "season": 7,
        "episode": 13,
        "released": "2025-03-03",
        "overview": "Calvin and Dave return from the casino, stunned by the revelation that Lamar had been laundering stolen money, which has now landed him in jail. Meanwhile, Malcom runs into his frenemy."
      },
      {
        "id": "tvmaze:3159972",
        "title": "Welcome to the Blowout",
        "season": 7,
        "episode": 14,
        "released": "2025-03-24",
        "overview": "Calvin spends a day babysitting Daphne. Also, Gemma and Dave worry about Grover's high school applications."
      },
      {
        "id": "tvmaze:3167971",
        "title": "Welcome to the Signature Service Loyalty Rewards Program",
        "season": 7,
        "episode": 15,
        "released": "2025-03-31",
        "overview": "Malcom receives an unexpected call from USC's athletic director about a baseball head coach vacancy. Meanwhile, Calvin and Marty start a new signature loyalty rewards program at The Fuse Box."
      },
      {
        "id": "tvmaze:3180998",
        "title": "Welcome to the Sting",
        "season": 7,
        "episode": 16,
        "released": "2025-04-14",
        "overview": "Calvin and Marty send Courtney on a mission to find out information about Fuse Box's impressive new rival. Meanwhile, Malcolm attends an event for his creative writing program at USC, where he scores a meeting with a book agent, Lisa."
      },
      {
        "id": "tvmaze:3180999",
        "title": "Welcome to Your Own Medicine",
        "season": 7,
        "episode": 17,
        "released": "2025-04-21",
        "overview": "After Dave's disastrous attempt to dunk a basketball, Calvin takes care of his injured neighbor. Also, Gemma befriends a cool mom group while babysitting Daphne."
      },
      {
        "id": "tvmaze:3181000",
        "title": "Welcome to the Yippedy-Dip",
        "season": 7,
        "episode": 18,
        "released": "2025-04-28",
        "overview": "The Butlers visit a nostalgic, rundown restaurant from Calvin's childhood and encounter its owner, Jasper. Meanwhile, Dave, Gemma, and Dave's mother, Paula, pay a visit to Lamar in prison."
      },
      {
        "id": "tvmaze:3181001",
        "title": "Welcome to Pomp and Circumstance",
        "season": 7,
        "episode": 19,
        "released": "2025-05-05",
        "overview": "Tina and Gemma plan a joint graduation party for Malcolm and Grover, on part one of the hour-long seventh season finale."
      },
      {
        "id": "tvmaze:3181002",
        "title": "Welcome to Venice",
        "season": 7,
        "episode": 20,
        "released": "2025-05-05",
        "overview": "The Butlers and Johnsons help Malcolm start a new chapter in a new city that, while just across town, is worlds away from the neighborhood, on part two of the hour-long seventh season finale."
      },
      {
        "id": "tvmaze:3301100",
        "title": "Welcome to the New Normals",
        "season": 8,
        "episode": 1,
        "released": "2025-10-13",
        "overview": "The Johnsons and Butlers face big changes and unexpected challenges as Tina discovers a new passion, Malcolm navigates work and family boundaries and Courtney takes a major step with Marty. Meanwhile, Dave's tech experiment backfires and Gemma's parenting plan goes awry."
      },
      {
        "id": "tvmaze:3383327",
        "title": "Welcome to the Downsizing",
        "season": 8,
        "episode": 2,
        "released": "2025-10-20",
        "overview": "Calvin and Marty face permit delays at Westside Fuse Box, pushing back the grand opening, while Malcolm's booming writing career sparks an urgent search for a new nanny. Over at the Johnson house, Dave is still struggling to bounce back after being fired."
      },
      {
        "id": "tvmaze:3383328",
        "title": "Welcome to Spades",
        "season": 8,
        "episode": 3,
        "released": "2025-10-27",
        "overview": "Marty and Courtney's nanny search takes an awkward turn, while Calvin's secret spades night stirs tension at home. Meanwhile, Dave's new hobby tests everyone's patience, and a texting miscommunication between Tina and Gemma leads to a fiery confrontation."
      },
      {
        "id": "tvmaze:3394720",
        "title": "Welcome to Family Value",
        "season": 8,
        "episode": 4,
        "released": "2025-11-03",
        "overview": "Malcolm's home renovation takes an unexpected turn when Calvin's cousin Crutch shows up uninvited to fix his floors. Meanwhile, Dave's attempts to help around the house and support Grover's booming T-shirt business lead to more stress than he bargained for."
      },
      {
        "id": "tvmaze:3400724",
        "title": "Welcome to New Horizons",
        "season": 8,
        "episode": 5,
        "released": "2025-11-10",
        "overview": "Dave's silent auction wins lead to a classical concert outing with Gemma and the Butlers that quickly goes off the rails. Meanwhile, Malcolm's ghostwriting gig takes a surprising turn when Tina encourages him to dive into reality TV for inspiration - sparking an unexpected obsession."
      },
      {
        "id": "tvmaze:3424498",
        "title": "Welcome to the Walk of Roses",
        "season": 8,
        "episode": 6,
        "released": "2025-11-17",
        "overview": "Calvin receives an unexpected honor that sparks mixed emotions, while Malcolm's ghostwriting gig takes a wild turn after a viral outburst from his celebrity client."
      },
      {
        "id": "tvmaze:3435130",
        "title": "Welcome to Babies and Bathwater",
        "season": 8,
        "episode": 7,
        "released": "2025-12-01",
        "overview": "Dave's ambitious home improvement plans take a turn, prompting Calvin to step in, while Malcolm seeks Gemma's help to overcome writer's block. Meanwhile, Tina's suggestion for Daphne sparks a parenting dilemma for Courtney."
      }
    ]
  }
}