{
  "meta": {
    "id": "tvmaze:394",
    "type": "series",
    "name": "Call the Midwife",
    "description": "Drama following the lives of a group of midwives working in the poverty-stricken East End of London during the 1950s &amp; decades following.  Based on the best-selling memoirs of Jennifer Worth.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/550/1377077.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/550/1377077.jpg",
    "videos": [
      {
        "id": "tvmaze:3459094",
        "title": "Christmas Specials 2025 - Episode 1",
        "season": 14,
        "episode": null,
        "released": "2025-12-25",
        "overview": "Senior members of Nonnatus House travel to Hong Kong to tackle a crisis at the order's branch house, and Dr Turner and Shelagh search for May's birth mother."
      },
      {
        "id": "tvmaze:3459095",
        "title": "Christmas Specials 2025 - Episode 2",
        "season": 14,
        "episode": null,
        "released": "2025-12-26",
        "overview": "The work of the Nonnatus team in Hong Kong is threatened, whilst back in Poplar, the young midwives throw a wild party at Nonnatus House."
      },
      {
        "id": "tvmaze:38987",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2012-01-15",
        "overview": "Nurse Jenny Lee arrives at Nonnatus House in London's East End to begin her work as a midwife. Naive and unused to the harsh conditions of the borough, she must rise above her misgivings if she is to succeed in her new role."
      },
      {
        "id": "tvmaze:38988",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2012-01-22",
        "overview": "A new midwife, Chummy Browne, arrives at Nonnatus House, and finds it difficult to prove herself. Meanwhile, Jenny befriends a young Irish prostitute who is expecting a baby, and is shocked by the Church's treatment of the girl."
      },
      {
        "id": "tvmaze:38989",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2012-01-29",
        "overview": "Jenny befriends an old soldier named Joe, and is disturbed by his living conditions. She is also visited by a man from her past, while Trixie and Cynthia have a sensitive case to deal with, and Chummy is asked on a date."
      },
      {
        "id": "tvmaze:38990",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2012-02-05",
        "overview": "A new baby is snatched from her pram, sparking an area wide search. Jenny is more familiar with the kidnapper than she realizes, Cynthia blames herself when a patient becomes gravely ill, and Chummy's romance continues."
      },
      {
        "id": "tvmaze:38991",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2012-02-12",
        "overview": "A figure from Jenny's past makes contact, while Jimmy continues to pursue her. Chummy prepares for an important meeting, and everyone at Nonnatus House rallies round the building's cleaner, Peggy, whose brother is very ill."
      },
      {
        "id": "tvmaze:38992",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2012-02-19",
        "overview": "Jenny speaks to her ex-lover again, while Sister Monica Joan lands herself in trouble with the police. Chummy receives a visit from her snobbish, imperious mother which forces her to reconsider her relationship with Peter."
      },
      {
        "id": "tvmaze:38994",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2013-01-20",
        "overview": "Jenny celebrates her birthday with Chummy and the girls, but soon after finds herself taking care of a patient in an abusive marriage."
      },
      {
        "id": "tvmaze:38995",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2013-01-27",
        "overview": "Cynthia comes under scrutiny when a child she has delivered dies suddenly. Jimmy reappears in Jenny's life with surprising results."
      },
      {
        "id": "tvmaze:38996",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2013-02-03",
        "overview": "Jenny is seconded to the London Hospital, while back in Poplar the midwives are introduced to a forthright pair of identical twins, one of whom is pregnant."
      },
      {
        "id": "tvmaze:38997",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2013-02-10",
        "overview": "Jenny needs all her skill as a midwife when she assists at the birth of a disabled baby, and Nonnatus House plays host to an eccentric acquaintance of Chummy's."
      },
      {
        "id": "tvmaze:38998",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2013-02-17",
        "overview": "The whole Poplar community pulls together to prepare for the annual summer fete. With the introduction of a baby show, the midwives will be more involved than ever."
      },
      {
        "id": "tvmaze:38999",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2013-02-24",
        "overview": "Dr Turner manages to get Poplar included in the mass X-ray screening programme for TB. Meanwhile, Jenny's district nursing rounds introduce her to a family who have been devastated by the disease."
      },
      {
        "id": "tvmaze:39000",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2013-03-03",
        "overview": "Cynthia's district nursing rounds find her tending to a diabetic John Lacey, a deplorable bully who consistently belittles his wife."
      },
      {
        "id": "tvmaze:39001",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2013-03-10",
        "overview": "Change is in the air for the residents of Nonnatus House, as Chummy prepares for motherhood and Sister Bernadette tries to decide on her future."
      },
      {
        "id": "tvmaze:39003",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2014-01-19",
        "overview": "Sister Monica Joan holds the key to the diagnosis of a mystery illness, and Chummy calls on her royal connections."
      },
      {
        "id": "tvmaze:39004",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2014-01-26",
        "overview": "A newly-promoted Jenny faces her most challenging case yet, and Cynthia introduces a new birthing practice to Poplar's expectant mothers."
      },
      {
        "id": "tvmaze:39005",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2014-02-02",
        "overview": "Sister Julienne and Trixie are rostered to work at Holloway Prison, and Shelagh receives a devastating diagnosis."
      },
      {
        "id": "tvmaze:39006",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2014-02-09",
        "overview": "Jenny's life is turned upside down when Alec has a terrible accident. Sister Winifred helps a holocaust survivor bury the past and Shelagh decides to join the local choir."
      },
      {
        "id": "tvmaze:39007",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2014-02-16",
        "overview": "When a young woman with Down's syndrome is discovered pregnant, sinister circumstances are assumed. Meanwhile, as the nuns organise celebrations for Sister Evangelina's jubilee, Nonnatus House greets new midwife Patsy. Elsewhere, Timothy Turner takes his first steps without his callipers."
      },
      {
        "id": "tvmaze:39008",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2014-02-23",
        "overview": "Patsy's brusque manner lands her in trouble with the nuns and she is removed from midwifery duties. Soon after, she finds herself taking care of a male patient who is on bed rest after an accident at work.Trixie agrees to go on a date with a curate, Tom Hereward. Dr Turner and Shelagh discuss how they might expand their family."
      },
      {
        "id": "tvmaze:39009",
        "title": "Episode 7",
        "season": 3,
        "episode": 7,
        "released": "2014-03-02",
        "overview": "As Jenny returns to Nonnatus House, her encounter with nervous expectant mum Faye forces her to break the rules. Chummy throws herself into preparations for her mother's visit, whilst Sister Julienne and Cynthia deal with acute mental illness in a newly delivered mother."
      },
      {
        "id": "tvmaze:39010",
        "title": "Episode 8",
        "season": 3,
        "episode": 8,
        "released": "2014-03-09",
        "overview": "As preparations are made for Chummy to nurse her dying mother at home, Jenny finds herself drawn to help. Whilst Shelagh and Dr Turner await news from the Adoption Society, Shelagh pulls out all the stops when she enters her choir into a competition."
      },
      {
        "id": "tvmaze:117374",
        "title": "Episode 1",
        "season": 4,
        "episode": 1,
        "released": "2015-01-18",
        "overview": "A chance encounter with an impoverished child forces Trixie to see an unfamiliar darker side of life. As Nonnatus House welcomes a new resident, Nurse Barbara Gilbert, Tom Hereward has a surprise romantic gesture in store for Trixie."
      },
      {
        "id": "tvmaze:118455",
        "title": "Episode 2",
        "season": 4,
        "episode": 2,
        "released": "2015-01-25",
        "overview": "Barbara faces her most challenging case to date when she treats a first-time mother and the birth does not go according to plan."
      },
      {
        "id": "tvmaze:122986",
        "title": "Episode 3",
        "season": 4,
        "episode": 3,
        "released": "2015-02-01",
        "overview": "The Nonnatus team rallies to support first-time parents Marie and Tony Amos when Tony is arrested for gross indecency with another male. Elsewhere, as Poplar is gripped by an outbreak of dysentery, Trixie undertakes her first official church duty since her engagement to Tom."
      },
      {
        "id": "tvmaze:122987",
        "title": "Episode 4",
        "season": 4,
        "episode": 4,
        "released": "2015-02-08",
        "overview": "The midwives face one of their busiest nights to date, whilst Sister Winifred concentrates her efforts on the prostitutes of Poplar. Elsewhere, cracks start to appear in Trixie and Tom Hereward's relationship."
      },
      {
        "id": "tvmaze:128896",
        "title": "Episode 5",
        "season": 4,
        "episode": 5,
        "released": "2015-02-15",
        "overview": "Sister Julienne's faith is challenged when a mother refuses medicine for her newborn baby. Dr Turner's involvement in the case forces him to face his own demons. Meanwhile, Barbara must work out a way to communicate with a pregnant Sylheti woman."
      },
      {
        "id": "tvmaze:134749",
        "title": "Episode 6",
        "season": 4,
        "episode": 6,
        "released": "2015-02-22",
        "overview": "A young diabetic girl faces heartbreak when she falls pregnant as a result of a clandestine romance. Elsewhere, the midwives become involved with a settlement of Irish Travellers and Sister Mary Cynthia delivers her first baby since becoming a nun."
      },
      {
        "id": "tvmaze:134750",
        "title": "Episode 7",
        "season": 4,
        "episode": 7,
        "released": "2015-03-01",
        "overview": "The maternity home sees two school friends reunited and their lives become intertwined in the most unexpected way."
      },
      {
        "id": "tvmaze:134751",
        "title": "Episode 8",
        "season": 4,
        "episode": 8,
        "released": "2015-03-08",
        "overview": "Trixie and Sister Mary Cynthia team up to support a deaf mother-to-be, while a case of morning sickness proves more serious than initially suspected. Elsewhere, Fred's daughter is less than delighted about his forthcoming wedding."
      },
      {
        "id": "tvmaze:473914",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2016-01-17",
        "overview": "As Easter approaches, the midwives are shook by a baby born with severe deformities. Trixie begins teaching keep-fit classes, but she starts questioning the relationship between women and their bodies when a there's a medical emergency for one of her students."
      },
      {
        "id": "tvmaze:557412",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2016-01-24",
        "overview": "A struggling dockworker's wife is forced into making a difficult decision about her upcoming birth, also putting pressure on Barbara who faces the test of her career so far. Nurse Crane makes a new friend. Evangelina has to take action as a mistake from the past comes to light."
      },
      {
        "id": "tvmaze:560293",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2016-01-31",
        "overview": "A closely knit family may be broken apart when a outbreak of typhoid erupts and there's suspicions over the carrier. Sister Winfred faces a dilemma when a local teacher reveals she is pregnant to a local man. Barbara goes to dinner with Tom, but is worried about how Trixie will react."
      },
      {
        "id": "tvmaze:560294",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2016-02-07",
        "overview": "Sister Julienne is on secondment and is amazed by the medical advances in use at a busy local hospital. A traumatic birth however soon leads her to question moral issues. Ian is overjoyed when he is accepted into university, but Linda falls pregnant and could throw his plans into jeopardy. Trixie and Tom try and help Linda and Ian out, as the family begins to fall apart."
      },
      {
        "id": "tvmaze:560295",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2016-02-14",
        "overview": "New mother Roseanne's past continues to haunt her, wreaking havoc on her family life, and a back injury forces Violet to put her beloved shop in the care of Fred."
      },
      {
        "id": "tvmaze:560296",
        "title": "Episode 6",
        "season": 5,
        "episode": 6,
        "released": "2016-02-21",
        "overview": "A spate of violent attacks on women impacts directly on the residents of Nonnatus House. A secret pregnancy threatens the life of a young girl."
      },
      {
        "id": "tvmaze:560297",
        "title": "Episode 7",
        "season": 5,
        "episode": 7,
        "released": "2016-02-28",
        "overview": "Dr Turner prepares for the introduction of the contraceptive pill, while Patsy struggles to help a Bargee woman who is determined to give birth among her own community."
      },
      {
        "id": "tvmaze:560298",
        "title": "Episode 8",
        "season": 5,
        "episode": 8,
        "released": "2016-03-06",
        "overview": "Poplar is shaken as the cause of recent infant deformities is revealed, whilst a tragedy throws Nonnatus House into disarray."
      },
      {
        "id": "tvmaze:1024547",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2017-01-22",
        "overview": "The team reunite but all is not well when a change of management shakes up Nonnatus House."
      },
      {
        "id": "tvmaze:1039611",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2017-01-29",
        "overview": "An explosion at the docks brings heartache to the people of Poplar, whilst Sister Ursula continues to ruffle feathers with her unpopular decisions."
      },
      {
        "id": "tvmaze:1039794",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2017-02-05",
        "overview": "New legislation and Sister Ursula cause serious problems for Shelagh and Dr Turner. Meanwhile, a first-time mother from the Chinese community faces an unexpected crisis."
      },
      {
        "id": "tvmaze:1039795",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2017-02-12",
        "overview": "An expectant mother with financial struggles enters into a painful arrangement with her cousin. As Tom provides pastoral care, he reveals why this case touched him more than most."
      },
      {
        "id": "tvmaze:1039796",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2017-02-19",
        "overview": "Nonnatus House welcomes a new recruit, Nurse Valerie Dyer. A vulnerable young man captures Fred and Violet's hearts, whilst the whereabouts of Sister Mary Cynthia is a concern."
      },
      {
        "id": "tvmaze:1039797",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2017-02-26",
        "overview": "Valerie Dyer cares for a pregnant Somali woman and is shocked by aspects of this unfamiliar culture. The nuns and midwives try to provide the best care for Sister Mary Cynthia."
      },
      {
        "id": "tvmaze:1039798",
        "title": "Episode 7",
        "season": 6,
        "episode": 7,
        "released": "2017-03-05",
        "overview": "Dr Turner helps the Mullucks cope with the stresses of caring for a disabled child as the terrible legacy of thalidomide becomes apparent and Nurse Crane faces an unexpected crisis."
      },
      {
        "id": "tvmaze:1039799",
        "title": "Episode 8",
        "season": 6,
        "episode": 8,
        "released": "2017-03-12",
        "overview": "An unexpected turn of events leads to a wedding being hastily arranged. Shelagh finally goes into labour. The arrival of the pill leads to unforeseen consequences."
      },
      {
        "id": "tvmaze:1385236",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2018-01-21",
        "overview": "The winter continues, and the team at Nonnatus House welcome their newest midwife, Lucille Anderson. Nurse Crane and Dr Turner care for an elderly cancer patient facing eviction."
      },
      {
        "id": "tvmaze:1391508",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2018-01-28",
        "overview": "Lucille faces racism and prejudice when a new mother falls ill. Sister Winifred is keen to have fathers be more involved in the care of their babies."
      },
      {
        "id": "tvmaze:1396889",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2018-02-04",
        "overview": "A pregnant mother hears a devastating diagnosis. Fred and Violet organise a beauty contest. Trixie and Christopher's relationship feels the strain."
      },
      {
        "id": "tvmaze:1401331",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2018-02-11",
        "overview": "Sister Julienne learns about a new culture as she helps a family at a difficult time, while Sister Monica Joan struggles with her eyesight."
      },
      {
        "id": "tvmaze:1401332",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2018-02-18",
        "overview": "Lucille must win the trust of a mother who is terrified of giving birth. Nurse Crane and Dr Turner are anxious to find a possible smallpox sufferer."
      },
      {
        "id": "tvmaze:1401333",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2018-02-25",
        "overview": "Barbara gets involved with a recently widowed pregnant woman. Sister Monica Joan has her cataract surgery."
      },
      {
        "id": "tvmaze:1401334",
        "title": "Episode 7",
        "season": 7,
        "episode": 7,
        "released": "2018-03-04",
        "overview": "Dr Turner gets involved with a troubled young man, and Lucille makes new friends. Meanwhile, Barbara lies ill in hospital."
      },
      {
        "id": "tvmaze:1401335",
        "title": "Episode 8",
        "season": 7,
        "episode": 8,
        "released": "2018-03-11",
        "overview": "The team must rally to prepare for Sister Monica Joan's birthday. Meanwhile, the closing of a nearby maternity home brings an influx of expectant mothers to the Nonnatus midwives."
      },
      {
        "id": "tvmaze:1584417",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2019-01-13",
        "overview": "Nonnatus House welcomes two new nuns. Valerie deals with a shocking case that arrives unexpectedly, and the other midwives must handle a complicated multiple birth."
      },
      {
        "id": "tvmaze:1586815",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2019-01-20",
        "overview": "Lucille helps elderly hoarder Clarice Millgrove who is struggling to keep her independence. Sister Hilda and the team work hard to help a Ghanaian family with an undiagnosed illness."
      },
      {
        "id": "tvmaze:1591876",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2019-01-27",
        "overview": "Valerie helps a struggling mother accept her son's birth defect. The Turners oversee a measles vaccination trial at the clinic as the team prepare for the Whitsun bank holiday."
      },
      {
        "id": "tvmaze:1591877",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2019-02-03",
        "overview": "Sister Julienne is drawn into a conflict between an estranged mother and daughter, both of whom are pregnant. Trixie's keep fit class is chosen to host a special event."
      },
      {
        "id": "tvmaze:1591878",
        "title": "Episode 5",
        "season": 8,
        "episode": 5,
        "released": "2019-02-10",
        "overview": "Poplar welcomes a brand new cervical cancer-screening clinic to the Institute and Dr Turner, Shelagh and Trixie are pleased to be part of the exciting new venture."
      },
      {
        "id": "tvmaze:1591879",
        "title": "Episode 6",
        "season": 8,
        "episode": 6,
        "released": "2019-02-17",
        "overview": "Mother Mildred returns to Nonnatus while Nurse Crane is in hospital, and provides care for a retired dock worker whose former job has taken its toll on his health."
      },
      {
        "id": "tvmaze:1594039",
        "title": "Episode 7",
        "season": 8,
        "episode": 7,
        "released": "2019-02-24",
        "overview": "Mother Mildred decides it's time for Sister Frances to attend her first solo birth. Trixie consoles a patient who discovers she has gonorrhea."
      },
      {
        "id": "tvmaze:1594040",
        "title": "Episode 8",
        "season": 8,
        "episode": 8,
        "released": "2019-03-03",
        "overview": "Sister Hilda digs deep to give her terminally-ill patient her final wish whilst the Turners must prepare to say goodbye to May. Fred and Reggie are keeping secrets from each other."
      },
      {
        "id": "tvmaze:1773958",
        "title": "Episode 1",
        "season": 9,
        "episode": 1,
        "released": "2020-01-05",
        "overview": "Dr Turner and Nurse Crane must deal with an alarming outbreak of diphtheria. Fred finds an abandoned baby in a dustbin, and the team must help locate its mother."
      },
      {
        "id": "tvmaze:1777163",
        "title": "Episode 2",
        "season": 9,
        "episode": 2,
        "released": "2020-01-12",
        "overview": "Sister Julienne cares for a pregnant prostitute, while Dr Turner puzzles over a mysterious string of symptoms."
      },
      {
        "id": "tvmaze:1778811",
        "title": "Episode 3",
        "season": 9,
        "episode": 3,
        "released": "2020-01-19",
        "overview": "Lucille is trapped in a lift with a woman in labour while working at St Cuthbert's, and Nurse Crane helps a Sylheti woman with fistula."
      },
      {
        "id": "tvmaze:1778812",
        "title": "Episode 4",
        "season": 9,
        "episode": 4,
        "released": "2020-01-26",
        "overview": "Four new doctors arrive at Nonnatus House and ruffle some feathers. Fred and Reggie try to help an old man and his pigeons, while Dr Turner tries to solve the old man's cough."
      },
      {
        "id": "tvmaze:1778813",
        "title": "Episode 5",
        "season": 9,
        "episode": 5,
        "released": "2020-02-02",
        "overview": "Sister Frances struggles to persuade the wife of a cancer patient to accept help, and as the nation obsesses over The Sound of Music, Sister Julienne considers the privileges of being a nun."
      },
      {
        "id": "tvmaze:1778814",
        "title": "Episode 6",
        "season": 9,
        "episode": 6,
        "released": "2020-02-09",
        "overview": "May's adoption by the Turners comes under threat when someone from her past appears. Valerie's cousin's baby has a devastating illness, andKevin returns to work with Dr Turner."
      },
      {
        "id": "tvmaze:1778815",
        "title": "Episode 7",
        "season": 9,
        "episode": 7,
        "released": "2020-02-16",
        "overview": "Dr Kevin McNulty performs an excellent forceps delivery - his final supervision under Dr Turner. Trixie helps a blind mother, Marion, care for her new baby, but trouble starts when Marion's sister calls Social Services to intervene. Meanwhile, since Sgt. Woolf left, Nurse Crane has started to struggle with the cubs. Cyril suggests that he and Lucille should help Nurse Crane."
      },
      {
        "id": "tvmaze:1778816",
        "title": "Episode 8",
        "season": 9,
        "episode": 8,
        "released": "2020-02-23",
        "overview": "The local council threatens to cut funding to Nonnatus House. Nurse Crane cares for a bohemian, unmarried expectant mother."
      },
      {
        "id": "tvmaze:2059374",
        "title": "Episode 1",
        "season": 10,
        "episode": 1,
        "released": "2021-04-18",
        "overview": "Change is on the horizon in Poplar. Sister Julienne must determine whether a private clinic venture that will generate much needed income for Nonnatus House is a suitable workplace for the Sisters, and enlists the help of Trixie."
      },
      {
        "id": "tvmaze:2070229",
        "title": "Episode 2",
        "season": 10,
        "episode": 2,
        "released": "2021-04-25",
        "overview": "Trixie befriends a patient during a delivery, but is troubled by the news that she has subsequently been readmitted to the Lady Emily after collapsing unexpectedly at home. Sister Frances decides she needs to know more of the outside world if she is truly to understand her patients' needs, and Cyril and Fred come to the aid of a family who have been evicted from their home - although Violet is less than happy about their acts of charity."
      },
      {
        "id": "tvmaze:2072251",
        "title": "Episode 3",
        "season": 10,
        "episode": 3,
        "released": "2021-05-02",
        "overview": "It's May 1966 and at clinic Shelagh examines an overweight lady who is expecting her third child. Concerned about her weight gain and subsequent symptoms, she discusses the case with Lucille, who comes across a new discovery.Dr Turner and Sister Hilda are flummoxed by a young patient whose health presents a series of challenges. They become increasingly concerned and do their best to get to the bottom of her unexplained ill health."
      },
      {
        "id": "tvmaze:2072268",
        "title": "Episode 4",
        "season": 10,
        "episode": 4,
        "released": "2021-05-09",
        "overview": "It's July 1966, and Britain is in the grip of World Cup fever. Unbeknown to Violet, Fred puts on an accumulator bet for the World Cup which keeps any winnings rolling forward. When England reaches the final against West Germany, Fred questions whether he has made the right decision.Nonnatus House awaits the arrival of four new pupil midwives. One of them, Nancy Corrigan, makes quite an impact.Meanwhile, Cyril and Lucille's relationship continues to blossom."
      },
      {
        "id": "tvmaze:2072269",
        "title": "Episode 5",
        "season": 10,
        "episode": 5,
        "released": "2021-05-16",
        "overview": "With sister Hilda away on a refresher course, sister Julienne steps in to carry out home visits. The new pupil midwives are settling in well, and there is a sense of hope in the air.While examining expectant mother Vera Sands during a routine visit, sister Julienne is concerned by her toddler daughter who is displaying troubling symptoms. Determined to find out what's wrong, sister Julienne and Dr Turner are on the case.Meanwhile, an overly protective mother struggles to cope with her daughter's teenage pregnancy and is insistent on keeping it low key, much to the frustration of new pupil midwife Nancy Corrigan."
      },
      {
        "id": "tvmaze:2072270",
        "title": "Episode 6",
        "season": 10,
        "episode": 6,
        "released": "2021-05-23",
        "overview": "It's September 1966, and at clinic Trixie is tasked with examining a desperate woman who is pregnant with her fifth child. Trixie learns that her patient's personal life is far from stable, compelling her to speak out publicly. However, the results garner mixed reactions from Nonnatus House and the community. Dr Turner and Sister Frances are entrusted to help a mother-to-be who refuses medical care through her final weeks of pregnancy, and Nancy Corrigan reveals a secret about her background that could threaten her relationship with Sister Julienne and Nonnatus House."
      },
      {
        "id": "tvmaze:2072271",
        "title": "Episode 7",
        "season": 10,
        "episode": 7,
        "released": "2021-05-30",
        "overview": "While Nonnatus House struggles to come to terms with Nancy's revelation, the housing conditions in Poplar reach crisis point. A birth causes a rift in a close-knit family."
      },
      {
        "id": "tvmaze:2236761",
        "title": "Episode 1",
        "season": 11,
        "episode": 1,
        "released": "2022-01-02",
        "overview": "It's Easter 1967, and celebrations are underway for a colourful Easter bonnet parade outside Nonnatus House. Sister Monica Joan and Reggie are excited about the Eurovision song contest, while Cyril and Lucille settle into blissful married life. After taking some time away following the death of their newborn son, Derek and Audrey Fleming return to Poplar with good news - Audrey is pregnant again.During demolition work at a nearby tenement block, the builders make a shocking discovery. The news ripples through the community, and the police are called in. The trail leads to someone close to home and has a heartbreaking effect on the team."
      },
      {
        "id": "tvmaze:2238792",
        "title": "Episode 2",
        "season": 11,
        "episode": 2,
        "released": "2022-01-09",
        "overview": "Trixie and Sister Frances put their training into action as they join Dr Turner at the monthly cytology clinic, which is attracting a high number of patients for a routine cervical smear test. While there, Sister Frances examines a newly married woman who presents some troubling symptoms.Lucille helps Vivien, a single mother of three, through her fourth pregnancy and intervenes when local authorities question Vivien's capabilities as a mother. After suffering a traumatic experience, Miss Higgins is offered a place to stay at Nonnatus House, and Sister Hilda and Shelagh take the lead in the fight against a scabies epidemic that has quickly engulfed Poplar."
      },
      {
        "id": "tvmaze:2248155",
        "title": "Episode 3",
        "season": 11,
        "episode": 3,
        "released": "2022-01-16",
        "overview": "It's June 1967, and the Order of St Raymond Nonnatus are celebrating a very special milestone birthday. It has been 100 years since the Order first arrived in Poplar. When Sister Julienne is unable to organise the celebrations, Shelagh brings the community together for what will be a joyous occasion.While tending to a patient who has tuberculosis, Sister Frances and Nancy learn that some residents have become increasingly frustrated by the presence of meths drinkers in the area. As local councillor, Violet must balance her professional and personal views in how best to tackle the issue. However, Nancy begins to see past the community's fear and recognises the plight of these homeless addicts."
      },
      {
        "id": "tvmaze:2254287",
        "title": "Episode 4",
        "season": 11,
        "episode": 4,
        "released": "2022-01-23",
        "overview": "It's the summer of 1967, and a heatwave descends over Poplar. Sister Hilda and Dr Turner support a young father with a lung condition, and Trixie takes the lead with a struggling first-time mother. Cyril continues to search for a new job that will put his civil engineering qualification to use and pay more so he and Lucille can afford a house deposit, but Lucille receives unexpected news that she must break to him. Meanwhile, Trixie and Matthew's relationship is going well, but Trixie wants a little more romance."
      },
      {
        "id": "tvmaze:2254288",
        "title": "Episode 5",
        "season": 11,
        "episode": 5,
        "released": "2022-01-30",
        "overview": "It's September 1967. Trixie has been assigned to a complicated case involving a crane driver who was injured in a workplace accident and is now paraplegic. He has been discharged from hospital, and is living back at home with his wife and children. Meanwhile, Nancy and Sister Frances give a talk on the facts of life at a primary school, and Lucille's attendance at a straightforward delivery takes a distressing turn.Shelagh decides to organise a jumble sale to raise money to fix some broken playground equipment in the park. When Sister Julienne finds a suspicious item, chaos ensues."
      },
      {
        "id": "tvmaze:2254289",
        "title": "Episode 6",
        "season": 11,
        "episode": 6,
        "released": "2022-02-06",
        "overview": "It's October 1967, which brings new beginnings with Nurse Crane away on an exciting adventure of a lifetime and Trixie taking care of her godmother in Portofino. Sister Hilda runs a tight ship, and Shelagh has joined the team to ease their busy workload. Lucille prepares for her first day back at work but is clearly not coping well, despite the support of the team.Sister Monica Joan is spooked to find a black raven in the parlour, believing its presence to be an omen. Seeking interpretation of the raven's meaning, Sister Monica Joan connects with Dulcie Greenhlagh, an eccentric East End clairvoyant, but soon realises there is another reason they were destined to meet.Matthew discovers one of his warehouses is being used by squatters, including a heavily pregnant woman. Shelagh faces the most challenging delivery of her career. Dr Turner attends a district health committee meeting on measles vaccination. He hopes to increase uptake by running a pilot scheme in Poplar."
      },
      {
        "id": "tvmaze:2254290",
        "title": "Episode 7",
        "season": 11,
        "episode": 7,
        "released": "2022-02-13",
        "overview": "An unforeseen event in Poplar means that Nonnatus House suffers its biggest threat yet. But this time it's not the bricks and mortar that are in danger - it's the people.Sister Frances takes charge of a spirited young teenage mother who is shortly to move out of foster care and into her own accommodation. While Sister Frances strives to prepare her, things take a serious turn with the young mother's health.Sister Hilda and Sister Julienne expect more from Nancy and decide to show her what she is capable of by letting her lead morning orders, and Timothy returns home from university after falling ill with glandular fever."
      },
      {
        "id": "tvmaze:2254291",
        "title": "Episode 8",
        "season": 11,
        "episode": 8,
        "released": "2022-02-20",
        "overview": "Nonnatus House faces its darkest day after a tragic incident in the heart of Poplar. As the community rallies together, the team must overcome personal anguish to help the injured."
      },
      {
        "id": "tvmaze:2443947",
        "title": "Episode 1",
        "season": 12,
        "episode": 1,
        "released": "2023-01-01",
        "overview": "It is April 1968 and change is coming to Nonnatus House. The sisters intend to make a good impression on new recruit Sister Veronica. It's clear she is no shrinking violet and will ruffle a few feathers. Racial tensions cast a shadow over Poplar following Enoch Powell's incendiary ‘Rivers of Blood' speech. Nancy and Trixie team up to support terminally ill patient, and Fred is saddened to receive an official letter confirming the disbandment of the Civil Defence Corps."
      },
      {
        "id": "tvmaze:2454176",
        "title": "Episode 2",
        "season": 12,
        "episode": 2,
        "released": "2023-01-08",
        "overview": "It is May 1968, and the Nonnatus team are faced with challenging cases, one of which is much closer to home as Lucille struggles with her own health. At a coffee morning for expectant mothers, Sister Julienne meets heavily pregnant Lilian Reynolds, who is expecting her first child. However, after Lilian experiences some breast discomfort, she receives a devastating diagnosis.Meanwhile, Shelagh is organising the Whitsun Maypole celebrations at the eleventh hour. She enlists Cyril, Fred, Dr Turner, Sister Monica Joan, Sister Veronica, Nancy, Violet and Miss Higgins to help, but the preparations for a Maypole dance routine are far from smooth."
      },
      {
        "id": "tvmaze:2462565",
        "title": "Episode 3",
        "season": 12,
        "episode": 3,
        "released": "2023-01-15",
        "overview": "It's June 1968, and a carefree Nancy continues to spoil Colette with new gifts. To afford such luxuries Nancy asks Nurse Crane for additional duties, but things come to a head when Nancy is forced to acknowledge her spending is getting out of control.As health visitor, Sister Veronica visits the Talbot family and is delighted to see them celebrating a joyous occasion. Single mum, Sandy has just married Joe Talbot who treats her children, Peter and Ann Marie, like his own. However, Sister Veronica is shaken when Sandy reveals a terrible truth about her marriage and encourages her to seek help. Meanwhile, kinks remain in Sister Veronica and Nurse Crane's working relationship."
      },
      {
        "id": "tvmaze:2463492",
        "title": "Episode 4",
        "season": 12,
        "episode": 4,
        "released": "2023-01-22",
        "overview": "When Nurse Crane attends a ventouse training course at St Cuthbert's, her age is called into question by the consultant running the course, and she is summoned to a meeting with the Board of Health. She starts to question her own abilities and suffers a crisis of confidence whilst overseeing the care of Simone and Larry Lucas who are expecting their second child. They are a young couple living in a council flat, and when the seemingly straightforward delivery runs into problems, Nurse Crane faces the challenges of a traumatic delivery alone.Meanwhile, Trixie enjoys caring for Vinita Khatri, who is expecting her third child. However, the maternity home is thrown into chaos when an emergency outbreak of gastroenteritis is declared. The team, joined by Sister Monica Joan, must dig deep to ensure all mothers and newborn babies recover from the worrying outbreak. Unfortunately, their actions have not gone unnoticed by the Board of Health, who are less than happy with the way things have been handled.Reggie is home from the Glasshouse Village, but he is not his usual self. He is drained of energy and suffering some hair loss. Concerned, Violet and Fred try to work out what's wrong, but it is not until Cyril encourages Reggie to seek help that they finally get some answers."
      },
      {
        "id": "tvmaze:2475596",
        "title": "Episode 5",
        "season": 12,
        "episode": 5,
        "released": "2023-01-29",
        "overview": "Nancy oversees the care of Jill Mellor and her newborn baby, Mylene, a child she has had out of wedlock with Spencer Wray, a young man from the West Indies. Jill and Spencer live with his kind-hearted mother, Florence. Not long after the birth, Spencer's behaviour starts to raise concerns as it becomes increasingly erratic. Worried, Nancy calls on Dr Turner who refers Spencer for an urgent psychiatric review, but as Spencer's condition deteriorates more rapidly, things take a very unexpected and shocking turn.Dr Turner and Sister Veronica arrange a men's health talk at the surgery to discuss male contraception and a new procedure, the vasectomy. At the same time, Dr Turner and Nurse Crane care for Annette Berkley, who has rheumatic heart disease and has gone against doctor's advice and fallen pregnant again.When Matthew's father, Sir Brigham, visits Poplar, relations between father and son are somewhat frosty at best. Matthew's opinion of Poplar is markedly different from his father's, as he has grown fond of the area and its residents over recent years. Matthew wants to invest more money in the borough, whereas Sir Brigham wants to sell up. With relations at an all-time low, Trixie is left to deliver Matthew some heartbreaking news."
      },
      {
        "id": "tvmaze:2479238",
        "title": "Episode 6",
        "season": 12,
        "episode": 6,
        "released": "2023-02-05",
        "overview": "Trixie supports an underage mother through a difficult time, Monica Joan welcomes an unusual guest to Nonnatus House, and Sister Veronica spearheads a new council initiative."
      },
      {
        "id": "tvmaze:2483519",
        "title": "Episode 7",
        "season": 12,
        "episode": 7,
        "released": "2023-02-12",
        "overview": "It's October 1968, and preparations for Trixie and Matthew's wedding are underway. Nancy makes a home visit to Imelda O'Connor, who is pregnant with her second child, and is surprised that Imelda, her husband Maurice and young son Paul are living in a cramped caravan on a building site. Unbeknown to Nancy, the family's circumstances quickly change when they are made homeless. When their plight is brought to the attention of Nonnatus house, Matthew is very vocal about his views.Shelagh supports Rosemary Mason, who is expecting her fifth child with husband Arthur. They run a family business selling second-hand goods and also run a guesthouse. Shelagh is troubled by Rosemary's symptoms and consults Dr Turner, who diagnoses Rosemary with hepatitis, a condition that leads to the revelation of a family secret.Dr Turner soon notices a worrying rise in hepatitis cases throughout the district, and when the outbreak directly impacts the residents of Nonnatus House, the team rally to care for a beloved member. Elsewhere, Cyril returns home from Jamaica and is keen to throw himself into work. He volunteers at a homeless shelter for men and meets a young stricken man, Leon, who is struggling with addiction."
      },
      {
        "id": "tvmaze:2489447",
        "title": "Episode 8",
        "season": 12,
        "episode": 8,
        "released": "2023-02-26",
        "overview": "Nonnatus House is abuzz with excitement as the countdown to Trixie and Matthew's wedding begins. Whilst Sister Veronica has appointed herself in charge of organising the wedding gifts, Trixie's brother, Geoffrey Franklin, arrives from Malta and immediately starts arranging the perfect hen do. However, the approaching nuptials cause stress levels to escalate as a catalogue of small and great disasters threaten to spoil the day.Dr Turner, Shelagh and Timothy are first on the scene of a fatal car crash. Dr Turner experiences the biggest test of his career as they race against time to save a precious life.Meanwhile, Nancy considers her future, and Sister Julienne hatches a plan to save Nonnatus House once and for all."
      },
      {
        "id": "tvmaze:2714326",
        "title": "Episode 1",
        "season": 13,
        "episode": 1,
        "released": "2024-01-07",
        "overview": "Sister Julienne and Shelagh are thrilled that the new midwifery training scheme is underway, which includes pupil midwives Rosalind Clifford, Joyce Highland, Kathy Downes and Norelle Morris. Once introduced to the routines of a home delivery, Rosalind and Joyce unpack their belongings and settle into Nonnatus House.Dr Turner expresses his delight about a new scheme which allows GPs to deliver some of their more complex patients in hospital with a consultant on standby. When Doreen Challis, a young woman with cerebral palsy, is confirmed to be pregnant, her mother Ada is furious, not only at the baby's father, Graham, but Doreen's sister Anne, who helped conceal the pregnancy. As concerns grow for Doreen, a shocking detail from her own birth comes to light.Rosalind's first birth on the district is a baptism of fire under Trixie's tutelage. All seems to be going well until events take a dramatic turn, putting Trixie, Rosalind, mother and baby in danger.When Violet regretfully tells Fred and Reggie that the fairground she's booked for Easter Monday has cancelled, Reggie comes up with an idea that will bring the community together. Meanwhile, the Nonnatus team learn of the nurses' Raise the Roof Campaign for better pay and conditions, and there is a clear divide of opinion around the table."
      },
      {
        "id": "tvmaze:2729716",
        "title": "Episode 2",
        "season": 13,
        "episode": 2,
        "released": "2024-01-14",
        "overview": "At Tuesday clinic, Shelagh and Joyce oversee the care of Edna Bristow, a heavily pregnant mother of one, whose husband has left her just days before their baby is due. Edna proves to be quite a difficult patient, but there are greater challenges ahead when it becomes clear that her flat is riddled with damp.Meanwhile, at The Shining Tabernacle church, Mrs Wallace believes there is an urgent need for a church building due to the growing congregation. She's also concerned about worshippers who have stopped attending, and asks Cyril to check in on them. As Cyril connects with the Bristow family, he feels at a loss when he's unable to help, and begins to question his career path.Nancy and Dr Turner are involved in a worrying medical case with a young Sylheti woman, Sahira Khan. She has been suffering with unexplained symptoms that seem to ebb and flow, but have recently started to worsen. As Dr Turner investigates the cause, Nancy offers support to Sahira and her husband, Ayub. Meanwhile, Nancy decides to attend an RCN Raise the Roof campaign meeting against the wishes of some of her peers.Trixie has been struggling with the long bus commute to Poplar each day, and decides it is time she learnt how to drive. Matthew offers to teach her, but soon regrets his decision. Meanwhile, Collette struggles in a sponsored poetry recital as she strives to memorise a long T. S. Eliot poem."
      },
      {
        "id": "tvmaze:2742158",
        "title": "Episode 3",
        "season": 13,
        "episode": 3,
        "released": "2024-01-21",
        "overview": "Reggie comes home for a few weeks' holiday and helps Fred to make over the small unkempt green space outside St Oswald's church. This is paid work for them both and marks the first time Reggie has earned his own money. Violet and Fred decide it is time they pay Reggie for his work in Buckle's paper shop. Meanwhile, Violet considers running for mayor and is somewhat preoccupied with her application. She fails to notice that Fred isn't his usual cheery self. Events take a dramatic turn, and it looks like Violet's mayoral campaign will have to be abandoned.Model Gillian Baxter is something of a star in Poplar. Born into an East End family, Gillian was signed up to a baby modelling agency, and her face was seen on the sides of London buses advertising baby soap. Since becoming pregnant, Gillian has been signed up to model once more, and there are plans already in place for her newborn to follow in her footsteps. Rosalind and Sister Julienne oversee Gillian's delivery at the maternity home, but when her newborn baby is diagnosed with a birth defect, Gillian doesn't take the news well. Nurse Crane helps Gillian and her husband, Liam, through this challenging time.Meanwhile, Trixie starts making plans for a move into the Barbican flat and tries to enlist Matthew's help selecting a new sofa."
      },
      {
        "id": "tvmaze:2750376",
        "title": "Episode 4",
        "season": 13,
        "episode": 4,
        "released": "2024-01-28",
        "overview": "It's July 1969, and everyone is giddy with nervous excitement about Apollo 11's imminent landing on the moon. The whole community wishes to mark this special occasion, and there is a public showing of the landing outside, using the Nonnatus House television set. Sister Veronica, Sister Julienne, Fred, Violet, Rosalind, Colette, Miss Higgins, Nurse Crane and Nancy are in attendance. Dr Turner, Shelagh, Angela, May, Teddy and Timothy host a family celebration and stay up late to watch the coverage. Sister Monica Joan is thankful to be able to witness a moon landing in her lifetime and is overcome with emotion when the Apollo commander, Neil Armstrong, steps onto the moon's surface. Meanwhile, Fred is unhappy with being under the watchful eye of Violet and wishes he could return to work.The pupil midwives are now into their third month of training and undergo a review. Sister Julienne, Shelagh and Nurse Crane are delighted with the scheme and how well Rosalind and Joyce are getting on. However, it's noted that both pupils have areas of practice that would benefit from improvement – Rosalind's self-confidence and Joyce's belief in home births. Under Trixie's tutelage, Joyce is assigned to Prue Stanton, a rumbustious warm-hearted local, who proves to be quite a challenge. But things take a turn for the worse when Trixie makes a serious mistake with far-reaching consequences.Sister Veronica presides over a BCG vaccination clinic at St Oswald's Hall for secondary school age children. The results from the clinic tests are rushed through before the end of the school term. A Biafran family cause great concern for the team, and Nancy delves into her family's past, which finally gives her some closure."
      },
      {
        "id": "tvmaze:2751046",
        "title": "Episode 5",
        "season": 13,
        "episode": 5,
        "released": "2024-02-04",
        "overview": "It's the summer of 1969, and excitement fills the air as Violet prepares for the inaugural beach excursion – her first key event since becoming mayor.Despite the terrible weather at the beach, everyone is having a good time. Yet the atmosphere quickly changes when Lindy goes into labour. Nurse Crane and Miss Higgins drive Lindy back to the maternity home. But, despite a straightforward birth, Lindy and her partner Melvin are shocked by a rare diagnosis.Meanwhile, following a serious incident involving May at the beach, Dr Turner and Shelagh are blindsided when May's future with them is called into question."
      },
      {
        "id": "tvmaze:2760340",
        "title": "Episode 6",
        "season": 13,
        "episode": 6,
        "released": "2024-02-11",
        "overview": "As summer draws to a close in Poplar, the pupil midwives are coming to the end of their training on the district, and prepare to sit their final exams and viva. Joyce is a methodical planner and can keep calm under fire, but Rosalind is becoming more and more anxious. It takes an unusual intervention by Nurse Crane and a sensitive case to see Rosalind put her nerves behind her.When two little boys are found abandoned in the local church, triggering a nationwide hunt for their mother, Cyril, as child welfare officer, is faced with his toughest challenge to date. When their heavily pregnant mother is found, Cyril must make the difficult decision of whether the children will be taken into foster care.Matthew's financial woes come to a head when he is summoned to a board meeting with his mother about the state of the business. Following a number of unwise business decisions and investments, that almost bring the company to its knees, it's time Matthew finally comes clean with Trixie.Elsewhere, Dr Turner is alarmed by local moneylender and matriarch Gladys Bell's swollen ascetic abdomen. He promptly refers her to St Cuthbert's, where a biopsy diagnoses mesothelioma of the peritoneum - an asbestos-related cancer in its advanced stages. When Gladys refuses treatment, an unlikely ally gives her food for thought.Meanwhile, Sister Veronica and Shelagh spearhead a summer singing event."
      },
      {
        "id": "tvmaze:2768464",
        "title": "Episode 7",
        "season": 13,
        "episode": 7,
        "released": "2024-02-25",
        "overview": "It's October 1969, and Rosalind and Joyce are thrilled to receive their red cardigans. Sister Julienne presents Joyce with the Violet Albany Prize, which is given to the East London midwife who qualifies with the highest marks in her exams. Shelagh has arranged for everyone to have their photograph taken for the Gazette outside Nonnatus House. Elsewhere, Joyce oversees the care of Gerri Godfrey, a single mother who is pregnant with her second child. When Joyce receives an unexpected visitor from her past, she must put all distractions aside to focus on her patient.Matthew and Trixie struggle with their change in fortune, and Trixie's lack of sleep prompts her to seek help from Dr Turner. As Matthew vows to overcome their financial troubles, he is offered a lifeline from an old colleague.Nurse Crane and Rosalind give a talk about menstruation and contraception at Kingsley Toy Factory. The all-female workforce is rowdy and give 16-year-old Alison Casey a hard time. Rosalind understands Alison is concealing a pregnancy and suspects something is wrong when she becomes distressed during an examination.Elsewhere, Fred plans on using turnips for Halloween lanterns but orders far too many. When they are accidentally unloaded outside Violet's shop, Violet demands Fred moves them at once. As Fred seeks Cyril's help, Miss Higgins and Nurse Crane have an idea on how to put the turnips to use."
      },
      {
        "id": "tvmaze:2777798",
        "title": "Episode 8",
        "season": 13,
        "episode": 8,
        "released": "2024-03-03",
        "overview": "Miss Higgins receives an unexpected visitor, and Sister Monica ruffles feathers. Poplar votes for its Mother of the Year."
      },
      {
        "id": "tvmaze:3082523",
        "title": "Episode 1",
        "season": 14,
        "episode": 1,
        "released": "2025-01-05",
        "overview": "It's March 1970. The team support a pregnant teenage girl whose parents believe in an immaculate conception. Demonstrations cause havoc for the Nonnatus team, whilst Nancy's relationship blossoms."
      },
      {
        "id": "tvmaze:3087097",
        "title": "Episode 2",
        "season": 14,
        "episode": 2,
        "released": "2025-01-12",
        "overview": "It's April 1970 and Trixie oversees the care of Arlene, an unmarried mother who is heavily pregnant and under the care of the district midwives. Rising rates of gonorrhoea in the district cause alarm when Zeta, a young Cypriot expectant mother, is diagnosed. She is utterly distressed and bewildered by her diagnosis and her husband Mehmet denies any extramarital affair. Meanwhile, Cyril and Rosalind volunteer together at the homeless shelter."
      },
      {
        "id": "tvmaze:3107797",
        "title": "Episode 3",
        "season": 14,
        "episode": 3,
        "released": "2025-01-19",
        "overview": "Rosalind oversees the care of first-time mum Norma and husband Don after she delivers their baby and immediately realises that all is not right. Joyce is assigned to the district round and meets Alf, who was recently discharged from hospital after a prostate procedure. Living in the same block of flats is single mum Nerys, and Joyce discovers that Nerys is leaving her children home alone when she goes to work. Elsewhere, Sister Julienne calls on Trixie's managerial skills when she is summoned to a meeting with Dr Threapwood to discuss the renewal of their contract with the council."
      },
      {
        "id": "tvmaze:3113587",
        "title": "Episode 4",
        "season": 14,
        "episode": 4,
        "released": "2025-01-26",
        "overview": "It's May 1970, and the Nonnatus team prepare for the arrival of a new nun and trainee midwife, Sister Catherine. Under Nurse Crane's supervision, Sister Catherine is thrown into a complex case. Dr Turner is taken aback when mother of seven Peggy Wrigley asks for an abortion. Although legal, the process isn't straightforward, and Dr Turner wants to ensure Peggy has thought this through. Meanwhile, Peggy's daughter Gail is expecting her first baby with a young RAF airman who is posted in Cyprus. Elsewhere, Dr Turner is disappointed by the general apathy towards the measles vaccination clinic as uptake remains relatively low despite the current high rate of cases."
      },
      {
        "id": "tvmaze:3122442",
        "title": "Episode 5",
        "season": 14,
        "episode": 5,
        "released": "2025-02-02",
        "overview": "It's the start of the summer holidays, and Sister Veronica arrives at an abandoned warehouse looking for a family to discuss the children's truancy. The mother is pregnant, but her imposing husband is refusing a midwife visit. Fearing for the mother's safety, Sister Veronica involves Sister Julienne, who must find the strength to help the mother through a traumatic birth whilst overcoming her own personal crisis.Shelagh makes a house call to see a man who lives inside an iron lung after being paralysed from a polio infection. His wife is his main carer, and Shelagh notices that she's looking jaundiced, so she suggests an appointment with Dr Turner, leading to a devastating diagnosis.The 1970 Commonwealth Games has everyone excited. Children play in the street with their makeshift hurdles and javelins, but when a young boy is injured, Violet decides to create the Poplar Commonwealth Games in an official, safe capacity and enlists the help of Cyril, who has returned from Jamaica."
      },
      {
        "id": "tvmaze:3131805",
        "title": "Episode 6",
        "season": 14,
        "episode": 6,
        "released": "2025-02-09",
        "overview": "It's September, 1970. Joyce faces a difficult situation when a mother suffers postnatal complications, a council strike leads to an outbreak of Weil's disease, and Cyril's life is turned upside down."
      },
      {
        "id": "tvmaze:3145345",
        "title": "Episode 7",
        "season": 14,
        "episode": 7,
        "released": "2025-02-23",
        "overview": "It's October, 1970. The midwives help a family with a history of drug addiction. Dr Turner and Shelagh take the final steps in May's adoption, whilst Joyce faces the disciplinary board."
      },
      {
        "id": "tvmaze:3153033",
        "title": "Episode 8",
        "season": 14,
        "episode": 8,
        "released": "2025-03-02",
        "overview": "November, 1970. The challenges of midwifery hit close to home when a mother and baby home is evacuated. Nancy's wedding plans take a surprising turn, and Sister Catherine takes her first vows."
      }
    ]
  }
}