{
  "meta": {
    "id": "tvmaze:67033",
    "type": "series",
    "name": "Alan Carr's Picture Slam",
    "description": "Alan Carr's Picture Slam will see three teams face a series of pictures and each picture is worth cash. The more they can name the more they win, but for the big money they need to name them ALL, and if they do that, they've got a Picture Slam!This is the fast paced game that asks do you know your Eiffel Tower from your Blackpool Tower? Your Victoria Beckham from your Victoria Sponge and your Buckingham Palace from your Crystal Palace? Across four thrilling rounds, contestants will need to know something about everything to try and win up to £10,000!",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/479/1199536.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/479/1199536.jpg",
    "videos": [
      {
        "id": "tvmaze:3464529",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3464530",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2025-12-20",
        "overview": ""
      },
      {
        "id": "tvmaze:2640204",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2023-09-16",
        "overview": "Attempting to Picture Slam their way to £10,000 are friends Lou and Jude from Grimsby, cousins Sibtain and Umar from London and Nottingham, and friends Steph and Jo from Barry."
      },
      {
        "id": "tvmaze:2641580",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2023-09-23",
        "overview": "This week, friends Astrid and Rob from Brighton, sisters Jay and Abi from London, and couple Debs and Hong from North Yorkshire are hoping to Picture Slam their way to the jackpot."
      },
      {
        "id": "tvmaze:2647573",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2023-09-30",
        "overview": "Playing this week are mother-daughter duo Erin &amp; Emma from Falkirk, friends Lil &amp; Nick from Kent, &amp; newly-married couple Ryan &amp; Kin from Leicester. They'll be battling it out across three rounds against the clock to make it to the final Super Slam and a chance to win £10,000.Do they know their Victoria Sponge from their Victoria Beckham? Find out in this hugely addictive show that will have the whole family shouting answers at the TV."
      },
      {
        "id": "tvmaze:2659615",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2023-10-07",
        "overview": "Attempting to Picture Slam their way to £10,000 are mother and daughter Lauren and Louise from Wigan, colleagues Sam and Shaun from Liverpool and students Alex and Lena from Cardiff."
      },
      {
        "id": "tvmaze:2659616",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2023-10-14",
        "overview": "Putting their picture knowledge to the test are couple Karen and John from Liverpool, friends Sharon and Amrita from Birmingham, and friends Cal and David from Aberdeen."
      },
      {
        "id": "tvmaze:2668541",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2023-10-21",
        "overview": "Friends Natalie and Lisa from Cardiff, couple Catherine and Matt from West Sussex, and Croydon couple Gaz and Daniel attempt to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:2668542",
        "title": "Episode 7",
        "season": 1,
        "episode": 7,
        "released": "2023-10-28",
        "overview": "Best friends James and Amy from Chingford, sisters Angelika and Annabel from London, and engaged couple Jody and Mike from Cwmbran, Wales, attempt to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:2679547",
        "title": "Episode 8",
        "season": 1,
        "episode": 8,
        "released": "2023-11-04",
        "overview": "Couple Jamie John and Josh from Great Yarmouth, mother and daughter Ruby and Lesley from King's Lynn, and Glasgow couple Iain and Jaclyn attempt to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:3010561",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2024-09-28",
        "overview": "Joining Alan Carr, hoping to win £10,000, are couple Daniel and Neil from Arbroath, Birmingham, friends Ruth and Michelle, and Nottingham teachers Candice and Dan."
      },
      {
        "id": "tvmaze:3019694",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2024-10-05",
        "overview": "Joining Alan Carr are friends Ann and Steven from Paisley, London couple Khamisha and Jack, and best friends Ella and Alex from Brighton, all hoping to win the £10,000 jackpot."
      },
      {
        "id": "tvmaze:3019695",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2024-10-12",
        "overview": "Joining Alan Carr and hoping to win £10,000 are Manchester couple Matty and Harvey, mother and daughter Emilie and Kathy from Swansea, and friends Patsy and Dave from London."
      },
      {
        "id": "tvmaze:3030341",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2024-10-19",
        "overview": "Married couple Stewart and Ross from Glasgow, London couple Amy and Anwar, and Liverpudlian uncle and niece George and Danielle all hope to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:3030342",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2024-10-26",
        "overview": "Alan Carr puts the picture knowledge of co-parents Sas and David from Haywards Heath, Manchester flatmates George and Joe and London father-son duo Sanjay and Kavi to the test."
      },
      {
        "id": "tvmaze:3041992",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2024-11-02",
        "overview": "Hoping to picture-slam their way to £10,000 are best friends Gaynor and Natalie from Sheffield, sisters Mica and Elodie from London and Dorset father-son duo Isaac and Gordon."
      },
      {
        "id": "tvmaze:3041993",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2024-11-09",
        "overview": "Putting their picture knowledge to the test are Essex married couple Nic and Corin, father-son duo Alex and David from Aberdeenshire and Glasgow and Durham friends Abbie and Maddy."
      },
      {
        "id": "tvmaze:3052161",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2024-11-16",
        "overview": "Alan Carr hosts as Brighton couple Rosie and Bekah, friends Ciaran and Ethan from Belfast, and childhood buddies Tony and Dalv attempt to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:3052162",
        "title": "Episode 9",
        "season": 2,
        "episode": 9,
        "released": "2024-11-23",
        "overview": "Married couple Sharon and Kevin from Kettering, London siblings Tam Alexis and Justin, and friends Jodie and Victoria from Cardiff compete to Picture Slam their way to £10,000."
      },
      {
        "id": "tvmaze:3058472",
        "title": "Episode 10",
        "season": 2,
        "episode": 10,
        "released": "2024-11-30",
        "overview": "Playing this week are friends Tre and Maz from Bristol, siblings Lucy and Stephen from Glasgow, and married couple Jade and Curtis from Middleton. They'll be facing off across four rounds against the clock, including the brand new Picture Twist and buzzer rounds, to make it to the final Super Slam and a chance to win £10,000."
      },
      {
        "id": "tvmaze:3440491",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2025-11-15",
        "overview": "Hoping to picture-slam their way to £10,000 are mother and daughter Angie and Mollie from Liverpool, friends Sean and Lee from Whitstable, and couple Emily and Chris from Llanelli."
      },
      {
        "id": "tvmaze:3440492",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2025-11-22",
        "overview": "Hoping to win £10,000 this week are siblings Jack and Hannah from Wales, mother and daughter Jacqui and Lola from Stockport, and friends Mel and Liz from Sydenham and High Wycombe."
      },
      {
        "id": "tvmaze:3440493",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2025-11-29",
        "overview": "Hoping to picture-slam their way to £10,000 are couples Dipak and Manisha from Bedfordshire, Derek and Stuart from Grimsby, and Vikki and Fraser from Dunfermline."
      },
      {
        "id": "tvmaze:3464527",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2025-12-06",
        "overview": ""
      }
    ]
  }
}