{
  "meta": {
    "id": "tvmaze:87011",
    "type": "series",
    "name": "Global Eye",
    "description": "Award-winning investigations - revealing secrets, rooting out injustice, and exposing crime, corruption, and abuse. The biggest stories from BBC correspondents all over the world.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/587/1467593.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/587/1467593.jpg",
    "videos": [
      {
        "id": "tvmaze:3451832",
        "title": "15/12/2025",
        "season": 2025,
        "episode": 15,
        "released": "2025-12-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3361459",
        "title": "08/09/2025",
        "season": 2025,
        "episode": 1,
        "released": "2025-09-08",
        "overview": "In the first episode, we hear from residents in Ukraine's Kharkiv and Nawal Al-Maghafi reports on the escalating crisis in Sudan."
      },
      {
        "id": "tvmaze:3361460",
        "title": "15/09/2025",
        "season": 2025,
        "episode": 2,
        "released": "2025-09-15",
        "overview": "Jean Mackenzie reports on the political turmoil in South Korea following the short-lived declaration of martial law last year."
      },
      {
        "id": "tvmaze:3366959",
        "title": "22/09/2025",
        "season": 2025,
        "episode": 3,
        "released": "2025-09-22",
        "overview": "A BBC Eye undercover reporter exposes a fake news operation in Moldova in Eastern Europe as the country prepares to go to the polls."
      },
      {
        "id": "tvmaze:3370577",
        "title": "29/09/2025",
        "season": 2025,
        "episode": 4,
        "released": "2025-09-29",
        "overview": "An investigation exposing members of the security forces who shot dead protesters at Kenya's parliament in 2024. And from Nairobi, Waihiga Mwaura explores the aftermath."
      },
      {
        "id": "tvmaze:3383103",
        "title": "06/10/2025",
        "season": 2025,
        "episode": 5,
        "released": "2025-10-06",
        "overview": "New evidence may hold the clue to the fate of a Middle Eastern political leader missing for more than 40 years, and Will Grant reports from Havana on Cuba's economic crisis."
      },
      {
        "id": "tvmaze:3402715",
        "title": "13/10/2025",
        "season": 2025,
        "episode": 6,
        "released": "2025-10-13",
        "overview": "This week, an investigation into unlicensed opioids that have been driving a major public health crisis in West Africa, and Diyva Arya is in Indian Administered Kashmir."
      },
      {
        "id": "tvmaze:3402716",
        "title": "20/10/2025",
        "season": 2025,
        "episode": 7,
        "released": "2025-10-20",
        "overview": "BBC Eye uncovers a growing culture of surveillance and informants in Hong Kong, and Carine Torbey reports on how what is happening in Lebanon could shape the future of the entire Middle East."
      },
      {
        "id": "tvmaze:3402717",
        "title": "27/10/2025",
        "season": 2025,
        "episode": 8,
        "released": "2025-10-27",
        "overview": "The Eye team uncovers what happened during the popular uprising that led to the downfall of Bangladesh's former prime minister Sheikh Hasina. And Sammy Awami is in Madagascar."
      },
      {
        "id": "tvmaze:3425077",
        "title": "03/11/2025",
        "season": 2025,
        "episode": 9,
        "released": "2025-11-03",
        "overview": "The team goes undercover to expose an illegal prostitution ring in Dubai, and Stephanie Hegarty is in Peru to report on the plight of one of the world's largest uncontacted tribes."
      },
      {
        "id": "tvmaze:3425078",
        "title": "10/11/2025",
        "season": 2025,
        "episode": 10,
        "released": "2025-11-10",
        "overview": "Investigation of a disturbing trend of wildlife deaths along Colombia's lifeblood, the River Magdalena, and Camilla Mota reports from Brazil ahead of the latest United Nations climate talks."
      },
      {
        "id": "tvmaze:3438464",
        "title": "17/11/2025",
        "season": 2025,
        "episode": 11,
        "released": "2025-11-17",
        "overview": "New evidence raises doubts about the US investigation and trial for the 2005 killings of 24 Iraqi civilians in the town of Haditha. And Anna Foster reports from Baghdad."
      },
      {
        "id": "tvmaze:3438465",
        "title": "24/11/2025",
        "season": 2025,
        "episode": 12,
        "released": "2025-11-24",
        "overview": "The incredible story of the Chinese woman behind behind the scam that led to the world's biggest bitcoin seizure and Shawn Yuan is in the Pacific Island Nation of Palau."
      },
      {
        "id": "tvmaze:3445976",
        "title": "01/12/2025",
        "season": 2025,
        "episode": 13,
        "released": "2025-12-01",
        "overview": "In this week's episode, BBC Eye investigates allegations that police in the former former Soviet republic, Georgia used a chemical weapon against protestors and Elizaveta Fokht reports from Berlin on Russia's shadow war against the West."
      },
      {
        "id": "tvmaze:3445977",
        "title": "08/12/2025",
        "season": 2025,
        "episode": 14,
        "released": "2025-12-08",
        "overview": "Nomsa Maseko reports from South Africa in the wake of the first-ever G20 on African soil. In two exclusive reports, Eye Investigations hears from residents of abandoned and hijacked buildings just a few kilometres from the summit location and, in the province of Free State, meets some of President Trump's South African refugees."
      }
    ]
  }
}