{
  "meta": {
    "id": "tvmaze:2950",
    "type": "series",
    "name": "The Great British Bake Off",
    "description": "Over 10 weeks, 12 of the best amateur bakers in Britain will whisk, knead, ice, beat and bake their way through classic British cakes, perfect patisserie, Italian delights, sticky caramel constructions and elaborate layered puddings. All 12 will be hoping to impress with their skill, creativity, knowledge and passion to clinch the Bake Off Crown. Each of the 30 new challenges have been carefully designed by judges Paul Hollywood and Prue Leith to reveal just who is a star baker.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/585/1464906.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/585/1464906.jpg",
    "videos": [
      {
        "id": "tvmaze:3459262",
        "title": "The Great Christmas Bake Off 2025",
        "season": 16,
        "episode": null,
        "released": "2025-12-25",
        "overview": "Deck the ovens with holiday cheer... it's Christmas 2025 in the Bake Off tent! Join Ebenezer Scrooge himself, Paul Hollywood, alongside Dame Prue Leith, and their festive sidekicks Noel Fielding and Alison Hammond. This Christmas, the tent is filled with extra sparkle as stars from the beloved sitcom Peep Show compete for the coveted title of Festive Star Baker. The holiday fun begins with the Signature, where our bakers craft hangable festive biscuit decorations, before they tackle a Boxing Day classic in the Technical: a traditional Christmas turkey pie. And to put the festive dusting on the cake, our bakers recreate their favourite Peep Show moments in cake form! Who'll make it onto Santa's good list, and who'll be left unable to utter a peep?"
      },
      {
        "id": "tvmaze:3459263",
        "title": "The Great New Year Bake Off",
        "season": 16,
        "episode": null,
        "released": "2026-01-01",
        "overview": "In a first-ever twist for the New Year's Bake Off, we're welcoming teams of Bake Off besties into the tent! For the very first time, pairs of bakers will join forces to battle it out for the coveted New Year's cake stand. Judges Paul Hollywood and Dame Prue Leith, along with hosts Alison Hammond and Noel Fielding, kick off 2026 with four teams of legendary Bake Off bakers from past seasons. Before the bakers can ring in the New Year with a dram or two, they have three New Year baking challenges to get stuck into. In the Signature, the duos create fantastic festive pies. The action heats up as the bakers pass the baton in a tricky Technical relay. And finally, in the Showstopper, each duo bring their favourite festive movie to life in biscuit form. Which team's Signature will be pied, and whose biscuit movie will get rave reviews?"
      },
      {
        "id": "tvmaze:209349",
        "title": "Cake",
        "season": 1,
        "episode": 1,
        "released": "2010-08-17",
        "overview": "Ten passionate homebakers take part in a `bake off', which will test every aspect of their baking skills as they battle it out to be crowned the Great British Bake Off's Best Amateur Baker. Each week the bakers are put through three challenges. The competition kicks off with cake in the Cotswolds. The bakers tackle three increasingly difficult challenges, starting off with their signature bake."
      },
      {
        "id": "tvmaze:209350",
        "title": "Biscuits",
        "season": 1,
        "episode": 2,
        "released": "2010-08-24",
        "overview": "Having survived cakes, the remaining 11 bakers are tested on biscuits. Serving up signature savoury biscuits, the bakers must push themselves on flavour to create biscuits that go well with a cheese course, and Sue learns the dirty secret behind the invention of the ice cream cone and the start of the UK ice cream industry."
      },
      {
        "id": "tvmaze:209351",
        "title": "Bread",
        "season": 1,
        "episode": 3,
        "released": "2010-08-31",
        "overview": "It is week three of the competition and the six remaining bakers are making bread in Kent. In the shadow of Sarre Windmill, the bakers will be kneading, proving and knocking back their dough under the watchful eye of baking writer Mary Berry and master baker Paul Hollywood."
      },
      {
        "id": "tvmaze:209352",
        "title": "Puddings",
        "season": 1,
        "episode": 4,
        "released": "2010-09-07",
        "overview": "The remaining five bakers travel to Bakewell in Derbyshire. They must reinvent an often-neglected British classic - the pudding. There are sticky toffee puds, peach and blueberry 'boy bait', rhubarb and orange betty and a cherry queen of puddings. The surprise bake set by judges Paul Hollywood and Mary Berry tests the bakers' ability to cope with pressure. Can the bakers rise to the occasion? As the puds go in the oven, Mel and Sue find out how and why puddings changed from meat to sweet, visit the birthplace of school puddings and discover how puddings helped change Britain's image overseas."
      },
      {
        "id": "tvmaze:209353",
        "title": "Pastry",
        "season": 1,
        "episode": 5,
        "released": "2010-09-14",
        "overview": "The travelling marquee pitches up in the Cornish village of Mousehole, and it's time for the bakers to get to grips with the most difficult of all baking skills - pastry. They bake their own versions of hearty British pies, get down to details with exquisite pastry canapés, and take a crash-course in crimping for this week's surprise bake. Mel and Sue will be find out that Britain's earliest pies really were humble, how pastry became an art form and how pies used to have a more sinister side. Judges Mary Berry and Paul Hollywood decide who will be the final three to go through to the final."
      },
      {
        "id": "tvmaze:209354",
        "title": "Tea Party",
        "season": 1,
        "episode": 6,
        "released": "2010-09-21",
        "overview": "It's the Grand Final and the last three surviving contestants face their biggest challenge yet - baking for the Bake Off's Afternoon Tea Party. In order to be crowned the victor, they will need to bring together all of their skills, making cakes, bread and pastry."
      },
      {
        "id": "tvmaze:209355",
        "title": "Cake",
        "season": 2,
        "episode": 1,
        "released": "2011-08-16",
        "overview": "Twelve of the country's best amateur bakers take part in the second series of `The Great British Bake Off'. In the first round, the bakers are challenged to make 24 decorated cupcakes in two hours and the stress soon shows. Next, they face a technical challenge - featuring a coffee and walnut Battenburg cake from one of Mary Berry's recipes - and finally, they have to make and bake a tiered showstopper cake."
      },
      {
        "id": "tvmaze:209356",
        "title": "Pastries",
        "season": 2,
        "episode": 2,
        "released": "2011-08-23",
        "overview": "It's the second round and eleven bakers remain. This time their pastry skills are scrutinized as the bakers tackle tarts. Over two days the bakers will face three increasingly complicated challenges whilst trying to avoid a soggy bottom. Judged by acclaimed master baker Paul Hollywood and legendary cookery writer and baker Mary Berry."
      },
      {
        "id": "tvmaze:209357",
        "title": "Bread",
        "season": 2,
        "episode": 3,
        "released": "2011-08-30",
        "overview": "The baker's bread making skills are tested with three increasingly complicated challenges over two days. They start with the signature bake, a free-form flavoured loaf that produces a variety of interesting results. The technical challenge is focaccia, which really separates the wheat from the chaff. Finally, a mammoth six-hour hour challenge requires the bakers to create a display bread basket."
      },
      {
        "id": "tvmaze:209358",
        "title": "Biscuits",
        "season": 2,
        "episode": 4,
        "released": "2011-09-06",
        "overview": "The bakers take on biscuits and these bite-sized, delicate delights prove too much for some. The remaining eight must impress legendary cookery writer Mary Berry and artisan baker Paul Hollywood with their interpretation of a classic biscuit. Who will crumble when it comes to judging and whose ginger nuts are too hot to handle?"
      },
      {
        "id": "tvmaze:209359",
        "title": "Pies",
        "season": 2,
        "episode": 5,
        "released": "2011-09-13",
        "overview": "In round five, everyone is out to avoid the dreaded soggy bottom as the seven remaining bakers face pies. They'll begin with their signature family pie, before the dreaded technical challenge which sees lifelong vegetarian Jason delivering six beautifully baked and seasoned pork pies to the judging table. Finally, there is a sweet showstopper challenge in the shape of a meringue pie."
      },
      {
        "id": "tvmaze:209360",
        "title": "Desserts",
        "season": 2,
        "episode": 6,
        "released": "2011-09-20",
        "overview": "In the all-lady quarter-final the remaining five have to impress with their dessert skills, making baked cheesecake, chocolate roulade and a croquembouche."
      },
      {
        "id": "tvmaze:209361",
        "title": "Semi-Final",
        "season": 2,
        "episode": 7,
        "released": "2011-09-27",
        "overview": "It's semi-final time and the four remaining bakers must prove they are worth a place in the final. The signature challenge requires them to make a baked, layered, mousse cake. The technical challenge is Paul's favourite sweet treat - iced fingers. Finally, the bakers must produce a batch of three different types of pastries or croissants."
      },
      {
        "id": "tvmaze:209362",
        "title": "Final - Street Party",
        "season": 2,
        "episode": 8,
        "released": "2011-10-04",
        "overview": "Mel Giedroyc and Sue Perkins host the grand final where Holly, Jo and Mary-Anne face their biggest challenge yet - baking for `The Great British Bake Off' street party. None of them have baked on this scale before. Amongst their offerings are mille-feuille, mini Victoria sponges, strawberry and cream meringue nests and miniature strawberry and rhubarb cheesecakes. Who of the three will take home the trophy?"
      },
      {
        "id": "tvmaze:209366",
        "title": "Cakes",
        "season": 3,
        "episode": 1,
        "released": "2012-08-14",
        "overview": "The first episode is all about cake and the pressure is on from the very first challenge. The bakers tackle an upside down cake for their signature bake, and to keep their place in the Bake Off tent they each attempt to produce a truly showstopping cake."
      },
      {
        "id": "tvmaze:209367",
        "title": "Bread",
        "season": 3,
        "episode": 2,
        "released": "2012-08-21",
        "overview": "The atmosphere in the Bake Off tent is charged as 11 bakers attempt to make flatbread. The revered technical challenge has the bakers in a twist as they attempt Paul's recipe for the notoriously difficult 8 strand paited loaf."
      },
      {
        "id": "tvmaze:209368",
        "title": "Tarts",
        "season": 3,
        "episode": 3,
        "released": "2012-08-28",
        "overview": "Things are hotting up as the remaining 10 bakers do their best to wow Paul and Mary with some unusual flavour combinations for their tartes tartin."
      },
      {
        "id": "tvmaze:209369",
        "title": "Desserts",
        "season": 3,
        "episode": 4,
        "released": "2012-09-04",
        "overview": "The bakers get their just dessert as they face three challenges all designed for a sweet tooth. Today's technical challenge is a main stay of French baking, the crème caramel. Proceedings are rounded off with a mammoth 6 hour challenge to produce a mighty showstopping layered meringue."
      },
      {
        "id": "tvmaze:209370",
        "title": "Pies",
        "season": 3,
        "episode": 5,
        "released": "2012-09-11",
        "overview": "The bakers turn their attention to pies. For their first task they must master a perfect Wellington. When they've recovered it's straight into a fiendishly difficult technical challenge – hand raised pies. None of the bakers have used a pastry dolly before and it proves the downfall of many!"
      },
      {
        "id": "tvmaze:209371",
        "title": "Puddings",
        "season": 3,
        "episode": 6,
        "released": "2012-09-18",
        "overview": "The bakers go all out to impress Mary and Paul with two types of delicious sponge puddings. The technical challenge sees them face a queen of pudding, a recipe direct from the archives of the Queen of Bakes, Mary Berry. And finally a show-stopping strudel that stretches the bakers to their limit."
      },
      {
        "id": "tvmaze:209372",
        "title": "Sweet Dough",
        "season": 3,
        "episode": 7,
        "released": "2012-09-25",
        "overview": "There are still seven bakers left in the Bake Off, but two must go this time. Facing three sweet dough challenges, the bakers start their campaign by creating their signature regional buns, and Paul opens his recipe vault for the technical challenge surprise recipe of Jam Doughnuts."
      },
      {
        "id": "tvmaze:209373",
        "title": "Biscuits",
        "season": 3,
        "episode": 8,
        "released": "2012-10-02",
        "overview": "It's the biscuit based quarter final, and Paul and Mary are taking the challenges to another level. The signature bake sees the bakers  attempt to deliver a batch of perfectly baked crispbreads, and time and temperature work against them to produce six perfectly tempered chocolate tea cakes for the technical challenge."
      },
      {
        "id": "tvmaze:209374",
        "title": "Patisserie",
        "season": 3,
        "episode": 9,
        "released": "2012-10-09",
        "overview": "There are only four bakers left vying for a place in the final. The weight of the occasion is getting to the most unflappable of the bakers as they frantically work against the clock to deliver petits fours to Paul and Mary's exacting standards. The hardest technical bake ever seen on Bake Off finds two of the bakers left wanting as their fraisier cakes collapse, and it's possible to hear a pin drop in the kitchen as the bakers pull out the stops for their showstopping choux gateaus."
      },
      {
        "id": "tvmaze:209375",
        "title": "The Final",
        "season": 3,
        "episode": 10,
        "released": "2012-10-16",
        "overview": "After weeks of pastries, cakes and bread, three bakers have made it to the final. To prove themselves to judges Paul and Mary, they will have to make some first rate fondant fancies. But ultimately, it all comes down to their final ever showstopper - creating a masterpiece with a notoriously difficult Chiffon sponge."
      },
      {
        "id": "tvmaze:209380",
        "title": "Cake",
        "season": 4,
        "episode": 1,
        "released": "2013-08-20",
        "overview": "For the first time ever, the tent welcomes a baker's dozen to do baking battle. Mel Giedroyc and Sue Perkins coax them through their baking trials, all the while under the scrutiny of the judges Mary Berry and Paul Hollywood. The first challenge? A sandwich cake."
      },
      {
        "id": "tvmaze:209381",
        "title": "Bread",
        "season": 4,
        "episode": 2,
        "released": "2013-08-27",
        "overview": "Having survived cake, this week the remaining 12 bakers battle bread. Knowing that Paul will be watching their every move and prove, they must bake 36 perfectly thin and crispy signature bread sticks, a technically tricky English Muffin, and the most outrageous show-stopping loaves of bread ever seen on television..."
      },
      {
        "id": "tvmaze:209382",
        "title": "Desserts",
        "season": 4,
        "episode": 3,
        "released": "2013-09-03",
        "overview": "It's week three, and the heat in the kitchen is already too much for some, as the remaining 11 bakers get ready to deal with desserts. These include a Signature Trifle combining biscuit, cake, jelly or custard in perfectly distinct layers."
      },
      {
        "id": "tvmaze:209383",
        "title": "Pies and Tarts",
        "season": 4,
        "episode": 4,
        "released": "2013-09-10",
        "overview": "It's week four in the tent and the baking is getting serious, as the remaining bakers put on their pinnies to pimp up pies and tarts. From the country's oldest known cookbook, we discover the almost 700 year old history of the English custard tart. As a technical challenge in the Bake Off tent, this classic sweet causes more than the intended wobble for the bakers!"
      },
      {
        "id": "tvmaze:209384",
        "title": "Biscuits and Traybakes",
        "season": 4,
        "episode": 5,
        "released": "2013-09-17",
        "overview": "Almost half way through the Bake Off and the remaining eight bakers are faced with biscuits and traybakes. Today they face the thinnest Technical Challenge ever devised on Bake Off; the French classic tuiles, biscuits formed into fragile rolls and decorated with piped chocolate."
      },
      {
        "id": "tvmaze:209385",
        "title": "Sweet Dough",
        "season": 4,
        "episode": 6,
        "released": "2013-09-24",
        "overview": "It's week six in the tent and time for sweet dough week – but will it prove bitter-sweet for the bakers? They kick off with a signature tea loaf. After this, the bakers face Paul's most twisted Technical Challenge yet, and a Showstopper that draws on all of Europe for inspiration, creating 36 sweet European buns."
      },
      {
        "id": "tvmaze:209386",
        "title": "Pastry",
        "season": 4,
        "episode": 7,
        "released": "2013-10-01",
        "overview": "With only six bakers left in the tent the stakes are getting higher, and this week they face pastry. First, the bakers battle to bring the old fashioned suet pudding up to date with some mean roly-poly puddings. After a tough technical challenge to make 8 delicate choux buns filled with crème patissiere, the bakers reach the showstopper, and must make three different types of perfectly puffed pastries."
      },
      {
        "id": "tvmaze:209387",
        "title": "Unconventional Flours and Unusual Desserts",
        "season": 4,
        "episode": 8,
        "released": "2013-10-08",
        "overview": "It's the quarter final and there are just five bakers left. For the Signature Challenge the bakers must make a loaf using non-traditional wheat flours. The Technical sees the bakers challenged to each make a dacquoise, made with three layers of fragile coiled meringue. And for their final challenge, the bakers must push themselves out of their comfort zone to create show-stopping novelty vegetable cakes."
      },
      {
        "id": "tvmaze:209388",
        "title": "French Week",
        "season": 4,
        "episode": 9,
        "released": "2013-10-15",
        "overview": "The semifinalists are tasked with baking savoury canapes, a Charlotte royal and a truly iconic French patisserie, the opera cake."
      },
      {
        "id": "tvmaze:1239930",
        "title": "The Final",
        "season": 4,
        "episode": 10,
        "released": "2013-10-22",
        "overview": "It's the final of The Great British Bake Off! 13,000 applicants were narrowed down to 13 of Britain's best amateur bakers, and the 13 became three. There are just three final challenges standing between the bakers and the title of WINNER of the Great British Bake Off."
      },
      {
        "id": "tvmaze:209394",
        "title": "Cake",
        "season": 5,
        "episode": 1,
        "released": "2014-08-06",
        "overview": "As the 12 new bakers enter the tent for the very first time, their first Signature Challenge is to make a swiss roll. But with such a seemingly simple challenge comes a risk - who will have the tightest roll? Whose roll will split? Should the bakers go for the classic or push the boat out to impress?"
      },
      {
        "id": "tvmaze:209395",
        "title": "Biscuits",
        "season": 5,
        "episode": 2,
        "released": "2014-08-13",
        "overview": "The bakers cook biscuits for a cheese course, Mary's Florentines and finally a 3D biscuit scene showstopper."
      },
      {
        "id": "tvmaze:209396",
        "title": "Bread",
        "season": 5,
        "episode": 3,
        "released": "2014-08-20",
        "overview": "Bread is on the menu, and the bakers must bake 12 perfect rye bread rolls, shaped in any way they like and using as much rye flour as they dare. Paul's technical challenge is his recipe for ciabatta loaves. But which bakers will listen to his words of wisdom and which ones will lose their nerve?"
      },
      {
        "id": "tvmaze:209397",
        "title": "Desserts",
        "season": 5,
        "episode": 4,
        "released": "2014-08-27",
        "overview": "Having seen the bakers make cake, biscuits and bread, Mary and Paul up the ante - for the first time, we see how the bakers cope with multi-tasking across several baking skills at once. For their signature challenge, the bakers must bake saucy puds - delicate sponges hiding a gooey saucy filling or a saucy surprise at the bottom. Also in this show, Sue Perkins explores the origins of the Paignton pudding."
      },
      {
        "id": "tvmaze:209398",
        "title": "Pies and Tarts",
        "season": 5,
        "episode": 5,
        "released": "2014-09-03",
        "overview": "Almost halfway through the Bake Off and the remaining bakers are facing pies and tarts. Starting with a signature custard tart that gives more than one of them a wobble, the bakers must make sweet custard tarts of their own invention. After this, Paul sets the bakers mini pear pies; one of the more unusual technical challenges that the Bake Off has seen."
      },
      {
        "id": "tvmaze:209399",
        "title": "European Cakes",
        "season": 5,
        "episode": 6,
        "released": "2014-09-10",
        "overview": "Past halfway in their baking marathon and the remaining six bakers face three European cakes. For their signature challenge the bakers are asked to bake yeast-leavened cakes, and Mary sets the bakers their most demanding technical challenge yet in which they must make a Swedish princess torte."
      },
      {
        "id": "tvmaze:209400",
        "title": "Pastry",
        "season": 5,
        "episode": 7,
        "released": "2014-09-17",
        "overview": "The remaining bakers are asked to make signature savoury parcels, ranging from pasties to wellingtons to samosas and even exploring the fame of the beloved cornish pasty which has spread much further than you would think - to Mexico. After this, the bakers must make show-stopping eclairs."
      },
      {
        "id": "tvmaze:209401",
        "title": "Advanced Dough",
        "season": 5,
        "episode": 8,
        "released": "2014-09-24",
        "overview": "It's the quarter-finals of the Bake Off and only five bakers remain. Asked to make enriched sweet fruit loaves for their signature challenge, the bakers must work with soft dough to create works of art for Paul and Mary to critique. The technical challenge stretches them to the limit and finally, a show-stopper that takes the ordinary into the extraordinary."
      },
      {
        "id": "tvmaze:209402",
        "title": "Semi-Final - Patisserie",
        "season": 5,
        "episode": 9,
        "released": "2014-10-01",
        "overview": "It's semi-final time and the tension is palpable as the bakers begin Patisserie Week. The semi-finalists are challenged to make signature baklava - two different types of any flavour they like, but with the crisp flaky layers of perfectly pulled filo pastry. Next up is the penultimate technical challenge of the series, which sees the bakers make layers of a different kind."
      },
      {
        "id": "tvmaze:209403",
        "title": "The Final",
        "season": 5,
        "episode": 10,
        "released": "2014-10-08",
        "overview": "It's the final...from thousands of applicants just 12 bakers made it to the tent, and now only three remain. Having fought their way through 27 baking challenges and proved they can master every baking discipline known to man, the remaining three bakers have just one more weekend of baking to tackle. Just three challenges lie between them and the trophy. Each one is worthy, but who will be crowned winner of the Great British Bake Off?"
      },
      {
        "id": "tvmaze:209408",
        "title": "Cake",
        "season": 6,
        "episode": 1,
        "released": "2015-08-05",
        "overview": "Twelve bakers take on their first signature challenge -- to make a Madeira cake; the classic black forest gateau."
      },
      {
        "id": "tvmaze:209409",
        "title": "Biscuits",
        "season": 6,
        "episode": 2,
        "released": "2015-08-12",
        "overview": "Eleven bakers face the signature challenge of creating 24 biscotti; the technical challenge is arlettes; edible biscuit box of 36 biscuits of a different flavor."
      },
      {
        "id": "tvmaze:209410",
        "title": "Bread",
        "season": 6,
        "episode": 3,
        "released": "2015-08-19",
        "overview": "The bakers create quick breads for the signature challenge; the technical challenge is baguettes; edible 3-D bread sculptures."
      },
      {
        "id": "tvmaze:209411",
        "title": "Desserts",
        "season": 6,
        "episode": 4,
        "released": "2015-08-26",
        "overview": "The nine bakers left make a French classic -- creme brulee; the technical challenge is a Spanische windtorte; a stack of tiered cheesecakes."
      },
      {
        "id": "tvmaze:209412",
        "title": "Alternative Ingredients",
        "season": 6,
        "episode": 5,
        "released": "2015-09-02",
        "overview": "For alternative ingredients week, the bakers must bake without sugar, gluten or dairy; the signature challenge requires sugar free cakes; gluten free pitas; dairy free ice cream rolls."
      },
      {
        "id": "tvmaze:209413",
        "title": "Pastry",
        "season": 6,
        "episode": 6,
        "released": "2015-09-09",
        "overview": "It's pastry week and the bakers begin with frangipane tarts for the signature challenge; the technical challenge calls for flaouna, a traditional cheese-filled pastry; vol-au-vent."
      },
      {
        "id": "tvmaze:211940",
        "title": "Victorian",
        "season": 6,
        "episode": 7,
        "released": "2015-09-16",
        "overview": "The signature challenge features a stalwart of the Victorian dinner table -- game pie."
      },
      {
        "id": "tvmaze:246271",
        "title": "Patisserie",
        "season": 6,
        "episode": 8,
        "released": "2015-09-23",
        "overview": "The five remaining bakers work their way through patisserie, including a mountainous choux pastry masterpiece."
      },
      {
        "id": "tvmaze:277881",
        "title": "Chocolate",
        "season": 6,
        "episode": 9,
        "released": "2015-09-30",
        "overview": "The pressure is on as the remaining bakers get a grip on one of the most difficult ingredients -- chocolate."
      },
      {
        "id": "tvmaze:321695",
        "title": "The Final",
        "season": 6,
        "episode": 10,
        "released": "2015-10-07",
        "overview": "This program looks back over the last series from Luis's amazing 3-D biscuit scene via the technically challenging Schichttorte to Ian's binning of his baked Alaska."
      },
      {
        "id": "tvmaze:885499",
        "title": "Cake Week",
        "season": 7,
        "episode": 1,
        "released": "2016-08-24",
        "overview": "Twelve new amateur bakers don their aprons and head for the iconic tent in the heart of the British countryside. Mel Giedroyc and Sue Perkins are back, as are Mary Berry and Paul Hollywood, who have devised 30 new challenges to test the bakers' knowlege, skill and creativity.The competition begins with cake week. The group first take on a British classic and are then faced with Mary's technical challenge - a popular little cake with a fatless sponge and tricky chocolate work. Finally, the bakers have the opportunity to show the judges what they can do with their showstopper.The best of the bunch will be crowned star baker while one contestant will be leaving the tent."
      },
      {
        "id": "tvmaze:898992",
        "title": "Biscuit Week",
        "season": 7,
        "episode": 2,
        "released": "2016-08-31",
        "overview": "It is week two of The Great British Bake Off, and it is crunch time as Paul and Mary set the bakers three biscuit challenges.The bakers start with a signature challenge, but who will snap first with just a few hours to make 24 identical decorated biscuits?Hidden under the gingham cloth is a technical challenge that requires perfect piping to avoid a crumbling whirl.Sue Perkins drops in for tea and history as she discovers the etiquette of dunking biscuits, from Victorian high society right back to Greek survival biscuits.The final showstopper challenge requires precision baking to build a biscuit structure that reveals a little more about each of the bakers."
      },
      {
        "id": "tvmaze:904680",
        "title": "Bread Week",
        "season": 7,
        "episode": 3,
        "released": "2016-09-07",
        "overview": "It is bread week, and Paul Hollywood has put together three of the toughest challenges ever. First up is the signature challenge - a sweet dough with a twist. And with Paul's digits primed for prodding, no dough is safe from scrutiny.The bakers then face a steamy technical challenge without an oven, as Paul and Mary step out of the tent to leave the bakers with only a basic set of instructions and ingredients. For the perfect bake they have to avoid a burnt bottom and a soggy top.Mel heads to Germany to discover how one brave baker and a few hundred dumplings saved his small town from the ravages of the Thirty Years' War.And there is a mighty final challenge which requires the use of three different flours to create a huge showstopper centrepiece."
      },
      {
        "id": "tvmaze:904681",
        "title": "Batter Week",
        "season": 7,
        "episode": 4,
        "released": "2016-09-14",
        "overview": "It's week four of The Great British Bake Off, just nine bakers remains, and - for the very first time - it is Batter Week. Mary and Paul have set three challenges to test the bakers on some store cupboard classics. To start things off there is a British favourite. It may sound simple, but the judges are looking for perfection - a uniform bake across the batch and a tasty savoury filling. The bakers really have to rise to the occasion in this signature challenge.The technical challenge requires a steady hand to master its intricacies, and there's no room for error.And finally there is a showstopper where the ovens are off and the fryers are out, as the bakers are challenged to do their version of a Spanish classic.Three challenges, three chances to win star baker, three chances to avoid leaving the tent."
      },
      {
        "id": "tvmaze:904682",
        "title": "Pastry Week",
        "season": 7,
        "episode": 5,
        "released": "2016-09-21",
        "overview": "It is Pastry Week, and with just eight bakers left, Mary and Paul are looking for perfection. They have set three challenges to test the bakers on three very different types of pastry. For the signature challenge it is breakfast time, Danish style.In the technical challenge, Mary asks the bakers to keep their cool, giving them limited time and instructions to bake a classic British tart. Mel takes a shift at a London Turkish bakery making baklava, and she discovers the history of this delicate desert that hailed from the palaces of Sultans.And finally there is a bite-size showstopper, a fine pastry which notoriously difficult to make and even trickier to bake. Which bakers will impress Mary and Paul enough to keep their place in the tent, and who will be heading home?"
      },
      {
        "id": "tvmaze:904683",
        "title": "Botanical Week",
        "season": 7,
        "episode": 6,
        "released": "2016-09-28",
        "overview": "It's week six of The Great British Bake Off and just seven bakers remain. This week, for the very first time on Bake Off, it's Botanical Week.There are three challenges inspired by nature. The bakers can reach for anything that grows to give their bakes maximum botanical taste.The bakers start with a signature challenge with a twist, that demands sharp citrus flavours and perfect peaks. Hidden under the gingham cloth is a leafy technical challenge set by Mr Hollywood. And finally, the botanical showstopper is the biggest challenge of the series so far - not one, not two, but three tiers of elaborately decorated cake.Paul and Mary are looking for beautifully flavoured sponges and to be wowed by stunning floral designs. Three challenges, three chances to win star baker, three chances to avoid leaving the tent."
      },
      {
        "id": "tvmaze:904684",
        "title": "Dessert Week",
        "season": 7,
        "episode": 7,
        "released": "2016-10-05",
        "overview": "Week seven of The Great British Bake Off is Dessert week. Three sweet challenges which will mean a bitter end for one of the six remaining bakers as they battle for a place in the quarter-final.For starters the bakers face a sweetly filled signature challenge that has them rolling out their skills to impress Mary and Paul.And if that wasn't enough, the technical challenge is one of the toughest of the series so far, which layers on the pressure as the bakers are tested on a tricky French dessert.Sue heads to Paris for a lesson on the history of praline and nibbles on a few of these nutty delicacies.And finally there is a multi-bake mini-showstopper that is a bit of a mousse marathon. But which of the bakers will impress Mary and Paul enough to earn their place in the quarter-final, and which baker will be hanging up their apron and heading home?"
      },
      {
        "id": "tvmaze:904685",
        "title": "Tudor Week",
        "season": 7,
        "episode": 8,
        "released": "2016-10-12",
        "overview": "This week we are stepping back in history for a Bake Off first - Tudor Week. Mary and Paul have set three new challenges that embrace a time when Henry VIII reigned, a time of flamboyant banquets and impressive centre pieces that were Tudor showstoppers.The signature is a Tudor classic - pies. Although a few hundred years ago their pies would have been filled with feathered birds, our bakers will attempt to make a rather more edible version for modern taste of a savoury stuffed pie.In the technical challenge, the bakers face a rather unusual Tudor biscuit that has the them all tied up in knots.Mel pops into Hampton Court to uncover how one sweet delicacy nearly enticed Queen Elizabeth I to marry.And the final challenge is to construct a showstopper that is a spectacle of marzipan, fit to grace the tables of a wealthy Tudor banquet.Which of the five bakers will make it into the semi-final, and who will be leaving the tent?"
      },
      {
        "id": "tvmaze:904686",
        "title": "Patisserie Week",
        "season": 7,
        "episode": 9,
        "released": "2016-10-19",
        "overview": "It is the Bake Off semi-final, and it is Patisserie Week, with just four bakers remaining. In the signature challenge, the bakers are once again butter-bashing and folding their pastry to achieve perfect lamination for a difficult French pastry.In the technical challenge, Paul has set the bar high. He is testing the bakers' patisserie prowess with a yeast-based cake that has a fruity top and delicate chocolate work.The showstopper is the bakers' last chance to prove they have what it takes to make it to the final, with a multiple mini-cake bake. The timings are crucial to achieve the high-end finish the judges are looking for.Which of the bakers will impress Mary and Paul enough to earn their place in next week's final, and who will be leaving the tent?"
      },
      {
        "id": "tvmaze:904687",
        "title": "The Final",
        "season": 7,
        "episode": 10,
        "released": "2016-10-26",
        "overview": "It is the final, and with just three of the original twelve bakers remaining. The theme for the final is a Royal Bake Off, as the tent plays host to three challenges to impress the Queen.The last signature challenge sees a return to meringues, a challenge that a few of the bakers stumbled over in week six.For the technical challenge, Mary has made a simple bake very, very tough, as she has only given the bakers one recipe instruction. The rest is down to them. It may be a very British classic, but with no measurements, this is the ultimate test of the final three bakers' intuition.Then on the final day, as the bakers' families gather outside the tent, the finalists face their last showstopper. This is the most complex one ever seen on Bake Off, and there are the most bakes ever requested in a challenge. With only one oven, it's five solid hours of baking for the finalists to prove they deserve the winner's trophy.Who will be named the winner of The Great British Bake Off 2016?"
      },
      {
        "id": "tvmaze:1275700",
        "title": "Cake Week",
        "season": 8,
        "episode": 1,
        "released": "2017-08-29",
        "overview": "Cake Week sees the bakers take on a fruity challenge. Prue sets her first technical - a kids' party favourite. Plus, the trickiest showstopper ever set in the first week of Bake Off: an illusion cake."
      },
      {
        "id": "tvmaze:1280221",
        "title": "Biscuit Week",
        "season": 8,
        "episode": 2,
        "released": "2017-09-05",
        "overview": "For biscuit week, Paul and Prue set the remaining 11 bakers three new challenges, including a tricky filling, and a final showstopper that is literally game-changing"
      },
      {
        "id": "tvmaze:1285194",
        "title": "Bread Week",
        "season": 8,
        "episode": 3,
        "released": "2017-09-12",
        "overview": "Paul and Prue set three tough challenges for the remaining 10 bakers in bread week, including an ambitious sculpture showstopper"
      },
      {
        "id": "tvmaze:1290299",
        "title": "Caramel Week",
        "season": 8,
        "episode": 4,
        "released": "2017-09-19",
        "overview": "For the very first time on the show, it's caramel week, with three sticky challenges for the bakers, including a super sweet signature and a double Dutch technical"
      },
      {
        "id": "tvmaze:1300456",
        "title": "Pudding Week",
        "season": 8,
        "episode": 5,
        "released": "2017-09-26",
        "overview": "Prue and Paul are seeking perfection in pudding week, with a staggering technical challenge and a multi-layered showstopper that's not to be trifled with"
      },
      {
        "id": "tvmaze:1313904",
        "title": "Pastry Week",
        "season": 8,
        "episode": 6,
        "released": "2017-10-03",
        "overview": "The bakers face a tough triple challenge with a savoury signature, a multi-layered technical, and an ambitious traditional pie that pushes them to the edge"
      },
      {
        "id": "tvmaze:1318980",
        "title": "Italian Week",
        "season": 8,
        "episode": 7,
        "released": "2017-10-10",
        "overview": "Week seven of The Great British Bake Off is Italian week. Prue Leith and Paul Hollywood have set three Italian challenges to test the six remaining bakers. There's a Sicilian signature that gets them all hot under the collar; while it's a toss-up as to who will survive the deceptively tricky technical. And finally there's a fiddly showstopper in the hottest temperatures ever recorded in the tent. Who will keep their cool and win star baker? And who will be saying ciao to the tent?"
      },
      {
        "id": "tvmaze:1326029",
        "title": "Forgotten Bakes Week",
        "season": 8,
        "episode": 8,
        "released": "2017-10-17",
        "overview": "Our five bakers are stepping back in time and using unfamiliar recipes for Forgotten Bakes week. There's a sweet and savoury signature challenge and Prue sets a boozy technical."
      },
      {
        "id": "tvmaze:1330150",
        "title": "Patisserie Week - Semi-Final",
        "season": 8,
        "episode": 9,
        "released": "2017-10-24",
        "overview": "It's the semi-final of the Great British Bake Off, and the four remaining bakers are all desperate to claim their place in the final. The remaining bakers know they are just three patisserie challenges away from the biggest day in their baking lives. First comes the signature, and there's no business like choux business as the bakers must set to work on producing 24 exquisite choux buns. Prue has set a complex technical for her first semi-final that leaves everyone stumped. And there's a meringue sculpture showstopper where the bakers mustn't crack under pressure. Who has the skill to reach the Bake Off Final and who will leave the tent?"
      },
      {
        "id": "tvmaze:1340585",
        "title": "The Final",
        "season": 8,
        "episode": 10,
        "released": "2017-10-31",
        "overview": "Noel Fielding and Sandi Toksvig present this year's grand final, as the three remaining bakers compete to impress judges Paul Hollywood and Prue Leith and take home this year's trophy. For the final three challenges, they must prepare a batch of loaves, followed by a biscuit bake, and climaxing with a delicate, multi-layered, high-end patisserie showstopper to decide the winner."
      },
      {
        "id": "tvmaze:1513892",
        "title": "Biscuit Week",
        "season": 9,
        "episode": 1,
        "released": "2018-08-28",
        "overview": "The bakers tackle signature biscuits that will say something both about them and a place in the British Isles. Next the bakers face their first Technical, and hiding under the gingham cloth is one of Paul's childhood favourites - an iconic biscuit that's sure to send the bakers round in circles. Finally, it's crunch time. The bakers will have to be picture perfect with their first showstopper - a spectacular 3D biscuit portrait challenge that requires precision baking and superb decorating skills. Three challenges, three chances to win star baker, three chances to avoid leaving the tent."
      },
      {
        "id": "tvmaze:1516353",
        "title": "Cake Week",
        "season": 9,
        "episode": 2,
        "released": "2018-09-04",
        "overview": "The 11 remaining bakers face a tough test in Cake Week, including a crowd-pleasing signature challenge, Prue's first technical challenge, and a chocolate collared showstopper."
      },
      {
        "id": "tvmaze:1516354",
        "title": "Bread Week",
        "season": 9,
        "episode": 3,
        "released": "2018-09-11",
        "overview": "It's Bread Week, and the ten remaining bakers have a lot to prove with three tough challenges set by judges Paul Hollywood and Prue Leith. There is a teatime fruity favourite Signature; a deceptively simple time-test of a Technical with an international flavour; and an ambitious Showstopper that's the largest bread sculpture challenge ever set in the tent. Only one can claim Star Baker, while one of them will leave the tent for good."
      },
      {
        "id": "tvmaze:1516355",
        "title": "Dessert Week",
        "season": 9,
        "episode": 4,
        "released": "2018-09-18",
        "overview": "The bakers must create a cracking meringue Signature, a wobbly Technical, and a complex chocolate Showstopper that promises to reveal all."
      },
      {
        "id": "tvmaze:1530241",
        "title": "Spice Week",
        "season": 9,
        "episode": 5,
        "released": "2018-09-25",
        "overview": "Paul and Prue set the bakers a classic teatime Signature. There's also an Arabian Technical and a fiddly Showstopper."
      },
      {
        "id": "tvmaze:1534461",
        "title": "Pastry Week",
        "season": 9,
        "episode": 6,
        "released": "2018-10-02",
        "overview": "It's Pastry Week, and as this year's competition passes the halfway mark, Paul and Prue are looking for perfection. For the Signature challenge, it's samosa time - with a sweet and a savoury option to test the bakers. There's a classic French Technical involving two types of pastry. And the ambitious final challenge sees the bakers pushed to the edge creating a majestic pie fit for a banquet."
      },
      {
        "id": "tvmaze:1536179",
        "title": "Vegan Week",
        "season": 9,
        "episode": 7,
        "released": "2018-10-09",
        "overview": "For the very first time on Bake Off, it's Vegan week. Prue and Paul have set three very different challenges to test the remaining bakers. A savoury pastry Signature, with no butter involved. A cracking Technical, with a very unusual ingredient. And finally, a spectacular Showstopper that, in the heat of the tent, threatens to lead to catastrophe. Who will keep their cool and win star baker? And who will be meeting their end?"
      },
      {
        "id": "tvmaze:1537814",
        "title": "Danish Week",
        "season": 9,
        "episode": 8,
        "released": "2018-10-16",
        "overview": "Velkommen to Danish Week in the latest episode of The Great British Bake Off. The bakers face unfamiliar recipes as they battle to impress Prue Leith and Paul Hollywood. There's a bread challenge Signature where they must demonstrate style as well substance. Paul sets a spherical Technical - and with a place in the Bake Off Semi-final at stake, everyone is out to impress. And for their final challenge, the bakers must deliver an elaborate pastry Showstopper fit for a Danish birthday party. Who will become an honorary Great Dane, and who will be leaving the tent?"
      },
      {
        "id": "tvmaze:1545090",
        "title": "Patisserie Week - Semi-Final",
        "season": 9,
        "episode": 9,
        "released": "2018-10-23",
        "overview": "It's the semi-final of the Great British Bake Off, and the remaining bakers are desperate to claim their place in the final. They know they are just three patisserie challenges away from the biggest day in their baking lives. First comes the Signature, and there's a deceptively simple challenge with Paul and Prue looking for perfection. The heat is on with Prue's complex, multi-layered Technical. And the semi-finalists feel the pressure when they're asked to create a spectacular Showstopper that could grace a Parisian patisserie. Who has the skill to reach the Bake Off final? And who will fall at the final hurdle?"
      },
      {
        "id": "tvmaze:1545091",
        "title": "Final",
        "season": 9,
        "episode": 10,
        "released": "2018-10-30",
        "overview": "Twelve bakers started. Now just three remain. But only one can be crowned winner of The Great British Bake Off 2018. This week's final sees Paul Hollywood and Prue Leith set three challenges that will test every aspect of the bakers' skills. In the judges' last Signature challenge, the bakers tackle doughnuts and the tricky task of immaculate decoration. There's a deceptively simple Technical, save for one key feature: it's not baked in the tent! And, on the final day, as the bakers' families gather outside the tent, there's one last challenge: an intricate, multi-layered, edible landscape Showstopper that could win them the title."
      },
      {
        "id": "tvmaze:1696812",
        "title": "Cake Week",
        "season": 10,
        "episode": 1,
        "released": "2019-08-27",
        "overview": "The series gets underway with cake week - during which two of the bakers will be sent home. The first stage of the challenge features a fruit cake, while the technical is a retro classic that requires intricate decoration. Finally, for the showstopper, the contestants must create the birthday cake they wish they had received as a child."
      },
      {
        "id": "tvmaze:1702513",
        "title": "Biscuit Week",
        "season": 10,
        "episode": 2,
        "released": "2019-09-03",
        "overview": "It's the second round of the culinary competition, which this time focuses on biscuits. For the signature round, the contestants must concoct a luxurious chocolate-coated bake. The technical challenge is a nostalgic one for Paul Hollywood, who asks the contestants to prepare a snack that was a favourite of his father's. Finally, the showstopper round requires the bakers to rise to an eye-catching challenge that is designed to test which of them will snap under the pressure."
      },
      {
        "id": "tvmaze:1704246",
        "title": "Bread Week",
        "season": 10,
        "episode": 3,
        "released": "2019-09-10",
        "overview": "Bread Week has arrived, and the remaining bakers face the challenge of proving their worth with Paul's speciality. First, the contestants must prepare a signature bake that is designed to be shared, while the ingredients for a popular summer staple are lurking beneath the gingham cloth in the technical challenge. Finally, an ambitious Showstopper will test their steady hands and artistic flair."
      },
      {
        "id": "tvmaze:1704247",
        "title": "Dairy Week",
        "season": 10,
        "episode": 4,
        "released": "2019-09-17",
        "overview": "Noel Fielding and Sandi Toksvig host Dairy Week, with Prue Leith and Paul Hollywood judging the baker's efforts. The first of the three challenges is a decorative signature bake that involves a tricky turn-out. The bakers then move onto the technical challenge, which is a complex recipe with a long history that dates back to Henry VIII. With the first day behind them, the contestants regroup for the final challenge of the week - an intricate showstopper usually found at the centre of Indian weddings."
      },
      {
        "id": "tvmaze:1704248",
        "title": "The Roaring Twenties",
        "season": 10,
        "episode": 5,
        "released": "2019-09-24",
        "overview": "Noel Fielding and Sandi Toksvig introduce a special round of the baking challenge in which contestants must create confectionery inspired by the Roaring Twenties. The signature challenge involves a decorative twist on custard pies, while the technical round will be a test of the bakers' timing and consistency. Finally, for the Shows, they must create a three-tiered masterpiece inspired by their tipple of choice. Paul Hollywood and Prue Leith are on hand to assess the results of their efforts and decide who will be leaving the tent."
      },
      {
        "id": "tvmaze:1718943",
        "title": "Dessert Week",
        "season": 10,
        "episode": 6,
        "released": "2019-10-01",
        "overview": "Noel Fielding and Sandi Toksvig host Dessert Week as the baking contest crosses the half-way point. The signature challenge is an elegant and challenging bake with a lot of delicate layers, while the technical round will test the bakers' ability to pull off delicate assembly and precise decoration. Finally, for the Showstopper, they must create a spherical celebration cake. Prue Leith and Paul Hollywood are on hand to taste the results - and decide who will be crowned Star Baker and who will be leaving the tent this week."
      },
      {
        "id": "tvmaze:1722553",
        "title": "Festival Week",
        "season": 10,
        "episode": 7,
        "released": "2019-10-08",
        "overview": "Noel Fielding and Sandi Toksvig host a special festival-themed round of the culinary competition. The episode kicks off with a signature challenge in which the bakers must draw inspiration from celebrations across the world. Moving on to the technical round, the contestants find the makings of a classic deep-fried Italian dish lurking beneath the mysterious gingham cloths. Finally, the Showstopper puts the bakers' precision and creativity to the test before judges Paul Hollywood and Prue Leith decide who will be crowned StarBaker."
      },
      {
        "id": "tvmaze:1727426",
        "title": "Pastry Week",
        "season": 10,
        "episode": 8,
        "released": "2019-10-15",
        "overview": "Noel Fielding and Sandi Toksvig host as the remaining bakers' knowledge of pastry is tested. The Signature challenge is a savoury take on a French classic, there's a multi-layered Moroccan Technical, and a towering Showstopper that requires not only an expertise with pastry, but also a solid grasp of structural engineering. With a place in the semi-final at stake, who will win the coveted Star Baker title from judges Prue Leith and Paul Hollywood?"
      },
      {
        "id": "tvmaze:1734691",
        "title": "Patisserie Week - Semi-Final",
        "season": 10,
        "episode": 9,
        "released": "2019-10-22",
        "overview": "Noel Fielding and Sandi Toksvig present the semi-final of the baking contest, which tests the four remaining bakers' skills with patisserie. There are only three places in next week's final, and this round of challenges will determine who does not make the cut. The signature dish requires a delicate dome and a perfect finish, while for the technical, the bakers must take croquembouche to the next level. Finally, for the showstopper, they must use all their skills to construct an edible display case."
      },
      {
        "id": "tvmaze:1734692",
        "title": "The Final",
        "season": 10,
        "episode": 10,
        "released": "2019-10-29",
        "overview": "Noel Fielding and Sandi Toksvig host the final of the culinary competition. As family and friends gather on the lawn outside, the last three bakers enter the tent to prepare a chocolate cake as their signature bake. For the technical challenge, they must master that most delicate of dishes, the souffle, and finally for their showstopper, they must create an edible illusion using only cake, sweet bread and biscuits."
      },
      {
        "id": "tvmaze:1927343",
        "title": "Cake Week",
        "season": 11,
        "episode": 1,
        "released": "2020-09-22",
        "overview": "The contest begins with Cake Week, beginning with a signature challenge to produce a classic Battenberg. For the technical round, Paul sets the contestants the task of making a fruit sponge, and the final Showstopper Challenge gives the bakers a chance to express their creativity."
      },
      {
        "id": "tvmaze:1932712",
        "title": "Biscuit Week",
        "season": 11,
        "episode": 2,
        "released": "2020-09-29",
        "overview": "Matt Lucas and Noel Fielding present Biscuit Week. The Signature challenge involves a sophisticated combination of fruit, nut and chocolate, and the bakers must then produce two takes on a tropical Technical. For the Showstopper round, they are challenged to create an elaborate table setting made entirely from biscuits, before judges Paul Hollywood and Prue Leith decide who will be crowned Star Baker and who will be leaving the contest this week."
      },
      {
        "id": "tvmaze:1936140",
        "title": "Bread Week",
        "season": 11,
        "episode": 3,
        "released": "2020-10-06",
        "overview": "Noel Fielding and Matt Lucas present Bread Week, which kicks off with a sweet and savoury signature round. For the technical challenge, the bakers are asked to create a tribute to the NHS, while the Showstopper is an ambitiously artistic challenge featuring decorative designs in bread. Judges Prue Leith and Paul Hollywood sample their efforts, and choose this week's Star Baker - and this week's departing contestant."
      },
      {
        "id": "tvmaze:1936141",
        "title": "Chocolate Week",
        "season": 11,
        "episode": 4,
        "released": "2020-10-13",
        "overview": "The competition starts to heat up during Chocolate Week, as Prue Leith and Paul Hollywood set three tricky challenges to test the remaining bakers. There's a deceptively simple traybake in the Signature, a Technical packed full of chocolate and nuts, and a celebration Showstopper that pushes the bakers' skills with white chocolate to the limit. Who will impress Prue and Paul enough to keep their place in the tent, and who will be heading home?"
      },
      {
        "id": "tvmaze:1946452",
        "title": "Pastry Week",
        "season": 11,
        "episode": 5,
        "released": "2020-10-20",
        "overview": "Matt Lucas and Noel Fielding present the halfway point of the culinary contest, with pastry week. The bakers must put their own stamp on a Cornish classic and are set a retro technical challenge. For the showstopper round, they must concoct a classic tart in a pastry cage, before judges Prue Leith and Paul Hollywood decide who will be this week's star baker and who will be going home."
      },
      {
        "id": "tvmaze:1950625",
        "title": "Japanese Week",
        "season": 11,
        "episode": 6,
        "released": "2020-10-27",
        "overview": "Noel Fielding and Matt Lucas host the show's first ever Japanese week. For the signature challenge the bakers tackle a Japanese version of the Asian staple, steamed buns, while the technical round involves a tricky recipe involving multiple layers. The showstopper round is themed around kawaii - the Japanese love of all things cute."
      },
      {
        "id": "tvmaze:1957673",
        "title": "1980s Week",
        "season": 11,
        "episode": 7,
        "released": "2020-11-03",
        "overview": "Matt Lucas and Noel Fielding host a 1980s-themed episode of the contest. The signature challenge features a classic quiche, while the technical round requires the bakers to master a popular retro sweet treat. For their final showstopper task, the contestants must keep their cool while preparing an ice cream cake before judges Prue Leith and Paul Hollywood pick this week's star baker and decide who will be leaving the tent."
      },
      {
        "id": "tvmaze:1961924",
        "title": "Dessert Week",
        "season": 11,
        "episode": 8,
        "released": "2020-11-10",
        "overview": "Noel Fielding and Matt Lucas present dessert week of the culinary competition. The signature round features a miniature cheesecake, while the technical challenge features a dish that dates back to the 17th century. Finally, for their showstoppers, the bakers must concoct a jelly art dessert cake constructed of delicate sponge. Judges Paul Hollywood and Prue Leith are on hand to sample the results and decide who will be Star Baker and who will be leaving the tent."
      },
      {
        "id": "tvmaze:1966114",
        "title": "Patisserie Week - Semi-Final",
        "season": 11,
        "episode": 9,
        "released": "2020-11-17",
        "overview": "Matt Lucas and Noel Fielding present this year's semi-final, the last four bakers facing three patisserie challenges to decide who will be going through to next week's final. The signature round features plenty of alcohol, while the technical challenge sets the bakers the task of making pastry horns. Finally, for the Showstopper, they must use all the precision they can muster to construct a cake made entirely from smaller cakes."
      },
      {
        "id": "tvmaze:1967915",
        "title": "The Final",
        "season": 11,
        "episode": 10,
        "released": "2020-11-24",
        "overview": "Noel Fielding and Matt Lucas host the grand final of this year's contest. The last three bakers face three tests of a range of baking skills - a deceptively simple Signature round combining set custard and puff pastry, a Technical celebrating the classic combination of chocolate and nuts, and a magnificent dessert tower for their final Showstopper, before judges Prue Leith and Paul Hollywood select this year's winner."
      },
      {
        "id": "tvmaze:2164089",
        "title": "Cake Week",
        "season": 12,
        "episode": 1,
        "released": "2021-09-21",
        "overview": "Twelve new contestants make their way into the famous tent, hoping they have what it takes to bake their way to the final. They start off with cake week, and a signature challenge in which they must produce 12 mini rolls, before working out the recipe for a nostalgic teatime classic in the technical. For the showstopper, the bakers are asked to express their creativity with cakes designed to defy the laws of physics."
      },
      {
        "id": "tvmaze:2171742",
        "title": "Biscuit Week",
        "season": 12,
        "episode": 2,
        "released": "2021-09-28",
        "overview": "It's crunch time for the bakers as biscuit week arrives and they are asked to produce their take on filled brandy snaps, followed by a jammy childhood favourite in the technical challenge. In the showstopper, they have to come up with an interactive toy made entirely from biscuit. Noel Fielding and Matt Lucas find out who will be top cookie and who will crumble under the pressure, while Paul Hollywood and Prue Leith judge their efforts."
      },
      {
        "id": "tvmaze:2171743",
        "title": "Bread Week",
        "season": 12,
        "episode": 3,
        "released": "2021-10-05",
        "overview": "Matt Lucas and Noel Fielding present as the amateurs demonstrate their bread-baking skills, putting their own twist on a classic Italian focaccia in the signature challenge and making a Greek-inspired snack in the technical. On day two, judges Paul Hollywood and Prue Leith task them with creating an artistic showpiece rendering decorative designs in milk bread. Who will be leaving the tent this week?"
      },
      {
        "id": "tvmaze:2187673",
        "title": "Dessert Week",
        "season": 12,
        "episode": 4,
        "released": "2021-10-12",
        "overview": "It's dessert week and the bakers put their twist on the classic pavlova, take on a toffee technical and create a delicate dessert wrapped in sponge for an intricate showstopper."
      },
      {
        "id": "tvmaze:2188586",
        "title": "German Week",
        "season": 12,
        "episode": 5,
        "released": "2021-10-19",
        "overview": "It's a Bake Off first, as the bakers make traditional German biscuits and a torte fit for a Prince, before rising to the challenge with a showstopping tiered cake using yeast."
      },
      {
        "id": "tvmaze:2194380",
        "title": "Pastry Week",
        "season": 12,
        "episode": 6,
        "released": "2021-10-26",
        "overview": "It's Pastry Week and the bakers tackle choux pastry doughnuts and a tricky Turkish technical, before making a savoury, delicately designed showstopping pie packed full of flavour."
      },
      {
        "id": "tvmaze:2202129",
        "title": "Caramel Week",
        "season": 12,
        "episode": 7,
        "released": "2021-11-02",
        "overview": "It's Caramel Week and the bakers put their twist on a classic caramel tart and produce a family favourite biscuit bar, before making a showstopping dessert encased in a sugar dome."
      },
      {
        "id": "tvmaze:2204378",
        "title": "Free-From Week",
        "season": 12,
        "episode": 8,
        "released": "2021-11-09",
        "overview": "It's Free-From Week and the remaining bakers explore alternative ingredients as they make a Signature without dairy, a hearty vegan Technical and a gluten-free celebration cake."
      },
      {
        "id": "tvmaze:2207316",
        "title": "Patisserie Week",
        "season": 12,
        "episode": 9,
        "released": "2021-11-16",
        "overview": "It's the semi-final. The bakers' patisserie skills are tested as they make delicate layered slices, a French classic and opulent entremets displays. Who will make it to the final?"
      },
      {
        "id": "tvmaze:2215615",
        "title": "The Final",
        "season": 12,
        "episode": 10,
        "released": "2021-11-23",
        "overview": "The bakers make a classic carrot cake and create a grand Mad Hatter's tea party banquet. Who will be crowned the winner of The Great British Bake Off 2021?"
      },
      {
        "id": "tvmaze:2381200",
        "title": "Cake Week",
        "season": 13,
        "episode": 1,
        "released": "2022-09-13",
        "overview": "Bake Off is back as 12 new bakers enter the iconic white tent. It's cake week, and the bakers tackle a striking sponge and a scaled-down version of a home close to their hearts."
      },
      {
        "id": "tvmaze:2388519",
        "title": "Biscuit Week",
        "season": 13,
        "episode": 2,
        "released": "2022-09-20",
        "overview": "It's Biscuit Week, and the bakers tackle illusion macarons and a fruity favourite, before unleashing their creativity by making a dramatic 3D mask entirely from biscuits."
      },
      {
        "id": "tvmaze:2394293",
        "title": "Bread Week",
        "season": 13,
        "episode": 3,
        "released": "2022-09-27",
        "overview": "It's Bread Week, and the bakers put their stamp on a classic pizza, get in a twist with a perfect pastry and tackle a showstopping Smörgåstårta, a decorative Danish sandwich cake."
      },
      {
        "id": "tvmaze:2397870",
        "title": "Mexican Week",
        "season": 13,
        "episode": 4,
        "released": "2022-10-04",
        "overview": "It's Mexican Week, and the bakers take on the sweet bread pan dulce, tackle a Mexican street food staple, and make a showstopping version of the milk-soaked tres leches cake."
      },
      {
        "id": "tvmaze:2402365",
        "title": "Dessert Week",
        "season": 13,
        "episode": 5,
        "released": "2022-10-11",
        "overview": "It's Dessert Week and the bakers get all steamed up in the Signature, tackle a classic lemon meringue pie, and create a showstopping sponge cake with a hidden surprise."
      },
      {
        "id": "tvmaze:2409864",
        "title": "Halloween Week",
        "season": 13,
        "episode": 6,
        "released": "2022-10-18",
        "overview": "It's Halloween Week and the bakers make apple cake, a s'more-ish Technical and a spooky showstopping piñata. Whose bakes will be eerie-sistible enough to earn them star baker?"
      },
      {
        "id": "tvmaze:2413633",
        "title": "Custard Week",
        "season": 13,
        "episode": 7,
        "released": "2022-10-25",
        "overview": "The bakers are back in the world of desserts for custard week, which sees them serving up floating islands, a summer staple in the technical and a showstopping set gateau that uses custard as the basis."
      },
      {
        "id": "tvmaze:2417552",
        "title": "Pastry Week",
        "season": 13,
        "episode": 8,
        "released": "2022-11-01",
        "overview": "It's Pastry Week and the bakers tackle vol-au-vents, a delicious savoury snack and a 3D pie-scape depicting their favourite childhood story. Who will pie-oneer into the semis?"
      },
      {
        "id": "tvmaze:2420631",
        "title": "Patisserie Week",
        "season": 13,
        "episode": 9,
        "released": "2022-11-08",
        "overview": "It's Patisserie Week and the semi-final, as the bakers tackle mini charlottes, a vertical Technical challenge and an opulent Swedish Showstopper. Who will soar into the final?"
      },
      {
        "id": "tvmaze:2425052",
        "title": "The Final",
        "season": 13,
        "episode": 10,
        "released": "2022-11-15",
        "overview": "The last remaining bakers make a perfect picnic, a summer classic and a baked celebration of our planet. Who will be crowned the winner of Bake Off 2022?"
      },
      {
        "id": "tvmaze:2642389",
        "title": "Cake Week",
        "season": 14,
        "episode": 1,
        "released": "2023-09-26",
        "overview": "Bake Off's back with new presenter Alison Hammond joining the team. It's Cake Week. The new bakers make vertical layers, choccy cake and a showstopping sponge animal menagerie."
      },
      {
        "id": "tvmaze:2649142",
        "title": "Biscuit Week",
        "season": 14,
        "episode": 2,
        "released": "2023-10-03",
        "overview": "It's Biscuit Week and the bakers get stuck into a marshmallow Signature and a custard classic, and make their favourite meal out of biscuits in an illusion-themed Showstopper."
      },
      {
        "id": "tvmaze:2654724",
        "title": "Bread Week",
        "season": 14,
        "episode": 3,
        "released": "2023-10-10",
        "overview": "It's Bread Week. The bakers make a classic loaf and head to Devon for the Technical. Whose plaited centrepiece will get the Breadmaster himself, Paul Hollywood, in a twist?"
      },
      {
        "id": "tvmaze:2659773",
        "title": "Chocolate Week",
        "season": 14,
        "episode": 4,
        "released": "2023-10-18",
        "overview": "It's Chocolate Week, and the bakers take on a tricky torte and a showstopping chocolate box. Who can smoothly make it through to the next week, and who'll have a meltdown?"
      },
      {
        "id": "tvmaze:2664009",
        "title": "Pastry Week",
        "season": 14,
        "episode": 5,
        "released": "2023-10-24",
        "overview": "It's Pastry Week and the bakers tackle savoury picnic pies and a classic French rough puff pastry, before creating showstopping decorative sweet pies. Who has the upper crust?"
      },
      {
        "id": "tvmaze:2667922",
        "title": "Botanical Week",
        "season": 14,
        "episode": 6,
        "released": "2023-10-31",
        "overview": "In a Bake Off first it's Botanical Week. The bakers tackle a spice-filled Signature, herby Technical and a showstopping floral dessert. Who will blossom, and whose thyme is up?"
      },
      {
        "id": "tvmaze:2674148",
        "title": "Dessert Week",
        "season": 14,
        "episode": 7,
        "released": "2023-11-07",
        "overview": "It's Dessert Week and the bakers take on a retro crème caramel, a classic treacle sponge and a showstopping meringue bomb. Who will peak and who'll wobble?"
      },
      {
        "id": "tvmaze:2679058",
        "title": "Party Week",
        "season": 14,
        "episode": 8,
        "released": "2023-11-14",
        "overview": "It's Party Week and the bakers have a ball with a sausage roll and make an 'anything-but-beige' buffet. Who will put on a semi-finals-worthy spread and who will be a party pooper?"
      },
      {
        "id": "tvmaze:2684380",
        "title": "Patisserie Week",
        "season": 14,
        "episode": 9,
        "released": "2023-11-21",
        "overview": "It's the semi-final and the bakers make elegant, buttery patisserie and a puff pastry layered cake. Who will achieve complete and butter perfection to make it to the final?"
      },
      {
        "id": "tvmaze:2689320",
        "title": "The Final",
        "season": 14,
        "episode": 10,
        "released": "2023-11-28",
        "overview": "The finalists make a pastry Signature, a sticky Technical and a showstopping celebration cake. Whose choux will see them through to be crowned Bake Off 2023 winner?"
      },
      {
        "id": "tvmaze:3002479",
        "title": "Cake Week",
        "season": 15,
        "episode": 1,
        "released": "2024-09-24",
        "overview": "Bake Off's back, as a new set of bakers enter the tent. It's Cake Week and the bakers elevate a loaf cake, tackle a Technical with a twist and make bamboozling illusion cakes."
      },
      {
        "id": "tvmaze:3007646",
        "title": "Biscuit Week",
        "season": 15,
        "episode": 2,
        "released": "2024-10-01",
        "overview": "It's Biscuit Week and the bakers make Viennese sandwiches, a retro minty favourite and dramatic puppet theatres. Who'll take centre stage, and who's delivered their final act?"
      },
      {
        "id": "tvmaze:3013716",
        "title": "Bread Week",
        "season": 15,
        "episode": 3,
        "released": "2024-10-08",
        "overview": "It's Bread Week and the bakers take on a savoury Signature, an instruction-less Technical and Horns of Plenty. Who rises to the occasion, and who kneads to dust themselves off?"
      },
      {
        "id": "tvmaze:3017818",
        "title": "Caramel Week",
        "season": 15,
        "episode": 4,
        "released": "2024-10-15",
        "overview": "It's Caramel Week and the bakers make caramel biscuits and turn up the heat with showstopping mousse cakes. Who gets a taste of sweet success, and whose mousse cuts them loose?"
      },
      {
        "id": "tvmaze:3025293",
        "title": "Pastry Week",
        "season": 15,
        "episode": 5,
        "released": "2024-10-22",
        "overview": "It's Pastry Week and the bakers tackle a frangipane tart and Paris-Brest, complete with a freestanding podium. Who'll be put on a pedestal, and whose dreams will flake away?"
      },
      {
        "id": "tvmaze:3034049",
        "title": "Autumn Week",
        "season": 15,
        "episode": 6,
        "released": "2024-10-29",
        "overview": "It's Autumn Week and the bakers make sweet autumn-inspired pies and transform veg into showstopping cakes. Who's got their eyes on the pies, and who'll be leaf-ing the tent?"
      },
      {
        "id": "tvmaze:3037842",
        "title": "Dessert Week",
        "season": 15,
        "episode": 7,
        "released": "2024-11-05",
        "overview": "It's Dessert Week and the bakers tackle exquisitely filled meringue nests, steamed suet puddings and a beloved Italian dessert. Whose tiramisu will get them through?"
      },
      {
        "id": "tvmaze:3042869",
        "title": "1970s Week",
        "season": 15,
        "episode": 8,
        "released": "2024-11-12",
        "overview": "It's a Bake Off first as the bakers get groovy for 1970s Week with towering profiteroles and a retro favourite. Whose gateau will steal the show and who'll make the semi-final?"
      },
      {
        "id": "tvmaze:3046508",
        "title": "Patisserie Week",
        "season": 15,
        "episode": 9,
        "released": "2024-11-19",
        "overview": "It's the semi-final and the bakers show off their patisserie prowess with breakfast pastries and a classic-but-theatrical Technical. Who'll make final-worthy fruit entremets?"
      },
      {
        "id": "tvmaze:3059083",
        "title": "The Final",
        "season": 15,
        "episode": 10,
        "released": "2024-11-26",
        "overview": "The finalists go all out with Signature scones, afternoon tea and tiered celebration cakes. Whose chance of winning has come and scone? And who'll be shedding tiers of joy?"
      },
      {
        "id": "tvmaze:3334741",
        "title": "Cake Week",
        "season": 16,
        "episode": 1,
        "released": "2025-09-02",
        "overview": "The bunting has been hung and the tent is up, which can only mean one thing - Alison Hammond and Noel Fielding are back to guide a new batch of amateur bakers through 10 weeks of challenges set by judges Paul Hollywood and Prue Leith. First up is cake week, in which the hopefuls must produce a Swiss roll with an inlay design, work out how to make fondant fancies in the technical and serve up a stunning landscape cake in the showstopper round."
      },
      {
        "id": "tvmaze:3341298",
        "title": "Biscuit Week",
        "season": 16,
        "episode": 2,
        "released": "2025-09-09",
        "overview": "It's crunch time for the bakers as biscuit week arrives, seeing them take on a 'slice and bake' signature, produce a classic chocolate Hobnob in the technical and make their favourite mementos out of biscuit in the showstopper."
      },
      {
        "id": "tvmaze:3356465",
        "title": "Bread Week",
        "season": 16,
        "episode": 3,
        "released": "2025-09-16",
        "overview": "The bakers are hoping for a Hollywood handshake this week as they tackle bread, the steely-eyed judge's speciality. They begin by putting their stamp on a pull-apart monkey bread in the signature challenge, before being asked to make a sticky, messy, fast food technical. For the showstopper, they serve up sweet bread in tiers. Sadly, for one baker, this will be their last day in the tent. Who will be dusting themselves off and hanging up their apron?"
      },
      {
        "id": "tvmaze:3363541",
        "title": "Back to School Week",
        "season": 16,
        "episode": 4,
        "released": "2025-09-23",
        "overview": "The bakers return to school, starting off with the classic canteen favourite, flapjacks, before being tested with a fondly remembered school cake technical, with a catch. For their final exam, they have to produce a spectacular school fete showstopper, full of nostalgic treats. Mr Hollywood and Ms Leith judge their efforts, before deciding which of the students to expel."
      },
      {
        "id": "tvmaze:3369477",
        "title": "Chocolate Week",
        "season": 16,
        "episode": 5,
        "released": "2025-09-30",
        "overview": "In Chocolate Week, Noel Fielding and Alison Hammond host as the bakers make fiddly mousse cups for the Signature, a white chocolate tart in the Technical and a fondue display for their Showstopper challenge."
      },
      {
        "id": "tvmaze:3378974",
        "title": "Pastry Week",
        "season": 16,
        "episode": 6,
        "released": "2025-10-07",
        "overview": "Noel Fielding and Alison Hammond lead the bakers through pastry week, where they make savoury plaits in the signature challenge before attempting a traditional gala pie in the technical. Finally, their skills are pushed to the limit with an intricately sculpted tart showstopper. Whose plaits will leave Paul Hollywood and Prue Leith tongue-tied? And whose pie will equal goodbye?"
      },
      {
        "id": "tvmaze:3385577",
        "title": "Meringue Week",
        "season": 16,
        "episode": 7,
        "released": "2025-10-14",
        "overview": "Alison Hammond and Noel Fielding present a Bake Off first as the contestants face meringue week, starting off by making mini meringue tarts in the signature, before the more delicate task of soufflés in the technical. To end, judges Paul Hollywood and Prue Leith challenge them to produce a showstopping meringue ice cream cake - before deciding which of the hopefuls hasn't quite come up with the goods."
      },
      {
        "id": "tvmaze:3391158",
        "title": "Dessert Week",
        "season": 16,
        "episode": 8,
        "released": "2025-10-21",
        "overview": "Alison Hammond and Noel Fielding present dessert week, which sees the bakers get stuck into a Basque-style cheesecake and a gluten-free sponge, before serving up an elaborate free-standing trifle in the showstopper. As always, Paul Hollywood and Prue Leith taste their efforts - but who will make it through to next week's semi-final?"
      },
      {
        "id": "tvmaze:3402606",
        "title": "Patisserie Week",
        "season": 16,
        "episode": 9,
        "released": "2025-10-28",
        "overview": "Alison Hammond and Noel Fielding present as the semi-finalists take on patisserie week, serving up cream horns and tackling a recipe for a sugar glass dome in the technical round. In the showstopper, they produce a macaron sculpture that depicts something meaningful to them, before judges Prue Leith and Paul Hollywood decide who will be going through to the final."
      },
      {
        "id": "tvmaze:3420143",
        "title": "The Final",
        "season": 16,
        "episode": 10,
        "released": "2025-11-04",
        "overview": "The three finalists bake a classic British iced bun in the signature, a tower of French delights in the technical and for their showstopper take on the challenge of making the largest ever cake in Bake Off history. As ever, Alison Hammond and Noel Fielding encourage the bakers, while judges Paul Hollywood and Prue Leith taste their efforts - but only one can be crowned winner of The Great British Bake Off 2025."
      }
    ]
  }
}