{
  "meta": {
    "id": "tvmaze:745",
    "type": "series",
    "name": "The Real Housewives of Beverly Hills",
    "description": "The Real Housewives of Beverly Hills offers a glimpse inside the world of luxurious wealth and pampered privilege, where being seen and who you know is everything. These women are in the center of it all and they have the mansions, the cars, and the diamonds to prove it. From heiresses to entrepreneurs to a family of child actresses - they deliver the star power and the drama.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504593.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504593.jpg",
    "videos": [
      {
        "id": "tvmaze:3470210",
        "title": "Bearing It All",
        "season": 15,
        "episode": 2,
        "released": "2025-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3470210",
        "title": "Bearing It All",
        "season": 15,
        "episode": 2,
        "released": "2025-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3470210",
        "title": "Bearing It All",
        "season": 15,
        "episode": 2,
        "released": "2025-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3432870",
        "title": "Hot Girl Summer",
        "season": 15,
        "episode": 1,
        "released": "2025-12-04",
        "overview": "Dorit has recently filed for divorce and opens up to the ladies about her ex, their children and if she's ready for a Hot Girl Summer. Kyle is planning Alexia's wedding and navigating life with Mauricio. Sutton must reassess her friendships in the group after being cut off by her former bestie. A familiar face makes a fashionable entrance at Kyle's Summer Solstice Party as Kathy arrives with Rachel Zoe."
      },
      {
        "id": "tvmaze:65699",
        "title": "Life, Liberty and the Pursuit of Wealthiness",
        "season": 1,
        "episode": 1,
        "released": "2010-10-14",
        "overview": "Welcome to Beverly Hills, where pint-size puppies are served breakfast in bed and a three million dollar home is scoffed at. In the premiere episode, Adrienne, whose family owns the Palm Casino Resort and the Sacramento Kings, decides to take the rest of the ladies on a private jet to get VIP treatment and sit courtside at a Kings game. The ladies include Lisa, a witty British restaurateur; former child actresses (and sisters) Kim and Kyle Richards, who are also Paris Hilton's aunts; Kelsey Grammer's soon to be ex-wife Camille, and Taylor, a beauty from Oklahoma with big Beverly Hills dreams. These ladies live big and when they fight, they fight big. They may be living in the lap of luxury, but with all that wealth comes even more drama."
      },
      {
        "id": "tvmaze:65700",
        "title": "Chocolate Louboutins",
        "season": 1,
        "episode": 2,
        "released": "2010-10-21",
        "overview": "It's Easter weekend in Beverly Hills but that doesn't mean that there is any less drama. Adrienne is on her way to Vegas for a shoot with a hot male model but she reluctantly decides to takes her husband Paul. Meanwhile, Kyle and Kim start squabbling at their family's vacation home in Palm Desert when Kyle accuses Kim of having no life outside her children, an accusation that just might be true. The conflict escalates back home in Beverly Hills as the sisters celebrate Kim's daughter's birthday at a posh spa."
      },
      {
        "id": "tvmaze:65701",
        "title": "Plenty of Baggage",
        "season": 1,
        "episode": 3,
        "released": "2010-10-28",
        "overview": "The glam of Beverly Hills meets the glitz of Las Vegas as Adrienne invites the ladies and their husbands to a Jay-Z concert at her Vegas casino resort, the Palms. Camille's husband, Kelsey Grammer, is in New York rehearsing a Broadway play, so Camille relishes this weekend trip with the girls until she and Kyle start butting heads. Unfortunately for those two, what happens in Vegas does not stay there – and the fight continues back home."
      },
      {
        "id": "tvmaze:65702",
        "title": "It's My Party and I'll Spend If I Want to",
        "season": 1,
        "episode": 4,
        "released": "2010-11-04",
        "overview": "After spending $50,000 on an over-the-top tea party, to celebrate her daughter Kennedy's fourth birthday, Taylor is upstaged by her husband who brings in an even bigger birthday present. Meanwhile, Camille discusses her marriage while relaxing in her Hawaii home and Lisa receives a heartwarming birthday surprise."
      },
      {
        "id": "tvmaze:65703",
        "title": "I Would Never Say That",
        "season": 1,
        "episode": 5,
        "released": "2010-11-11",
        "overview": "Camille invites the women to New York for the premiere of Kelsey Grammer's Broadway musical, but things are off to a very rough start. Adrienne receives some bad news from home and Kyle is still worried about the fallout from her and Camille's Vegas show down. But in true Beverly Hills style, the women seem to pull themselves together and put the past behind them – that is until they all sit down together for dinner and the claws come out once again."
      },
      {
        "id": "tvmaze:65704",
        "title": "The Art of War",
        "season": 1,
        "episode": 6,
        "released": "2010-11-18",
        "overview": "Still in New York, the women are all reeling over the past evenings meltdown and Kim continues to add fuel to the fire by refusing to stand up for her sister. It's the day of Kelsey's premiere and everyone's nerves are fraught, but it's a glamorous evening and it seems like the women do their best to sweep their problems under the rug – at least while they are in New York."
      },
      {
        "id": "tvmaze:65705",
        "title": "My Mansion Is Bigger Than Your Mansion",
        "season": 1,
        "episode": 7,
        "released": "2010-12-02",
        "overview": "There is way too much tension among these Beverly Hills beauties, so Lisa decides to lighten the mood and set Kim up on a date with a millionaire friend of hers – so where does a standard date in Beverly Hills begin? How about a $55 million dollar home, one of the most expensive homes in the country. Meanwhile, Camille decides to unwind by going shopping. After receiving news that her husband Kelsey was nominated for a Tony Award, she quickly goes on a shopping spree, trying on gorgeous – and outrageously priced dresses."
      },
      {
        "id": "tvmaze:65706",
        "title": "Charity Cases",
        "season": 1,
        "episode": 8,
        "released": "2010-12-09",
        "overview": "Kyle and Mauricio's seemingly perfect marriage is put to the test as they debate whether or not to take the kids on a romantic trip to Napa Valley for a charity bike ride. Taylor's also giving back, and reveals some deeply personal insights into her past at a charity poker tournament. A surprising new twist in Camille's marriage to Kelsey is also revealed."
      },
      {
        "id": "tvmaze:65707",
        "title": "The Dinner Party from Hell",
        "season": 1,
        "episode": 9,
        "released": "2010-12-16",
        "overview": "Camille throws a glamorous dinner party at her Malibu home and, in addition to the housewives, she invites a few special guests. The guests, however, bring up a sore subject and sparks fly between all the women in an explosive showdown, as Camille and Kyle's issues are once again exposed."
      },
      {
        "id": "tvmaze:65708",
        "title": "Payback's a Bitch… Just Ask Your Husband",
        "season": 1,
        "episode": 10,
        "released": "2010-12-23",
        "overview": "Lisa holds a charity event at her restaurant Villa Blanca and the ladies attend to show their support. Camille, however, is still dealing with the fallout between her and Kyle. Taylor also holds a big event – a Roaring Twenties party. It's the first time Camille and Kyle are face to face since the last blow up so everyone is anxious to see if they can put the past behind them."
      },
      {
        "id": "tvmaze:65709",
        "title": "How to Behave",
        "season": 1,
        "episode": 11,
        "released": "2011-01-06",
        "overview": "In an attempt to patch things up between herself and Kyle, Camille invites her to a potentially awkward afternoon of tennis and swimming. Lisa's houseguest Cedric reveals a tragic past no one ever knew about, and Kyle throws an off-the-charts \"white party\" for Mauricio's 40th birthday. It's fun and games until Taylor's problems with her husband Russell take center stage."
      },
      {
        "id": "tvmaze:65710",
        "title": "Turn, Turn, Turn",
        "season": 1,
        "episode": 12,
        "released": "2011-01-13",
        "overview": "With Kelsey in New York for so long, Camille is starting to realize there are cracks in their marriage, while Taylor looks for ways to resolve some of her own marital strife. It's another emotional event for the Richards' family as Kyle's oldest daughter Farrah graduates from college (the first in the family to do so). But Kyle is upset that her nieces Paris and Nicky choose a trip to Europe over the family milestone."
      },
      {
        "id": "tvmaze:65711",
        "title": "Unforgivable",
        "season": 1,
        "episode": 13,
        "released": "2011-01-20",
        "overview": "Taylor's birthday is coming up and everyone is excited to celebrate at a huge party on a fabulous Beverly Hills hotel rooftop. Unfortunately for the ladies, no one can escape the drama. Kim and Kyle finally go to blows after years of pent up family frustration. A lot of things are said and their sisterly bond may be broken forever. Meanwhile, another bond is breaking as Camille gets word from her husband that he wants to end their marriage."
      },
      {
        "id": "tvmaze:65712",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 14,
        "released": "2011-01-27",
        "overview": "Host Andy Cohen referees Part 1 of a two-part reunion installment, as reconvened 90210 ladies Taylor, Camille, Adrienne, Kim, Kyle and Lisa cast light on the frantic antics of Season 1."
      },
      {
        "id": "tvmaze:65713",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 15,
        "released": "2011-02-01",
        "overview": "Andy Cohen presides over the conclusion of a two-part reunion, which features the Beverly Hills wives recalling the diva dramas of Season 1."
      },
      {
        "id": "tvmaze:65714",
        "title": "The Lost Footage",
        "season": 1,
        "episode": 16,
        "released": "2011-02-08",
        "overview": "Unseen moments from the first season."
      },
      {
        "id": "tvmaze:65715",
        "title": "Dinner Party from Hell Producers Cut",
        "season": 1,
        "episode": 17,
        "released": "2011-02-15",
        "overview": "The extended version of the Dinner Party from hell with unseen footage and new interviews."
      },
      {
        "id": "tvmaze:65716",
        "title": "Back to Beverly Hills (a.k.a. Group Therapy)",
        "season": 2,
        "episode": 1,
        "released": "2011-09-05",
        "overview": "The Beverly Hills bombshells are back for a second season of over the top glitz and glamour. In the first episode, the ladies attend a sumptuous dinner party at Adrienne's home to celebrate Camille's guest-starring role on a major sitcom. However, tensions arise and true feelings begin to show, revealing what could be a very big divide in the ladies friendships."
      },
      {
        "id": "tvmaze:65717",
        "title": "Blame It on the Altitude",
        "season": 2,
        "episode": 2,
        "released": "2011-09-12",
        "overview": "After a very tough year and a very public divorce, Camille must say goodbye to her gorgeous Colorado home, so she invites the ladies to hit the slopes in style. Dressed like snow bunnies from head to toe, the ladies let loose skiing and then head back to the house to relax in the hot tub. But after a day of laughter and fun, Taylor opens up to her friends about some very serious problems in her marriage."
      },
      {
        "id": "tvmaze:65718",
        "title": "Rocky Mountain Highs and Lows",
        "season": 2,
        "episode": 3,
        "released": "2011-09-19",
        "overview": "Adrienne's family is forced to make some very serious decisions that could potentially move their NBA team to a rival city. She heads to Sacramento for what could be the team's last home game ever and invites Kim along for the ride. However, Kim seems to be a little off, and the issue that has been on everyone's mind since last year is finally addressed when Adrienne questions her sobriety."
      },
      {
        "id": "tvmaze:65719",
        "title": "Gossip Girls",
        "season": 2,
        "episode": 4,
        "released": "2011-09-26",
        "overview": "The tension is high not only for the ladies, but also for Adrienne's NBA team. Adrienne, Paul, and Kim attend the last game of the season -- but the fans are not happy with the potential move and things get dangerous for the Maloof family. Meanwhile, back in Beverly Hills, Kyle throws a charity cocktail party to raise money for the Lollipop Theater Network. The focus, however, turns to an unexpected guest named Brandi, who is rumored to be friends with someone in Lisa's past. The ladies immediately side with Lisa and question the intentions of this gorgeous Beverly Hills newcomer."
      },
      {
        "id": "tvmaze:65720",
        "title": "$25,000 Sunglasses?!",
        "season": 2,
        "episode": 5,
        "released": "2011-10-03",
        "overview": "Adrienne throws a lavish barbecue, Beverly Hills style. She invites her friend Brandi, and while Brandi and Camille seem to bond instantly over their very public and very ugly high-profile divorces, the other ladies are shocked by this newcomer's numerous social faux pas. They begin to wonder what she's doing on their turf and if she will fit into their social circle."
      },
      {
        "id": "tvmaze:65721",
        "title": "Let the Games Begin",
        "season": 2,
        "episode": 6,
        "released": "2011-10-10",
        "overview": "Adrienne throws a lavish barbecue, Beverly Hills style. She invites her friend Brandi, and while Brandi and Camille seem to bond instantly over their very public and very ugly high-profile divorces, the other ladies are shocked by this newcomer's numerous social faux pas. They begin to wonder what she's doing on their turf and if she will fit into their social circle."
      },
      {
        "id": "tvmaze:65722",
        "title": "Game Night Gone Wild!",
        "season": 2,
        "episode": 7,
        "released": "2011-10-17",
        "overview": "The ladies' innocent game night ends with a jaw-dropping fight, and while Kim and Kyle are on the same side for once, Brandi is left with no one in her corner. The tension continues when the ladies attend Camille's charity luncheon."
      },
      {
        "id": "tvmaze:65723",
        "title": "The Opposite of Relaxation",
        "season": 2,
        "episode": 8,
        "released": "2011-10-24",
        "overview": "Adrienne invites the women over for a day of pampering at her glorious home spa, but with Kim and Kyle still seething over the things Brandi said at game night, no one is relaxing."
      },
      {
        "id": "tvmaze:65724",
        "title": "Otherwise Engaged",
        "season": 2,
        "episode": 9,
        "released": "2011-10-31",
        "overview": "The engagement party for Lisa's daughter is the social event of the season, featuring camels, snakes, and circus performers. However, Kim's not in attendance and busy hiding a secret from Kyle."
      },
      {
        "id": "tvmaze:65725",
        "title": "Your Face or Mine?",
        "season": 2,
        "episode": 10,
        "released": "2011-11-07",
        "overview": "The cause of Kim's erratic behavior is revealed at Paul's night of beauty treatments. Meanwhile, spirits at Kyle's séance reveal insights into the past and future, and she finally learns what Kim has been hiding from her."
      },
      {
        "id": "tvmaze:65726",
        "title": "Tempest in a Tea Party",
        "season": 2,
        "episode": 11,
        "released": "2011-11-14",
        "overview": "Lisa's elegant tea party is the unexpected setting for a heated confrontation when Taylor reveals her true feelings toward Lisa and the women finally discuss with Taylor the real issues behind her troubled marriage."
      },
      {
        "id": "tvmaze:65727",
        "title": "The Great Divide",
        "season": 2,
        "episode": 12,
        "released": "2011-11-21",
        "overview": "Friendships are re-evaluated in the aftermath of Lisa's tea party, while Taylor puts conflict on the back burner and throws herself into her daughter's lavish birthday party."
      },
      {
        "id": "tvmaze:65728",
        "title": "Adrienne's Fashion Show",
        "season": 2,
        "episode": 13,
        "released": "2011-11-28",
        "overview": "Still angry from accusations repeated at the tea party, Taylor fears running into Camille at Adrienne's glamorous backyard fashion show."
      },
      {
        "id": "tvmaze:65729",
        "title": "Malibu Beach Party from Hell",
        "season": 2,
        "episode": 14,
        "released": "2011-12-05",
        "overview": "Brandi tries to throw a nice party for the women at a Malibu beach house, but the tension between Taylor and Camille reaches a boiling point."
      },
      {
        "id": "tvmaze:65730",
        "title": "A Book, a Bachelorette and a Breakdown",
        "season": 2,
        "episode": 15,
        "released": "2011-12-12",
        "overview": "Lisa and Taylor descend on Las Vegas for Pandora's bachelorette party (complete with Chippendales!), while Adrienne takes the other ladies to her casino for their own wild time."
      },
      {
        "id": "tvmaze:65731",
        "title": "Uninvited",
        "season": 2,
        "episode": 16,
        "released": "2011-12-19",
        "overview": "When Taylor's husband threatens a lawsuit against Camille, the women worry they could be next. Through tears, concern, and anger, they debate turning Taylor away from Kyle's annual white party."
      },
      {
        "id": "tvmaze:65732",
        "title": "Leis and Lies in Lanai",
        "season": 2,
        "episode": 17,
        "released": "2012-01-02",
        "overview": "Taylor copes with her troubled marriage in LA while the rest of the women fly to Hawaii for some fun in the sun. Kyle can't relax, though, when Kim misses her first -- and second -- flight."
      },
      {
        "id": "tvmaze:65733",
        "title": "A Day Late, An Apology Short",
        "season": 2,
        "episode": 18,
        "released": "2012-01-09",
        "overview": "Anxiety increases in the group when Kim and her new boyfriend arrive in Hawaii, missing most of the activities. Kyle finally breaks down and tells Kim how she feels about her strange and irresponsible behavior."
      },
      {
        "id": "tvmaze:65734",
        "title": "Night of a Thousand Surprises",
        "season": 2,
        "episode": 19,
        "released": "2012-01-16",
        "overview": "New drama and old faces pop up at the launch party for Lisa's new lounge at Sur, and a disheveled Kim tells Kyle the truth about her new boyfriend Ken."
      },
      {
        "id": "tvmaze:65735",
        "title": "The Real Wedding of Beverly Hills",
        "season": 2,
        "episode": 20,
        "released": "2012-01-23",
        "overview": "Taylor reveals the unvarnished truth about her marriage and Lisa's daughter Pandora is married in a glamorous \"million dollar\" ceremony at Vanderpump Manor."
      },
      {
        "id": "tvmaze:65736",
        "title": "Reunion Part 1",
        "season": 2,
        "episode": 21,
        "released": "2012-01-30",
        "overview": "The Beverly Hills bombshells sit down with Andy Cohen to re-live and rehash the seasons most controversial and talked about moments. It's meltdown and makeup central as the ladies come face-to-face to confront their issues and speak their peace. The reunion would not be complete without a visit from the zip code's hottest hubbies."
      },
      {
        "id": "tvmaze:65737",
        "title": "Reunion Part 2",
        "season": 2,
        "episode": 22,
        "released": "2012-02-06",
        "overview": "The Beverly Hills bombshells sit down with Andy Cohen to re-live and re-hash the seasons most controversial and talked about moments. It's meltdown and makeup central as the ladies come face-to-face to confront their issues and speak their peace. The reunion would not be complete without a visit from the zip code's hottest hubbies."
      },
      {
        "id": "tvmaze:65738",
        "title": "Reunion Part 3",
        "season": 2,
        "episode": 23,
        "released": "2012-02-13",
        "overview": "Kim Richards exclusively reveals to Andy Cohen, \"I am an alcoholic\" and discusses life after rehab. Later in the show, housewife friend Dana Wilkey also appears to recount with her recollection of Game Night followed by the husbands who field viewer questions."
      },
      {
        "id": "tvmaze:65739",
        "title": "The Lost Footage",
        "season": 2,
        "episode": 24,
        "released": "2012-02-16",
        "overview": "Bravo will air an explosive one-hour \"Lost Footage\" special featuring the jaw dropping fight between Brandi Glanville and Kyle Richards where tensions boiled over at The Malibu Beach Party from Hell. That and other clips originally left on the cutting room floor are sure to surprise, astonish, and amuse."
      },
      {
        "id": "tvmaze:65740",
        "title": "Down and Left Out in Beverly Hills",
        "season": 3,
        "episode": 1,
        "released": "2012-11-05",
        "overview": "The brassy, bold beauties of Beverly Hills are back for a third season of wealth, luxury. . .and lots of problems. In the first episode, Lisa and Adrienne's friendship has soured, with both expecting apologies for accusations and barbs made previously. When Lisa doesn't invite Adrienne to the exclusive anniversary party for her restaurant, Adrienne is more than miffed. And theirs is not the only friendship that will be tested in this season of wild outbursts, vehement backbiting, and unrivaled glamour."
      },
      {
        "id": "tvmaze:65741",
        "title": "The Higher the Heel, the Closer to God",
        "season": 3,
        "episode": 2,
        "released": "2012-11-12",
        "overview": "Kyle's adorable daughter Portia turns four and has a carnival-themed party featuring flying elephant rides, llamas, and unicorns. Kyle's husband Mauricio arrives late, however, because he and Adrienne's husband Paul have agreed to help Taylor with a charity event -- by walking a mile in women's high heels! It's all fun and games until they return, and Adrienne realizes Lisa has avoided her by leaving the party early."
      },
      {
        "id": "tvmaze:65742",
        "title": "Don't Sing for Your Supper",
        "season": 3,
        "episode": 3,
        "released": "2012-11-19",
        "overview": "New housewife Yolanda invites the ladies to a dinner party at the spectacular Malibu home she shares with her husband, 16-time Grammy-Award winning music producer David Foster. Taylor is annoyed when David won't allow the women to participate in an after-dinner sing-along, and the tension between Lisa and Adrienne intensifies until they agree to meet after the party and discuss their issues."
      },
      {
        "id": "tvmaze:65743",
        "title": "Uh Oh, Somebody's Crying!",
        "season": 3,
        "episode": 4,
        "released": "2012-11-26",
        "overview": "Lisa and Adrienne's tense summit meeting comes to a head, and one party is left unsatisfied when the other refuses to apologize for things she's said in the past. But problems are set aside temporarily when Kim suggests a group trip to Ojai, California, where the women share a five-bedroom mansion on gorgeous grounds. Kim and Brandi start to forge an unlikely bond, but when Brandi is unable to control her potty mouth, things go south with Adrienne."
      },
      {
        "id": "tvmaze:65744",
        "title": "Girls Gone Ojai'ld",
        "season": 3,
        "episode": 5,
        "released": "2012-12-03",
        "overview": "Still in Ojai, the women have a hard time understanding Lisa's defense of Brandi's language at the dinner table. Brandi and Taylor exchange angry words as well, but the group lightens up the following day, having fun in a golf cart race, at a mud-filled spa and, late at night, in a drunken gymnastics and arm-wrestling contest that is the opposite of ladylike. However, the problems between Brandi and Adrienne have just begun."
      },
      {
        "id": "tvmaze:65745",
        "title": "She's Gone Too Far",
        "season": 3,
        "episode": 6,
        "released": "2012-12-10",
        "overview": "Though Kyle surprises her daughter with a present every 16-year-old would want, the happy times in Beverly Hills won't last for long. Lisa has a food tasting at one of her restaurants, but Brandi fears she'll run into the waitress who had an affair with her ex-husband. At the tasting, when asked about her issues with Adrienne, Brandi reveals very personal information that Adrienne has always kept private. When Kim tells Adrienne what Brandi revealed, Paul and Adrienne are livid -- and a battle of epic proportions begins."
      },
      {
        "id": "tvmaze:65746",
        "title": "Oy, Faye!",
        "season": 3,
        "episode": 7,
        "released": "2012-12-17",
        "overview": "Kim, though newly out of rehab, plans a trip to Vegas for her son's 21st birthday -- and neglects to invite Kyle. Meanwhile, the fallout from Brandi's revelation about Adrienne continues, and it is not pretty. Angry that this happened at an event of his, Mauricio doesn't want Brandi to come to Kyle's upcoming dinner party, but it's too late; she's already invited. At the party, Kyle's friend Faye demands to know why Brandi said what she did, and won't accept an explanation until Brandi departs in tears."
      },
      {
        "id": "tvmaze:65747",
        "title": "Vanderpump Rules (a.k.a. Unsolved Mistresses)",
        "season": 3,
        "episode": 8,
        "released": "2013-01-07",
        "overview": "Worried about a $1.5 million dollar lawsuit left behind by her husband, Taylor invites a psychic to \"cleanse\" her house. The lawsuit is ultimately settled, though not in the way Taylor would like. The drama also continues in Brandi's life, as Lisa asks her to meet with Scheana, the waitress who admitted to having an affair with Brandi's ex-husband. Seeking counsel from another wise divorcee, Camille, Brandi decides to come face-to-face with the woman who had a hand in ruining her marriage. After the confrontation, things get worse for Scheana as she picks up shifts at Lisa's restaurant, SUR, and tries to fit in with the other servers. In an effort to keep a hand on her unruly staff, Lisa encourages Scheana to stand up to Stassi, the self-proclaimed \"leader of the pack\" who has been labeling her a \"home wrecker\" to all of her new co-workers."
      },
      {
        "id": "tvmaze:65748",
        "title": "Moroccan Madness",
        "season": 3,
        "episode": 9,
        "released": "2013-01-14",
        "overview": "Kyle visits Yolanda's gorgeous estate and shares that her issues with Kim have not been resolved, despite Kim going to rehab. Kim admits the same thing to her life coach, who advises she talk to Kyle. Kim takes that opportunity when the ladies and husbands all meet for dinner at a Moroccan restaurant. But bigger news is revealed by Brandi: Adrienne and Paul are threatening to sue her based on things she's said in the past. The debate about Brandi's intentions erupts into a full-fledged fight, with Ken and Mauricio at odds, and Brandi telling Mauricio to \"f--- off.\""
      },
      {
        "id": "tvmaze:65749",
        "title": "Home Is Where the Art Is",
        "season": 3,
        "episode": 10,
        "released": "2013-01-21",
        "overview": "Tension is still high at the Moroccan restaurant, but everyone moves on. Adrienne and Paul visit Kyle and Mauricio to discuss Brandi's actions; Yolanda crosses paths with her ex-husband Mohamed as she decorates a mansion for him, and Kim has a psychic point out the ghosts inhabiting her house. At an art gallery opening (where Kim and Kyle's niece Paris Hilton is a guest), Brandi invites the ladies to Las Vegas, and despite their rocky past, Kyle decides to go."
      },
      {
        "id": "tvmaze:65750",
        "title": "Stars and Strips",
        "season": 3,
        "episode": 11,
        "released": "2013-01-28",
        "overview": "When Kyle's daughter Sophia graduates from sixth grade, Adrienne and Paul make an appearance, still keeping their distance from the rest of the group. Kim is not in attendance, and Kyle won't learn until later that her sister is planning to have a nose job. Brandi and the ladies head for Vegas where Brandi is practicing to host events that empower women -- through pole dancing. But before the women hit the pole, they have a surprisingly eye-opening dinner and learn things they never knew about each other."
      },
      {
        "id": "tvmaze:65751",
        "title": "Kim Nose Best",
        "season": 3,
        "episode": 12,
        "released": "2013-02-04",
        "overview": "In Las Vegas, Brandi entices all the women (except Adrienne, who stayed back in LA) to try pole dancing, with varied success. Upon learning Kim is about to go under the knife for her nose job, the women wonder if going under anesthesia and taking pain killers is wise for a woman just out of rehab. The final dinner in Vegas starts pleasantly, but the moment Adrienne's name is mentioned, it devolves into a feud in which new issues are raised, and old wounds are opened."
      },
      {
        "id": "tvmaze:65752",
        "title": "Game of Scones",
        "season": 3,
        "episode": 13,
        "released": "2013-02-11",
        "overview": "Kyle pays a visit to Lisa's to discuss the mutual hurt in their relationship: Lisa is upset Kyle doesn't defend her, and Kyle says Lisa holds a grudge. A truce is reached, but it's not exactly resolved. More unresolved issues are addressed when Lisa throws a tea party in her beautiful olive grove, and it's the first time Adrienne and Brandi have faced each other since their big blow-up. It's civil at first, but denials and accusations fly when a tipsy Taylor asks whether or not Adrienne is suing Brandi."
      },
      {
        "id": "tvmaze:65753",
        "title": "White Party Pooper",
        "season": 3,
        "episode": 14,
        "released": "2013-02-18",
        "overview": "Kim reveals her new post-surgery nose with a party in her backyard. When Taylor calls to say she won't be attending, Kim and Kyle are shocked -- not just because Taylor is jetting off with a new love, but because she doesn't know where her daughter is. Later, Adrienne gets angry with Paul because he won't evacuate their home when Lisa's old house is in flames across the street. They make up in time for Kyle's white party, however, and are a united front when everyone confronts them about their threatened lawsuit against Brandi."
      },
      {
        "id": "tvmaze:65754",
        "title": "The Real Housewives of Paris: Part Un",
        "season": 3,
        "episode": 15,
        "released": "2013-02-25",
        "overview": "Prompted by a disturbing phone call earlier, Kim and Kyle confront Taylor about using alcohol as a crutch. Taylor then turns down a group trip to Paris in order to spend time with her daughter. The rest of the ladies, however, jet off to the City of Lights for fun and fireworks. They're worried, however, when Kim is late then acts increasingly strange, in a way reminiscent of her life before rehab. Lisa and Ken also take a side trip to San Tropez, where they reunite with Ken's grown son and his much-older wife, who was once a friend of Lisa's."
      },
      {
        "id": "tvmaze:65755",
        "title": "The Real Housewives of Paris: Part Deux",
        "season": 3,
        "episode": 16,
        "released": "2013-03-04",
        "overview": "The women explore Paris: jogging by the Seine, shopping on the Champs Elysee, and visiting Notre Dame cathedral. But when Kim is late for a cooking class, they fear something terrible has happened. Kim is irritated by Lisa's possibly faux concern and encourages Kyle to confront Lisa about their troubled friendship -- which she does, on top of the Eiffel Tower."
      },
      {
        "id": "tvmaze:65756",
        "title": "No Business Like Clothes Business",
        "season": 3,
        "episode": 17,
        "released": "2013-03-11",
        "overview": "The ladies' trip to Paris wraps up with a boat ride down the Seine River, and an unlikely bond forming between Kim and Brandi. Back in Beverly Hills, Lisa begins planning her housewarming party/vow renewal with flamboyant party planner Kevin Lee, and Kyle scurries to prepare for her boutique opening. In a changing room during the big event, Kyle and Kim discuss Kim's erratic behavior in Paris, and Kyle wonders if she'll ever be able to trust Kim's sobriety."
      },
      {
        "id": "tvmaze:65757",
        "title": "A Shot Through the Heart",
        "season": 3,
        "episode": 18,
        "released": "2013-03-18",
        "overview": "Adrienne throws an eye-popping party to launch her new vodka line, but her relationship with Paul worsens, even as Paul tries to impress her by dressing up as a tree. News of their separation reaches the shocked women as they head toward Lisa's housewarming party/vow renewal. Drama develops quickly, as Brandi confronts Marisa about talking behind her back. Things get uglier when Brandi's enemy Faye interrupts. Trouble is clearly about to ensue."
      },
      {
        "id": "tvmaze:65758",
        "title": "Finale",
        "season": 3,
        "episode": 19,
        "released": "2013-03-25",
        "overview": "While Lisa prepares to renew her vows after thirty years of marriage, her housewarming party plummets downhill. Faye picks a fight with Lisa, and when all the ladies get involved, Lisa realizes Kyle will never have her back. Kyle is not safe from Kim's ire either, but luckily Lisa and Ken's vow renewal ceremony interrupts the drama for one lovely moment. And when a tearful Adrienne shows up, on the very day her separation has been announced, some of the women stand behind her, while some are not as sympathetic."
      },
      {
        "id": "tvmaze:65759",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 20,
        "released": "2013-03-25",
        "overview": "In the Reunion Part One, the women gather with Andy Cohen to discuss the year, settle old scores, and clear the air. . .but Adrienne Maloof's decision not to attend sparks the initial controversy -- and leads to a shocking announcement. Other surprises are revealed in this hour: Yolanda felt unwelcome when she joined the group, Taylor admits to drinking too much, and Lisa and Kyle's touchy relationship becomes even more dramatic when Yolanda, Kim, and Brandi step in with their take on the battle."
      },
      {
        "id": "tvmaze:65760",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 21,
        "released": "2013-04-01",
        "overview": "Still on their hot seats, Lisa and Kyle wrap up a painful discussion about their relationship -- with little resolution. The group dishes about the shocking allegations followed Adrienne and Paul's divorce, while Mauricio explains his passionate stance in the Brandi/Adrienne conflict. And despite three seasons of a reality show (and being sisters their whole lives), there is still anguish and tears as Kim and Kyle discuss Kim's first year of sobriety, and the difficulty Kyle has in trusting her."
      },
      {
        "id": "tvmaze:65761",
        "title": "Secrets Revealed",
        "season": 3,
        "episode": 22,
        "released": "2013-04-08",
        "overview": "The Bravo vaults are opened and the audience is treated to never-before-seen footage of the Housewives both at the Reunion and out-and-about in Beverly Hills. Kyle takes a nervous Lisa for her first mammogram; Yolanda and Brandi's friendship is explored in further depth, and Taylor has a meltdown directed at her onetime friend Adrienne. And in unseen footage from the reunion, the ladies discuss the actions of Faye."
      },
      {
        "id": "tvmaze:65762",
        "title": "A Catered Affair to Remember",
        "season": 4,
        "episode": 1,
        "released": "2013-11-04",
        "overview": "The beautiful, wealthy ladies of Beverly Hills and the sexy, dramatic servers of SUR are back for a special two hour crossover event. To celebrate the centennial of Beverly Hills and meet other local business owners, Kyle throws a cocktail party at her home for the city's Chamber of Commerce. She hires Lisa's posh restaurant, SUR, to cater the event but in typical fashion, one of her servers begins talking back and Lisa has to send her home before the guests begin to arrive. At the party, Kyle tries to put aside her differences with Yolanda after last year's explosive reunion, while Lisa struggles to keep tensions down between Brandi and Scheana. After the party wraps up, SUR staffers Stassi, Jax, Katie, Tom and Scheana head out to meet up with Kristen when serious tensions flare up. In an effort to mend her relationship with the group, Scheana invites everyone to her birthday party, but it doesn't take long for catfights to erupt."
      },
      {
        "id": "tvmaze:65763",
        "title": "Faint Chance",
        "season": 4,
        "episode": 2,
        "released": "2013-11-11",
        "overview": "Brandi, Kim, Kyle and Mauricio show up to support Lisa and her sexy dance partner Gleb on Dancing with the Stars. Meanwhile, Yolanda faces a surgical procedure in her efforts to battle Lyme disease. Kyle hosts a lunch for new friends, Joyce and Carlton, but the meal goes awry when Kyle encourages the killing of a bee, offending nature-loving Carlton. Brandi's mother visits from Sacramento and helps her settle into her new home. Kim and Kyle watch Lisa's next dance performance, questioning the sincerity of Lisa's infamous faint."
      },
      {
        "id": "tvmaze:65764",
        "title": "Life's a Witch",
        "season": 4,
        "episode": 3,
        "released": "2013-11-18",
        "overview": "Carlton hosts the ladies for a luncheon in her gorgeous, Gothic mansion, which sports \"Victorian balls,\" a spooky doll collection and black cats. When Lisa shows up to the lunch a little late, teasing from her friends about her suspect faint proves too much for her after recently being eliminated on Dancing with the Stars. Kyle upsets Carlton by asking too many questions about witchcraft, but Kyle finds herself on the defense when Brandi prompts the ladies to talk about the tabloid accusations about Mauricio cheating."
      },
      {
        "id": "tvmaze:65765",
        "title": "Irked at Cirque",
        "season": 4,
        "episode": 4,
        "released": "2013-11-25",
        "overview": "Hoping for an afternoon of fun, Kim invites the ladies to a funky and colorful circus school, but tensions simmer as Brandi believes Kyle has labeled her a bully to the tabloids. Later, Lisa suddenly finds herself in the drama when an accusation by Joyce leaves her and the other ladies totally baffled."
      },
      {
        "id": "tvmaze:65766",
        "title": "Star of the Family",
        "season": 4,
        "episode": 5,
        "released": "2013-12-02",
        "overview": "Yolanda's mother and brother visit from Holland, just in time to see Yolanda's husband, David Foster, get his star on the Hollywood Walk of Fame. Kim, Kyle, and their sister, Kathy, attend the high school graduation of Kim's daughter, Kimberly. Brandi reveals a secret about Carlton that leaves Lisa speechless."
      },
      {
        "id": "tvmaze:65767",
        "title": "Palm Springs Breakers",
        "season": 4,
        "episode": 6,
        "released": "2013-12-09",
        "overview": "The ladies travel to Palm Springs for a girls' bonding trip and Kyle is surprised when Carlton confronts her about a list of issues. As the group relaxes by the pool, Brandi reveals that she and Carlton made out, much to Carlton's chagrin. When questioned about her pentagram tattoo, Carlton finally reveals she is a practicing Wiccan, eliciting eye rolls from some of the women. Brandi riles up Joyce by repeatedly calling her Jaclyn, amongst other things and the group dinner goes downhill quickly when a tipsy Brandi picks a fight with Kyle."
      },
      {
        "id": "tvmaze:65768",
        "title": "Escape to Bitch Mountain",
        "season": 4,
        "episode": 7,
        "released": "2013-12-16",
        "overview": "As the Palm Springs trip continues, Brandi wants Kyle and Yolanda to resolve their Paris issues, but Kyle leaves the table in tears, and unexpectedly it's Yolanda who winds up comforting her. After a day of fun, the mood is shattered when Brandi learns her beloved dog, Chica, has gone missing."
      },
      {
        "id": "tvmaze:65769",
        "title": "She Hearts You, She Hearts You Not",
        "season": 4,
        "episode": 8,
        "released": "2013-12-23",
        "overview": "Kim sends problem dog Kingsley off to doggy boarding school. Yolanda hosts a night of fine dining and music -- provided by the Canadian Tenors -- at her gorgeous Malibu home. However, she inadvertently divides the group in two by dubbing herself, Brandi and Lisa \"The Dream Team.\" Tipsy Brandi continues to insult Joyce, and once in the privacy of their limo ride home, Joyce and husband Michael voice their anger and contempt for Brandi."
      },
      {
        "id": "tvmaze:65770",
        "title": "Guess Who's Coming to Dinner?",
        "season": 4,
        "episode": 9,
        "released": "2013-12-30",
        "overview": "It's a happy time for some of the housewives, as Yolanda celebrates her anniversary with David, Kim takes an exuberant ride in a racecar, and Carlton shops for racy lingerie with. . .her mother-in-law?! Brandi and Joyce avoid each other at a fitting for Kyle's upcoming fashion show, but they come face to face when Lisa invites them to a group dinner at SUR. Neither Brandi nor Joyce hold their feelings back and the night devolves into name-calling and the lobbing of \"f--- bombs.\""
      },
      {
        "id": "tvmaze:65771",
        "title": "Catfight on the Catwalk",
        "season": 4,
        "episode": 10,
        "released": "2014-01-06",
        "overview": "Following the tense and unpleasant dinner at SUR, Yolanda chides Brandi for her behavior toward Joyce. Joyce and Brandi must share the catwalk at Kyle's fashion show, and Kyle hopes for the best as she raises money for charity and visits with her co-star from Halloween, Jamie Lee Curtis."
      },
      {
        "id": "tvmaze:65772",
        "title": "Luaus and Lies",
        "season": 4,
        "episode": 11,
        "released": "2014-01-13",
        "overview": "Kim throws a luau for her daughter Kimberly who will be leaving for college at the end of the summer. Carlton, who was \"over-served\" before attending a pole dancing class with Brandi, arrives tipsy, while Brandi shows up nauseous. Later, Joyce and Brandi attempt to discuss their problems in a civil manner – with mixed results."
      },
      {
        "id": "tvmaze:65773",
        "title": "Tough Break",
        "season": 4,
        "episode": 12,
        "released": "2014-01-20",
        "overview": "Brandi takes Yolanda to her hometown of Sacramento, where she'll be reading from her book. Brandi is more concerned, however, with seeing her father, from whom she's been estranged for months."
      },
      {
        "id": "tvmaze:65774",
        "title": "The Curse of Carlton",
        "season": 4,
        "episode": 13,
        "released": "2014-01-27",
        "overview": "Carlton welcomes the women to her annual pool party, a wild blow-out featuring naked women and naughty gift bags. Later, Yolanda invites the ladies to her home, but when Lisa cancels at the last minute, Yolanda questions their friendship. And when Joyce says she doesn't believe in witchcraft, Carlton warns her to see what happens once she gets home – and something does!"
      },
      {
        "id": "tvmaze:65775",
        "title": "The Birthday Witch",
        "season": 4,
        "episode": 14,
        "released": "2014-02-03",
        "overview": "Joyce confronts Carlton about potentially putting a spell on Joyce's husband -- which Carlton vehemently denies. Lisa and Kyle plan a joint birthday party for their husbands, but the party devolves into drama when Carlton brings up the ways in which Kyle has offended her."
      },
      {
        "id": "tvmaze:65776",
        "title": "Trail of Doubts",
        "season": 4,
        "episode": 15,
        "released": "2014-02-10",
        "overview": "Carlton oversees a party for her husband's business, a party to which Kyle is no longer invited. Brandi confides in Kim and Kyle that she is having serious doubts about her friendship with Lisa."
      },
      {
        "id": "tvmaze:65777",
        "title": "Turning Down the Crown",
        "season": 4,
        "episode": 16,
        "released": "2014-02-17",
        "overview": "Kyle and Joyce decide not to invite Carlton on their Puerto Rico trip, especially after Kyle reveals how she received strange, spooky words on her computer screen saver. Brandi tries to avoid Lisa at Gigi's glamorous going-away party. Kyle mistakenly reveals to the group that Joyce's father has died and Joyce feels betrayed."
      },
      {
        "id": "tvmaze:65778",
        "title": "Lines in the Sand",
        "season": 4,
        "episode": 17,
        "released": "2014-02-24",
        "overview": "All the ladies, except Carlton, head off for a vacation in Puerto Rico. The relaxation doesn't last long after Yolanda and Brandi confront Lisa about the doubts they have regarding their friendships. A battle royale erupts over dinner, and Lisa and Ken leave the table, calling it a sabotage attack."
      },
      {
        "id": "tvmaze:65779",
        "title": "The Kids Are Alright",
        "season": 4,
        "episode": 18,
        "released": "2014-03-03",
        "overview": "The trip to Puerto Rico finishes with a day of golf, shopping, and the threat of arrest, all happening after the ladies learn about the shocking and mysterious departure of Lisa and Ken in the middle of the night. Back in Beverly Hills, Brandi surprises her parents with the help of Yolanda. Then, Kim and Yolanda have tearful goodbyes when their daughters Kimberly and Gigi depart for college. Meanwhile, Lisa pours her heart out to Carlton about why she left Puerto Rico in the middle of the night."
      },
      {
        "id": "tvmaze:65780",
        "title": "Are You My Friend?",
        "season": 4,
        "episode": 19,
        "released": "2014-03-10",
        "overview": "The ladies have not seen each other since the dramatic fireworks in Puerto Rico, but are drawn together by a glamorous party for the Beverly Hills 100th anniversary at the world famous Beverly Hilton hotel."
      },
      {
        "id": "tvmaze:65781",
        "title": "Reunion Part 1",
        "season": 4,
        "episode": 20,
        "released": "2014-03-17",
        "overview": "The gripping, three-part Beverly Hills reunion begins as Andy Cohen questions the women about the dramatic twists and turns of Season 4. Joyce and Brandi prove that there is no love lost between them, and the women explore what happened when the \"dream team\" of Yolanda, Lisa, and Brandi started to show its cracks. There are light moments as well, as Kim discusses her favorite season yet."
      },
      {
        "id": "tvmaze:65782",
        "title": "Reunion Part 2",
        "season": 4,
        "episode": 21,
        "released": "2014-03-24",
        "overview": "The Beverly Hills housewives share laughter over their health and beauty regimens and shed tears talking about their children who are growing up and leaving home. Brandi delves into the tough year she's had, while Kim doesn't hide her conflicted feelings about Lisa."
      },
      {
        "id": "tvmaze:65783",
        "title": "Reunion Part 3",
        "season": 4,
        "episode": 22,
        "released": "2014-03-31",
        "overview": "In Part 3 of the dramatic Beverly Hills reunion, Lisa is in the hot seat as Yolanda, Brandi, and Kyle all discuss the problems they've had with her while, at the same time, hope for some resolution. The husbands join the fray and Ken tells a teary Brandi that he may never be able to accept her back into his life. Or can he?"
      },
      {
        "id": "tvmaze:65784",
        "title": "Secrets Revealed",
        "season": 4,
        "episode": 23,
        "released": "2014-04-07",
        "overview": "Never-before-seen moments from Season 4 are revealed, as Kim teaches Brandi how to act in a TV movie, Lisa and Joyce bond over a candid dinner with their husbands, Kim receives advice about how to plump her lips from an old friend, and Kyle learns how to be a TV presenter."
      },
      {
        "id": "tvmaze:65785",
        "title": "Guess Who's Coming to the White Party?",
        "season": 5,
        "episode": 1,
        "released": "2014-11-18",
        "overview": "After a sudden and secret departure from Puerto Rico at the end of last season, Lisa Vanderpump is still wary of her formerly close friends, but is beginning to reconnect with Yolanda and Kyle. She has no interest in making amends with Brandi, who is also struggling to move past her own hurt. The ladies all come face-to-face at Kyle's annual White Party and the over-the-top event is bigger and better than ever now that Mauricio's real estate agency is selling houses upwards of $50 million. The social event of the season brings original Beverly Hills housewives Adrienne Maloof, Camille Grammer, and Taylor Armstrong back together. As unresolved issues come to the surface, Brandi is faced with making amends with both Lisa and Adrienne at the same event."
      },
      {
        "id": "tvmaze:65786",
        "title": "Who Stalked J.R.?",
        "season": 5,
        "episode": 2,
        "released": "2014-11-25",
        "overview": "Kim and some hunky movers help Brandi move into her new house, but Brandi is more interested in the guys' abs than unpacking boxes.  Kyle and her family jet to Lake Tahoe in a private plane while Yolanda surprises David with a very special, and very revealing, dinner. Kim and Brandi celebrate being BFFs by dressing up in disguise to spy on Brandi's ex-boyfriend, J.R."
      },
      {
        "id": "tvmaze:65787",
        "title": "Pay Attention to Me!",
        "season": 5,
        "episode": 3,
        "released": "2014-12-02",
        "overview": "Lisa Vanderpump throws Lisa Rinna a private birthday dinner at PUMP, and Lisa Rinna's husband shows up just in time with just the right gift. Brandi is settling into her new home, but is still dealing with old drama from her ex- husband. Kim is looking nowhere but forward as she and her daughter, Brooke, go dress shopping for a very special occasion. Lisa Rinna meets up with a friend from way back, Emmy-winning soap actress Eileen Davidson."
      },
      {
        "id": "tvmaze:65788",
        "title": "Livin' la Vida Housewife",
        "season": 5,
        "episode": 4,
        "released": "2014-12-09",
        "overview": "The two Lisas bond as Vanderpump invites Rinna to watch her receive a plaque on the Palm Springs Walk of Stars. Before jetting off for a family trip to Spain, Kyle fears that her coughing sister Kim will make her ill.  But all is heavenly when Kyle arrives in Mallorca and settles into her 100-foot-long private yacht. Yolanda joins Kyle for fun in the water and sightseeing in the gorgeous town. But the perfect vacation is ruined when Yolanda gets a phone call with horrible news about her daughter Bella."
      },
      {
        "id": "tvmaze:65789",
        "title": "Star Sighting",
        "season": 5,
        "episode": 5,
        "released": "2014-12-16",
        "overview": "Kyle returns home early from Spain to attend Kim's daughter's wedding, and Eileen returns to work after a long break to reprise her role of Ashley Abbott on The Young and the Restless. Meanwhile, Lisa Vanderpump, with pal Lisa Rinna in tow, receives a star on the Palm Springs Walk of Stars. Back at home, Yolanda deals with the fallout from her daughter's DUI."
      },
      {
        "id": "tvmaze:93534",
        "title": "Medford, 90210",
        "season": 5,
        "episode": 6,
        "released": "2014-12-23",
        "overview": "Yolanda and Eileen meet for lunch and bond over their love of family, discovering a surprising connection between their children. Lisa Vanderpump returns from Palm Springs to engage in some hanky panky with her pet swans. Lisa Rinna travels to her hometown of Medford, Oregon to visit her ailing parents and goes through her childhood home for the last time. Kyle hosts a casual BBQ, complete with private chef, where Eileen gets a chance to meet all the ladies. Brandi tries to get an answer from Lisa Vanderpump about her housewarming party, but quickly learns that Lisa will not be pushed around."
      },
      {
        "id": "tvmaze:93535",
        "title": "Breaking Branches",
        "season": 5,
        "episode": 7,
        "released": "2014-12-30",
        "overview": "The time has come for Brandi's housewarming party, and everyone is shocked when an unexpected party guest shows up. Lisa Rinna guest-hosts Access Hollywood Live, while fellow actress Eileen tries out a new form of exercising. Elsewhere, Kyle learns that her daughter still has a lot to learn before she leaves for college. Lisa Vanderpump hosts a charity event at PUMP, where Brandi makes her an unusual offer."
      },
      {
        "id": "tvmaze:106231",
        "title": "Winning and Dining",
        "season": 5,
        "episode": 8,
        "released": "2015-01-06",
        "overview": "Brandi and Lisa Vanderpump finally meet for lunch to talk about the status of their tenuous relationship. Yolanda struggles with trusting Bella after her recent DUI charge. Eileen and Brandi share marriage stories over dinner, but the evening quickly turns sour when Brandi hears Eileen was married to somebody else when she met Vince. The ladies attend a dinner party at Yolanda's home in Malibu where tensions are high between Eileen and Brandi."
      },
      {
        "id": "tvmaze:107040",
        "title": "Live and Learn",
        "season": 5,
        "episode": 9,
        "released": "2015-01-13",
        "overview": "Yolanda and Kyle are apprehensive about leaving their daughters at college, but in very different ways, while Lisa Vanderpump learns that her son Max wants to move up in the world. Lisa Rinna films a movie with her husband Harry Hamlin and magician Penn Jillette, while Brandi checks out her ex-husband's new reality show."
      },
      {
        "id": "tvmaze:107041",
        "title": "House of Cards",
        "season": 5,
        "episode": 10,
        "released": "2015-01-20",
        "overview": "The ladies travel up the coast to Santa Barbara to enjoy a day at the spa, but what should be a relaxing afternoon turns tense as Kim is put in a position that could challenge her sobriety. Meanwhile, Yolanda spends one last night with her daughters in NYC. Eileen opens her house to her new friends, inviting Kim, Kyle, Lisa Rinna, and Brandi to her Malibu home for a night of poker. Kim's erratic behavior puts everyone on edge, leading to an explosive confrontation between Brandi and Kyle."
      },
      {
        "id": "tvmaze:107042",
        "title": "It's Just a Scratch",
        "season": 5,
        "episode": 11,
        "released": "2015-01-27",
        "overview": "The rumble at Eileen's poker party continues as Kyle and Brandi argue over Kim. Lisa Vanderpump returns from vacation and her dog Rumpy returns from puppy training camp. Lisa Rinna hosts a jewelry party, where several women call Brandi out for her recent behavior. Kyle receives shocking news about Kim."
      },
      {
        "id": "tvmaze:120522",
        "title": "Drama Queens",
        "season": 5,
        "episode": 12,
        "released": "2015-02-03",
        "overview": "Lisa Vanderpump is surprised when adopted son Max decides he wants to take a DNA test to discover his heritage. Brandi and Kyle both visit Kim, who has just been released from the hospital, and a session of she-said-she-said ensues. Later, Brandi shows up uninvited to Kyle's gay mixer where insults are hurled and things get ugly."
      },
      {
        "id": "tvmaze:128899",
        "title": "Sister Act",
        "season": 5,
        "episode": 13,
        "released": "2015-02-10",
        "overview": "After the blow up at Kyle's gay mixer, the other women speculate about Brandi's influence over Kim. The ladies attend Eileen's movie premiere at a shopping center in the suburbs. Lisa Vanderpump is nervous when her son receives his genealogy test results. As Eileen brings the Richards sisters together to discuss their problems, Lisa Rinna questions Brandi about Kim's recent behavior."
      },
      {
        "id": "tvmaze:129508",
        "title": "Surprise!",
        "season": 5,
        "episode": 14,
        "released": "2015-02-17",
        "overview": "Eileen organizes a table read for her husband's latest Hollywood script, inviting the actresses: Kim, Kyle, and the two Lisas. Kim and Kyle act like everything is okay between them, but after the read, emotions run high, leaving everyone wondering what lies ahead for Kim. Brandi agrees to a 21 day cleanse of no alcohol, but attending Lisa Vanderpump's surprise birthday party may have her second guessing her decision to stay sober."
      },
      {
        "id": "tvmaze:129683",
        "title": "Welcome to Amsterdam?",
        "season": 5,
        "episode": 15,
        "released": "2015-02-24",
        "overview": "The ladies come together for Yolanda's scavenger hunt around Beverly Hills and are forced to put aside their differences and work together as teams. Embarking on a group trip to Amsterdam, several of the ladies attend David Foster's annual charity gala in Canada where Kim confronts Lisa Rinna over talking behind her back. When the women arrive in Amsterdam, more anger flares between the Richards sisters."
      },
      {
        "id": "tvmaze:129684",
        "title": "Amster-Damn!",
        "season": 5,
        "episode": 16,
        "released": "2015-03-03",
        "overview": "In Amsterdam, tensions continue to run high between Kim and Lisa Rinna, culminating in a shocking and explosive dinner that leaves Kyle fleeing the scene. Several of the ladies enjoy the local \"space cakes,\" but the fun sours when Brandi unexpectedly explodes at Kyle."
      },
      {
        "id": "tvmaze:142303",
        "title": "Amster-damn Slap",
        "season": 5,
        "episode": 17,
        "released": "2015-03-10",
        "overview": "With tensions still high, the ladies start day three in Amsterdam by splitting into two groups to explore the city. Eileen confronts Lisa Rinna about Lisa's failure to support her in front of Kim. Later, at dinner on a riverboat, all the unresolved issues come to a head. The night climaxes with Brandi playfully slapping Lisa, but for Ms. Vanderpump it's no game."
      },
      {
        "id": "tvmaze:142419",
        "title": "Confessions of a Housewife",
        "season": 5,
        "episode": 18,
        "released": "2015-03-17",
        "overview": "Lisa Vanderpump refuses to accept Brandi's apology for slapping her the night before. After a final dinner in Amsterdam, which Brandi skips for a date with a 24-year-old, the women return home. Brandi gets bad news about her father's health. Kyle is shocked when Lisa Rinna tells her that Brandi has talked about Kim needing an intervention. Later, in Palm Springs, Kyle angrily reveals to Kim what her \"best friend\" Brandi has been saying behind her back."
      },
      {
        "id": "tvmaze:142420",
        "title": "The Party's Over",
        "season": 5,
        "episode": 19,
        "released": "2015-03-24",
        "overview": "The women attend a splashy, over-the-top party thrown by the group's old friend Adrienne Maloof. Lisa Vanderpump confronts Brandi about Brandi slapping her in Amsterdam, but Brandi doesn't want to hear it. Kyle gets angry with Lisa Rinna for not confirming to her sister that Brandi is also worried about Kim's sobriety. Kim wants answers from Brandi."
      },
      {
        "id": "tvmaze:150956",
        "title": "Reunion Part 1",
        "season": 5,
        "episode": 20,
        "released": "2015-03-31",
        "overview": "The gripping three-part reunion begins with Yolanda revealing the difficulties she faces relapsing with Lyme disease. Although she does leave the couch early, Yolanda stays long enough to defend her daughter from Brandi's \"alcoholic\" comment and attempts to create some peace within the group. Kim declares she has more \"pride\" than Lisa Rinna in the roles she chooses and Brandi and Lisa Vanderpump getting into an argument that suggests little future for their onetime friendship."
      },
      {
        "id": "tvmaze:151371",
        "title": "Reunion Part 2",
        "season": 5,
        "episode": 21,
        "released": "2015-04-07",
        "overview": "The Beverly Hills Housewives continue reliving good times and airing their grievances. Eileen discusses how Brandi went from a high-school fan to a wine-tossing foe. Kim delves into her own issues with the soap stars and goes after Lisa Rinna as they debate the glass-breaking incident in Amsterdam and Kim's veiled threats to reveal something about Lisa's husband Harry.  Leading into a breakdown between sisters, Kim and Kyle vacillate between anger and tears."
      },
      {
        "id": "tvmaze:151372",
        "title": "Reunion Part 3",
        "season": 5,
        "episode": 22,
        "released": "2015-04-14",
        "overview": "The reunion concludes with plenty more drama and a little bit of humor. While the women can laugh about who has the dirtiest mouth, things turn sour when Kim reveals threatening texts Lisa Rinna sent her after Adrienne's party. Kyle and Brandi argue about the \"space-cakes\" in Amsterdam and Kyle's relationship with Kim unravels further as they bring deep seeded issues to the surface."
      },
      {
        "id": "tvmaze:153612",
        "title": "Secrets Revealed",
        "season": 5,
        "episode": 23,
        "released": "2015-04-21",
        "overview": "Never-before-seen stories are told as the Beverly Hills vault is opened. Getting primped in her hotel room, Eileen wonders if she really wants to win an Emmy. Kyle's daughter Portia decides to pursue her own acting career, while Lisa Rinna's daughter Delilah helps her mom prepare for an upcoming movie. Outside Amsterdam, the women probe into Yolanda's past, and back in Beverly Hills, Kim confronts Lisa Rinna about threatening texts she sent."
      },
      {
        "id": "tvmaze:483075",
        "title": "Life's a Pitch",
        "season": 6,
        "episode": 1,
        "released": "2015-12-01",
        "overview": "Lisa Vanderpump is tapped to throw out the first pitch at Dodger Stadium; Kyle buys $75,000 sunglasses for her store; Kyle copes with her sister, Kim, who is in rehabilitation; Eileen suffers a loss; Yolanda shows up for Lisa Rinna's birthday dinner."
      },
      {
        "id": "tvmaze:485576",
        "title": "Tuscany!",
        "season": 6,
        "episode": 2,
        "released": "2015-12-08",
        "overview": "Kyle and Lisa Vanderpump are enjoying a fabulous time zooming through Italy in a Ferrari and taking in the tranquil countryside when family problems interrupt. Meanwhile, back in Beverly Hills, Yolanda takes drastic measures to improve her health and Eileen and Lisa Rinna are stunned by her condition."
      },
      {
        "id": "tvmaze:485577",
        "title": "Horsing Around",
        "season": 6,
        "episode": 3,
        "released": "2015-12-15",
        "overview": "When Kyle returns from her European vacation, she is greeted with bad news about her sister, Kim; Lisa Rinna and Lisa Vanderpump head off in a private jet to find the perfect mini-horse for Ken's birthday present; a new housewife leads a double life."
      },
      {
        "id": "tvmaze:485578",
        "title": "The M Word",
        "season": 6,
        "episode": 4,
        "released": "2015-12-22",
        "overview": "Kyle reflects on her career when her 7-year-old daughter, Portia, expresses an interest in acting; Lisa Vanderpump invites the women over to show off the mini-horses; Lisa Rinna makes a shocking suggestion about Yolanda's health."
      },
      {
        "id": "tvmaze:530253",
        "title": "Will Power",
        "season": 6,
        "episode": 5,
        "released": "2015-12-29",
        "overview": "The women are intrigued with Yolanda's friend Erika, whose short skirt and flashy Cartier ring leave a memorable impression. Lisa Vanderpump pays an emergency visit to her veterinarian's office. Eileen inadvertently references Lisa Rinna's comment about Yolanda's illness in front of the other women -- including Yolanda. Later, on the eve of getting her breast implants removed, Yolanda makes a startling announcement to her children."
      },
      {
        "id": "tvmaze:530254",
        "title": "Hamptons, 90210",
        "season": 6,
        "episode": 6,
        "released": "2016-01-05",
        "overview": "The women travel to The Hamptons to celebrate Lisa Vanderpump on the cover of Bella Magazine, but Lisa's feathers are ruffled when she feels slighted by her friends. Yolanda's ongoing battle against Lyme disease finds her in Cleveland--and under the knife. Kyle is devastated by news about Kim."
      },
      {
        "id": "tvmaze:530255",
        "title": "Pretty Mess",
        "season": 6,
        "episode": 7,
        "released": "2016-01-12",
        "overview": "The women continue their adventure in the Hamptons. Eileen is still upset about being interrogated by Lisa Vanderpump about her \"affair\" with Vince. Lisa Rinna gets prudish watching Erika Jayne's videos, and the women all get a taste of Erika's alter ego when Kyle's good friend Bethenny Frankel invites everyone to dinner. Yolanda misses all the fun as she recovers from her surgery in Cleveland."
      },
      {
        "id": "tvmaze:554746",
        "title": "Going Deep",
        "season": 6,
        "episode": 8,
        "released": "2016-01-19",
        "overview": "Kyle holds a book signing at her new Hamptons pop up shop for Bethenny Frankel. The ladies enjoy a final dinner in the Hamptons, where Eileen shares a secret from her past. Erika uses her private plane to pick up Yolanda, while Kyle meets with her confidante Faye Resnick, who gives her some advice for dealing with her sister Kim. Lisa Vanderpump hosts a charity event where Lisa Rinna runs into an old friend with an intriguing past."
      },
      {
        "id": "tvmaze:567584",
        "title": "Busted BBQ",
        "season": 6,
        "episode": 9,
        "released": "2016-01-26",
        "overview": "Lisa Vanderpump takes a tour of the space that Ken wants for a new restaurant, and it turns out to be a sex shop! Eileen flies to Italy to spread her sister's ashes. Kyle hosts a BBQ where the main course is confrontation: Kyle and Lisa Vanderpump question Yolanda's claim that her children have Lyme disease, and Kathryn finally confronts Faye Resnick about a 20-year-old grudge."
      },
      {
        "id": "tvmaze:567585",
        "title": "Backwards in Heels",
        "season": 6,
        "episode": 10,
        "released": "2016-02-02",
        "overview": "Kyle and Lisa Vanderpump plan their burlesque-themed joint anniversary party, but Lisa isn't happy when she finds out Faye Resnick is on Kyle's guest list. Later, Kyle gets angry with Kathryn when she speaks out against Faye as well. Still feeling guilty about bringing up Munchhausen's disease to the other ladies, Lisa Rinna decides it's time to tell Yolanda what was said."
      },
      {
        "id": "tvmaze:590462",
        "title": "Please Welcome Erika Jayne!",
        "season": 6,
        "episode": 11,
        "released": "2016-02-09",
        "overview": "Kyle and Lisa Vanderpump take a cold plunge and try cryotherapy with Yolanda. Erika invites the ladies to see her wild alter ego perform in an over-the-top gay club in San Diego. Accused of throwing Kyle and Lisa Vanderpump under the bus, Lisa Rinna goes on a mission to find out who said what to Yolanda."
      },
      {
        "id": "tvmaze:604658",
        "title": "Hearing Problems",
        "season": 6,
        "episode": 12,
        "released": "2016-02-16",
        "overview": "The ladies have brunch at Kathryn and Donnie's San Diego home, but emotions run high when Kyle's sister Kim is brought up and Kathryn reveals pain from her past. Eileen gets an Erika Jayne makeover, while Kyle meets with an old friend who has some advice for dealing with her sister. Then, the shadow of Munchausen Syndrome casts a dark cloud over Erika's sexy outdoor pool party as tempers reach their boiling point."
      },
      {
        "id": "tvmaze:613891",
        "title": "Spinning a Web",
        "season": 6,
        "episode": 13,
        "released": "2016-02-23",
        "overview": "The women raise money for charity while working up a sweat in a spin class; Yolanda accuses Kyle of gossiping, then confronts Lisa Vanderpump for questioning her children's health; Kathryn visits Erika at her house in an effort to gain her trust."
      },
      {
        "id": "tvmaze:613890",
        "title": "Not Easy to Love",
        "season": 6,
        "episode": 14,
        "released": "2016-03-01",
        "overview": "Yolanda hosts a dinner party featuring a surprise musical guest. Also, Lisa Rinna upsets Eileen by not facing real feelings; Erika feels betrayed by Kathryn; and Kyle and Kim meet after not speaking for nearly nine months."
      },
      {
        "id": "tvmaze:622314",
        "title": "Objection, Your Honor",
        "season": 6,
        "episode": 15,
        "released": "2016-03-08",
        "overview": "Erika hosts a dinner party to introduce her husband, Tom, to the ladies, and Kathryn receives positive news during a hearing test. The ladies get their hands dirty doing charity work. Yolanda is criticized for hanging out with Kim and Brandi. Lisa Rinna shocks Eileen by revealing her thoughts about some of the ladies."
      },
      {
        "id": "tvmaze:622315",
        "title": "Hearing Is Believing",
        "season": 6,
        "episode": 16,
        "released": "2016-03-15",
        "overview": "The ladies shop for diamonds in support of Camille's cancer charity. Meanwhile, Lisa Vanderpump rallies her pals for a march; trust issues surround Lisa Rinna and Yolanda; and Erika's private jet is used for a trip to New York for Yolanda's Lyme Gala."
      },
      {
        "id": "tvmaze:622316",
        "title": "Lymes in the Sand",
        "season": 6,
        "episode": 17,
        "released": "2016-03-22",
        "overview": "At a glittering gala in New York, Yolanda receives a Lyme disease awareness award, which erases any doubts Kyle had about Yolanda's illness. Days later, the women travel to Dubai and attempt to live in a culture where they must dress modestly and not curse. After marveling at the city and their unbelievably over-the-top hotel rooms, the ladies gather for an evening full of doubts from Lisa Rinna, who did not attend the Lyme gala."
      },
      {
        "id": "tvmaze:659809",
        "title": "Dubai Daze",
        "season": 6,
        "episode": 18,
        "released": "2016-03-29",
        "overview": "After a full day of travel, the ladies finally step outside and see what Dubai has to offer. They drive through the sand dunes, shop at the local souk market and experience a traditional Arabian Nights dinner with meat from animals they didn't consider edible. Even though Yolanda stayed in Beverly Hills, there are still lingering feelings from the Munchausen fallout, leaving some ladies to feel deserted."
      },
      {
        "id": "tvmaze:669372",
        "title": "Goodbye, Dubai",
        "season": 6,
        "episode": 19,
        "released": "2016-04-05",
        "overview": "A Dubai vacation continues with the ladies basking in retail therapy. Also, Lisa Vanderpump tries to apologize to Eileen atop the Burj Khalifa skyscraper; Kathryn receives a birthday makeover; and the ladies have a luxury yet tense dinner on a yacht."
      },
      {
        "id": "tvmaze:679618",
        "title": "Who Do You Believe?",
        "season": 6,
        "episode": 20,
        "released": "2016-04-12",
        "overview": "The women head to a party at Kyle's desert home; tensions arise when Lisa Rinna comes face to face with Kyle's sister, Kim; the women react to the news of Yolanda's divorce; Yolanda talks openly to Erika about the end of her marriage."
      },
      {
        "id": "tvmaze:695016",
        "title": "Reunion Part 1",
        "season": 6,
        "episode": 21,
        "released": "2016-04-19",
        "overview": "The gorgeous and glittering ladies of Beverly Hills meet with Andy Cohen for a gripping three-part reunion that begins with some fun insights into new housewife Erika Girardi, a.k.a. Erika Jayne. Kyle defends her friend Faye Resnick when Kathryn's connection to the OJ Simpson trial is discussed, and Yolanda opens her heart about her pending divorce from David Foster. However, further conversation about her health becomes too much for Yolanda, leading to a surprising moment."
      },
      {
        "id": "tvmaze:700075",
        "title": "Reunion Part 2",
        "season": 6,
        "episode": 22,
        "released": "2016-04-26",
        "overview": "The reunion picks up with Yolanda taking some of her friends to task for questioning her health issues. Tears are shed and apologies are made. Old wounds are opened when Kyle's sister Kim Richards returns to talk about her difficult year that's been splashed through the tabloids. When Eileen confronts Lisa Vanderpump about not understanding her, Lisa breaks down in unexpected tears."
      },
      {
        "id": "tvmaze:700076",
        "title": "Reunion Part 3",
        "season": 6,
        "episode": 23,
        "released": "2016-05-03",
        "overview": "As the reunion wraps up, the women relive the fun of Dubai, and also the outrageous interpersonal drama that occurred there. While many of the ladies have nice things to say about each other, Lisa Rinna and Lisa Vanderpump remain at an impasse. The housewives are also surprised when a viewer from Encino, California (none other than Brandi!) voices her opinions of the season via video."
      },
      {
        "id": "tvmaze:750925",
        "title": "Secrets Revealed",
        "season": 6,
        "episode": 24,
        "released": "2016-05-10",
        "overview": "When the Beverly Hills vault is opened, Erika Jayne's latest sexy video is revealed, as is the hard work that goes into preparing for a big show. Eileen's \"inner Erika\" comes out on a shopping trip, while Lisa Rinna comes clean about using a strap-on. Kyle is frustrated by a spending spree Portia went on by mistake, and Yolanda's daughter, supermodel Gigi Hadid, shares a common interest with Erika's husband, Tom."
      },
      {
        "id": "tvmaze:978329",
        "title": "Stronger Than Ever",
        "season": 7,
        "episode": 1,
        "released": "2016-12-06",
        "overview": "Lisa Vanderpump introduces the group to her friend, Dorit, whose houseguest is Boy George; Erika celebrates her birthday with a Studio 54-inspired party; Lisa Rinna and Eileen come face to face with Lisa Vanderpump for the first time in months."
      },
      {
        "id": "tvmaze:993076",
        "title": "The Buddha Bentley Birthday",
        "season": 7,
        "episode": 2,
        "released": "2016-12-13",
        "overview": "Erika auditions dancers for her new music video \"Xxpensive.\" Dorit's extravagant birthday party provides a few surprises, both planned and unplanned. At the party, Lisa Vanderpump shows Lisa Rinna and Eileen exactly where they stand."
      },
      {
        "id": "tvmaze:993077",
        "title": "Going Commando",
        "season": 7,
        "episode": 3,
        "released": "2016-12-20",
        "overview": "Kyle and Lisa Rinna cross paths in New York City; Lisa Vanderpump surprises Ken with a watch on his birthday; Eileen continues to struggle with the loss of her mother."
      },
      {
        "id": "tvmaze:1015880",
        "title": "Pantygate",
        "season": 7,
        "episode": 4,
        "released": "2016-12-27",
        "overview": "Dorit wonders if Erika's wardrobe malfunction was intentional; Lisa Rinna embarks upon a 24-hour garment-selling marathon; Erika explores a future in acting with Eileen; Dorit uses a risky maneuver to confront Erika."
      },
      {
        "id": "tvmaze:1017348",
        "title": "Amnesia Appetizers",
        "season": 7,
        "episode": 5,
        "released": "2017-01-03",
        "overview": "Lisa Vanderpump and Kyle talk female rejuvenation with a plastic surgeon, while Lisa Rinna and Erika meet Eden, daughter of hairstyling icon Vidal Sassoon. Dorit hosts a dinner party where she and her husband PK question Lisa Rinna and Eileen's grieving decisions. When confronted, Dorit remembers nothing, leading to flared tensions at a luncheon at Camille Grammer's new Malibu house."
      },
      {
        "id": "tvmaze:1017349",
        "title": "Compromising Positions",
        "season": 7,
        "episode": 6,
        "released": "2017-01-10",
        "overview": "Despite having disastrous parties in the past, Kyle hosts a game night, which leads to compromising positions and plenty of laughs; Lisa Rinna and Kim reunite, and their feud reignites while Dorit and Eileen exchange angry words."
      },
      {
        "id": "tvmaze:1017350",
        "title": "It's Expensive to Be Me",
        "season": 7,
        "episode": 7,
        "released": "2017-01-17",
        "overview": "After her explosive encounter with Kim, Lisa Rinna complains to Eden; Erika shoots the music video for her new song before jetting off to Mykonos, Greece, with Kyle; Lisa Vanderpump's son, Max, begins a quest to find his biological parents."
      },
      {
        "id": "tvmaze:1033005",
        "title": "Boys, Blades and Bag of Pills",
        "season": 7,
        "episode": 8,
        "released": "2017-01-24",
        "overview": "Lisa Rinna reveals the recipe for her favorite smoothie while Eden is suspicious about Kim Richards' sobriety. Erika Jayne performs in Greece for her biggest crowd ever and Dorit shocks the ladies by having Boy George perform at her husband's birthday party."
      },
      {
        "id": "tvmaze:1033006",
        "title": "Harry's Meat and Gatsby's Fete",
        "season": 7,
        "episode": 9,
        "released": "2017-01-31",
        "overview": "Eileen is thrilled when Erika nails her reading for ``The Young and the Restless;'' Lisa Rinna throws a barbecue, during which her husband, Harry Hamlin, ends up doing most of the work; Eden causes a scene during Kyle's Great Gatsby party."
      },
      {
        "id": "tvmaze:1046771",
        "title": "Hostile Hacienda",
        "season": 7,
        "episode": 10,
        "released": "2017-02-07",
        "overview": "The women pack for their trip to Mexico; Eden tells Lisa Vanderpump what Lisa Rinna said about Kim's sobriety; while Lisa Rinna goes to New York to see her daughter walk at Fashion Week, she is the topic of conversation among the women in Mexico."
      },
      {
        "id": "tvmaze:1046772",
        "title": "Backed Into a Corner",
        "season": 7,
        "episode": 11,
        "released": "2017-02-14",
        "overview": "Tensions run high at Mauricio's party in Mexico, as Kyle demands to know exactly what Lisa Rinna said about her sister, Kim; Erika advises Lisa Rinna to come clean with Kyle; the Mexico trip wraps up with a wild boat ride and a dance to remember."
      },
      {
        "id": "tvmaze:1072850",
        "title": "Feeding a Need",
        "season": 7,
        "episode": 12,
        "released": "2017-02-21",
        "overview": "After a tear-filled Mexico trip, Lisa Rinna confronts Eden over the \"near death\" accusations. Lisa Vanderpump buys her son Max a condo, and the scripted show inspired by Kyle's childhood becomes even more of a reality. Lisa Rinna is honored with an award from her favorite charity, but Dorit has increasing suspicions about what she sees as erratic behavior from Rinna."
      },
      {
        "id": "tvmaze:1072857",
        "title": "Cake Therapy",
        "season": 7,
        "episode": 13,
        "released": "2017-02-28",
        "overview": "Erika flexes her acting muscles as she rehearses for her upcoming soap role with Eileen. Lisa Vanderpump and Ken visit their new dog rescue center. Later, Kyle throws a cake tasting for Wilson Phillips singer Carnie Wilson, where Lisa Rinna makes a startling — and very public — confession to Kim."
      },
      {
        "id": "tvmaze:1073260",
        "title": "Sweet Georgia Jayne",
        "season": 7,
        "episode": 14,
        "released": "2017-03-07",
        "overview": "Kyle hosts a party at her store where Lisa Vanderpump's invitations to Hong Kong get out of hand; the women gather at Villa Rosa for lunch; Erika flies back home to Georgia to see her mother and reconnect with her roots."
      },
      {
        "id": "tvmaze:1073274",
        "title": "Hong Kong Fireworks",
        "season": 7,
        "episode": 15,
        "released": "2017-03-14",
        "overview": "The women set off for Hong Kong where Lisa Vanderpump continues her efforts to stop animal cruelty; Erika confides in Kyle about visiting her mother in Georgia; aboard a historic junk boat, old conflicts explode between Dorit, Lisa Rinna and Erika."
      },
      {
        "id": "tvmaze:1073286",
        "title": "Big Buddha Brawl",
        "season": 7,
        "episode": 16,
        "released": "2017-03-21",
        "overview": "Tensions between Dorit and Erika continue to rock the boat in Hong Kong; Lisa Rinna and Eileen pick a side while Lisa Vanderpump and Kyle watch in shock; the women visit the second largest Buddha."
      },
      {
        "id": "tvmaze:1073292",
        "title": "From Dogs to Diamonds",
        "season": 7,
        "episode": 17,
        "released": "2017-03-28",
        "overview": "Still in Hong Kong, Lisa Rinna defends her accusations; the women visit an animal shelter; back in Beverly Hills, Erika shoots her scenes for ``The Young &amp; the Restless;'' the group heads to Villa Rosa for a spectacular Diamonds and Rosé party."
      },
      {
        "id": "tvmaze:1110663",
        "title": "Diamonds Under Pressure",
        "season": 7,
        "episode": 18,
        "released": "2017-04-04",
        "overview": "Lisa Rinna and Erika's unresolved issues with Dorit come to a head at Lisa Vanderpump's Diamonds and Rosé party, which is filled with fabulous food, glittering ponies and lots of tension. When Dorit's efforts to defend herself fall on deaf ears, her husband PK joins the fray. Eden shocks the women by unleashing an epic tirade on Lisa Rinna."
      },
      {
        "id": "tvmaze:1125422",
        "title": "Reunion Part 1",
        "season": 7,
        "episode": 19,
        "released": "2017-04-11",
        "overview": "Erika addresses the claims she has an icy demeanor; Dorit defends her parenting skills; Lisa Vanderpump, Lisa Rinna and Eileen discuss their wounded feelings; tensions escalate when Dorit's husband, PK, joins the ladies on the couch."
      },
      {
        "id": "tvmaze:1126382",
        "title": "Reunion Part 2",
        "season": 7,
        "episode": 20,
        "released": "2017-04-18",
        "overview": "Erika addresses the claims she has an icy demeanor; Dorit defends her parenting skills; Lisa Vanderpump, Lisa Rinna and Eileen discuss their wounded feelings; tensions escalate when Dorit's husband, PK, joins the ladies on the couch."
      },
      {
        "id": "tvmaze:1126383",
        "title": "Reunion Part 3",
        "season": 7,
        "episode": 21,
        "released": "2017-04-25",
        "overview": "The women are forced to evaluate the bonds they have forged over the years; Lisa Vanderpump gets emotional when discussing her son and her crusade to save dogs; Lisa Rinna and Kim Richards attempt to see eye-to-eye, then Kyle dives into the fray."
      },
      {
        "id": "tvmaze:1357196",
        "title": "Don't Cry Over Spilled Wine",
        "season": 8,
        "episode": 1,
        "released": "2017-12-19",
        "overview": "In the eighth season opener, Kyle and Lisa Vanderpump charter a private jet to take the ladies to Las Vegas for a group birthday celebration, but the question of whether Lisa Rinna will join lingers. Dorit's new friend Teddi hits it off with Lisa Vanderpump over drinks and they invite her along for the ride. Lisa Vanderpump assesses her friendship with Erika and begins to see their relationship in a different light. The ladies let loose in Sin City, with familiar faces Adrienne Maloof and Camille Grammar joining the festivities."
      },
      {
        "id": "tvmaze:1371797",
        "title": "Diva Las Vegas",
        "season": 8,
        "episode": 2,
        "released": "2017-12-26",
        "overview": "Teddi's job as an accountability coach leads to questions amongst the group. When Lisa Vanderpump takes Erika to task for not responding whenever she reaches out to spend time with her, their friendship is called into question. Kyle and Dorit take issue with Lisa Rinna and confront her atop the High Roller—a 550 foot tall ferris wheel overlooking the Las Vegas strip. Teddi feels iced out in her attempts to get to know Erika."
      },
      {
        "id": "tvmaze:1371798",
        "title": "Bad Guys",
        "season": 8,
        "episode": 3,
        "released": "2018-01-02",
        "overview": "As she writes her memoir, Erika is forced to revisit her past and gets emotional about her father. Lisa Vanderpump helps PK throw a lavish birthday dinner for Dorit—and the unlikeliest of guests gives a speech. Teddi starts to question Dorit's character when Dorit speaks badly about Lisa Rinna. Meanwhile, Kyle vacations with her family in Croatia."
      },
      {
        "id": "tvmaze:1371799",
        "title": "Lights Out!",
        "season": 8,
        "episode": 4,
        "released": "2018-01-09",
        "overview": "Lisa Rinna and Erika jet off to Tokyo to support Amelia and Delilah's latest modeling gig, but \"momager\" Lisa comes to the realization that the girls might not need her there as much as she thought. Dorit agrees to model for Lisa Vanderpump's magazine, but the photo shoot is not what she expected. When the power goes out at Kyle's dinner party, the darkness brings out the worst in one housewife, leading to an explosive outburst."
      },
      {
        "id": "tvmaze:1371800",
        "title": "Unfashionably Late",
        "season": 8,
        "episode": 5,
        "released": "2018-01-16",
        "overview": "Kyle laments not being able to share her newfound success as a television producer with her sisters. Dorit relaunches her swimwear line, but a business meeting inadvertently causes friction with Teddi. After returning from Tokyo, Erika is shaken when she receives unexpected news. Lisa Vanderpump advises Dorit to make things right with Camille."
      },
      {
        "id": "tvmaze:1371801",
        "title": "Wham, Glam, Thank You Ma'am",
        "season": 8,
        "episode": 6,
        "released": "2018-01-23",
        "overview": "Dorit searches for the perfect birthday gift for PK, and takes Erika to test drive an insanely luxurious car. Lisa Rinna worries about her daughter's upcoming move to New York City. Lisa Vanderpump confides in Kyle about the lawsuit brought against her and Ken – and later criticizes Lisa Rinna for talking about it behind her back. Teddi's spa day is everything but relaxing."
      },
      {
        "id": "tvmaze:1371802",
        "title": "Birthday Fever",
        "season": 8,
        "episode": 7,
        "released": "2018-01-30",
        "overview": "Kyle worries when she's late for a double date with Teddi and their husbands. Lisa Rinna hustles her way into two new acting gigs. Dorit shocks her husband PK with an extravagant 50th birthday party on a yacht. Erika and Lisa Vanderpump have differing opinions about Dorit's big surprise, and a wine glass is at the center of a new conflict."
      },
      {
        "id": "tvmaze:1389389",
        "title": "Petty Mess",
        "season": 8,
        "episode": 8,
        "released": "2018-02-06",
        "overview": "Lisa Rinna returns to her roots, and the role of Billie, on Days of Our Lives. Lisa Vanderpump receives news about the lawsuit, but Kyle and Dorit don't react to it the way she hopes — prompting Lisa to walk out on them. Teddi's concerns about hosting the women at her beach house come true when Kyle and Lisa Vanderpump waste no time addressing their latest issues in front of everyone."
      },
      {
        "id": "tvmaze:1395216",
        "title": "That Was Weird",
        "season": 8,
        "episode": 9,
        "released": "2018-02-13",
        "overview": "Teddi's beach house weekend ends abruptly—and disastrously—when Dorit reveals to Erika what was said about her after her unexpected departure. The ladies descend upon New York for Fashion Week. Lisa Rinna helps her daughter, Delilah, get settled in New York City. Private information about Lisa Vanderpump is revealed publicly—and some of the ladies worry how she'll react once she finds out."
      },
      {
        "id": "tvmaze:1395217",
        "title": "The Big Apple Bites",
        "season": 8,
        "episode": 10,
        "released": "2018-02-20",
        "overview": "While still in the Big Apple for Fashion Week, Dorit attempts to come clean with Lisa Vanderpump, but Lisa isn't sure she's getting the whole story. Erika meets with her publisher to give an update on her book. Meanwhile, Kyle gets wind of what Dorit has been saying about her from Teddi. And what should be Dorit's big night turns into a big altercation."
      },
      {
        "id": "tvmaze:1395218",
        "title": "Thank You, Thuck You",
        "season": 8,
        "episode": 11,
        "released": "2018-02-27",
        "overview": "With front row seats to New York Fashion Week, Dorit tries to get back into Lisa Vanderpump's good graces, while Kyle wants an apology from Lisa but doesn't think she'll get one. Erika comes face to face with Kyle's old friend, Bethenny Frankel, who was critical of Erika's music the last time they met. Lisa Rinna's daughter is already feeling homesick. Teddi persuades Lisa Vanderpump to do the unthinkable."
      },
      {
        "id": "tvmaze:1409936",
        "title": "Gag Gift",
        "season": 8,
        "episode": 12,
        "released": "2018-03-06",
        "overview": "Erika is surprised by her own emotions as her Hollywood journey comes full circle. The women attend Camille's charity event, where Teddi's motives are brought into question. Dorit tries her best to repair her relationship with Lisa Vanderpump, but ends up experiencing a side of Lisa she's never seen before.  And at Lisa Vanderpump's birthday party, Camille attempts to silence Dorit once and for all."
      },
      {
        "id": "tvmaze:1409937",
        "title": "Crying Shame",
        "season": 8,
        "episode": 13,
        "released": "2018-03-13",
        "overview": "Erika and Lisa Rinna meet up with old friend Eileen Davidson for drinks. After unexpectedly finding her dream home, Kyle struggles with the decision to stay in her current house or move. Erika strikes a pose for her book cover. Teddi drops a bomb that could damage Lisa Rinna's newfound friendship with Dorit, but when the dust settles, it's Erika who Teddi finds herself at odds with more than ever before."
      },
      {
        "id": "tvmaze:1409938",
        "title": "Heaven Knows",
        "season": 8,
        "episode": 14,
        "released": "2018-03-20",
        "overview": "After her explosive encounter with Erika, Teddi worries about seeing her at Lisa Rinna's luncheon. Kyle's séance conjures up some unexpected guests, but the group gets a bigger shock when Erika reveals information about her past. Lisa Vanderpump is struck by sudden tragedy at home."
      },
      {
        "id": "tvmaze:1409939",
        "title": "Dames, Dogs and Danke",
        "season": 8,
        "episode": 15,
        "released": "2018-03-27",
        "overview": "Kyle packs her house for her upcoming move. Lisa Vanderpump's documentary about dog abuse in China premieres at a film festival. Dorit races to finish her swimwear collection on time, and then suffers the consequences when she becomes sick on the way to the girls' trip to Berlin. Lisa Vanderpump is stunned when Kyle – her friend of ten years – doesn't remember someone very dear to Lisa's own heart."
      },
      {
        "id": "tvmaze:1422920",
        "title": "Holy Schnitzel",
        "season": 8,
        "episode": 16,
        "released": "2018-04-03",
        "overview": "A peaceful horseback ride through the German countryside takes a dangerous turn for Kyle and Lisa Rinna. The ladies get emotional while visiting the Eisenman Holocaust Memorial and Berlin Wall. The group gets into the Oktoberfest spirit when they spend the night dancing at a Berlin beer hall."
      },
      {
        "id": "tvmaze:1425898",
        "title": "Better Latex Than Never",
        "season": 8,
        "episode": 17,
        "released": "2018-04-10",
        "overview": "As the Berlin trip concludes, one of the ladies can't seem to be on time to any of the scheduled events; surprisingly, it's not Dorit. \"Pretend amnesia\" rears its ugly head again, and Erika is surprised to hear how Teddi truly feels about her. Kyle's still upset with Dorit but chooses to ignore her own feelings for the sake of the trip. Dorit stresses over final preparations for her fashion show—and fears she won't be able to pull off her big comeback."
      },
      {
        "id": "tvmaze:1427144",
        "title": "The Runaway Runway",
        "season": 8,
        "episode": 18,
        "released": "2018-04-17",
        "overview": "In the season finale, Dorit launches her swimwear line with a glamorous fashion show that could make or break her design comeback. Camille shares life-changing news. Lisa Rinna worries about Delilah being homesick in New York. Kyle expresses her feelings about Dorit, but it causes an unexpected rift with Erika. Lisa Vanderpump is forced to reveal a hard truth to Dorit."
      },
      {
        "id": "tvmaze:1436929",
        "title": "Reunion Part 1",
        "season": 8,
        "episode": 19,
        "released": "2018-04-24",
        "overview": "Strong emotions persist as Dorit and Teddi struggle to sort out a year of misunderstandings. Kyle reveals the devastating details of her house burglary last Christmas. Then, Camille Grammer joins the ladies and brings an unexpected gift for Andy. And Lisa Vanderpump finds herself in the hot seat when she defends her reaction to Dorit's betrayal."
      },
      {
        "id": "tvmaze:1439497",
        "title": "Reunion Part 2",
        "season": 8,
        "episode": 20,
        "released": "2018-05-01",
        "overview": "Strong emotions persist as Dorit and Teddi struggle to sort out a year of misunderstandings. Kyle reveals the devastating details of her house burglary last Christmas. Then, Camille Grammer joins the ladies and brings an unexpected gift for Andy. And Lisa Vanderpump finds herself in the hot seat when she defends her reaction to Dorit's betrayal."
      },
      {
        "id": "tvmaze:1445941",
        "title": "Reunion Part 3",
        "season": 8,
        "episode": 21,
        "released": "2018-05-08",
        "overview": "As the reunion concludes, Andy explores the reasons behind Lisa Vanderpump's fall-out with Dorit. As the ladies relive their trip to Berlin, they question why Lisa Vanderpump was so upset with Kyle for not remembering her grandmother's name. Kyle gets emotional when discussing her sisters' lack of support around her new projects. All the while, Teddi and Erika confront each other over \"pretend amnesia.\""
      },
      {
        "id": "tvmaze:1458021",
        "title": "Secrets Revealed",
        "season": 8,
        "episode": 22,
        "released": "2018-05-15",
        "overview": "In never-before-seen footage from Beverly Hills, Teddi goes shopping for a new sports car with her husband and is shocked by its high speed – and its high price tag! Dorit and her bestie, Boy George, are curious about Teddi's job. Erika and Camille are slightly mortified when Lisa Rinna makes a questionable joke about Lisa Vanderpump. Kyle plans to build a new beach house in Mexico. Camille's search for the perfect gift for Dorit takes her to the Museum of Sex in New York City."
      },
      {
        "id": "tvmaze:1581011",
        "title": "Lucy Lucy Apple Juicy",
        "season": 9,
        "episode": 1,
        "released": "2019-02-12",
        "overview": "Erika is excited when Lisa Rinna introduces her friend, famous actress Denise Richards, to the group.  Lisa Vanderpump struggles to come to terms with her grief after a personal tragedy. At Kyle's pool party, Dorit is concerned that Teddi will twist information about her family's dog and use it against her."
      },
      {
        "id": "tvmaze:1602774",
        "title": "Eat Your Heart Out",
        "season": 9,
        "episode": 2,
        "released": "2019-02-19",
        "overview": "Kyle and Lisa Vanderpump visit the cosmetic dermatologist in hopes of lifting Lisa's spirits — as well as some other body parts. Dorit suggests a girls' trip to the Bahamas, anticipating that time away will strengthen relationships amongst the group, specifically between her and Teddi. Lisa Rinna hosts a pastry party, where Erika has a big reaction after Denise details the salacious way in which she met her boyfriend Aaron."
      },
      {
        "id": "tvmaze:1603799",
        "title": "Sun and Shade in the Bahamas",
        "season": 9,
        "episode": 3,
        "released": "2019-02-26",
        "overview": "On a private island in the Bahamas, newcomer Denise quickly discovers that fun in the sun, sand, and surf comes with plenty of conflict for the rest of the women. Lisa Rinna suspects Kyle and Teddi were used in a scheme to exact revenge on Dorit. Meanwhile, Erika is stunned when Lisa Vanderpump questions her motives, and resents being portrayed as \"the bad guy.\""
      },
      {
        "id": "tvmaze:1603800",
        "title": "Bahama Drama",
        "season": 9,
        "episode": 4,
        "released": "2019-03-05",
        "overview": "After an explosive start to the girls' trip, Lisa Rinna and Denise comfort Dorit, who struggles to make sense of the gossip surrounding the situation with her former dog. When Lisa Vanderpump is accused of having spread the scandalous dog story, Vanderpump searches for evidence that will clear her name. Meanwhile, Erika and Teddi make good on their promise to put their rocky past behind them, and Kyle takes the first step in building a new jewelry collection after last year's burglary."
      },
      {
        "id": "tvmaze:1614223",
        "title": "The Proof Hurts",
        "season": 9,
        "episode": 5,
        "released": "2019-03-12",
        "overview": "Denise lets Lisa Rinna in on exciting news about her future. Kyle's anxiety is front and center as she and her family drop off Sophia at college. In Erika's chapel, Teddi \"confesses\" her involvement in the dog drama, but Lisa Vanderpump insists that Teddi is not as angelic as she makes herself out to be – and she has proof."
      },
      {
        "id": "tvmaze:1617979",
        "title": "Fifty Shades of Shade",
        "season": 9,
        "episode": 6,
        "released": "2019-03-19",
        "overview": "Erika pushes Dorit to take her sex appeal to the next level during a magazine photo shoot. Denise lets it all hang out at dinner with Lisa Vanderpump and Kyle, and reveals some big details – literally – about Aaron. Lisa Rinna helps Camille plan her 50th birthday bash, but tensions run high at the celebration when Teddi and Lisa Vanderpump go head to head."
      },
      {
        "id": "tvmaze:1620706",
        "title": "Eat, Drink, and Be Married",
        "season": 9,
        "episode": 7,
        "released": "2019-03-26",
        "overview": "Kyle, Dorit, and Teddi shop for a wedding gift for Denise, who scrambles to pull off her big day in record time. Lisa Rinna comes face-to-face with an old flame, who dated both her and Denise at the same time. After their disastrous run-in at Camille's birthday party, Lisa Vanderpump dreads seeing Teddi at the wedding. Erika prepares for the launch of her new tour."
      },
      {
        "id": "tvmaze:1624774",
        "title": "Showdown at Villa Rosa",
        "season": 9,
        "episode": 8,
        "released": "2019-04-02",
        "overview": "Newlyweds Denise and Aaron begin their life together by nesting at home instead of embarking on a honeymoon. Erika and Lisa Rinna lend moral support to Dorit, who deals with the repercussions of the dog fiasco going public. Despite her fallout with Lisa Vanderpump, Teddi honors her commitment to host a charity event for Vanderpump Dogs. Then, a monster argument between Kyle and Lisa Vanderpump culminates in Lisa and Ken demanding that Kyle leave their house."
      },
      {
        "id": "tvmaze:1628167",
        "title": "A Wolf in Camille's Clothing",
        "season": 9,
        "episode": 9,
        "released": "2019-04-09",
        "overview": "As Lisa Vanderpump's birthday approaches, she and Kyle deal with raw emotions in the aftermath of their intense falling out. Denise feels caught between her loyalty to the group and her new friendship with Lisa Vanderpump. Lisa Rinna and Teddi discuss a tweet gone wrong, while Dorit struggles to get PK to take his health issues seriously."
      },
      {
        "id": "tvmaze:1635077",
        "title": "A Supreme Snub",
        "season": 9,
        "episode": 10,
        "released": "2019-04-16",
        "overview": "After throwing a bridal shower for Camille, Kyle finds that she is being blamed for Lisa Vanderpump's absence. A dinner celebrating Lisa Rinna's mother takes an unexpected turn when Lisa Rinna and Teddi get into a political argument with Camille. Denise provides a shoulder to cry on for Dorit, who is still battling the wounds of her public takedown in the press. Meanwhile, renovation on Lisa Vanderpump's kitchen begins and Erika prepares for her upcoming tour."
      },
      {
        "id": "tvmaze:1638348",
        "title": "Do You Really Want to Hurt Me?",
        "season": 9,
        "episode": 11,
        "released": "2019-04-23",
        "overview": "Denise meets with Lisa Vanderpump in hopes of mediating the situation between Lisa and the other ladies – while, Kyle and Dorit debate Denise's chances of making any headway with Vanderpump. Erika kicks off her headline tour in New Jersey, but jets back to LA in time to join the others at the Culture Club concert, where Lisa Rinna meets an idol and Kyle and Teddi both have unexpected run-ins backstage."
      },
      {
        "id": "tvmaze:1639956",
        "title": "The Ultimate Ultimatum",
        "season": 9,
        "episode": 12,
        "released": "2019-04-30",
        "overview": "Lisa Vanderpump gives Dorit an ultimatum that could end their friendship forever; unresolved tension between Kyle and Dorit comes to a head at Teddi's dinner party; Denise gets her first taste of Camille's insincere ways."
      },
      {
        "id": "tvmaze:1644033",
        "title": "Grilling Me Softly",
        "season": 9,
        "episode": 13,
        "released": "2019-05-07",
        "overview": "The ladies hit the road in Teddi's RV for a camping trip in the great outdoors. With no room for glam squads, Erika and Dorit embrace the idea of \"roughing it,\" while Kyle is pushed out of her comfort zone when she tries to embrace her adventurous side. Lisa Rinna realizes she's now the oldest member of the group. A fireside chat heats up when Camille lets Teddi know how she really feels about her - and Denise shares a raunchy story that leaves the other women speechless."
      },
      {
        "id": "tvmaze:1655826",
        "title": "The Show Must Go On",
        "season": 9,
        "episode": 14,
        "released": "2019-05-14",
        "overview": "Kyle, Lisa Rinna, Dorit, and Teddi get wild at the LA stop of Erika's concert tour, but a major mishap threatens to silence the show. While inviting Lisa Vanderpump to her Hawaiian wedding, Camille finds another opportunity to criticize Teddi. Lisa Vanderpump makes a declaration about the future of her friendship with Kyle. And Denise struggles to balance the demands of parenting with her acting career."
      },
      {
        "id": "tvmaze:1655827",
        "title": "One Wedding and a Polygraph",
        "season": 9,
        "episode": 15,
        "released": "2019-05-21",
        "overview": "The ladies travel to the Big Island of Hawaii for Camille's lavish wedding in paradise. Despite having to wear a cap sleeve dress, Kyle stands up as a bridesmaid for her friend/former frenemy. Teddi worries about the effect her growing business has on her family. Lisa Rinna and Dorit, both husband-less on the trip, plan to be each other's dates for the wedding — but Rinna's health may derail their fun time. Lisa Vanderpump resorts to drastic measures to prove her innocence in the dog drama."
      },
      {
        "id": "tvmaze:1656414",
        "title": "Meet Rinna Jayne",
        "season": 9,
        "episode": 16,
        "released": "2019-05-28",
        "overview": "While traveling home from Hawaii, Lisa Rinna, Kyle, Teddi, and Dorit discover an article that exposes Camille's duplicity. In the midst of planning an epic Halloween-inspired bash for her daughter's 30th birthday, Kyle faces her worst fear. After reuniting with Denise and Erika at Kyle's party, Dorit and Teddi battle the urge to confront Camille. Lisa Rinna comes face-to-face with Kim Richards and makes a bold move that shocks everyone."
      },
      {
        "id": "tvmaze:1658314",
        "title": "A Double Shot of Brandi",
        "season": 9,
        "episode": 17,
        "released": "2019-06-04",
        "overview": "Kyle plans a girls' trip to Provence, France. Erika and Lisa Rinna are astonished by Camille talking out of both sides of her mouth about Dorit — and are certain Dorit will call her on it. Denise spends a wild night with new friend Brandi Glanville and gets an earful about the other women. Tragedy strikes as Kyle, Lisa Rinna, and Teddi head to the airport."
      },
      {
        "id": "tvmaze:1661021",
        "title": "Pardon Our French",
        "season": 9,
        "episode": 18,
        "released": "2019-06-11",
        "overview": "Kyle, Erika, Dorit, Teddi, and Lisa Rinna arrive at a luxurious chateau in Provence, France, for a wine-tasting adventure. Denise and Camille must stay behind when a massive wildfire forces them to evacuate their homes and flee to safety. While touring the local villages, an emotional Kyle opens up to the group about something deeply personal. Erika grows frustrated with Teddi and Kyle when they confront her about Lisa Rinna's over-the-top portrayal of Erika Jayne."
      },
      {
        "id": "tvmaze:1663955",
        "title": "Thirst Impressions",
        "season": 9,
        "episode": 19,
        "released": "2019-06-18",
        "overview": "In Provence, a countryside excursion features a lot of wine, and even more laughs, despite Erika's unenthusiastic attitude. Teddi and Kyle overindulge, leading to a shocking night of revelations, tears, and chaos – leaving Lisa Rinna and Dorit caught in the middle. Back in Malibu, Denise and Camille return to their homes for the first time since devastating wildfires upended their lives."
      },
      {
        "id": "tvmaze:1667450",
        "title": "Un Petit Hangover",
        "season": 9,
        "episode": 20,
        "released": "2019-06-25",
        "overview": "The morning after their drunken tirade, Lisa Rinna encourages Kyle and Teddi to do damage control; Denise copes with her family's displacement; Dorit reveals her first window display; Camille reveals her true feelings about Dorit."
      },
      {
        "id": "tvmaze:1674396",
        "title": "Hurricane Camille",
        "season": 9,
        "episode": 21,
        "released": "2019-07-09",
        "overview": "When Kyle hosts a party to celebrate the family business, an emotionally fragile Camille is eager to settle the score with Teddi, Dorit, and Lisa Rinna. Denise tries to play peacemaker — but ends up losing her cool. Kim updates Kyle on where she stands with Lisa Rinna. The group is stunned when Kyle reveals she had her first encounter with Lisa Vanderpump since being kicked out of Lisa's home."
      },
      {
        "id": "tvmaze:1674397",
        "title": "Reunion Part 1",
        "season": 9,
        "episode": 22,
        "released": "2019-07-16",
        "overview": "The women gather to settle their grievances, but are faced with a stunning no-show from Lisa Vanderpump, which sets Kyle off. An emotional Denise reflects on her roller-coaster year, but her comments draw Camille's ire. Erika and Lisa Rinna reveal some naughty secrets about their husbands, while Dorit calls out Teddi's betrayal."
      },
      {
        "id": "tvmaze:1676924",
        "title": "Reunion Part 2",
        "season": 9,
        "episode": 23,
        "released": "2019-07-23",
        "overview": "Teddi finds herself in the hot seat as Andy holds her accountable for her role in Puppygate, which ultimately led to a rift between Dorit and Lisa Vanderpump. Dorit, Erika, and Kyle defend themselves when tabloid headlines are brought into question. Lisa Rinna opens up to the group about her possible issues with food. Unresolved emotions between Camille and the rest of the ladies come to a shocking climax."
      },
      {
        "id": "tvmaze:1682148",
        "title": "Reunion Part 3",
        "season": 9,
        "episode": 24,
        "released": "2019-07-30",
        "overview": "The reunion concludes with the fallout over Camille's dramatic storm-off. Teddi and Denise face a volatile foe. A tearful Kyle reflects on the end of her long friendship with Lisa Vanderpump. Lisa Rinna, Dorit, and Erika debate Lisa Vanderpump's behavior this season and question her motivations."
      },
      {
        "id": "tvmaze:1818770",
        "title": "The Crown Isn't So Heavy",
        "season": 10,
        "episode": 1,
        "released": "2020-04-15",
        "overview": "Kyle's new clothing line brings the women of Beverly Hills together for New York Fashion Week, where Dorit quickly realizes Kyle's lack of experience in the fashion world could turn into a runway disaster. Erika takes Lisa Rinna, Teddi and Denise on a revealing trip down memory lane. Denise, who is trying her best to ignore legal issues with her notorious ex-husband, introduces the group to her longtime friend Garcelle Beauvais."
      },
      {
        "id": "tvmaze:1821139",
        "title": "To Live and Text in Beverly Hills",
        "season": 10,
        "episode": 2,
        "released": "2020-04-22",
        "overview": "While Kyle tries to attract buyers for her new fashion line in New York City, Erika gets big news that has her moving there. Dorit's move into a new house is marred by negative press about her finances. As Denise faces emergency surgery, Lisa Rinna worries about Amelia adjusting to college life. Meanwhile, Teddi's confusing invitation causes conflict in the group."
      },
      {
        "id": "tvmaze:1837781",
        "title": "First Impressions, True Confessions",
        "season": 10,
        "episode": 3,
        "released": "2020-04-29",
        "overview": "Kyle wraps shooting on her latest film and plans a Welcome Home party for all the ladies, including her newest friend Garcelle. Erika's singing lesson brings up a painful childhood memory. Teddi doesn't take kindly to Sutton's criticism. Denise's husband inadvertently bewilders Kyle's guests, while Lisa Rinna's party game leads to hurt feelings, tears and a dramatic exit."
      },
      {
        "id": "tvmaze:1837782",
        "title": "All's Fair in Glam and War",
        "season": 10,
        "episode": 4,
        "released": "2020-05-06",
        "overview": "After an awkward invitation, Lisa Rinna and Garcelle opt out of Teddi's fitness and wellness retreat, which is far from relaxing for the other ladies. Kyle and Erika question Dorit's all-about-me behavior. Denise is upset when her backyard dinner party takes an R-rated turn in front of her kids. The ladies are shocked when Kyle becomes inexplicably emotional."
      },
      {
        "id": "tvmaze:1855711",
        "title": "Let the Mouse Go!",
        "season": 10,
        "episode": 5,
        "released": "2020-05-13",
        "overview": "Lisa and Teddi butt heads over Kyle's emotional meltdown. Garcelle celebrates a milestone in her sons' lives, while Lisa struggles to stay in the shadows as her daughters launch their clothing line. Dorit and Sutton get into a cat-and-mouse game over a misunderstanding, and Erika notices the cracks in Denise's laid-back facade when Denise is pushed to a new breaking point."
      },
      {
        "id": "tvmaze:1855712",
        "title": "Read Between the Signs",
        "season": 10,
        "episode": 6,
        "released": "2020-05-20",
        "overview": "Erika is left seeing stars at her astrology party when old resentments flare up between Kyle, Teddi and Dorit. Denise's simmering frustration boils over in front of a speechless Lisa Rinna. After drinks with her besties, Garcelle questions a new friend's priorities."
      },
      {
        "id": "tvmaze:1855713",
        "title": "Santa Denise",
        "season": 10,
        "episode": 7,
        "released": "2020-05-27",
        "overview": "What promises to be a relaxing trip to Santa Barbara instead opens old wounds for Dorit, Erika, Teddi and Kyle. After feeling judged as a mother, Lisa Rinna turns the tables on Denise, forcing her to examine her own history of risqué behavior. Meanwhile, Garcelle weighs the pros and cons of being a working mom as she prepares to leave town for a job."
      },
      {
        "id": "tvmaze:1865682",
        "title": "Mind Your P's and BBQ's",
        "season": 10,
        "episode": 8,
        "released": "2020-06-03",
        "overview": "Garcelle is honored for her work with a local charity, but her acceptance speech isn't charitable to one guest. The ladies feel mom-shamed when Denise shows up to Kyle's kid-friendly barbecue without her kids. Lisa, Erika and Teddi are annoyed when Aaron mansplains to them – a situation Dorit knows firsthand is problematic for husbands in this group."
      },
      {
        "id": "tvmaze:1878611",
        "title": "Until We Leave Again",
        "season": 10,
        "episode": 9,
        "released": "2020-07-08",
        "overview": "Denise and Aaron's hasty departure from Kyle's barbecue leaves the other ladies confused and unsettled. Kyle helps Kim through a delicate medical procedure, while Lisa and Erika have a distinctively Beverly Hills \"procedure\" of their own. Garcelle moves into her new house. Aaron awkwardly comes face to face with Erika and Teddi at Sutton's trunk show."
      },
      {
        "id": "tvmaze:1878612",
        "title": "Black Ties and White Lies",
        "season": 10,
        "episode": 10,
        "released": "2020-07-15",
        "overview": "Garcelle finds herself in a tough spot during a business meeting. Lisa questions Denise's motives when Denise's behavior is filled with shades of grey. With Dorit's help, Kyle throws a black and white charity gala full of familiar faces from years past. Erika tries to avoid being \"mansplained\" to again, while Camille's road to reconciliation is bumpier than she expected."
      },
      {
        "id": "tvmaze:1878613",
        "title": "Kiss and Tell All",
        "season": 10,
        "episode": 11,
        "released": "2020-07-22",
        "overview": "Lisa invites Dorit and the others on a glamorous Roman getaway. Denise tries to make nice with Erika, but gets an ice-cold shoulder instead. Garcelle digs into Sutton's past, while Brandi drops a bomb on Kyle and Teddi which threatens to turn their dream vacation into a nightmare."
      },
      {
        "id": "tvmaze:1899774",
        "title": "Roman Rumors",
        "season": 10,
        "episode": 12,
        "released": "2020-07-29",
        "overview": "After rumors about Denise begin to swirl, Lisa attempts to save the group's Roman holiday from turning into a disaster. When Teddi questions Denise about talking behind their backs, the confrontation leads to shocking revelations and questionable denials. Garcelle's bluntness hits a nerve with Sutton. Meanwhile, Kyle raises her eyebrows at Dorit and Erika's fashion-forward travel wear."
      },
      {
        "id": "tvmaze:1906562",
        "title": "There's No Place Like Rome",
        "season": 10,
        "episode": 13,
        "released": "2020-08-05",
        "overview": "The Rome getaway continues as the women process Brandi's claims against Denise. While Kyle and Dorit attempt to work through their constant clashes, Garcelle, Denise, Erika and Lisa tour the city in luxury Ferraris. Dinner takes a wild turn when Denise throws out an accusation of her own, leading the women to question each other."
      },
      {
        "id": "tvmaze:1906563",
        "title": "That's Not Amore",
        "season": 10,
        "episode": 14,
        "released": "2020-08-12",
        "overview": "While a Vespa ride reminds Kyle and Dorit just how much fun they can have together, Denise calls out Lisa for betraying their friendship; a tearful Lisa joins Denise, Garcelle and Sutton to find redemption at the Vatican."
      },
      {
        "id": "tvmaze:1906564",
        "title": "Sex, Lies, and Text Messages",
        "season": 10,
        "episode": 15,
        "released": "2020-08-19",
        "overview": "Kyle and Dorit surprise Teddi with a baby shower, but Brandi reveals a few surprises of her own. Denise and Garcelle lament over how they think Lisa has changed – but Lisa has a very different take on things. Erika leaves LA and jets off to Broadway."
      },
      {
        "id": "tvmaze:1906565",
        "title": "Denise and Desist",
        "season": 10,
        "episode": 16,
        "released": "2020-08-26",
        "overview": "Denise is a no-show at Dorit's housewarming party and fails to keep plans with Garcelle twice in one week. The group hops on a private jet to celebrate Erika's Broadway debut, while Lisa and Denise try to salvage their 20-year friendship in a tense one-on-one."
      },
      {
        "id": "tvmaze:1917839",
        "title": "Reunion Part 1",
        "season": 10,
        "episode": 17,
        "released": "2020-09-02",
        "overview": "The ladies come together for a virtual sit-down to rehash a season of incredible highs and shocking lows, as they confront their issues and tackle viewers' burning questions. Kyle and Garcelle waste no time airing their grievances, and their unresolved tension finally reaches its boiling point when Kyle drops a shocking accusation. Dorit and Sutton recount their awkward exchange at Lisa's daughters' clothing line launch event, but Dorit's apology falls on deaf ears as Sutton challenges the motivations behind her comment. Frustrations come to a head when Erika and Lisa bring Denise to task for refusing to have an honest conversation and accuse her of manipulating the truth."
      },
      {
        "id": "tvmaze:1921475",
        "title": "Reunion Part 2",
        "season": 10,
        "episode": 18,
        "released": "2020-09-09",
        "overview": "Kyle takes a turn in the hot seat when she is left to answer for her attitude towards Dorit and Erika. When her daughters are brought up in conversation, Lisa bares all and addresses Garcelle's implication that she has a need for attention. Teddi reflects on the exhilarating joys and crippling fears of parenthood during a pandemic. A defiant Denise comes under fire for her connection to Brandi Glanville, but Garcelle and Dorit maintain their loyalty and quickly come to her defense."
      },
      {
        "id": "tvmaze:1921476",
        "title": "Reunion Part 3",
        "season": 10,
        "episode": 19,
        "released": "2020-09-16",
        "overview": "The reunion concludes as Denise finally tells the women the truth about her friendship with Brandi. A defensive Garcelle is questioned for not supporting Erika's Broadway debut, while Erika and the others voice their crushing concerns about Denise's marriage. The women discuss what needs to happen amongst the group for them to be able to move forward as friends."
      },
      {
        "id": "tvmaze:1932756",
        "title": "Secrets Revealed",
        "season": 10,
        "episode": 20,
        "released": "2020-09-23",
        "overview": "In never-before-seen footage from Season 10, the story behind Denise's \"Bravo, Bravo, F---ing Bravo\" moment is finally revealed. Dorit faces mediation for her highly publicized lawsuit. Garcelle's new house is threatened by wild fires. Meanwhile, Lisa checks out a swanky Hollywood apartment with her daughter Amelia, and Erika hopes to stay in one piece after Kyle takes her for a spin in a vintage car."
      },
      {
        "id": "tvmaze:2083117",
        "title": "Dressed to the 90210s",
        "season": 11,
        "episode": 1,
        "released": "2021-05-19",
        "overview": "After months in isolation, the friends glam it up for a Beverly Hills \"barbecue\" at Dorit's house. Kyle's sister, Kathy Hilton, introduces the group to Crystal Kung Minkoff, wife of Hollywood director Rob Minkoff. Sutton moves into a very familiar rental house while her new home undergoes renovations. When the women are finally able to catch up inperson, Erika sheds light on a very dark summer. Meanwhile, Lisa's abrupt apology leaves Garcelle questioning their friendship."
      },
      {
        "id": "tvmaze:2083118",
        "title": "Two Truths and a Lie",
        "season": 11,
        "episode": 2,
        "released": "2021-05-26",
        "overview": "Lisa Rinna takes the girls on fun getaway to Lake Tahoe. The excitement only lasts so long, however, as it becomes clear that Sutton and Crystal do not see eye to eye. Looking to move forward, Kyle and Garcelle attempt to heal the emotional wounds they inflicted on each other in the past. When Dorit suggests a revealing game of Two Truths and a Lie, Erika's unexpected answers leave her clouded in mystery."
      },
      {
        "id": "tvmaze:2083119",
        "title": "Sutton's Gotta Give",
        "season": 11,
        "episode": 3,
        "released": "2021-06-02",
        "overview": "As the Tahoe getaway continues, Sutton and Crystal's colorful disagreement comes to a head — only to go off the rails again when Sutton feels alienated from the group. Garcelle's bold opinion of a Hilton family member shocks Kyle and Kathy. Dorit gets down and dirty during a rare night out on the town, while Lisa and Erika prank a prankster."
      },
      {
        "id": "tvmaze:2083120",
        "title": "Overexposed",
        "season": 11,
        "episode": 4,
        "released": "2021-06-09",
        "overview": "While in Lake Tahoe, Crystal bares it all — but Sutton is not having it. Meanwhile, a latenight admission from one of the women strikes Kyle as odd; Dorit makes certain denials that no one takes at face value; and Lisa's persistence brings Garcelle to her breaking point. Erika stuns her friends with news about her husband, leaving them confused and completely in the dark."
      },
      {
        "id": "tvmaze:2083121",
        "title": "The Divided States of Erika",
        "season": 11,
        "episode": 5,
        "released": "2021-06-16",
        "overview": "Election night takes a turn when Kyle and Dorit's past issues resurface. Erika's shocking announcement is the topic of conversation at Sutton's Paris-themed luncheon, as the women seek answers trying to make sense of it all. Meanwhile, Crystal opens up about a difficult period in her life, and Lisa gets a thrill playing with her hubby's firehose."
      },
      {
        "id": "tvmaze:2114939",
        "title": "The Liberation of Erika Jayne",
        "season": 11,
        "episode": 6,
        "released": "2021-06-23",
        "overview": "Erika reunites with the ladies for the first time since filing for divorce and explains how she came to such a tough decision. Crystal invites everyone over to make Chinese dumplings, but she and Sutton must first confront their lingering issues from Lake Tahoe. Kyle and Dorit reach a truce, while Garcelle meets with a dating coach to dream up Mr. Right."
      },
      {
        "id": "tvmaze:2119139",
        "title": "Defining Women",
        "season": 11,
        "episode": 7,
        "released": "2021-06-30",
        "overview": "With rumors swirling about her divorce, Erika reveals new details about why she left her husband. A group outing on the town goes up in flames when Kathy unintentionally reignites a dying spark. Meanwhile, Lisa Rinna confronts tabloid rumors of her own, Dorit adds a special piece of art to her collection, and Garcelle's son has strong thoughts about her love life."
      },
      {
        "id": "tvmaze:2122914",
        "title": "The Good, the Bad and the Ugly Leather Pants",
        "season": 11,
        "episode": 8,
        "released": "2021-07-07",
        "overview": "Harry Hamlin's homemade Bolognese sauce spices up Lisa's gathering, but Crystal's non-apology pushes Sutton to her boiling point. Meanwhile, Garcelle's birthday surprise has her wishing big and Kathy has unexpected news for Kyle about their sister, Kim. As Erika settles into her new home, Dorit says \"I do\" to her latest design venture."
      },
      {
        "id": "tvmaze:2126082",
        "title": "A Pretty Meltdown",
        "season": 11,
        "episode": 9,
        "released": "2021-07-14",
        "overview": "Sutton and Crystal continue stirring the sauce at Lisa's Bolognese lunch, as they lay all their lingering issues out on the table. Amid bombshell news tied to her divorce, Erika unexpectedly melts down to Kyle and Garcelle begins to question the truth. Meanwhile, the group is forced into quarantine and Lisa uses the time at home to dig up hidden treasures for her daughters to finally enjoy."
      },
      {
        "id": "tvmaze:2131810",
        "title": "Affairs and Accidents",
        "season": 11,
        "episode": 10,
        "released": "2021-07-21",
        "overview": "Kyle opens her home in La Quinta to the group for a desert getaway, but Erika cannot escape the fallout from her messy divorce. When Lisa questions certain new reports in the media, Dorit offers insights from her own experience. Sutton and Crystal connect with Erika through stories of family loss. Meanwhile, Kathy heats things up in the kitchen – and, with a little help from her friends, cools down in front of a fan."
      },
      {
        "id": "tvmaze:2134728",
        "title": "Ice Queen of the Desert",
        "season": 11,
        "episode": 11,
        "released": "2021-08-04",
        "overview": "Kyle puts on her detective hat to help solve a mystery involving one of the women in La Quinta, while Sutton reveals her secrets for navigating a difficult divorce. Meanwhile, Dorit and Lisa worry about how their friend will fare in her own split. Crystal, Garcelle and Erika find solace on a desert hike, but the peace is shattered when Garcelle reveals details of their private conversation to the entire group."
      },
      {
        "id": "tvmaze:2142896",
        "title": "Circle of Distrust",
        "season": 11,
        "episode": 12,
        "released": "2021-08-11",
        "overview": "Garcelle is in the hot seat when a distraught Erika leaves the trip early, but she refuses to roast alone. On their last day in the desert, the women wake up to a stunning exposé that leaves Kyle, Lisa and Dorit with questions. Meanwhile, Sutton calls an emergency meeting among the group – but not everyone makes the guest list."
      },
      {
        "id": "tvmaze:2144581",
        "title": "Season's Grillings",
        "season": 11,
        "episode": 13,
        "released": "2021-08-18",
        "overview": "Shockwaves from an unexpected news article continue to spread as the ladies try to piece together the truth. Meanwhile, Garcelle serves up a very Haitian holiday meal for her family. When Kyle gathers the ladies for Christmas dinner, holiday cheer turns to jeer as the women press for answers, and Erika realizes that not everyone has her best interests at heart."
      },
      {
        "id": "tvmaze:2155625",
        "title": "Lips Unsealed",
        "season": 11,
        "episode": 14,
        "released": "2021-08-25",
        "overview": "Erika and Lisa help Kyle celebrate her birthday, but the festivities are short-lived when Erika shares more information about her marriage. When Crystal hosts a launch party for Lisa's lip line, tensions between the ladies come to a head, leaving the glossy gathering in need of a touch up. Meanwhile, Kyle and Kathy have a heart-to-heart about their past issues."
      },
      {
        "id": "tvmaze:2159130",
        "title": "The Dinner Party from Hell: Part 2",
        "season": 11,
        "episode": 15,
        "released": "2021-09-01",
        "overview": "Kyle assesses the progress at Sutton's new home, while Dorit hopes her new business venture is the right fit for her family. Crystal invites Erika, Garcelle and Kathy over for a dinner where duck is served, but beef is on the menu. Kathy puts her staff to work arranging an evening to remember, but when Erika and Sutton face off, it quickly becomes a night the ladies would rather forget."
      },
      {
        "id": "tvmaze:2160842",
        "title": "Threats and Promises",
        "season": 11,
        "episode": 16,
        "released": "2021-09-08",
        "overview": "Kathy's dinner party ends abruptly, following a flurry of accusations hurled amongst the women. In the fall out, Garcelle accuses Lisa of never having her back, and Sutton unloads on Kyle for pushing her too far. While Crystal is sympathetic to Erika's reaction, someone close to Dorit takes a more critical approach toward her friend."
      },
      {
        "id": "tvmaze:2171499",
        "title": "A Tale of Two Accidents",
        "season": 11,
        "episode": 17,
        "released": "2021-09-15",
        "overview": "At Kathy's spa day, Erika reveals a shocking story about her family, leaving the group with questions. Meanwhile, Crystal works on her big-ticket basement renovation and Garcelle moves one step closer to finding Mr. Right. Dorit's wedding dress launch is anything but happily ever after, as Sutton and Erika come face-to-face and Garcelle has to answer for a provocative comment."
      },
      {
        "id": "tvmaze:2172246",
        "title": "Del Mar by the Shade",
        "season": 11,
        "episode": 18,
        "released": "2021-09-22",
        "overview": "When the group caravans down the coast for a relaxing girls' weekend, Kyle and Kathy find themselves in the luxurious presidential suite — while Sutton's vacation takes a turn for the worse. New questions arise about Erika at a glamorous picnic on the beach, and she is later devastated by news about her family. Meanwhile, Dorit and Lisa push Garcelle to tears when they question her investment in their friendships."
      },
      {
        "id": "tvmaze:2180084",
        "title": "Over-poured and Over-board",
        "season": 11,
        "episode": 19,
        "released": "2021-09-29",
        "overview": "The trip to Del Mar continues with a tour of local wineries and the ladies getting a taste of another shocking story from Erika. After Crystal and Lisa soak up a unique fitness experience, Sutton questions Kyle and Dorit on their \"alleged\" naivete. Later, a sunset cruise heads for choppy waters as Garcelle suggests a game that puts the women in the hot seat."
      },
      {
        "id": "tvmaze:2180085",
        "title": "New Year, Old Grudges",
        "season": 11,
        "episode": 20,
        "released": "2021-10-06",
        "overview": "Erika heads to dinner with close friends Kyle, Dorit and Lisa, but her mood goes from glad to mad when questions arise. At Crystal's Chinese New Year party, everyone is excited to usher in a change of fortune, but old issues between Lisa and Garcelle threaten to ruin the fun. In the spirit of the night, Sutton offers a warm gesture to Erika, but gets a cold shoulder in return."
      },
      {
        "id": "tvmaze:2188255",
        "title": "Reunion Part 1",
        "season": 11,
        "episode": 21,
        "released": "2021-10-13",
        "overview": "As the reunion kicks off, Erika faces viewers' hard-hitting questions head-on and reveals surprising facts about her life. Crystal reluctantly admits a commonality she shares with Sutton, while Kyle brings up a burning complaint about her former tenant. Garcelle defends her passive-aggressive jabs at Dorit – and then shocks Lisa with an alarming accusation."
      },
      {
        "id": "tvmaze:2194398",
        "title": "Reunion Part 2",
        "season": 11,
        "episode": 22,
        "released": "2021-10-20",
        "overview": "Erika surprises the ladies when she divulges juicy new details about her difficult marriage and divorce. Dorit acknowledges that talking too much has gotten her into trouble in the past. Lisa reveals new details about her daughter's very public breakup. Meanwhile, Kathy breaks down while reminiscing about her and Kyle's mother."
      },
      {
        "id": "tvmaze:2198894",
        "title": "Reunion Part 3",
        "season": 11,
        "episode": 23,
        "released": "2021-10-27",
        "overview": "The reunion continues with emotions on high, as Kyle and Kathy discuss the years they spent apart and their eventual reconciliation. Crystal reflects on her struggles with Sutton and the heartbreaking racism she encountered this year. Erika expresses her hurt over what she describes as Kyle and Dorit \"mocking\" her life."
      },
      {
        "id": "tvmaze:2203704",
        "title": "Reunion Part 4",
        "season": 11,
        "episode": 24,
        "released": "2021-11-03",
        "overview": "As the reunion concludes, Lisa sounds off on her support of Erika and expresses remorse about how she's treated friends in the past. Garcelle and Sutton hold Erika accountable for the threatening comments she made this season. Erika fires back at the onslaught of tough questions and finally shares what her future holds."
      },
      {
        "id": "tvmaze:2309030",
        "title": "The Break-In",
        "season": 12,
        "episode": 1,
        "released": "2022-05-11",
        "overview": "After Dorit survives a harrowing robbery at home, Kyle brings the ladies together to rally around their friend. While Sutton and Crystal finally see eye-to-eye, a very public diss leaves Lisa seeing red. Erika is excited for a fresh start following a difficult year, but that does not stop Garcelle from asking tough questions."
      },
      {
        "id": "tvmaze:2328944",
        "title": "Receipt Offender",
        "season": 12,
        "episode": 2,
        "released": "2022-05-18",
        "overview": "Dorit and PK try to pick up the pieces following their traumatic home invasion. While Sutton and Crystal's new friendship continues over cake tasting, Lisa lets Kyle know someone has left a bad taste in her mouth. At Harry's party, the glamorous Diana Jenkins makes a rich first impression. The evening is spoiled, however, when issues rise to the surface. Garcelle is dismayed to discover that Erika has not let go of their past grievances."
      },
      {
        "id": "tvmaze:2332711",
        "title": "There's Sutton about Crystal",
        "season": 12,
        "episode": 3,
        "released": "2022-05-25",
        "overview": "Kyle invites her friends to the desert for the launch of her new store. Sutton apologizes to Dorit for seeming unsympathetic following her traumatic home invasion. Garcelle urges the women to be up front with each other. While Erika and Diana point out that all their problems share a common denominator, Crystal winds up triggered by a past offense and Lisa feels they're all missing the point."
      },
      {
        "id": "tvmaze:2336787",
        "title": "The Crystal Conundrum",
        "season": 12,
        "episode": 4,
        "released": "2022-06-01",
        "overview": "Crystal talks through her differences with the group, but the conversation takes an unexpected detour when she brings up old wounds — a stunning revelation that leaves Kyle completely confused. Erika tries to justify her stance on Tom's legal situation, but Garcelle isn't impressed. Lisa's world is turned upside down by a family tragedy, Dorit begins therapy and Diana is confused by Sutton's dietary choices."
      },
      {
        "id": "tvmaze:2338197",
        "title": "In Hot Water",
        "season": 12,
        "episode": 5,
        "released": "2022-06-08",
        "overview": "Kyle and Garcelle attempt to get to the bottom of the alleged \"dark comments\" Sutton made a year ago, but Crystal refuses to divulge what was said. Lisa suffers a devastating loss. Diana sweetens the trip to Mexico by chartering a private jet, but the getaway may not be enough to ease Dorit's ongoing anxiety. Erika and Lisa's comments push Sutton to a breaking point."
      },
      {
        "id": "tvmaze:2338962",
        "title": "High Cries and Misty Demeanors",
        "season": 12,
        "episode": 6,
        "released": "2022-06-15",
        "overview": "As the Mexico getaway continues, Dorit struggles to work through her robbery-related anxiety while Lisa sees signs of her mother flying all around her. Kyle and Garcelle are convinced they're being manipulated by Crystal, who is also hearing from Erika that she needs to stand up for herself. Sutton snaps at Diana, pushing their new friendship to the breaking point."
      },
      {
        "id": "tvmaze:2338963",
        "title": "Ship-Faced",
        "season": 12,
        "episode": 7,
        "released": "2022-06-22",
        "overview": "The women set sail aboard Dorit's luxury yacht in Mexico, but Erika goes overboard with her partying and winds up three sheets to the wind. Diana admits to Kyle that her temper is still burning hot at Sutton. Garcelle springs a surprise on Lisa, who turns the tables with a stunning admission of her own. Crystal vows to stop holding onto the past."
      },
      {
        "id": "tvmaze:2351378",
        "title": "It Takes a Villain",
        "season": 12,
        "episode": 8,
        "released": "2022-06-29",
        "overview": "Crystal unpacks the outcome of the Mexico trip with Rob and Jeff, and Dorit finds comfort in her mother, who is in town for an extended visit. Meanwhile, Erika works on growing a new business venture. A text message sends shock waves through the group, leaving Kyle to wonder who will attend Garcelle's upcoming birthday party. At the celebration, Sutton comes face to face with Diana and her pointed questions reveal a side of the newcomer no one has seen before."
      },
      {
        "id": "tvmaze:2356850",
        "title": "Calamity Jayne",
        "season": 12,
        "episode": 9,
        "released": "2022-07-06",
        "overview": "Erika lands in hot water with Garcelle over some choice words. Kyle tries to atone for some words of her own. Lisa is amused by Diana's new look. Crystal tries to help Dorit with her ongoing anxieties. A sinking feeling sets in at Sutton's housewarming party when the hostess and her guests find themselves literally sinking into the backyard mud."
      },
      {
        "id": "tvmaze:2358585",
        "title": "So You Say",
        "season": 12,
        "episode": 10,
        "released": "2022-07-13",
        "overview": "As Sutton's garden party finds itself in the weeds after Lisa's outburst, Erika seeks forgiveness from Garcelle for her past indiscretions. Meanwhile, Crystal gets involved in Sutton's love life and Kyle is left reeling by an accusation she does not agree with. Dorit finds comfort in Hanukkah traditions, but a frigid lunch has Diana feeling anything but the holiday spirit."
      },
      {
        "id": "tvmaze:2364716",
        "title": "The Weight of Words",
        "season": 12,
        "episode": 11,
        "released": "2022-07-20",
        "overview": "Dorit fangirls over Jamie Lee Curtis, who is a special guest at Kyle's charity luncheon. An eye-opening social media post throws attention on Crystal. Sutton comes to the conclusion that some friendships are not meant to be. Lisa is intrigued by a conversation Erika recently had with her estranged husband. At Diana's holiday party, Kathy Hilton makes a return appearance and Garcelle is shocked by an inappropriate joke."
      },
      {
        "id": "tvmaze:2364717",
        "title": "Beverly Hills Blackout",
        "season": 12,
        "episode": 12,
        "released": "2022-07-27",
        "overview": "Diana apologizes to Garcelle for acting out at her birthday party. Lisa has a frank conversation with Erika about her recent behavior. Kathy's prank annoys but doesn't surprise Kyle. Dorit isn't happy about PK's brush with the law and makes her feelings clear. Sutton dips her toes into the dating pool and makes a memorable impression on her Bumble match."
      },
      {
        "id": "tvmaze:2370467",
        "title": "Rosé Colored Glasses",
        "season": 12,
        "episode": 13,
        "released": "2022-08-03",
        "overview": "Garcelle takes her concerns about Erika to Dorit — then asks a surprising question about Dorit's personal life. Erika makes a stunning revelation that will surely whip up some excitement in her life. Lisa invites the women to sip on rosé, but her past resentment towards Sutton uncorks itself in a big way."
      },
      {
        "id": "tvmaze:2371081",
        "title": "Shameless Not Ruthless",
        "season": 12,
        "episode": 14,
        "released": "2022-08-10",
        "overview": "Dorit throws a charity dinner to benefit the homeless, but there is little goodwill between Lisa and Sutton. When Lisa's anger turns to tears, her friends rally to her side in her time of need. Crystal opens up about her health, expecting support from the women, but is stunned to face questions instead. Erika's patience is stretched thin when Kyle reveals Garcelle criticized her drinking. After a turbulent year, Diana and Asher plan for a more harmonious future."
      },
      {
        "id": "tvmaze:2373955",
        "title": "Disco Inferno",
        "season": 12,
        "episode": 15,
        "released": "2022-08-17",
        "overview": "As Dorit's charity dinner continues, Crystal addresses troubling rumors she's been hearing. Sutton objects to a hurtful label and drops a bombshell in return. The ladies boogie down at Lisa's disco event where Kathy keeps putting her foot in her mouth. Kyle tries to get Erika and Sutton to face the music. Garcelle is called out for pushing a narrative but stands her ground and then some."
      },
      {
        "id": "tvmaze:2381203",
        "title": "Altitude Adjustment",
        "season": 12,
        "episode": 16,
        "released": "2022-08-31",
        "overview": "Kyle charters a private plane and flies the women to Aspen in style, but Dorit packs emotional baggage along with her snow pants. The mountain weather isn't the only thing that's cold, as Garcelle and Sutton ice out Erika in a very public fashion. Kyle's ski chalet goes from cozy to creepy when Rinna summons the spirits with a Ouija board. Diana and Sutton's feud is rekindled after a combustible word leaves the ladies fuming."
      },
      {
        "id": "tvmaze:2388520",
        "title": "The Girl With the Diamond Earrings",
        "season": 12,
        "episode": 17,
        "released": "2022-09-07",
        "overview": "The ladies hit the slopes in Aspen, where Dorit proves to be shaky on her skis. Sutton goes snowmobiling but is really revved up about Diana. Garcelle broaches a very touchy subject with Erika at dinner. Back at the house, Rinna wants everyone to chill out, but things get heated when Kyle and Crystal confront Erika about her perceived lack of empathy."
      },
      {
        "id": "tvmaze:2393405",
        "title": "Rocky Mountain Bye",
        "season": 12,
        "episode": 18,
        "released": "2022-09-14",
        "overview": "Kyle plans the perfect Aspen day, but tempers run hot after Erika gives her the cold shoulder. While Diana and Garcelle pick sides, Dorit finds herself caught in the middle. Crystal and Sutton go hat shopping, where flames get fanned when Lisa snubs Kathy. After tears and turmoil, the group tries to rally for a fun final night, but one woman's after-hours behavior ruins the night for everyone."
      },
      {
        "id": "tvmaze:2397905",
        "title": "We Need to Talk About Kathy",
        "season": 12,
        "episode": 19,
        "released": "2022-09-21",
        "overview": "When Kathy skips the flight home from Aspen, whispers surface about a meltdown directed at Kyle that took place the night before. Back in Beverly Hills, Erika tells Dorit she's hurt that Garcelle talked behind her back and vows to say it to her face. Sutton and the others don flapper dresses for Crystal's swank Roaring 20s birthday party. However, when Kathy arrives as if nothing is amiss, Lisa heads for the exit, and Erika decides to share what she heard."
      },
      {
        "id": "tvmaze:2399333",
        "title": "Silence Is Golden",
        "season": 12,
        "episode": 20,
        "released": "2022-09-28",
        "overview": "Erika throws a pop-up product launch where Diana receives a legendary phone call, but the hairiest situation remains the fallout from Aspen. While Dorit and Crystal question old friendships, Erika and Sutton build a new connection over fancy bubbles and casual biscuits. Kathy faces Kyle to apologize and move forward, but Lisa's arrival threatens the bonds between friends and sisters alike."
      },
      {
        "id": "tvmaze:2408165",
        "title": "Not My Sister's Keeper",
        "season": 12,
        "episode": 21,
        "released": "2022-10-05",
        "overview": "Garcelle celebrates her success with a big party and makes an even bigger purchase with some encouragement from Sutton and Crystal. Lisa's refusal to accept Kathy's apology leaves Kyle holding the bag for her sister. As the ladies are draped in diamonds at Kyle's charity gala, stories swirl in the tabloids and Dorit wonders if there is a leak in their circle. Erika and Lisa continue to call out Kathy, leaving Kyle to question if any of her friends can truly be trusted."
      },
      {
        "id": "tvmaze:2413653",
        "title": "Reunion Part 1",
        "season": 12,
        "episode": 22,
        "released": "2022-10-12",
        "overview": "A surprise visit from a special guest kicks off the chicest Beverly Hills reunion yet. Dorit revisits trauma from her home invasion. Kyle, Lisa and Erika challenge Crystal's contradictory statements about Sutton's dark comments. Garcelle admits to bad deeds. Tempers boil over when Kyle comes to Diana's defense."
      },
      {
        "id": "tvmaze:2415435",
        "title": "Reunion Part 2",
        "season": 12,
        "episode": 23,
        "released": "2022-10-19",
        "overview": "As the reunion continues, Garcelle and Diana hit a point of no return in their already frayed friendship. Sutton reflects on her ongoing tension with Lisa, who updates the women on her grieving process. Garcelle discovers the trashy truth behind Erika's book review. As Kyle anxiously anticipates her sister's arrival, Kathy Hilton arrives with tequila in tow."
      },
      {
        "id": "tvmaze:2415436",
        "title": "Reunion Part 3",
        "season": 12,
        "episode": 24,
        "released": "2022-10-26",
        "overview": "The reunion concludes as Erika is tasked with answering for her questionable decisions, both legally and otherwise. Kathy finally comes face to face with Erika and Lisa to confront their allegations over what went down in Aspen. Kyle gets drawn into the middle of a battle between her friends and her sister. The dynamic between Kathy and Kyle takes center stage as their relationship hangs in the balance."
      },
      {
        "id": "tvmaze:2658638",
        "title": "The Eaglewoman Has Landed",
        "season": 13,
        "episode": 1,
        "released": "2023-10-25",
        "overview": "Dorit hosts the ladies at a retreat; Erika seeks to rebuild her life following her husband's indictment; Garcelle tries to navigate her relationships with her teenage boys; Kyle's new focus on self-care offers a sobering look at her home life."
      },
      {
        "id": "tvmaze:2672682",
        "title": "An Unwise Surprise",
        "season": 13,
        "episode": 2,
        "released": "2023-11-01",
        "overview": "Erika apologizes for spilling tea about Dorit's marriage, but PK's glitzy anniversary surprise may land him in hot water with his wife; Sutton seeks help from a matchmaker, but soon realizes that finding Mr. Right may be difficult."
      },
      {
        "id": "tvmaze:2679155",
        "title": "It's Not About the Pants",
        "season": 13,
        "episode": 3,
        "released": "2023-11-08",
        "overview": "Las Vegas starts with a bang as the women hold an intervention for Sutton, who is disappointed with her dating life. Erika treats the group to a VIP experience at a sexy show for Crystal's 40th birthday, but Sutton's reaction surprises the ladies. Kyle's new workout routine raises questions. Garcelle opens up old wounds with Dorit."
      },
      {
        "id": "tvmaze:2679156",
        "title": "Hellevator",
        "season": 13,
        "episode": 4,
        "released": "2023-11-15",
        "overview": "The women recover after a meltdown in Las Vegas, but Erika's elevator callout of Sutton leaves everyone floored. Dorit and Garcelle want Kyle to put her cards on the table about her marriage. The women celebrate Crystal's birthday with a bull-riding bonanza at a country bar. Back in Beverly Hills, Kyle's friendly checkup on Sutton ends with major accusations."
      },
      {
        "id": "tvmaze:2685931",
        "title": "Sutton-ly Suspicious",
        "season": 13,
        "episode": 5,
        "released": "2023-11-22",
        "overview": "Still reeling from their tense exchange, Sutton isn't horsing around when she brings up rumors about Kyle's marriage. Erika comes to terms with her painful past during a tense visit from her mom. Crystal gets a tough talking to about her control issues with her brother. Garcelle throws a star-studded screening for her new movie, which is a night of celebration and major frustration for some of the ladies."
      },
      {
        "id": "tvmaze:2685932",
        "title": "Ring Around the Rumor",
        "season": 13,
        "episode": 6,
        "released": "2023-11-29",
        "overview": "Kyle seeks insight into Sutton's confusing behavior. Dorit pours out a strong opinion of her own. Erika presses forward with reviving her public image. Garcelle is stunned when her son makes an admission about her divorce. After leaving her mark on country singer Morgan Wade, Kyle is confronted by Sutton about the state of her marriage."
      },
      {
        "id": "tvmaze:2692488",
        "title": "Dazed and Accused",
        "season": 13,
        "episode": 7,
        "released": "2023-12-06",
        "overview": "As the weed dinner continues, Kyle and Sutton's friendship seems to go up in smoke. Garcelle and Crystal struggle to make sense of Denise's showdown with Erika. Dorit schools PK on their children's future. Feeling let down by her friends, Kyle turns to sister Kim for support and advice about her family."
      },
      {
        "id": "tvmaze:2697782",
        "title": "Esopha-gate",
        "season": 13,
        "episode": 8,
        "released": "2023-12-13",
        "overview": "Crystal calls out Dorit for spreading rumors behind Sutton's back, leaving both women fuming. Kyle seeks guidance from her life coach about her struggles with grief. Garcelle spends time with Jaid and his new girlfriend over dinner. Erika shares good news with her mother. The ladies come together to celebrate the anniversary of Sutton's boutique as nurse anesthetist Annemarie goes toe to toe with her most difficult patient yet."
      },
      {
        "id": "tvmaze:2718653",
        "title": "A Feisty Fiesta",
        "season": 13,
        "episode": 9,
        "released": "2023-12-20",
        "overview": "After enlisting a matchmaker, Sutton tries her not-so-steady hand at dating. Annemarie reveals which first impression left a bad taste in her mouth. Dorit is shocked at how far Kyle has waded into a new friendship. Tensions flare at Crystal's Taco Tuesday between Dorit, Sutton, Crystal and Garcelle. Erika comes to a boiling point with Denise."
      },
      {
        "id": "tvmaze:2719246",
        "title": "Re-Lentless Erika",
        "season": 13,
        "episode": 10,
        "released": "2024-01-03",
        "overview": "Crystal's Taco Tuesday heats up when Denise's return brings back Erika's fiery side. After rehearsing with her matchmaker, Sutton finds herself in tune with a new date. A tearful Kim asks Kyle to make amends with Kathy. After a war over words, Dorit and Garcelle meet one on one to hear each other out."
      },
      {
        "id": "tvmaze:2719247",
        "title": "A Celebration of Life",
        "season": 13,
        "episode": 11,
        "released": "2024-01-10",
        "overview": "The women head to Ojai for Annemarie's birthday as frosting isn't the only thing Sutton is licking. Dorit questions her marriage after PK's shocking admission in therapy. Garcelle's frank conversation with her boys sends them into a tizzy. Kyle hosts a celebration of life event for her late friend."
      },
      {
        "id": "tvmaze:2719248",
        "title": "Bitter Pill to Swallow",
        "season": 13,
        "episode": 12,
        "released": "2024-01-17",
        "overview": "Kyle and Sutton unpack the group dynamics; Erika sets out to rebuild her career; Dorit reintroduces the group to Homeless Not Toothless; Crystal finds her voice when confronting Annemarie."
      },
      {
        "id": "tvmaze:2719249",
        "title": "Tapas and Tattletales",
        "season": 13,
        "episode": 13,
        "released": "2024-01-24",
        "overview": "Adios Beverly Hills, hola España! Sutton takes the ladies on a fabulous getaway to Barcelona where Garcelle fears supernatural houseguests. Kyle's bold fashion choices leave Dorit questioning this new Kyle. Annemarie puts Crystal in the hot seat for talking behind the group's back."
      },
      {
        "id": "tvmaze:2719250",
        "title": "Aches and Spains",
        "season": 13,
        "episode": 14,
        "released": "2024-01-31",
        "overview": "Hearts are racing after Crystal's medical emergency, but nurse anesthetist Annemarie comes to the rescue. Dorit opens up to Garcelle, allowing the two to finally move forward. Disappointed in her friends, Erika gets tipsy ahead of dinner but wows the group with her erudite observations at the table. While planning her healing ceremony, Sutton is overwhelmed by old emotions, forcing her to find comfort in an unlikely friend."
      },
      {
        "id": "tvmaze:2761023",
        "title": "Ashing It Out",
        "season": 13,
        "episode": 15,
        "released": "2024-02-07",
        "overview": "Sutton holds a healing ceremony for the group to let go of the past, but a shocking admission stirs up old grudges. The ladies say adios to Spain with a Flamenco dinner where Annemarie asks tough questions. Back in Beverly Hills, Kyle opens up to Dorit about the cracks in her once rock-solid relationship."
      },
      {
        "id": "tvmaze:2761024",
        "title": "Diamond in the Rough",
        "season": 13,
        "episode": 16,
        "released": "2024-02-14",
        "overview": "Fresh off their trip in Spain, Sutton gets back in the saddle, both with her new horse and a second date. Garcelle agrees to give her boys more freedom, even as they prove they're not quite ready for adulthood. Annemarie throws a blinged-out brunch where she and Crystal finally put their issues to bed. Erika's tearful accusations leave Kyle and Dorit questioning their friendship."
      },
      {
        "id": "tvmaze:2765916",
        "title": "Soirees and Separations",
        "season": 13,
        "episode": 17,
        "released": "2024-02-21",
        "overview": "After a tough year, Sutton celebrates her success with an over-the-top shopping day. PK's continued absence leaves Dorit questioning her progress … and their marriage. The White Party is back and bigger than ever as Garcelle, Crystal and Annemarie get ready to watch Erika hit the stage at SoFi Stadium. A shocking headline forces Kyle to reckon with her marriage and leaves all of Beverly Hills questioning her truth."
      },
      {
        "id": "tvmaze:2765917",
        "title": "Reunion Part 1",
        "season": 13,
        "episode": 18,
        "released": "2024-02-28",
        "overview": "In the midst of shocking headlines and hurt feelings, the diamonds of Beverly Hills come face-to-face for a tense reunion. Kyle addresses Erika's past comment about wanting Andy to \"eviscerate\" her on the couch. Dorit confronts Kyle about an ominous text message she received and the current state of their \"close\" friendship. Garcelle challenges Dorit and attempts to burst her bubble in order to get through to her. Annemarie swallows her pride when she apologizes to Sutton, but Crystal proves to be her most difficult patient yet."
      },
      {
        "id": "tvmaze:2765918",
        "title": "Reunion Part 2",
        "season": 13,
        "episode": 19,
        "released": "2024-03-06",
        "overview": "The reunion continues as Sutton and Kyle's issues come to a head, jeopardizing their friendship like never before."
      },
      {
        "id": "tvmaze:2765919",
        "title": "Reunion Part 3",
        "season": 13,
        "episode": 20,
        "released": "2024-03-13",
        "overview": "The reunion concludes with a surprise appearance from familiar face Kathy Hilton, whose presence draws mixed reactions from the ladies."
      },
      {
        "id": "tvmaze:3035515",
        "title": "Grace Time is Over",
        "season": 14,
        "episode": 1,
        "released": "2024-11-19",
        "overview": "The women of Beverly Hills are back and change is in the air! Erika is reinventing her home and herself, Garcelle is taking on new roles and Kyle is navigating life post-separation. Dorit is experiencing the biggest change of all – after nine years of marriage she and PK are separating. The split sparks Dorit to be more outspoken than ever, especially with regards to her friendships. The women wear their bizarre best to Sutton's Surrealist Ball where new friend Bozoma makes a stunning entrance."
      },
      {
        "id": "tvmaze:3058446",
        "title": "A Sobering Separation",
        "season": 14,
        "episode": 2,
        "released": "2024-11-26",
        "overview": "After an ungraceful conclusion to the Surrealist Ball, Kyle and Dorit's fractured friendship remains hanging in the balance. Bozoma opens up about how she turns tragedy into triumph. While Garcelle is away working in Atlanta, Sutton and Erika join forces to dole out a slice of divorce advice for Kyle. Dorit and PK take a sobering look at their marriage and separation."
      },
      {
        "id": "tvmaze:3058447",
        "title": "Life's a Beach",
        "season": 14,
        "episode": 3,
        "released": "2024-12-03",
        "overview": "Calling all beach babes! Kathy's Oceanside, Calif., getaway promises to be a luxurious escape, but it's far from smooth sailing. PK's sudden silence causes Dorit to open up to Bozoma, but Garcelle and Sutton are left questioning this new friendship. Fun beach games bring the laughs, but the tension between Kyle and Dorit spills over at dinner, leaving everyone with a bad taste in their mouth."
      },
      {
        "id": "tvmaze:3058448",
        "title": "Twisted Sisterhood",
        "season": 14,
        "episode": 4,
        "released": "2024-12-10",
        "overview": "The girls' Oceanside getaway gets derailed when a tense exchange between Dorit and Kyle leaves the two at an impasse. On a boat trip, Garcelle feels adrift over her soon-to-be empty nest. Sutton helps Dorit navigate rough waters in her separation. At the final dinner, Boz and Erika are left questioning the future of the group, but Sutton tries to bind the women together through sisterhood."
      },
      {
        "id": "tvmaze:3060479",
        "title": "High Horses and Low Blows",
        "season": 14,
        "episode": 5,
        "released": "2024-12-17",
        "overview": "The sand settles after Oceanside, but the ladies return home with unresolved feelings; Garcelle enjoys her recently finished beach house; Erika navigates deep-rooted emotions with her therapist; Boz defends Dorit when Sutton delivers some low blows."
      },
      {
        "id": "tvmaze:3071334",
        "title": "Venom in the Viper Room",
        "season": 14,
        "episode": 6,
        "released": "2025-01-07",
        "overview": "Love is in the air for Boz and her new boyfriend, but Dorit and PK can't say the same."
      },
      {
        "id": "tvmaze:3076022",
        "title": "What the Chuck?",
        "season": 14,
        "episode": 7,
        "released": "2025-01-14",
        "overview": "The fangs are out at the Viper Room, where tensions are high between Kyle and Dorit; Bozoma navigates the next step in her fertility journey with her man by her side."
      },
      {
        "id": "tvmaze:3115578",
        "title": "A Perfect Storm Out",
        "season": 14,
        "episode": 8,
        "released": "2025-01-21",
        "overview": "Bozoma hosts a healing spa day for the ladies that proves to be anything but serene; Garcelle receives a long overdue apology; Kyle is confronted with mounting suspicions."
      },
      {
        "id": "tvmaze:3115579",
        "title": "Beachy Keen",
        "season": 14,
        "episode": 9,
        "released": "2025-01-28",
        "overview": "Garcelle invites the ladies to her beach house; Dorit continues to confide in Boz; Kyle tries to explain herself to Garcelle and Sutton."
      },
      {
        "id": "tvmaze:3115580",
        "title": "Sweet Home Augusta",
        "season": 14,
        "episode": 10,
        "released": "2025-02-04",
        "overview": "While Kyle gets emotional over her new life, Bozoma tries to make sense of her new future with her man. Sutton plans a trip back home to Augusta with Garcelle and Kyle."
      },
      {
        "id": "tvmaze:3143609",
        "title": "Mind Your Business",
        "season": 14,
        "episode": 11,
        "released": "2025-02-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3152128",
        "title": "Land of the Free, Home of the Shade",
        "season": 14,
        "episode": 12,
        "released": "2025-02-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3156942",
        "title": "Caviar Catastrophe",
        "season": 14,
        "episode": 13,
        "released": "2025-02-25",
        "overview": "Bozoma's hopes for her fertility journey are met with a reality check; shocking photos leave Garcelle and Erika seeking answers."
      },
      {
        "id": "tvmaze:3156943",
        "title": "Hemlines and Headlines",
        "season": 14,
        "episode": 14,
        "released": "2025-03-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3170666",
        "title": "Trouble in Paradise",
        "season": 14,
        "episode": 15,
        "released": "2025-03-11",
        "overview": "Kyle and Mauricio speak face-to-face for the first time since he was photographed with another woman."
      },
      {
        "id": "tvmaze:3170792",
        "title": "Sutton on Trial at Sea",
        "season": 14,
        "episode": 16,
        "released": "2025-03-18",
        "overview": "As Boz's trip to Saint Lucia heats up, Sutton apologizes to Dorit for her poor use of words at Jennifer's dinner party, but Dorit finds the apology a day late and a dollar short; Kyle faces the music."
      },
      {
        "id": "tvmaze:3170793",
        "title": "A Caribbean Send Off",
        "season": 14,
        "episode": 17,
        "released": "2025-03-25",
        "overview": "A catamaran ride ends in rough waters as Sutton finds herself searching for a buoy of support; Garcelle questions Kyle's loyalty and Jennifer calls out a conspiracy, leaving Erika and Dorit seeing red."
      },
      {
        "id": "tvmaze:3181906",
        "title": "Reunion Part 1",
        "season": 14,
        "episode": 18,
        "released": "2025-04-01",
        "overview": "On the heels of a tumultuous season, the ladies of Beverly Hills reunite to work through hurt feelings and shocking allegations. Dorit speaks out about her separation and feeling unsupported by Kyle, but a surprise statement leaves her at a loss for words. Bozoma responds to those questioning her relationship with Keely and accusations that she was being manipulated by Dorit. Garcelle has to answer for hurtful insinuations she made throughout the year."
      },
      {
        "id": "tvmaze:3194730",
        "title": "Reunion Part 2",
        "season": 14,
        "episode": 19,
        "released": "2025-04-08",
        "overview": "The reunion continues as Kyle and Dorit face off over Kyle's texts to PK, putting more strain on their already fragile friendship. Boz stands firm on her claim that one of the women is not telling the truth. The fabulous Jennifer Tilly joins the action, but it isn't all diamonds and caviar when she's called out for her shady comments. Sutton is put in the hot seat, first by the arrival of Kathy Hilton and then for short-changing the size of Dorit's wallet."
      },
      {
        "id": "tvmaze:3194731",
        "title": "Reunion Part 3",
        "season": 14,
        "episode": 20,
        "released": "2025-04-15",
        "overview": "As the reunion concludes, Sutton and Dorit continue to go head-to-head. Erika is forced to confront Tom's damning conviction and also reveals how this saga has impacted her relationship with her son. Kyle tearfully explores the end of her marriage, while big sister Kathy struggles to wrap her head around it. Just as the night is drawing to a close, one Housewife storms off, leaving the rest of the women stunned and confused."
      },
      {
        "id": "tvmaze:3432870",
        "title": "Hot Girl Summer",
        "season": 15,
        "episode": 1,
        "released": "2025-12-04",
        "overview": "Dorit has recently filed for divorce and opens up to the ladies about her ex, their children and if she's ready for a Hot Girl Summer. Kyle is planning Alexia's wedding and navigating life with Mauricio. Sutton must reassess her friendships in the group after being cut off by her former bestie. A familiar face makes a fashionable entrance at Kyle's Summer Solstice Party as Kathy arrives with Rachel Zoe."
      },
      {
        "id": "tvmaze:3470210",
        "title": "Bearing It All",
        "season": 15,
        "episode": 2,
        "released": "2025-12-11",
        "overview": ""
      }
    ]
  }
}