{
  "meta": {
    "id": "tvmaze:36765",
    "type": "series",
    "name": "Girl Meets Farm",
    "description": "A transplant from city to farm life who has embraced her new home, Molly Yeh welcomes viewers to her cozy farmhouse on the Minnesota/North Dakota border and shares her love for the country life. The series celebrates the very best of Molly's food, with recipes inspired by her Jewish and Chinese heritage and a taste of the Midwest.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/562/1406206.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/562/1406206.jpg",
    "videos": [
      {
        "id": "tvmaze:3433733",
        "title": "Party Bites for Any Night!",
        "season": 15,
        "episode": 12,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3456097",
        "title": "A Colossally Cozy Dinner",
        "season": 15,
        "episode": 13,
        "released": "2025-12-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3433732",
        "title": "10 Glorious Years",
        "season": 15,
        "episode": 11,
        "released": "2025-12-07",
        "overview": "Molly Yeh and Nick celebrate their 10-year wedding anniversary with some nostalgic favorites! She prepares Prosciutto and Swiss Croissant Strata, Loaded Avocado Hashbrowns with Salsa Macha, a Creamy Fruit Salad \"Cocktail\" and PB and Raspberry J Blondies. Cheers to 10 years of food, fun, and romance!"
      },
      {
        "id": "tvmaze:1467941",
        "title": "Farm Brunch Anniversary",
        "season": 1,
        "episode": 1,
        "released": "2018-06-24",
        "overview": "Molly Yeh is making a special brunch for the family to celebrate her and her husband Nick's third wedding anniversary. There's Shakshuka with Feta, Brussels Sprout and Bacon Hash, Roasted Potatoes with Paprika Mayo and Grilled Cheese with Everything Bagel Seasoning. For dessert, Molly's making her pretty Pocket Pastries with Raspberry Jam."
      },
      {
        "id": "tvmaze:1479779",
        "title": "New Farm Traditions",
        "season": 1,
        "episode": 2,
        "released": "2018-07-01",
        "overview": "Molly Yeh is putting a fresh spin on the classic farm lunch. There's her easy Garlic and Onion Challah Bread,Chopped Salad with Crumbled Feta and her all-time favorite Creamy Homemade Hummus. For a sweet bite, Molly's making Olive Oil Blondies with Chocolate Frosting and sprinkles!"
      },
      {
        "id": "tvmaze:1479780",
        "title": "Girl's Brunch",
        "season": 1,
        "episode": 3,
        "released": "2018-07-08",
        "overview": "Molly Yeh treats her girlfriends to her favorite brunch dishes after a night out in Grand Forks. There's Mini Quiches with Peas and Bacon, Garlicky Lemony Kale and a Dark Chocolate Scone Loaf with Marzipan for a sweet treat. Finally, Molly makes a refreshing Fresh Mint Iced Coffee for a morning pick-me-up."
      },
      {
        "id": "tvmaze:1479781",
        "title": "Baby Shower",
        "season": 1,
        "episode": 4,
        "released": "2018-07-15",
        "overview": "Molly Yeh makes a delicious buffet spread for her sister-in-law's baby shower. The menu includes \"Walking\" Fish Tacos with Crunchy Cabbage Slaw and Cilantro Dressing, Pigs in a Blanket with Harissa Ketchup and Honey Mustard and her signature meatless Meatball Sliders with a Twist. Molly's Baked Donuts with Rhubarb,Blood Orange and Blueberry glazes then take center stage on the dessert table."
      },
      {
        "id": "tvmaze:1479783",
        "title": "Mom Comes to Town",
        "season": 1,
        "episode": 5,
        "released": "2018-07-22",
        "overview": "Molly Yeh's mom is visiting from Chicago to help with some garden planting and to enjoy a campfire supper. The menu includes Hearty Brisket Tacos with Pink Pickled Onions, Charred Sweet Corn Salsa, Crispy Smashed Potatoes with Chimichurri Dressing and Homemade Raspberry Marshmallows."
      },
      {
        "id": "tvmaze:1479784",
        "title": "Farm Suppers",
        "season": 1,
        "episode": 6,
        "released": "2018-07-29",
        "overview": "Molly Yeh is cooking up her most delicious and memorable suppers from her early days on the farm. She's making two hearty upper-Midwest classics for a weeknight dinner with her husband Nick and his parents including Chicken Pot Hot Dish and a Sweet Cookie \"Salad\" with Homemade Cookies and Mandarins. She then honors her \"Pizza Friday\" tradition by making tasty Sausage and Broccolini Pizza Pockets to be enjoyed out on the tractor with Nick."
      },
      {
        "id": "tvmaze:1496330",
        "title": "Chinese Family Faves",
        "season": 1,
        "episode": 7,
        "released": "2018-08-05",
        "overview": "Molly Yeh is making some tasty family favorites to celebrate a visit from her dad. The menu includes Chicken Pot Stickers with Dipping Sauce, Scallion Pancakes with Maple Carrot Slaw and Green Beans with her versatile Magic Sesame Sauce. The visit ends with Molly and her dad breaking out their instruments for a musical jamming session before enjoying Molly's Sprinkles Cake."
      },
      {
        "id": "tvmaze:1562295",
        "title": "Harvest Party",
        "season": 2,
        "episode": 1,
        "released": "2018-11-11",
        "overview": "It's beet harvest time, and the farm is buzzing. Molly Yeh makes tasty Chocolate Doughnuts with Coffee Glaze to keep the farmers going through their long shifts. Then to celebrate the end of another great harvest, Molly is throwing her annual supper party. She makes hearty Goulash with Bread Dumplings, Roasted Brussels Sprouts with Lemon, Parmesan and Breadcrumbs and, to finish, a Spiced Apple Pie. (Listed as S02E02)"
      },
      {
        "id": "tvmaze:1562296",
        "title": "Thanksgiving",
        "season": 2,
        "episode": 2,
        "released": "2018-11-18",
        "overview": "Molly Yeh is hosting Thanksgiving on the farm with Nick, her mom and a variety of family friends. She's making her foolproof Sweet-and-Smoky Turkey, crunchy Pretzel Stuffing and a delicious side dish of Charred Creamed Corn. Finally, she's getting creative with cranberries for dessert by making her Lemon Almond Cake with Cranberry Glaze. (Listed as S02E01)"
      },
      {
        "id": "tvmaze:1570704",
        "title": "Entertaining the Girls",
        "season": 2,
        "episode": 3,
        "released": "2018-11-25",
        "overview": "Molly Yeh's girlfriends are coming over for dinner so she's preparing her go-to special menu. There's going to be make-ahead sticky Rhubarb Short Ribs, a show-stopping Crispy Saffron Rice dish and a fresh side of Green Beans with Potato Chip Crunch. She then finishes the meal with a sweet treat — Whipped Cheesecakes with Pistachio Crusts"
      },
      {
        "id": "tvmaze:1574077",
        "title": "Holiday Spirit",
        "season": 2,
        "episode": 4,
        "released": "2018-12-02",
        "overview": "Molly Yeh celebrates her favorite time of the year by making a festive buffet for three generations of the family. There are Pastrami Meatballs, Brussels Sprouts Latkes, rolled Potato Flatbreads and her speculoos-inspired Airline Cookie Sheet Cakes. Finally, there's Molly's Mini Marzipan Treats -- a delicious edible gift idea perfect for going under the Christmas tree!"
      },
      {
        "id": "tvmaze:1576388",
        "title": "Apple Harvest",
        "season": 2,
        "episode": 5,
        "released": "2018-12-09",
        "overview": "Molly Yeh's blogging friends are flying in from the west coast to help her pick apples on the farm. She's making the ultimate campfire supper for them that includes Fried Cheesy Pickles and a Butternut, Bacon and Apple Hotdish. There's also Creamed Spinach with Crispy Cheese and Creamy Butterscotch Pudding."
      },
      {
        "id": "tvmaze:1576389",
        "title": "Mom on the Farm",
        "season": 2,
        "episode": 6,
        "released": "2018-12-16",
        "overview": "Molly Yeh's mom is visiting the farm for the weekend, so Molly's cooking a supper with all her mom's favorite dishes, starting with Chicken Paprikash. For sides, she makes Spatzle and Zucchini with Walnut Pesto, and dessert is her cute Stuffed Challah Hedgehogs."
      },
      {
        "id": "tvmaze:1576390",
        "title": "Ladies Who Brunch",
        "season": 2,
        "episode": 7,
        "released": "2018-12-30",
        "overview": "Molly Yeh shares her favorite meal of the day with some of her favorite friends from Grand Forks, N.D. She's making them a brunch feast that includes Mini Kale Shakshuka, a Sweet Potato and Bacon Hash and her make-ahead Baked Challah French Toast. For a little treat they can take home, Molly bakes Sprinkles Biscotti."
      },
      {
        "id": "tvmaze:1586973",
        "title": "Healthy New Year",
        "season": 2,
        "episode": 8,
        "released": "2019-01-06",
        "overview": "Molly Yeh's sister-in-law, Anna, is visiting the farm with her new baby Cliff, and she's asked Auntie Molly to make her favorite healthy meal. Molly gets to work making Hummus with Meat All Over It, homemade Whole Wheat Pita, Pita Salad with Tahini Dressing and, for dessert, Mint Cupcakes with Cream Cheese Frosting."
      },
      {
        "id": "tvmaze:1587752",
        "title": "Pizza Friday",
        "season": 2,
        "episode": 9,
        "released": "2019-01-13",
        "overview": "It's Pizza Friday on the farm, and Molly Yeh and her husband, Nick, are hosting friends for dinner. Molly's making two pizzas using the same delicious dough recipe: Sausage and Kale Pizza and Squash and Ricotta Pizza with fresh squash from the farm. She also makes a Pizza Parlor Salad with Chickpeas to get some greens in, and for dessert, she serves her easy Chocolate Chip Cookie Cake with Buttercream Frosting."
      },
      {
        "id": "tvmaze:1587753",
        "title": "Pantry Faves",
        "season": 2,
        "episode": 10,
        "released": "2019-01-20",
        "overview": "It's a quiet weekend for Molly Yeh and her husband, Nick, on the farm, so Molly's making an inexpensive lunch using her favorite pantry ingredients. She starts with Harissa-Braised Chickpeas with Feta and adds her super easy Yogurt Marinated Chicken Skewers. She also makes Smashed Cucumber Salad with Mint, Tahini Milkshakes and Peanut Butter Krispy Rice Squares with a few sprinkles."
      },
      {
        "id": "tvmaze:1587754",
        "title": "Chinese New Year",
        "season": 2,
        "episode": 11,
        "released": "2019-01-27",
        "overview": "Molly Yeh's family is flying in to celebrate Chinese New Year on the farm, and there will be quite a crowd to feed. Molly's keeping it simple but special with Ginger Glazed Salmon, Carrot Steamed Buns, Peanut Butter Broccolini and, for dessert, her homemade Fortune Cookies."
      },
      {
        "id": "tvmaze:1587755",
        "title": "Big Game",
        "season": 2,
        "episode": 12,
        "released": "2019-02-03",
        "overview": "Molly Yeh's making a pre-game lunch for a few friends, and it's full of delicious finger foods like her easy Asian Scotch Eggs and Crispy Oven Fries with Feta Red Pepper Dip. She also prepares Molly's Mac and Cheese Bar so her friends can personalize their own dishes. For a sweet bite, she makes Peanut Butter Blondie Ice Cream Sandwiches."
      },
      {
        "id": "tvmaze:1587756",
        "title": "Birthday Boys",
        "season": 2,
        "episode": 13,
        "released": "2019-02-10",
        "overview": "Molly Yeh is celebrating two birthdays on the farm -- her husband, Nick, and his dad, Roger. She's making a lunch menu that features both of their favorites, starting with Nick's favorite Chicken Shawarma Tacos served with a tasty Moroccan Carrot Salad. Dessert is chocoholic Roger's dream sweet treat, Chocolate Tahini Cake with Tahini Frosting. Molly also makes them edible gifts with jars of Hazelnut Sugar Cookie Cereal complete with mini heart-shaped cookies and meringues."
      },
      {
        "id": "tvmaze:1632322",
        "title": "New Classics",
        "season": 3,
        "episode": 1,
        "released": "2019-03-31",
        "overview": "Molly Yeh is putting her own spin on some of her favorite dishes to make a fun meal for Nick and her dad. The menu includes Molly's Chicago Dog Meatloaf with Mustard Glaze, a Salt-and-Vinegar Potato Galette and Wedge Salads with Bacon and Feta Cream. She's rounding the meal out with her Dad's Favorite Coconut Cream Pie."
      },
      {
        "id": "tvmaze:1632323",
        "title": "Make-Ahead Meals",
        "season": 3,
        "episode": 2,
        "released": "2019-04-07",
        "overview": "Molly Yeh is preparing make-ahead meals in anticipation of the birth of her first child. There's a freezer-friendly version of Sweet Potato and Black Bean Burritos, Mini Spinach and Artichoke Chicken Casseroles and Potato Bagel Breakfast Sandwiches. She also teaches Nick how to make a super-quick Salmon Sheet Pan Supper with Horseradish Sauce for dinner."
      },
      {
        "id": "tvmaze:1632327",
        "title": "Spring Feast",
        "season": 3,
        "episode": 3,
        "released": "2019-04-14",
        "overview": "Molly Yeh makes a delicious farm spread to celebrate the arrival of spring with her family. She's making Homemade Herbed Pasta with Feta, Lemon and Pine Nuts, hearty Meatballs with Garlic Yogurt and Chimichurri, and Spring Apple and Fennel Salad with Dijon Vinaigrette. For dessert, they'll all enjoy Molly's Carrot Cake with Spiced Cream Cheese Frosting."
      },
      {
        "id": "tvmaze:1632328",
        "title": "Molly's Baby Shower",
        "season": 3,
        "episode": 4,
        "released": "2019-04-21",
        "overview": "It's time for Molly Yeh's baby shower and there's quite a crowd to feed! Molly keeps it simple-but-delicious with her Potato, Sausage and Broccoli Frittata and Herby Salad with Burrata. Next, there's a Baby Shower Bubbly Bar so everyone can toast with or without booze. For a sweet finish, Molly's made Mini Rosewater Trifles with Cardamom Cream and Golden Milk Lattes that double as a hostess gift."
      },
      {
        "id": "tvmaze:1632329",
        "title": "Generational Goodies",
        "season": 3,
        "episode": 5,
        "released": "2019-04-28",
        "overview": "Molly Yeh's mom comes to the farm to share a few family recipes before baby arrives. Molly makes Pastrami Eggrolls as a tribute to her mother's hometown to go with Citrus Chicken Rice Bowls and Grilled Veggies. Together, they make Chocolate Sea Salt Rugelach -- a dish Molly grew up watching her mom make."
      },
      {
        "id": "tvmaze:1644900",
        "title": "Taco Night Twist",
        "season": 3,
        "episode": 6,
        "released": "2019-05-05",
        "overview": "Molly Yeh treats her girlfriends to a taco night done Pizza Friday style! Her menu includes Taco Pizza Al Pastor with Tomatillo Salsa and Avocado Cucumber Salad served alongside Watermelon Agua Fresca. Of course, it wouldn't be taco night without tacos so she's making Chocolate-Covered Ice Cream Tacos to finish off the night."
      },
      {
        "id": "tvmaze:1688168",
        "title": "Outdoor Movie Night",
        "season": 4,
        "episode": 1,
        "released": "2019-09-08",
        "overview": "Molly Yeh makes some of her favorite munchies for an outdoor movie night on the farm. Her Nachos are piled high with BBQ Pulled Pork, and Radishes with Smoked Butter are a unique, crunchy combination. She assembles individual Candy Bar Salads for dessert and whips up a batch of Nick's Favorite Grilled Orange Soda."
      },
      {
        "id": "tvmaze:1713122",
        "title": "New Mom Life",
        "season": 4,
        "episode": 2,
        "released": "2019-09-15",
        "overview": "Molly Yeh makes quick and easy recipes that let her spend more time enjoying her life as a new mom. She starts off with savory Green Pancakes for lunch, and then she's in dinner mode with a hearty Funeral Hotdish and a crunchy Romaine Salad with Breadcrumbs and Simple Dressing. For dessert, she mixes up peanut-buttery Monster Cookie Dough … with sprinkles, of course!"
      },
      {
        "id": "tvmaze:1713123",
        "title": "Jewish New Year",
        "season": 4,
        "episode": 3,
        "released": "2019-09-22",
        "overview": "Molly Yeh's family is in town to celebrate Rosh Hashana, the Jewish new year, and she makes a fabulous brunch to mark the occasion. They'll love her sweet Apple Butter Rolls with Honey Marzipan Frosting, a tender and juicy Brunch Brisket and Carrot Hash with Eggs and Pesto. Molly also makes her Celery Dill Soda Spritz for everyone to toast the new year."
      },
      {
        "id": "tvmaze:1713124",
        "title": "Girl Meets Grill",
        "season": 4,
        "episode": 4,
        "released": "2019-09-29",
        "overview": "Molly Yeh fires up the outdoor grill to make her favorite tailgating recipes with a twist, starting with Spicy Cheddar Juicy Lucies with Homemade Chili Potato Chips and Sesame Avocado Salsa on the side. Grilled Corn on the Cob slathered with a tangy Kimchi Mayo is an irresistible addition, and her highly addictive Miso Caramel Cracker Cookies make the perfect dessert."
      },
      {
        "id": "tvmaze:1713125",
        "title": "Midwest Oktoberfest",
        "season": 4,
        "episode": 5,
        "released": "2019-10-06",
        "overview": "Molly Yeh is hosting Oktoberfest in the Midwest and making all her favorite German-inspired dishes. She starts with Soft Pretzels two ways: Salty with Beer Cheese and Sweet with Cinnamon Sugar. Her main dish is the ultimate crispy Chicken Schnitzel, and she makes a mustardy German Potato Salad loaded with bacon and a beautiful Braised Red Cabbage to serve on the side."
      },
      {
        "id": "tvmaze:1713126",
        "title": "Wheat Harvest",
        "season": 4,
        "episode": 6,
        "released": "2019-10-13",
        "overview": "Everyone is busy with the wheat harvest on the farm, so Molly Yeh is making a meal to share with the farmers and keep them fueled and happy for the days ahead. They love her cheesy Ham, Spinach and Potato Pizzas -- with wheat crust, of course! Molly also makes Creamy Navy Bean and Rosemary Dip and a tangy Tomato Green Bean Salad with Wheat Berries, and for dessert, she whips up Coconut Pudding with Roasted Rhubarb."
      },
      {
        "id": "tvmaze:1713127",
        "title": "Falafel Night",
        "season": 4,
        "episode": 7,
        "released": "2019-10-20",
        "overview": "Molly Yeh is making a Middle Eastern feast for her college friends visiting the farm, and the food is as colorful as the company! Molly starts with her crispy Falafel and a creamy Homemade Labneh with Olive Oil and Za'atar. She assembles a healthy Cauliflower Tabbouleh Salad, and for dessert, she bakes fudgy Turkish Coffee Brownies and mixes a pitcher of refreshing Frozen Mint Lemonades."
      },
      {
        "id": "tvmaze:1713128",
        "title": "Halloween",
        "season": 4,
        "episode": 8,
        "released": "2019-10-27",
        "overview": "Molly Yeh is hosting a Halloween party for all her friends and their little monsters! She makes some spooky treats for her guests, including cheesy Ghost Hand Pies with Honey Dijon dipping sauce and Broccoli FrankenTots with Lemon Garlic Mayo. There's a cauldron of creamy Pumpkin Risotto, and for dessert, she bakes a chocolatey Matcha Monster Bundt Cake."
      },
      {
        "id": "tvmaze:1747705",
        "title": "Midwest Potluck",
        "season": 4,
        "episode": 9,
        "released": "2019-11-10",
        "overview": "Molly Yeh and her husband, Nick, are going to a potluck dinner, and Molly's bringing some of her favorite Midwestern dishes with a twist, like her beautiful 8-Layer Salad loaded with sweet squash and farro. She also makes chewy Halva Magic Bars and a sweet Peanut Butter Mocha Mix. But before they head out, Molly bakes Bacon, Egg and Cheese Turnovers for a satisfying little farm lunch for two."
      },
      {
        "id": "tvmaze:1754545",
        "title": "Friendsgiving",
        "season": 4,
        "episode": 10,
        "released": "2019-11-17",
        "overview": "Molly Yeh is whipping up fun takes on Thanksgiving classics for her Friendsgiving gathering on the farm. Her main dish is sweet and savory Pomegranate Glazed Turkey Legs, and she serves them with Slow Cooker Greens and Dumplings as well as Roasted Sweet Potato Wedges with Cilantro Yogurt. For a festive dessert, Molly bakes her super-moist Cranberry Stuffed Cupcakes with Cranberry Cream Cheese Frosting."
      },
      {
        "id": "tvmaze:1761159",
        "title": "Double Birthday Party",
        "season": 4,
        "episode": 11,
        "released": "2019-12-01",
        "overview": "One of Molly Yeh's best friends is in town for their birthdays, so Molly is making her most-delicious party bites for the double celebration. She starts with her pretty in pink Pickled Beet Deviled Eggs and addictive Spinach and Feta Rugelach. She fries up crispy Walleye Cakes and assembles a Party Platter with Pickle Dip. For a dessert that's worthy of two celebrations, Molly makes chocolatey Mozart Birthday Balls."
      },
      {
        "id": "tvmaze:1761161",
        "title": "Holly-Dazzle",
        "season": 4,
        "episode": 12,
        "released": "2019-12-08",
        "overview": "Molly Yeh is celebrating Chrismukkah on the farm with tons of delicious food, treats and family traditions. She makes Pistachio Linzer Christmas Cookies with Tahini Hot Chocolate to keep everyone warm and happy. Before heading to the annual HollyDazzle Festival, there's a feast for the whole family with all of the best Hanukkah and Christmas dishes on one table, including Molly's juicy Roasted Spiced Chicken and Apples, Brussels Sprouts Salad with Cranberries and Dijon Dressing, crispy fried Potato Latkes with Caramelized Onion Sour Cream and Raspberry Rose Filled Donuts for dessert."
      },
      {
        "id": "tvmaze:1761160",
        "title": "Farmers' Breakfast",
        "season": 4,
        "episode": 13,
        "released": "2019-12-15",
        "overview": "Molly Yeh is showing her thanks to all the hardworking farmers with a hearty breakfast spread. She makes a crowd-pleasing Cheesy Kale Breakfast Casserole and crispy Corned Beef Hash Waffles. There's also a refreshing Rosemary Citrus Salad, super-fun Pancakes and Sausages on a Stick and, finally, Apple and Peanut Butter Green Smoothies for good measure."
      },
      {
        "id": "tvmaze:1771653",
        "title": "Brunch All Day",
        "season": 5,
        "episode": 1,
        "released": "2019-12-29",
        "overview": "Molly Yeh is hosting a brunch party with a few of her former bridesmaids, and she has all the best brunch bases covered. She starts by making her sweet and fluffy Blueberry Blintzes followed by a satisfying Breakfast Salad with Soft-Cooked Eggs and crispy Walnut Sausage Patties."
      },
      {
        "id": "tvmaze:1782885",
        "title": "Playdate",
        "season": 5,
        "episode": 2,
        "released": "2020-01-05",
        "overview": "Molly Yeh invites her sister-in-law Anna and her baby Cliff over for a playdate with Molly's daughter Bernie. They work up quite an appetite with all that playing, so Molly makes Homemade Granola Bar Treats, juicy Falafel-Spiced Turkey Burgers, Grilled Corn Salad with a creamy Avocado Ranch and refreshing Carrot Apple Juice to wash it all down."
      },
      {
        "id": "tvmaze:1782886",
        "title": "Campfire Cookout",
        "season": 5,
        "episode": 3,
        "released": "2020-01-12",
        "overview": "Molly Yeh is putting together some delicious campfire favorites and reliving her childhood by camping out in her backyard. Her husband Nick is building the fire, and they've invited some old camp buddies to join the fun. Dinner and dessert by the fire starts with Bonfire Eggs with Green Peppers and Cheese cooked right in the coals. Then they enjoy Bagel Dogs with Curry Ketchup, tangy Cherry Bug Juice and a flaky S'mores Slab Pie for dessert."
      },
      {
        "id": "tvmaze:1782887",
        "title": "The Big Till",
        "season": 5,
        "episode": 4,
        "released": "2020-01-19",
        "overview": "Molly Yeh is making an easy and hearty lunch for the Hagen family farmers, and she's using some of her favorite pantry staples -- with a twist -- to fill them up on a budget. She starts by making cheesy Meatball-Stuffed Biscuits and a side dish with a little kick, Spicy Roasted Delicata Squash. Then Molly prepares Creamy Polenta with Crispy Bacon and Chard as well as Cinnamon Cookies and Cream Meringues that look like mini dessert clouds covered in tasty cookie soil."
      },
      {
        "id": "tvmaze:1782888",
        "title": "Chinese Family Favorites",
        "season": 5,
        "episode": 5,
        "released": "2020-01-26",
        "overview": "Molly Yeh is making some of her favorite Chinese-inspired recipes, including some passed down from her dad's family. He's flying in with Molly's Aunt Lucy to visit her and baby Bernie, so Molly makes them her grandma's sweet and sour Tepong Pork with Fried Rice that's easy and addictive. Her Sauteed Spinach with Sweet Black Garlic is a side dish that's loaded with flavor, and for dessert, they'll love her Chocolate-Stuffed Sesame Balls."
      },
      {
        "id": "tvmaze:1782889",
        "title": "Hockey Game!",
        "season": 5,
        "episode": 6,
        "released": "2020-02-02",
        "overview": "Molly Yeh and her husband, Nick, host a hockey party for their sports-loving friends. She makes all her favorites, including crispy Fried Chicken Sandwiches with super-creamy Chipotle Mayo, Homemade Noodles and, for dessert, Chocolate Mint Sandwich Cookies shaped like hockey pucks."
      },
      {
        "id": "tvmaze:1782890",
        "title": "Date Night",
        "season": 5,
        "episode": 7,
        "released": "2020-02-09",
        "overview": "It's date night on the farm! Molly Yeh makes a romantic dinner for husband Nick, including juicy Steak Salad with a bright Za'atar Chimichurri, the best Cheesy Garlic Babka Muffins and Blood Orange Amaretto Sours. For dessert, there's a homemade Valentine's Day box filled with chewy Chocolate Covered Nougats."
      },
      {
        "id": "tvmaze:1782891",
        "title": "Middle Italy",
        "season": 5,
        "episode": 8,
        "released": "2020-02-16",
        "overview": "Molly Yeh's old band stops by the farm for a home-cooked meal. For her music-loving friends, Molly makes Orecchiette with Broccolini and Sausage, and a simple Escarole Salad with Artichokes and tangy Lemon Dressing. Plus, there are crispy Fried Mozzarella Sticks with Creamy Marinara and sweet Italian Rainbow Cookies for dessert."
      },
      {
        "id": "tvmaze:1789229",
        "title": "Curling Club",
        "season": 5,
        "episode": 9,
        "released": "2020-02-23",
        "overview": "Molly Yeh makes her most-prized Midwestern comfort foods with a twist. The hearty dishes include Knoephla Soup with the chewiest dumplings ever, Sticky Ribs and a side of sweet, tangy Broccoli Slaw with plump currants. For dessert, Molly has Red Velvet Snow Balls with cream cheese filling."
      },
      {
        "id": "tvmaze:1803737",
        "title": "Hawaii Farm'O",
        "season": 5,
        "episode": 10,
        "released": "2020-03-01",
        "overview": "Molly Yeh hosts a tiki party game night with all her favorite Hawaiian-inspired foods. She prepares delicious Hurricane Popcorn Balls, Sweet and Salty Pork Musubi, a mouthwatering Macaroni Salad and creamy Macadamia Nut Pops for dessert. To get the party started, she makes Sour Pineapple Tiki Cocktails with dark rum."
      },
      {
        "id": "tvmaze:1803738",
        "title": "Nick's Trombone Choir",
        "season": 5,
        "episode": 11,
        "released": "2020-03-08",
        "overview": "Molly Yeh makes a hearty Tomato Squash Soup and Labneh Grilled Cheese for lunch before husband Nick's trombone practice. Then she sends him off with Chewy Chocolate Peanut Butter Bars for the whole choir. Afterwards, they eat a simple weeknight meal of her delicious Smoked Salmon Nicoise Salad."
      },
      {
        "id": "tvmaze:1803739",
        "title": "Midwest Mex",
        "season": 5,
        "episode": 12,
        "released": "2020-03-15",
        "overview": "To celebrate her husband Nick's birthday, Molly Yeh surprises him by making his favorite Mexican cuisine -- with a Midwestern twist of course! She cooks up a Taco Hotdish, Chili-Lime Fruit Salad and Ham and Cheese Jalapeno Poppers. For dessert, there's a Mexican Chocolate Pinata Cake."
      },
      {
        "id": "tvmaze:1803740",
        "title": "Happy Passover!",
        "season": 5,
        "episode": 13,
        "released": "2020-03-22",
        "overview": "Molly Yeh hosts Passover dinner on the farm, putting her own twist on some of her family's traditional recipes. She starts with an Asian-inspired Scallion and Ginger Matzo Ball Soup followed by a hearty Spiced Beef Pie and, as a refreshing side, Strawberry and Hazelnut Salad with Orange Blossom Dressing. To wow everyone for dessert, she makes Giant Sprinkle Macaroons."
      },
      {
        "id": "tvmaze:1825586",
        "title": "Spring Is Springing!",
        "season": 6,
        "episode": 1,
        "released": "2020-04-05",
        "overview": "Molly Yeh creates a springtime feast to celebrate planting season on the farm. The meal includes her juicy One-Skillet Chicken with Spring Vegetables, crispy Dill Flakey Bread, a nutty Walnut Romesco Sauce for dunking and the most-beautiful Glazed Lavender Sugar Cookies for dessert."
      },
      {
        "id": "tvmaze:1825587",
        "title": "Winter Farming Activities",
        "season": 6,
        "episode": 2,
        "released": "2020-04-12",
        "overview": "While Molly Yeh's husband, Nick, and his dad are busy fixing all the farm equipment in the winter off-season, Molly makes comforting Sweet Flatbreads with Lemon Yogurt Whipped Cream for lunch to keep them warm. Then she prepares an even cozier dinner of Spiced Chicken Pot Pies, Crispy Chili Brussels Sprouts and Halva Apple Pie Bars that the whole family will love."
      },
      {
        "id": "tvmaze:1825588",
        "title": "Dad's Midwest Concert",
        "season": 6,
        "episode": 3,
        "released": "2020-04-19",
        "overview": "Molly Yeh's dad is in town to play a clarinet concert, and she's making an Asian-inspired lunch of succulent Sugar-Coated Pork Buns and crunchy Drunken Cucumber Noodles to fill him up beforehand. Then, who wants flowers when you can have homemade Matcha Mochi Donuts for a sweet treat after the performance!"
      },
      {
        "id": "tvmaze:1825589",
        "title": "Farm-Style Bowling",
        "season": 6,
        "episode": 4,
        "released": "2020-04-26",
        "overview": "Molly Yeh and her husband, Nick, are bringing some bowling party fun to the farm. Nick's building their own lane, and they're inviting friends over to play and enjoy Molly's super Sloppy Joes, craveworthy Sweet Potato Waffle Fry Nachos and Crunchy Snap Pea Popcorn Salad. She also makes Coconut Cake Balls shaped like little bowling balls for dessert. Sounds like a strike!"
      },
      {
        "id": "tvmaze:1842762",
        "title": "Mexican Brunch",
        "season": 6,
        "episode": 5,
        "released": "2020-05-03",
        "overview": "Molly Yeh hosts a Mexican-themed brunch for the Spicy Senoritas of the Grand Forks Brunch Club. She makes Churro Pancakes with Sweet Milk Glaze, comforting Chorizo, Egg and Cheese Enchiladas and an addictive Charred Tomatillo Salad. Plus, Spicy Palomas wash everything down with a kick. Things are getting crazy and tasting crazy good!"
      },
      {
        "id": "tvmaze:1942541",
        "title": "Harvest Pre-Haul",
        "season": 6,
        "episode": 6,
        "released": "2020-10-04",
        "overview": "It's beet harvest pre-haul time, and Molly Yeh is making the coziest foods imaginable to keep her husband, Nick, primed for the work ahead. She whips up her tender Spiced Beef Hotdish with Bacon Jalapeno Cornbread, Loaded Potato Skins and, for dessert, dreamy Tahini Fudge Pie."
      },
      {
        "id": "tvmaze:1946997",
        "title": "Bernie's First Birthday",
        "season": 6,
        "episode": 7,
        "released": "2020-10-11",
        "overview": "It's Bernie's first birthday, so Molly Yeh is pulling out all the stops with a garden-themed bash for her little girl. She's making juicy Pretzel-Crusted Chicken Nugget Salad, a Tomato and Mozzarella Tart and creamy Beet Ricotta Dip. For dessert, there's a Rainbow Cake with Marzipan Vegetables and a special mini Smash Cake for the little birthday queen!"
      },
      {
        "id": "tvmaze:1946998",
        "title": "Farm Harvest Treats",
        "season": 6,
        "episode": 8,
        "released": "2020-10-18",
        "overview": "It's harvest time, and Molly Yeh is baking tasty treats for the farmers, starting with her thick and soft Sugar Beet Sugar Cookies and moist Pumpkin Cranberry Loaf. She also makes flakey Pepperoni Pizza Pastries and adorable Cookie-Coated Chocolate Strawberries that look like mini versions of the real beets they're harvesting."
      },
      {
        "id": "tvmaze:1953549",
        "title": "Italian Grill",
        "season": 6,
        "episode": 9,
        "released": "2020-10-25",
        "overview": "Molly Yeh hosts a double-date pizza party on the farm and takes the Italian grilling outside for some extra fun times! She makes cheesy Fried Risotto Balls, Grilled Zucchini Pizza with Basil Mint Pesto and a crisp Romaine Salad drizzled in Bacon Fat Vinaigrette."
      },
      {
        "id": "tvmaze:1953551",
        "title": "Dinner Staycation",
        "season": 6,
        "episode": 10,
        "released": "2020-11-01",
        "overview": "It's time for wheat harvest on the farm, and Molly Yeh is making all her husband Nick's favorite Mexican dishes to whisk him away on a food vacation! She cooks up a decadent Refried Beans and Rice Bowl, Roasted Salmon Tacos wrapped in chewy homemade Flour Tortillas and creamy Coconut-Lime Tres Leches Cake for dessert."
      },
      {
        "id": "tvmaze:1964121",
        "title": "Family Thanksgiving",
        "season": 6,
        "episode": 11,
        "released": "2020-11-15",
        "overview": "It's Thanksgiving on the farm, and Molly Yeh is celebrating the best way she knows how -- with lots of food! She makes creamy Twice-Baked Potatoes, a hearty Brussels Sprout Casserole, sweet and sticky Orange Marmalade Glazed Ham and finishes with a classic, Pumpkin Pie with Whipped Cream and Cinnamon."
      },
      {
        "id": "tvmaze:1975571",
        "title": "Chinese Food Christmas",
        "season": 6,
        "episode": 12,
        "released": "2020-12-06",
        "overview": "Molly Yeh's sister is visiting, so Molly's taking her snowshoeing -- with treats, of course! They snack on Pistachio White Chocolates and Beef and Rutabaga Hand Pies with Jalapeno Ketchup. Then, they have some cheesy fun with a Gruyere Fondue Dinner party with Gummy Bear Bark for dessert."
      },
      {
        "id": "tvmaze:1975572",
        "title": "Farm Fry Dinner",
        "season": 6,
        "episode": 13,
        "released": "2020-12-20",
        "overview": "Molly Yeh is having a fry-out on the farm, and things are getting deliciously crispy! She makes juicy Buttermilk Fried Chicken, a Roasted Broccoli and Grape Salad and colorful Harissa Carrots and Ranch. For dessert, Molly bakes Almond Tarts with a sweet Raspberry Glaze."
      },
      {
        "id": "tvmaze:1977991",
        "title": "Brunch Club Strikes Again",
        "season": 6,
        "episode": 14,
        "released": "2020-12-27",
        "overview": "Molly Yeh hosts Brunch Club with her friends; she makes Blueberry Cream Cheese Scones with Yogurt Glaze, Bacon Hasselback Sweet Potatoes, Pita and Greens Benedict with Feta Cream and Caraway Bloody Marys with Mini Reubens."
      },
      {
        "id": "tvmaze:1999121",
        "title": "Norwegian Celebration",
        "season": 7,
        "episode": 1,
        "released": "2021-01-03",
        "overview": "Molly Yeh is cooking for a Norwegian dinner celebration on the farm, starting with Lefse hot dogs with fennel slaw and open face salmon and avocado sandwiches; she also makes crispy paprika fries with dill mayo and a stunning Norwegian wreath cake."
      },
      {
        "id": "tvmaze:2005104",
        "title": "Book Club Party",
        "season": 7,
        "episode": 2,
        "released": "2021-01-10",
        "overview": "Molly Yeh is hosting book club on the farm with plenty of fiction, fun and fantastic food! She makes Walnut-Crusted Brie Mac and Cheese, succulent Skillet Pork Chops with Salsa Verde, Squash and Apple Salad with Mustardy Dressing and, for dessert, Dakota-Style Plum Cakes."
      },
      {
        "id": "tvmaze:2010087",
        "title": "Picnic Blowout",
        "season": 7,
        "episode": 3,
        "released": "2021-01-17",
        "overview": "Molly Yeh starts the day off right with cheesy Breakfast Juicy Lucys for herself and her husband, Nick. Then she assembles a picnic with Pickle Dip Fried Bologna Sandwiches, fresh and bright Falafel-y Farfalle and colorful Tie-Dye Cookies that are gooey in the center and groovy all the way through!"
      },
      {
        "id": "tvmaze:2011021",
        "title": "Girl Meets Ice",
        "season": 7,
        "episode": 4,
        "released": "2021-01-24",
        "overview": "Molly Yeh has figure skating fever, and she's making cozy dishes to share with her synchronized skating trio. She starts with Spiced Tomato ABCs, followed by Fried Beef Tacos, Cheesy Parmesan Broccoli and Coffee Cookie Butter Cones for dessert."
      },
      {
        "id": "tvmaze:2031451",
        "title": "Fondue Party",
        "season": 7,
        "episode": 5,
        "released": "2021-01-31",
        "overview": "Molly Yeh and a friend go snowshoeing -- with treats, of course! They snack on Pistachio White Chocolates and Beef and Rutabaga Hand Pies with Jalapeno Ketchup. Then, they have some cheesy fun with a Gruyere Fondue Dinner party with Gummy Bear Bark for dessert."
      },
      {
        "id": "tvmaze:2031452",
        "title": "Iron Anniversary",
        "season": 7,
        "episode": 6,
        "released": "2021-02-14",
        "overview": "Molly Yeh is celebrating her sixth wedding anniversary with an epic dinner that includes a T-bone steak, scalloped potatoes, charred broccolini with shishito pepper romesco and a marzipan moose mousse cake."
      },
      {
        "id": "tvmaze:2031453",
        "title": "Purim Party",
        "season": 7,
        "episode": 7,
        "released": "2021-02-21",
        "overview": "It's Purim, and Molly Yeh is celebrating with a festive meal, lots of drinks and plenty of fun! Her menu includes Short Rib Gnocchi, Red Wine Slushies and, for dessert, Poppy Seed Hamantaschen. Plus, a comforting morning-after breakfast of Cheesy Spinach Matzo Brei is just what the doctor ordered."
      },
      {
        "id": "tvmaze:2033157",
        "title": "Mecca of the Midwest",
        "season": 7,
        "episode": 8,
        "released": "2021-02-28",
        "overview": "Molly Yeh makes a decadent Midwest meal in honor of her hometown, Chicago. She starts with Sausage, Peppers and Onion Deep Dish Pizza and Chicago Corn Dog Bites, and then she makes sweet and salty Caramel and Cheddar Popcorn Mix and Mint Truffle Bars for dessert."
      },
      {
        "id": "tvmaze:2033158",
        "title": "Midwest Delicatesse",
        "season": 7,
        "episode": 9,
        "released": "2021-03-07",
        "overview": "Molly Yeh and her husband, Nick, are missing the Big Apple -- especially the food! -- so to crush the craving, she whips up Pastrami Sandwiches with Onion Rings, hearty Chicken Kreplach Soup and, for dessert, beautiful Black and Pink Cookies."
      },
      {
        "id": "tvmaze:2033159",
        "title": "Fun Italian Feast",
        "season": 7,
        "episode": 10,
        "released": "2021-03-14",
        "overview": "Molly Yeh whips up a fun Italian feast for the whole family, starting with her cheesy Smashed Meatball Burgers. She also makes a colorful Antipasto Salad with Prosciutto-Wrapped Breadsticks, a crispy Parmesan Fried Onion and Spumoni Cake Jars for dessert."
      },
      {
        "id": "tvmaze:2033160",
        "title": "The Yeh-Hagen Family Games",
        "season": 7,
        "episode": 11,
        "released": "2021-03-21",
        "overview": "Molly Yeh kicks off the first official Yeh-Hagen Family Games with a big, delicious bang! She makes Carnitas Walking Tacos and Mexican Street Corn-Loaded Tots, and for dessert, there are Coconut Mango Pops and ooey-gooey S'mores Brownies."
      },
      {
        "id": "tvmaze:2048123",
        "title": "Midwest Passover",
        "season": 7,
        "episode": 12,
        "released": "2021-03-28",
        "overview": "Molly Yeh is celebrating day two of Passover on the farm with her super crispy Giant Skillet Latke for lunch. For dinner, there's succulent Spatchcock Roast Chicken with mouthwatering Schmaltzy Potatoes and Green Goddess Sauce and a tangy Pomegranate Pavlova for dessert!"
      },
      {
        "id": "tvmaze:2051631",
        "title": "Midwest Mom",
        "season": 7,
        "episode": 13,
        "released": "2021-04-04",
        "overview": "Molly Yeh makes some easy Midwest staples to keep everyone going on the farm; Molly makes carrot cake baked oatmeal, a french fry-covered busy day hotdish, pea and bacon salad with french dressing and rocky road fudge."
      },
      {
        "id": "tvmaze:2055815",
        "title": "Simple Shabbat Dinner, Perfect Sunday Morning Breakfast",
        "season": 8,
        "episode": 1,
        "released": "2021-04-11",
        "overview": "Molly Yeh and her husband, Nick, celebrate Shabbat with a delicious, no-stress dinner on the farm. Molly prepares Orange Juice Challah and succulent Shawarma Stuffed Peppers, and for dessert, she makes her creamy Gingersnap Coconut Icebox Cake. Then Molly transforms the leftover challah into Strawberries and Cream Stuffed French Toast for breakfast the next day."
      },
      {
        "id": "tvmaze:2063033",
        "title": "Nick's Horn Show and the Late-Night Munchies",
        "season": 8,
        "episode": 2,
        "released": "2021-04-18",
        "overview": "Nick's got a band gig downtown, and Molly Yeh is making hearty Cheeseburger Potato Soup for dinner. Then, it's time for a sinful spread of late-night munchies with Veggie Supreme Pizza Bagels, loaded Cheesy Pickle Nachos and adorable Iced Dinosaur Cookies for dessert!"
      },
      {
        "id": "tvmaze:2070126",
        "title": "Tour de Grand Forks",
        "season": 8,
        "episode": 3,
        "released": "2021-04-25",
        "overview": "It's a day of delicious food on the farm! Molly Yeh is making her Big Fluffy Pancakes and Sausage for breakfast. Then, for a picnic lunch, meaty Prosciutto, Cantaloupe and Butter Sandwiches with Fried Cheese Curd Salad are followed by the flakiest Chocolate Croissants ever."
      },
      {
        "id": "tvmaze:2079269",
        "title": "Cinco de Mayo ... Brunch Club Style",
        "season": 8,
        "episode": 4,
        "released": "2021-05-02",
        "overview": "It's Cinco de Mayo, and Molly Yeh is celebrating Brunch Club style with swirly and moist Mexican Chocolate Babka, spicy Chorizo Breakfast Burrito Bowls, Avocado Salad and Frozen Horchata Lattes that drink just like dessert-y rice pudding!"
      },
      {
        "id": "tvmaze:2079270",
        "title": "Tea for Three",
        "season": 8,
        "episode": 5,
        "released": "2021-05-09",
        "overview": "Molly Yeh is celebrating Mother's Day with a sprinkle-filled tea party! She makes Rose Cupcake Cones, savory Hot Dog Flower Buns, Ham and Cheese Sandwiches on sour cream and chive scones, and Fairy Toast with Marzipan Butter and Homemade Sprinkles."
      },
      {
        "id": "tvmaze:2079274",
        "title": "Dim Sum Date Night",
        "season": 8,
        "episode": 6,
        "released": "2021-05-16",
        "overview": "Molly Yeh is making adorable bites of scrumptiousness for a dim sum date night! The menu includes Steak Buns with creamy Peanut Sauce, Crispy Veggie Buns, addictive Shrimp Toasts and Egg Custard Tarts for dessert."
      },
      {
        "id": "tvmaze:2079275",
        "title": "A Trade for a Trade",
        "season": 8,
        "episode": 7,
        "released": "2021-05-23",
        "overview": "Molly Yeh and husband Nick are swapping a trade for a trade! She is teaching him to make Brown Butter Buttermilk Donuts in exchange for a welding lesson. Then, she makes a cozy Midwest dinner of Chicken Wild Rice Hotdish, Deep Fried Broccoli and Monster Cookie Bars for dessert."
      },
      {
        "id": "tvmaze:2079277",
        "title": "BBQ Housewarming for Mom",
        "season": 8,
        "episode": 8,
        "released": "2021-05-30",
        "overview": "Molly Yeh is making a housewarming dinner of Midwest-Jewish mashups to welcome Grandma Jody to town! The menu includes her BBQ Brisket Sandwich with Caraway Coleslaw on Pretzel Challah Buns, Scallion Cream Cheese Grilled Corn and Rugelach Cookie Salad for dessert."
      },
      {
        "id": "tvmaze:2098612",
        "title": "Nick's Special Birthday TV Dinner",
        "season": 8,
        "episode": 9,
        "released": "2021-06-06",
        "overview": "Molly Yeh is putting together a TV dinner-themed evening to celebrate Nick's birthday! She's making succulent Bacon Wrapped Meatloaves, Mashed Cheesy Potatoes with pan Gravy, spicy Easy Peasies and a stunning Battenberg Cake for the birthday boy."
      },
      {
        "id": "tvmaze:2111796",
        "title": "Parents' Payback",
        "season": 8,
        "episode": 10,
        "released": "2021-06-13",
        "overview": "Molly Yeh is making dinner for her parents, Roger and Roxanne, to say thanks for all their help around the farm! The menu includes Knoephla Sausage Hotdish, sweet and smoky Roasted Squash Hummus with Bernie-inspired Veggie Focaccia for dunking and buttery Kitty Cookies for dessert!"
      },
      {
        "id": "tvmaze:2108800",
        "title": "Nick's the Man!",
        "season": 8,
        "episode": 11,
        "released": "2021-06-20",
        "overview": "It's Father's Day on the farm, and Molly Yeh is whipping up the creamiest, dreamiest, most-decadent dishes around! She's making saucy Chicken Alfredo Lasagna, Toasted Ravioli Salad with a Creamy Marinara Ranch and, for dessert, chocolate dipped Strawberry Krumkake Cannoli!"
      },
      {
        "id": "tvmaze:2113008",
        "title": "Ladies' Painting Party",
        "season": 8,
        "episode": 12,
        "released": "2021-06-27",
        "overview": "Molly Yeh is making a slew of colorful dishes for a painting party on the farm! The menu includes her Pork Meatball Banh Mi Sandwiches, Crispy Rice Salad with Kale and succulent Ham Summer Rolls. For dessert, there's a Terrazzo Jelly Cake to draw then devour!"
      },
      {
        "id": "tvmaze:2120159",
        "title": "Souping & Sleepovers",
        "season": 8,
        "episode": 13,
        "released": "2021-07-04",
        "overview": "Molly Yeh is making a cozy lunch of rich Miso Ramen then having a mother-kiddo sleepover with the most-addictive party noshes ever! Molly serves her Spicy Ranch Snack Mix, ooey-gooey Pesto Pizza Pillows and a showstopping Blueberry Doll Cake bedazzled with sprinkles ... she's a 10 out of 10!"
      },
      {
        "id": "tvmaze:2150261",
        "title": "Mommy & Me Lunch",
        "season": 9,
        "episode": 1,
        "released": "2021-09-19",
        "overview": "Molly Yeh is making everyone's morning complete with her super-satisfying Hammy Hot Dish breakfast. Then, it's a cute Mommy-and-me lunch with her savory Tomato Basil Soup with Parmesan and Bunny Pesto Cristos on the side. For dessert, Molly bakes beautiful Mini Princess Cakes to celebrate Bernie's new tiny play kitchen, which looks just like Molly's!"
      },
      {
        "id": "tvmaze:2150262",
        "title": "Wheat & Meat Tailgate",
        "season": 9,
        "episode": 2,
        "released": "2021-09-26",
        "overview": "Molly Yeh and husband Nick are celebrating wheat harvest with a tractor tailgate party on the farm. She's making colorful Sheet Pan Ratatouille Pizza and succulent Grilled Ribeye Steak on Feta Farro with Garden Veggies. For dessert, get ready for tangy, delicious Rhubarb Bars!"
      },
      {
        "id": "tvmaze:2176872",
        "title": "Drive-In Date Night",
        "season": 9,
        "episode": 3,
        "released": "2021-10-03",
        "overview": "Molly Yeh is having a movie night-style date night on the farm, complete with the tastiest homemade concessions. She makes ooey-gooey Diner-Style Patty Melts, addictively salty and delicious Ranch Kale Chips, deep-fried Kim-Cheese Tots with a tangy yogurt sauce drizzle and, for dessert, Oatmeal Movie Cookie Ice Cream Sandwiches."
      },
      {
        "id": "tvmaze:2181857",
        "title": "Farm-iversary",
        "season": 9,
        "episode": 4,
        "released": "2021-10-10",
        "overview": "Molly Yeh is celebrating eight happy years of Midwestern farm life with all her cozy food favorites. She makes fluffy, chewy Tahini Caramel Rolls, savory Chinese Hotdish covered with deep-fried wonton skins and Spicy BBQ Wings. To finish the meal with a dash of sweet and cute, her Bear-y Cookie Salad is the ultimate Midwestern dessert with a twist."
      },
      {
        "id": "tvmaze:2186377",
        "title": "Halloween Brunch Club",
        "season": 9,
        "episode": 5,
        "released": "2021-10-17",
        "overview": "Molly Yeh is hosting her brunch club with a fun Halloween theme that includes cute costumes and frighteningly good food. She makes saucy Cyclops Shakshuka Focaccias, Apple Pancakes with crispy caramelized edges, salty and cheesy Munster Monster Hash Brown Fingers and, for dessert, Matcha Macaroon Monsters that shine with sweetness!"
      },
      {
        "id": "tvmaze:2186378",
        "title": "Turtle River Hike",
        "season": 9,
        "episode": 6,
        "released": "2021-10-31",
        "overview": "Molly Yeh starts the day by making one of her family's favorite breakfasts, a sweet and tangy Blueberry Toasted Oat Tart. Then she treats a few friends to a picnic lunch at Turtle River State Park with her thick and indulgent BLFGT Sandwiches -- that's bacon, lettuce and fried green tomatoes -- and creamy Ranch Egg Salad with veggies and matzo for dunking. For dessert, Molly makes Chocolate Pecan Sandwich Cookies with caramel frosting as a sweet tribute to the state park's revered reptile."
      },
      {
        "id": "tvmaze:2186379",
        "title": "Nick's Birthday Dinner Roast",
        "season": 9,
        "episode": 7,
        "released": "2021-11-07",
        "overview": "Molly Yeh is celebrating her husband's birthday with a delicious, Italian-inspired meal and friendly little roast -- with plenty of cheese! She makes Meaty Ziti with Pesto Dollops, spicy and briny Giardiniera Bruschetta and crispy Fried Olive Salad with creamy harissa dressing. Dessert is a classic Red Velvet Birthday Cake with sweet cream cheese frosting. Break out the flatware and the funny -- it's time for dinner, honey!"
      },
      {
        "id": "tvmaze:2186380",
        "title": "Thanksgiving Parade on the Farm",
        "season": 9,
        "episode": 8,
        "released": "2021-11-14",
        "overview": "It's the most legendary food holiday ever -- Thanksgiving! -- so Molly Yeh is celebrating with tons of food and a tiny parade on the farm. She makes crispy Fried Turkey Breasts with Cranberry Mayo, Everything Bagel Stuffing, twice-baked Tahini Cinnamon Sweet Potatoes with Toasted Meringue and, for dessert, her melt-in-your-mouth Pistachio Pudding Pie."
      },
      {
        "id": "tvmaze:2209205",
        "title": "Puppet Circus",
        "season": 9,
        "episode": 9,
        "released": "2021-11-21",
        "overview": "Molly Yeh is putting together a puppet circus on the farm and making lots of tasty food for the occasion! She bakes creamy Roasted Butternut Squash Shells &amp; Cheese and flakey Oyster Cracker Crusted Fish Sticks, and she uses lots of cheese in her Broccolini in Blankets. For dessert, Molly makes her adorably goofy Mint Clown Cones that are sure to make everyone smile!"
      },
      {
        "id": "tvmaze:2209206",
        "title": "Heck Yeah Hanukkah!",
        "season": 9,
        "episode": 10,
        "released": "2021-11-28",
        "overview": "Molly Yeh is going all out for Hanukkah with an ugly sweater party and heaps of marvelous food, including rich and hearty Beef Stew with Fluffy Pitas. She also makes Mini Sufganiyot Salad drizzled with creamy tahini dressing, and her Chocolate Coconut Shake with a Latke Stack satisfies both sweet and salty cravings for dessert. Finally, Molly ups the ante on the high-stakes dreidel game with Hazelnut Gelt Cookies."
      },
      {
        "id": "tvmaze:2209207",
        "title": "Super \"Scandi\" Christmas",
        "season": 9,
        "episode": 11,
        "released": "2021-12-05",
        "overview": "For Christmas, Molly Yeh is having a ball making a Scandinavian-inspired meal in an ode to her farming family. For breakfast, she bakes a rich and warmly spiced Cardamom Wreath. For dinner, she makes the juiciest Meatballs &amp; Lutefisk and chewy Potato &amp; Ham Dumplings with Brussels Sprouts, and dessert is a beautiful, fluffy Norwegian Cream Cake with sugar cranberries that screams Happy Holidays!"
      },
      {
        "id": "tvmaze:2209208",
        "title": "2nd Honeymoon",
        "season": 9,
        "episode": 12,
        "released": "2021-12-19",
        "overview": "Molly Yeh is putting together a second honeymoon on the farm with all the best dishes from her first married vacation. She makes her Fluffy Shredded Pancake with tart Plum Sauce, crunchy Pork Schnitzel with a crisp Cucumber Salad, super Cheesy Spaetzle with Fried Onions and Chives, and the most adorable Glazed Almond Mini Cakes you've ever seen!"
      },
      {
        "id": "tvmaze:2242394",
        "title": "Chinese Brunch",
        "season": 9,
        "episode": 13,
        "released": "2022-01-02",
        "overview": "Molly Yeh's dad is in town for the weekend, and she's making a delicious Chinese brunch, starting with deep fried Pork Belly in crispy Egg Pancakes. Then, she makes comforting Congee with Sauteed Greens, Chinese Crullers for dunking and moist Black Sesame Babka that's baked to perfection!"
      },
      {
        "id": "tvmaze:2246878",
        "title": "Winter Spa Day",
        "season": 10,
        "episode": 1,
        "released": "2022-01-09",
        "overview": "Molly Yeh is kicking off the new year with a bang! She's making her chewy, tangy English Muffin Jam Rolls, satisfying Miso Salmon Grain Bowls and Harissa Roasted Carrot Dip with Seedy Cheese Crackers for dunking. Plus, Molly's Black Sesame Buckeyes are a sweet chocolate treat that will melt in your mouth."
      },
      {
        "id": "tvmaze:2247458",
        "title": "Northern Plains Practice on the Farm",
        "season": 10,
        "episode": 2,
        "released": "2022-01-16",
        "overview": "Molly Yeh is putting together a Midwest-Italian inspired feast for Nick's new brass ensemble, The Northern Plains! She's making sausage forward Spaghetti and Juicy Lucy Meatballs, Charred Broccolini on creamy Homemade Ricotta, and a lively, bright Marinated Bean Salad. For dessert, there are buttery Italian Bakery Cookies sandwiched with raspberry jam and dipped in chocolate with sprinkles."
      },
      {
        "id": "tvmaze:2247459",
        "title": "Let's Get Cozy!",
        "season": 10,
        "episode": 3,
        "released": "2022-01-23",
        "overview": "Winter is coming on the farm, and Molly Yeh is making hearty foods to keep her family warm. The cozy menu includes comforting Chicken and Dumpling Soup with decadent No Knead Salami Bread and zippy Citrus and Greens Salad with Wonton Croutons and Chinese hot honey mustard dressing. Plus, for dessert, chocolate chip Cookies in a Bowl with vanilla ice cream and hot fudge will blow your gasket!"
      },
      {
        "id": "tvmaze:2247460",
        "title": "Lunar New Year",
        "season": 10,
        "episode": 4,
        "released": "2022-01-30",
        "overview": "It's Lunar New Year on the farm, and Molly Yeh is celebrating with epic entertainment and a fabulous Chinese-inspired feast. She's making saucy Orange Chicken, peanut-buttery pork Dan Dan Noodles with tender bok choy, and golden Lucky Baloney Egg Rolls. Plus, there are sweet Sprinkly Almond Cookies, which are sure to bring in buckets full of good fortune!"
      },
      {
        "id": "tvmaze:2247461",
        "title": "Hawk-ey Party",
        "season": 10,
        "episode": 5,
        "released": "2022-02-06",
        "overview": "Molly Yeh is having a hockey party for the love of the food! She makes Mexican-inspired favorites for everyone to indulge, including meaty Al Pastor Taco Salad with Spicy Salsa Verde Ranch, sweet but smoky Charred Corn 7-Layer Dip and Cheese-Crusted Fajita Veggie Quesadillas. For dessert, Sparkly Strawberry Churros add a bit of extra fun to the sports."
      },
      {
        "id": "tvmaze:2247462",
        "title": "Molly's Farm-y Valentine",
        "season": 10,
        "episode": 6,
        "released": "2022-02-13",
        "overview": "For Valentine's Day on the farm, Molly Yeh and husband Nick are celebrating with chocolate and meat. Molly makes succulent Rosemary Rib Roast with Creamy Gremolata, Brussels Sprout Risotto with Lemony White Beans and, for dessert, Chocolate Tahini Fudge Cake dolloped with fresh whipped cream and halva. Plus, she adds two Cherry Chocolate Egg Creams on the side -- it's a meal laced with love!"
      },
      {
        "id": "tvmaze:2253555",
        "title": "Molly's Sprinkle!",
        "season": 10,
        "episode": 7,
        "released": "2022-02-20",
        "overview": "It's Molly's sprinkle, and she's throwing a baby shower on the farm to celebrate! She's making fun, indulgent foods, including savory Lentil Soup in chewy Bread Bowls with salty pancetta and crave-worthy Chicken Caesar Salad Wraps with Crispy Cheese. For dessert, there are glossy pink Sprinkle-y Glazed Yeasted Donuts and icy Grape Slushie Floats to wash everything down."
      },
      {
        "id": "tvmaze:2258526",
        "title": "That's Sno-Problem!",
        "season": 10,
        "episode": 8,
        "released": "2022-02-27",
        "overview": "Molly Yeh is snowed in, but that's no problem! To cozy up, she cooks some hearty Midwest-inspired favorites, like crispy Fried Walleye Sandwiches on soft Homemade Potato Buns, slathered with tangy tartar sauce, and creamy Ham and Egg Potato Salad with Charred Scallions. For dessert, Molly makes chocolate chip Oatmeal Cream Pies with a coconut fat filling."
      },
      {
        "id": "tvmaze:2290378",
        "title": "Sister, Sister",
        "season": 10,
        "episode": 9,
        "released": "2022-03-06",
        "overview": "Molly Yeh's sister is visiting the farm, and she's making a Greek-inspired meal for the occasion. The menu starts with colorful Yogurty Marinated Chicken Skewers and perfectly packaged Fried Feta Greek Salad Pitas. Skordalia, a creamy potato dip, is served with Herby Grilled Pita for dunking, and, for dessert, beautiful Baklava Blondies shine bright like diamonds!"
      },
      {
        "id": "tvmaze:2290781",
        "title": "Purim Pizza Pool Party",
        "season": 10,
        "episode": 10,
        "released": "2022-03-13",
        "overview": "Molly Yeh is celebrating Purim with a pizza pool party full of fabulous food! The menu includes garlicky Stuffed Crust Purim Pickle Pizza, Creamy White Bean Dip with Charred Peppers, and deep-fried Sour Cream and Onion Rings. For dessert, One Giant Spumoni Hamantaschen takes this holiday into greatness!"
      },
      {
        "id": "tvmaze:2290782",
        "title": "Campy Talent Show",
        "season": 10,
        "episode": 11,
        "released": "2022-03-27",
        "overview": "Molly Yeh is having a campy talent show on the farm! She's making nostalgic favorites for the festivities, including pizza-inspired creamy Mozzarella Mac and Cheese, smoky Sausage and Broccoli Pesto Packets and fun Homemade Squeeze Cheese and Crackers. For dessert, get ready to rock out with sweet, rich S'mores Ice Cream Pie."
      },
      {
        "id": "tvmaze:2300124",
        "title": "Birthday Bagel Brunch",
        "season": 10,
        "episode": 12,
        "released": "2022-04-03",
        "overview": "Molly Yeh is celebrating her birthday with a big bagel brunch, in all forms! The feast includes her indulgent Bacon Egg and Cheese Bagels, irresistible Smoked Whitefish Dip with crispy Bagel Chips and fruity Chocolate Strawberry Halva Smoothies to wash the bagels down. For dessert, a fluffy Pistachio Cake with Cream Cheese Frosting and Donut Bagels is unbelievable birthday fun!"
      },
      {
        "id": "tvmaze:2300125",
        "title": "Spring Passover Shenanigans",
        "season": 10,
        "episode": 13,
        "released": "2022-04-10",
        "overview": "Molly Yeh is celebrating Passover with heaps of delicious food and spring shenanigans! For breakfast, she makes sweet cinnamon sugar Mixed Berry Matzo Brei. Then, for dinner, it's hearty Brisket Hotdish covered with crispy, smiling potatoes and schmaltzy Popover Salad drizzled with Honey Poppyseed Dressing. For dessert, Molly's ooey-gooey Matzo Magic Bars are proof that no-rise doesn't mean no fun!"
      },
      {
        "id": "tvmaze:2383162",
        "title": "Minnesota Shore Lunch",
        "season": 11,
        "episode": 1,
        "released": "2022-09-04",
        "overview": "Molly Yeh is making her very own shore lunch! She brings the fresh taste of the sea to the farm with her own version of Cornflake-Crusted Fried Fish with Tartar Sauce, Saucy Stovetop Bacon Beans and a delicious Strawberry Rhubarb Pretzel dessert!"
      },
      {
        "id": "tvmaze:2383383",
        "title": "Bash After Baby",
        "season": 11,
        "episode": 2,
        "released": "2022-09-11",
        "overview": "Molly Yeh and baby Ira are happy and healthy, so now Molly's ready to celebrate with all the foods she had to forgo while pregnant! She's excited to dig into homemade Honey Bagels with Blueberry Lox, a Big Salami Railroad Sandwich and Beans and Greens with Runny Eggs. Plus, she finishes her treat day with yummy Frozen Strawberries and Cream Cocktails."
      },
      {
        "id": "tvmaze:2383385",
        "title": "Mooncake Festival",
        "season": 11,
        "episode": 3,
        "released": "2022-09-18",
        "overview": "Molly Yeh's friend has two sons who are studying the Mooncake Festival, and they've asked Molly to show them how it is celebrated. She's delighted to fly red lanterns with them as they dine on Chocolate Hazelnut Mooncakes, Peking Chicken, Grilled Bok Choy with Ginger Scallion Garlic Oil and Mandarin Pancakes."
      },
      {
        "id": "tvmaze:2383386",
        "title": "Four Square on the Farm",
        "season": 11,
        "episode": 4,
        "released": "2022-09-25",
        "overview": "Molly Yeh loves a good physical workout, and today she's opted for four square. As a reward for her exercise buddies, Molly's grilling Margherita and Prosciutto Pizzettes, Corn with Spicy Calabrian Chili Butter and a special version of the Hagen House Salad. Then, they'll finish things off with Pistachio Bomboloni."
      },
      {
        "id": "tvmaze:2406265",
        "title": "Chrismukkah Cookie Swap",
        "season": 11,
        "episode": 5,
        "released": "2022-10-02",
        "overview": "Molly Yeh can't wait for the holidays, so she's throwing a summer solstice cookie swap! Her friends are thrilled to participate in this untraditionally traditional event where Molly is serving up her Potluck Potsticker Salad and Peanut Butter Miso Caramel Ice Cream Sandwiches. Plus, they'll finish up with a special treat of Toasted Sesame Santa Hats and Frozen Mint Hot Chocolate."
      },
      {
        "id": "tvmaze:2401232",
        "title": "Sukkot, The Harvest Festival",
        "season": 11,
        "episode": 6,
        "released": "2022-10-09",
        "overview": "For the beginning of Sukkot, the fall Jewish harvest festival, Molly Yeh is putting the final touches on her first meal in the Sukkah. She gets her table ready with Chickpea Squash Pot Pie, Fried Brussels Sprouts with Feta, Lemon and Breadcrumbs, and Honey-Glazed Carrots with Radicchio and Thyme. Then, Molly finishes off her harvest meal with a Plum Hazelnut Kugel."
      },
      {
        "id": "tvmaze:2401233",
        "title": "Tutu Cute",
        "season": 11,
        "episode": 7,
        "released": "2022-10-16",
        "overview": "It is Bernie's tie-dye birthday party, and Molly Yeh is celebrating her tutu-loving daughter with a Tie-Dye Tutu Birthday Cake! Molly's also loading up the snack table with Swirly Yogurt Queso with Cilantro Cream, Little Bean Burritos and Tiny Taco Salads."
      },
      {
        "id": "tvmaze:2401231",
        "title": "It's Harvest Time",
        "season": 11,
        "episode": 8,
        "released": "2022-10-23",
        "overview": "With Nick working the wheat harvest, Molly Yeh is inspired to make him a hearty lunch while indulging in her own wheat-noodle delights. Molly gets to cooking her Ginger Chicken Meatballs on Soy Sauce Braised Cabbage, Yeasted Scallion Pancakes and Hand Pulled Chili Oil Noodles. Then, she finishes up lunch with a sweet and sticky Matcha Mochi."
      },
      {
        "id": "tvmaze:2401234",
        "title": "Pumpkin Carving Party",
        "season": 11,
        "episode": 9,
        "released": "2022-10-30",
        "overview": "Molly Yeh is hosting a pumpkin-carving soiree! To go with all the festive fun, she's prepared a monstrous menu of Sausage Mummies and Bacon and Greens Pumpkin Lasagna. Then, she's ready to hand out some tricky treats with her Chocolate Tahini Dirt Cup Pudding with Homemade Gummy Worms and Homemade Salted Nutty Nougat Rolls."
      },
      {
        "id": "tvmaze:2401235",
        "title": "New Book Release Dinner Party",
        "season": 11,
        "episode": 10,
        "released": "2022-11-06",
        "overview": "To celebrate the release of her second book, Molly Yeh is serving her guests a few of her favs. She'll be cooking Rotisserie Chicken Fattoush with Sumac Vinaigrette, Classic Beef Tot Hotdish and Honey Cupcakes with Salted Honey Frosting. Plus, she's giving her guests a special take-home gift of Rhubarb Rose Jam."
      },
      {
        "id": "tvmaze:2431083",
        "title": "Chinese Thanksgiving",
        "season": 11,
        "episode": 11,
        "released": "2022-11-13",
        "overview": "Molly is hosting a Chinese-inspired Thanksgiving on the farm, and she's featuring a ton of mouthwatering mash-up dishes. To start her massive meal, Molly makes Five-Spice Turkey with Sweet and Sour Glaze served with sides of Sticky Rice Stuffing and Greens with Crispy Onions and Chili Crisp. For dessert, she puts a spin on a classic with her Mandarin Meringue Pie"
      },
      {
        "id": "tvmaze:2431086",
        "title": "Hanukkah Cocktail Party",
        "season": 11,
        "episode": 12,
        "released": "2022-11-27",
        "overview": "Molly Yeh gets ready for Hanukkah with heaps of tasty and traditional treats. She whips up a Spinach and Feta Dip with Cheesy Twists, bakes Tomato Jam Rugelach and fries Latkes with Eggs and Greens. For a sweet finish, she makes indulgent Marzipan Sugar Plum Sufganiyot."
      },
      {
        "id": "tvmaze:2431087",
        "title": "Have Yourself A Molly Little Christmas",
        "season": 11,
        "episode": 13,
        "released": "2022-12-04",
        "overview": "From super sweet buns to gingerbread houses, Molly Yeh has her whole Christmas Day figured out! On the savory side, Molly cooks up a Whole Fish with her Broccoli Mac and Cheese. She indulges her sweet tooth with Stollen Swirly Buns and an adorable Gingerbread Farmhouse."
      },
      {
        "id": "tvmaze:2443430",
        "title": "Molly's Favorite Brunch",
        "season": 12,
        "episode": 1,
        "released": "2023-01-01",
        "overview": "Molly Yeh is hosting a brunch extravaganza on the farm with all her Middle Eastern-inspired favorites. It's a meal full of flavor, color and texture as Molly makes Falafel Waffles with Creamy Lemon Yogurt Slaw, a Scallion-Marinated Labneh Balls Board and Chocolate Rose Buns for dessert. She finishes things off with a sweet and bubbly treat of Peachy Basil Marzipan Soda."
      },
      {
        "id": "tvmaze:2459672",
        "title": "One Great Date Night",
        "season": 12,
        "episode": 2,
        "released": "2023-01-08",
        "overview": "There is one small section of time between harvest and planting when Nick is available for date night, and tonight's the night! Molly Yeh packs a picnic dinner complete with Meat-Stuffed Pitas with Yogurt Tahini Sauce, Couscous Salad with Pistachios and Dates and Cold Curried Cauliflower. Then, they'll enjoy the best view in town as they snack on Fizzy Rock Potato Chips."
      },
      {
        "id": "tvmaze:2459673",
        "title": "Hearty Harvest Lunch",
        "season": 12,
        "episode": 3,
        "released": "2023-01-15",
        "overview": "Molly Yeh believes the farmers harvesting the beets need nourishment to get through the long days, so she's feeding the hungry crew with a hearty meal! Molly packs them Pulled Pork Sandwiches with Charred Broccoli Slaw and a side of Beet Chips with French Onion Yogurt. For a sweet treat, she adds some of her Thick Frosted Speculoos Cookie Bars and S'mores Puppy Chow."
      },
      {
        "id": "tvmaze:2459674",
        "title": "Big Game, Big Tastes!",
        "season": 12,
        "episode": 4,
        "released": "2023-01-22",
        "overview": "Molly Yeh is bringing big tastes to the big game! Her fun and filling menu teams a Corndog Hotdish with her Fried Green Beans with Spicy Ranch Aioli and tangy Pickle Roll-Ups. For overtime, she whips up a Sweet Cheese Ball that can feed a crowd!"
      },
      {
        "id": "tvmaze:2459676",
        "title": "Oh Canada - Yum!",
        "season": 12,
        "episode": 5,
        "released": "2023-01-29",
        "overview": "Molly Yeh shows her affection for our northern neighbor by making the best Canadian eats and treats. She prepares a Ham and Pineapple Pizza, Maple Walnut Nanaimo Bars and a Bloody Caesar Salad. For the ultimate mash-up of Midwestern and Canadian flavors, Molly put together a Hot Tot Short Rib Poutine."
      },
      {
        "id": "tvmaze:2473500",
        "title": "Molly's Fast Food Fun Day",
        "season": 12,
        "episode": 6,
        "released": "2023-02-05",
        "overview": "Molly Yeh is making some super fun, colorful and tasty Pan-Asian fast foods with a homespun edge! Molly starts her snack day with a sticky Char Siu Sandwich and savory BEC Fried Rice before showing off her sweeter side with a fish-shaped Chocolate Taiyaki and refreshing Strawberry Milk Tea."
      },
      {
        "id": "tvmaze:2473501",
        "title": "Sweethearts Day",
        "season": 12,
        "episode": 7,
        "released": "2023-02-12",
        "overview": "Just in time for the sweetest day of the year, Molly Yeh creates treats that are sure to win hearts! On the savory side, she whips up a creamy Roasted Red Pepper White Bean Dip and extra-flavorful Salmon Rice Bowls with Crisp Roasted Broccoli. Then, Molly gets super sweet with her Chocolate Chocolate Halva Walnut Cookies and Chocolate Chunk Cherry Cobbler."
      },
      {
        "id": "tvmaze:2473502",
        "title": "Polish Deliciousness",
        "season": 12,
        "episode": 8,
        "released": "2023-02-19",
        "overview": "Molly Yeh uses the delicious flavors of Poland to create a comforting feast! She creates a hearty meal of fluffy Cheese Pierogies, savory White Borscht Soup and tangy Sauerkraut Pancakes. For dessert, Molly bakes up sweet and flaky Kolacky Cookies."
      },
      {
        "id": "tvmaze:2473503",
        "title": "Final Touches House Reno",
        "season": 12,
        "episode": 9,
        "released": "2023-02-26",
        "overview": "Molly Yeh and Nick love being comfortable, so they're dining in a special place as Nick installs the final touches on their house reno -- their new porch swing! For a cozy night in, Molly cooks up Wild Rice Pancakes with Cherry Compote, Everything Bagel Chicken and Biscuits and Kimchi Potato Salad. Plus, they'll swing the night away with a slice of her Chocolate Peanut Butter Sheet Cake."
      },
      {
        "id": "tvmaze:2497099",
        "title": "From Whitey's to Bernie's",
        "season": 12,
        "episode": 10,
        "released": "2023-03-05",
        "overview": "Molly Yeh and Nick unearth local lore by reviving a historic speakeasy, Whitey's Wonderbar. With echoes of bootleg gin and illegal gambling infusing the halls, Molly gets inspired to make Crispy Roasted Chicken with Carrots and Potatoes, a Homemade Bread, Butter &amp; Relish Plate and Whitefish Dip. Plus, she creates a special dessert bar celebrating the building's namesake."
      },
      {
        "id": "tvmaze:2497100",
        "title": "Best of Bernie's",
        "season": 12,
        "episode": 11,
        "released": "2023-03-12",
        "overview": "With the restaurant opening just weeks away, Molly puts the finishing touches on Bernie's menu to reflect the farm-to-table concept. She prepares a Wild Rice Burger with Bacon and Cheese, an earthy Green Goddess Salad and satisfying Good Bistro Fries. Plus, Molly adds her signature, sprinkled touch to dessert with Sprinkle Cake Donuts."
      },
      {
        "id": "tvmaze:2497101",
        "title": "Brunching at Bernie's",
        "season": 12,
        "episode": 12,
        "released": "2023-03-19",
        "overview": "Molly Yeh is determined to create the ultimate brunch menu for the new restaurant. Working with flavors Whitey would have loved, Molly fixes a full breakfast plate of Eggs Bernadette, Bernie's House Breakfast Sausage and a Gigantic Frosted Cardamom Roll. Brunch isn't complete without cocktails, so Molly pours her refreshing Rhubarb Basil Shrub."
      },
      {
        "id": "tvmaze:2497102",
        "title": "Happy Anniversary Mom and Dad",
        "season": 12,
        "episode": 13,
        "released": "2023-03-26",
        "overview": "Nick's parents are celebrating their 41st wedding anniversary, so Molly Yeh puts a twist on foods they've enjoyed through the years. She does her own take on Tofu Schnitzel, Bean Soup with Challah Crouton and Crispy Roasted Brussels Sprouts. Plus, Molly blends sweet and savory flavors with her Jumbo Blue Corn Blueberry Muffins."
      },
      {
        "id": "tvmaze:2584078",
        "title": "Big Midwestern Tractor Lunch",
        "season": 13,
        "episode": 1,
        "released": "2023-07-09",
        "overview": "Molly Yeh makes a big ole Midwestern tractor lunch for her favorite farmer, starting with her jazzy Bacon and Ranch Grain Bowls, super fun Savory Monkey Bread with Creamy Veggie Dip for dunking, crispy Deep Fried Pickle Chips and for something sweet -- the most beautiful Giant Almond Butter Blossoms there ever were!"
      },
      {
        "id": "tvmaze:2593128",
        "title": "Fantabulous Kids Brunch",
        "season": 13,
        "episode": 2,
        "released": "2023-07-16",
        "overview": "Molly Yeh puts together the coolest kids' brunch in town for Bernie's preschool buddies, and everyone in the family can enjoy! She serves up savory Breakfast Sausage Stuffed Biscuits with runny, sunny-side-up eggs and maple syrup for dunking. Then, she makes Strawberry Vanilla Bean Pastry Pockets drizzled with Cream Cheese Glaze and sprinkles, easy Spinach Egg Bites and Frozen Peanut Butter Drinks the kiddos and parents will both love!"
      },
      {
        "id": "tvmaze:2593129",
        "title": "2nd 40th Bdays = Outdoor Pizza Party",
        "season": 13,
        "episode": 3,
        "released": "2023-07-23",
        "overview": "Molly Yeh throws an outdoor pizza party to celebrate her good friends' second 40th birthdays! She makes her meaty, cheesy Baloney Pizzas and a super crunchy Chicken Parm Caesar Salad! Then, she loosens everyone up with Five Spice Limoncello and her moist Matcha, Red Bean and Almond Rainbow Cookie Cake covered in chocolate that will make them feel like they're 40 again!"
      },
      {
        "id": "tvmaze:2593130",
        "title": "Globetrotting Dinner Night: Destination Korea",
        "season": 13,
        "episode": 4,
        "released": "2023-07-30",
        "overview": "Molly Yeh goes globetrotting with dinner while fixing up some of her favorite Korean-inspired foods! She makes her sweet and spicy Gochujang Meatloaf Sandwiches with tangy pickled cucumbers, oh-so-satisfyingly cheesy Korean Corn Dogs and their perfectly baked best friend: Spicy Blizzard Fries. To cap off the meal right, she finishes up with tangy Orange Bars with Sesame Crust that are to live for!"
      },
      {
        "id": "tvmaze:2604183",
        "title": "Chinese Nostalgia",
        "season": 13,
        "episode": 5,
        "released": "2023-08-06",
        "overview": "Aunt Lucy's in town, so she and Molly Yeh have a Chinese-inspired dinner to honor the family's favorite dishes! She makes her mouthwatering Mapo Tofu with Pork, fresh Chili Crisp Vinaigrette Salad covered with crunchy ramen noodles and silky Egg Drop Soup. For dessert, Molly bakes the tastiest pastries on the planet -- her Pineapple Buns!"
      },
      {
        "id": "tvmaze:2604186",
        "title": "Bernie and Ira's Day of Deliciousness",
        "season": 13,
        "episode": 6,
        "released": "2023-08-13",
        "overview": "Molly Yeh makes a slew of kid-friendly dishes that everyone will adore! She whips up her crispy Grilled Bacon, Egg and Cheese in a Basket with creamy Avocado Dip for dunking, a cozy Chicken Noodle Hot Dish to please the pickiest of eaters and the cutest breakfast combination ever -- Blueberry Muffin Smoothies with moist Mini Blueberry Muffin Garnishes!"
      },
      {
        "id": "tvmaze:2604187",
        "title": "The Real Farm Spouses of Wheat Harvest",
        "season": 13,
        "episode": 7,
        "released": "2023-08-20",
        "overview": "To celebrate the golden season, Molly Yeh hosts a lunch for the real farm spouses of wheat harvest. They'll enjoy hearty Sausage, Squash, Bean and Chard Soup with cloud-like Jumbo Cheesy Stuffed Pitas on the side and Crispy Spicy Broccoli with Yogurt. For dessert, everybody gets their own decadent and out-of-this-world adorable Sweet Potato Mini Cake with Cream Cheese Frosting."
      },
      {
        "id": "tvmaze:2604188",
        "title": "Swedish Send-Off",
        "season": 13,
        "episode": 8,
        "released": "2023-08-27",
        "overview": "Molly Yeh hosts a send-off party to destination: Sweden! She whips up a smorgasbord of delightful Swedish-inspired foods, like her sweet Rose Semlor buns with almond bellies and whipped cream toppers, classic savory Swedish Meatballs and a Big Green Salad with Tiny Hasselback Potatoes tossed in spicy Horseradish Dressing. She finishes up with the coolest party dish -- her Smorgastarta that combines salmon salad and egg salad sandwiches in cake form!"
      },
      {
        "id": "tvmaze:2636687",
        "title": "Long Days, Late Night BBQ Date",
        "season": 13,
        "episode": 9,
        "released": "2023-09-03",
        "overview": "Molly and Nick are having a late-night date night! She pulls out all the stops with her juicy Steak Party Sub loaded with deliciousness and a scrumptious Grilled Potato Salad with Zhoung Mayo. For dessert, Molly's velvety Orange Blossom Blondie Ice Cream coated in a rich White Chocolate Raspberry Shell is the perfect treat to end this sweet dinner!"
      },
      {
        "id": "tvmaze:2636688",
        "title": "Cool Mom on the Go!",
        "season": 13,
        "episode": 10,
        "released": "2023-09-10",
        "overview": "As a busy mom, Molly Yeh is always on the go. She has a slew of simple recipes to make life a little less complicated, like her make-ahead Midwestern Oatmeal Cookie Salads, easy and cheesy Pancetta, Kale and White Bean Melts and a fluffy Harissa Potato Chip Frittata. For dessert, her fudge-like Dark Chocolate Fridge Cake is filled with fun!"
      },
      {
        "id": "tvmaze:2636689",
        "title": "Rosh Hashanah Rowdy Good Fun",
        "season": 13,
        "episode": 11,
        "released": "2023-09-17",
        "overview": "Molly Yeh hosts a Rosh Hashanah dinner on the farm with some crave-worthy Jewish favorites! She makes her savory Challah Donuts with Squash Jam and Herby Cheese, tender Preserved Lemon Brisket and schmaltzy Shallow Fried Potatoes with Lemon, Dill and Scallions on the side. For dessert, her moist Honey Whiskey Cake cloaked in sugary glaze celebrates a sweet New Year!"
      },
      {
        "id": "tvmaze:2636690",
        "title": "Asian-Inspired Baseball Eats",
        "season": 13,
        "episode": 12,
        "released": "2023-09-24",
        "overview": "Molly Yeh throws a baseball tailgate on the farm with tons of Asian-inspired eats! She makes creamy Bok Choy Peanut Noodles that are oh-so-slurpable, thick and juicy Lion's Head Meatball Burgers topped with fried eggs and crunchy Asian Coleslaw on the side. For dessert, her ooey-gooey Mochi Chocolate Chip Cookies are a homerun!"
      },
      {
        "id": "tvmaze:2647468",
        "title": "Beet Harvest Bash",
        "season": 13,
        "episode": 13,
        "released": "2023-10-01",
        "overview": "It's the end of beet harvest season, and Molly Yeh has tons of food in store for the farmers. She whips up her cozy Chorizo and Tot Breakfast Burritos drizzled with ranch, mouthwatering Giant Sausage Pasta oozing with cheese and a citrusy Shaved Fennel Salad. For dessert, her celebratory Beet Red-ish Velvet Cake with Cream Cheese Frosting is truly unBEET-ABLE!"
      },
      {
        "id": "tvmaze:2823962",
        "title": "Sing-Along on the Farm",
        "season": 14,
        "episode": 1,
        "released": "2024-04-07",
        "overview": "Molly Yeh's hosting a sing-along on the farm, and she's preparing a tasty lunch for the occasion. She makes hearty and comforting Hamburger Mac and Cheese and adorable Chocolate PB and Strawberry J Cupcakes that sing with sweetness. Then, she whips up a quick and easy Korean-inspired dinner, Crispy Rice Bibimbap with ooey-gooey Corn Cheese on the side."
      },
      {
        "id": "tvmaze:2825284",
        "title": "Meet in the Middle",
        "season": 14,
        "episode": 2,
        "released": "2024-04-14",
        "overview": "Molly Yeh makes her favorite Middle Eastern dishes with a Midwestern touch. She prepares her fried Squash Falafel with a spicy Chipotle Ranch drizzled on top, super hearty and Meaty Twice Baked Potatoes with spicy harissa ketchup and her take on Basbousa, a nutty and sweet semolina cake cloaked in tart Cherry Compote for dessert. Plus, she has delicious Date Cream Soda Floats to sip and spoon on the side."
      },
      {
        "id": "tvmaze:2825285",
        "title": "Post Library Play Group",
        "season": 14,
        "episode": 3,
        "released": "2024-04-21",
        "overview": "Molly Yeh hosts brunch for Bernie's library play group to foster eating and reading well! She entices their taste buds with a crispy and salty Ham Frit-tot-ta, Sausage Breakfast Pals -- juicy pork and cheese sandwiches -- on homemade Hawaiian buns, and Spinach \"Cookies.\" Then for a sweet bite, she piles up Chocolate Chunk Peanut Butter Pancakes with fluffy Whipped Cream."
      },
      {
        "id": "tvmaze:2825286",
        "title": "Fancy Farm Dinner Party",
        "season": 14,
        "episode": 4,
        "released": "2024-04-28",
        "overview": "Molly Yeh's throwing a fancy dinner on the farm with the best moms she knows! It's a meal to impress with her tender Beef Wellington encased in buttery, flakey puff pastry and served with a hearty, cheesy and surprisingly fresh Sausage and Wild Rice Hotdish on the side. For dessert, she has lovely Lavender Panna Cottas with salty, snappy Pretzel Shortbread."
      },
      {
        "id": "tvmaze:2825288",
        "title": "Spiced-Up Date Night",
        "season": 14,
        "episode": 5,
        "released": "2024-05-05",
        "overview": "It's Valentine's, so Molly Yeh spices things up with a dinner date on the farm! She gets cooking with Juicy Roasted Sumac Chicken dripping with hot and tangy Zhug sauce, sweet and smoky Matbucha on a fluffy bed of whipped feta, Veggie Fried Rice with warming Middle Eastern spices and deliciously dangerous Chocolate Cardamom Cake Donuts for dessert!"
      },
      {
        "id": "tvmaze:2825289",
        "title": "Moms' Night In",
        "season": 14,
        "episode": 6,
        "released": "2024-05-12",
        "overview": "Molly Yeh hosts a moms' night in with her friends on the farm, and there's plenty of good food! She cooks up Grilled Salmon on a bed of colorful Charred Veggie Lemon Orzo, a salty Salami Nicoise Salad, icy cold Elderflower Slushes for sipping and cute-as-a-button Peach Shortcakes to round out the meal."
      },
      {
        "id": "tvmaze:2825291",
        "title": "Farm to Tractor",
        "season": 14,
        "episode": 7,
        "released": "2024-05-19",
        "overview": "It's wheat harvest time, and Molly Yeh is making a totally tasty wheat truck lunch for two! She has hearty and crispy Fried Chicken Banh Mi Sandwiches, a side of Salt and Vinegar Potato Salad, a savory Miso Broccoli Grain Salad filled with the fruits of her farmer's labors, and a sweet and tart Pickled Plum Crumble for dessert."
      },
      {
        "id": "tvmaze:3063840",
        "title": "Asian-Inspired Football Fabulousness",
        "season": 14,
        "episode": 8,
        "released": "2024-11-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3063841",
        "title": "Lawn Game Fun, Harvest Included",
        "season": 14,
        "episode": 9,
        "released": "2024-11-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3063842",
        "title": "It's Delicious Being Green",
        "season": 14,
        "episode": 10,
        "released": "2024-12-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3063843",
        "title": "The Year of the Dragon",
        "season": 14,
        "episode": 11,
        "released": "2024-12-08",
        "overview": "Molly Yeh's coolest cousins are in town, so she's making a Chinese dinner to celebrate! She prepares her mouthwatering Char Siu Meatball Sliders, lucky Long Noodle Pasta Salad coated in a mayo-y Chili Crisp sauce, perfectly salty Soy Sauce Deviled Eggs, and a moist Toasted Sesame Layer Cake for dessert."
      },
      {
        "id": "tvmaze:3063844",
        "title": "Farm-Style Brunch",
        "season": 14,
        "episode": 12,
        "released": "2024-12-15",
        "overview": "Molly Yeh makes a delicious farm-style brunch for her family that's chock-full of flavor! She prepares big, meaty Chorizo Scotch Eggs with oozy golden yolks, homemade English Muffins slathered in fresh Chive Butter, tangy Green Juice Pops with a shot of booze on the side and moist Mixed Berry Crumb Cake!"
      },
      {
        "id": "tvmaze:3063845",
        "title": "Mighty, Mighty Midwest Meals",
        "season": 14,
        "episode": 13,
        "released": "2024-12-22",
        "overview": "Molly Yeh makes a mighty Midwestern \"big girl lunch\" to treat her oldest daughter! They bond over a creamy and cheesy Chicken Fajita Hotdish and ooey-gooey Monster Cookie Crispy Rice Treats on the side. Then, dinner's a delicious doozy for the fam with hearty Chinese Black Bean Sloppy Joes and slurp-able Wild Rice Soup."
      },
      {
        "id": "tvmaze:3180874",
        "title": "Superhero Birthday Bash for Bette",
        "season": 15,
        "episode": 1,
        "released": "2025-04-06",
        "overview": "Molly Yeh throws a superhero-themed birthday bash on the farm for her niece, Bette! She saves the day with her a Chocolate Beet Superhero Cake, Green Pesto Pasta with Burrata, a Pepperoni Pizza Cheeseball with crunchy Cheese Crackers, and Salami Chopped Salads in Bread Bowls!"
      },
      {
        "id": "tvmaze:3180875",
        "title": "Mini Van Test Drive Meal",
        "season": 15,
        "episode": 2,
        "released": "2025-04-13",
        "overview": "Molly Yeh and Nick are test driving a new van for the family, so Molly whips up some of her fast-food faves to try out in the vehicle. She hits the road with Smoked Turkey and Brie Horseshoe Sandwiches, Air Fryer Chicken Nuggets with Creamy Marinara Sauce, Gooey Butter Cake on a Stick and Pistachio Milkshakes that'll hopefully fit into the cup holders nicely!"
      },
      {
        "id": "tvmaze:3180876",
        "title": "Cookbook Club Potluck: Midwest Church Cookbook Edition",
        "season": 15,
        "episode": 3,
        "released": "2025-04-20",
        "overview": "It's Molly Yeh's turn to host her cookbook club, and this week's theme: Midwest church cookbooks. She puts her own twists on some classics to serve up a Ham and Bean Hotdish, Boozy Gelatin Salad, Midwest Green Salad, and Miso Millionaire Bars for dessert! Best club ever!"
      },
      {
        "id": "tvmaze:3180877",
        "title": "Nap Time Meal Done Juuust Right!",
        "season": 15,
        "episode": 4,
        "released": "2025-04-27",
        "overview": "Molly Yeh makes a delicious dinner during naptime! She sneaks away to prepare Slow Cooker Asian Wedding Soup, 1-Dish Salmon and Veggies, Tamagoyaki and a Red Bean Snacking Cake with Yogurt Glaze. It's all so easy, she'll even have time for a nap herself!"
      },
      {
        "id": "tvmaze:3199465",
        "title": "Sisters' Mexico Trip Kick-Off",
        "season": 15,
        "episode": 5,
        "released": "2025-05-04",
        "overview": "Molly Yeh and her sisters are taking a trip to Mexico! To jump-start their taste buds, Molly makes Sausage, Egg and Cheese Tostada Wraps, Fried Flour Shell Turkey Tacos, a Charred Corn and Tomato Salad with Creamy Cilantro Green Goddess Dressing, and a Horchata Ice Cream Orange Soda Float to wash it all down. Let the adventure begin!"
      },
      {
        "id": "tvmaze:3199466",
        "title": "Sweet Farm Thank Yous",
        "season": 15,
        "episode": 6,
        "released": "2025-05-11",
        "overview": "Molly Yeh makes a meal to thank all the people in her life who helped with her new cookbook! She shares her Puffy Potato Donuts with a Tahini Vanilla Pastry Cream, Blueberry Speculoos Slab Pie, an Upside Down Hotdish and Hot Dog Chopped Salad. Yum!"
      },
      {
        "id": "tvmaze:3199467",
        "title": "Dim Sum Story Time",
        "season": 15,
        "episode": 7,
        "released": "2025-05-18",
        "overview": "Once upon a time ... it was dim sum story time on the farm! For the occasion, Molly Yeh makes Shrimp Fun Rolls, Sticky Fried Rice with Lap Cheong, fluffy Ginger Scallion Chicken Steamed Buns and a Matcha Crepe Cake. Yum!"
      },
      {
        "id": "tvmaze:3429822",
        "title": "Cousins' Costume Bonfire",
        "season": 15,
        "episode": 8,
        "released": "2025-11-16",
        "overview": "Molly Yeh plans on hosting a costume bonfire for her cousins, so she makes Summer Sausage en Croute, a Pot of Beans with Runny Eggs, steamy Kinako White Hot Chocolates and Red Velvet S'mores with Black Sesame Marshmallows to toast around the fire."
      },
      {
        "id": "tvmaze:3429823",
        "title": "A Big, Bread-y, Buttery Family Feast",
        "season": 15,
        "episode": 9,
        "released": "2025-11-23",
        "overview": "Molly Yeh wants to host a big, bread-y, buttery family feast, so she prepares Buttery Ham with a Spiced Honey Glaze, pillowy Parker House Rolls, Bacon Brussels Sprout Stuffing and a smooth Chocolate Coconut Silk Pie for dessert. Yay!"
      },
      {
        "id": "tvmaze:3429824",
        "title": "Beet Harvest Bake Off and Big Farm Lunch",
        "season": 15,
        "episode": 10,
        "released": "2025-11-30",
        "overview": "It's harvest time, and Molly Yeh hosts a bake-off for the farmers in the shop, submitting her own Chocolate Combine Cookies! Then, she makes a big lunch with hearty Bacon Frittata Focaccia Sandwiches, Kimchi Mac and Cheese, and Broccolini and Cannellini Soup!"
      }
    ]
  }
}