{
  "meta": {
    "id": "tvmaze:71390",
    "type": "series",
    "name": "Ms. Pat Settles It",
    "description": "Comedian Ms. Pat takes the bench to rule on real cases -- where real-life relationships hang in the balance -- with help from a wise(cracking) jury of friends, family and guest comics.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/595/1489883.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/595/1489883.jpg",
    "videos": [
      {
        "id": "tvmaze:3452010",
        "title": "The Twin, the Ex & the Karaoke Queen",
        "season": 3,
        "episode": 10,
        "released": "2025-12-16",
        "overview": "Judge Ms. Pat settles three crazy cases including a lease dispute with a wannabe karaoke star, an ex-hubby crashes the family minivan he didn't pay for, &amp; one twin sticks the other with a sky-high phone bill after her Dominican Republic girls' trip."
      },
      {
        "id": "tvmaze:3452009",
        "title": "Cousins, Clout & Crazy Glue",
        "season": 3,
        "episode": 9,
        "released": "2025-12-09",
        "overview": "Judge Ms. Pat settles three cases: cousins clashing over unpaid wedding catering services, a BFF who glued her friend's eye shut and left her with an ER bill, and a podcast partner claiming she built the brand but got ditched."
      },
      {
        "id": "tvmaze:2649313",
        "title": "From Romance to Robbery",
        "season": 1,
        "episode": 1,
        "released": "2023-10-18",
        "overview": "Judge Ms. Pat settles cases that include exes disputing over a missing transmission with an uncle in the middle, a reneged trade between foul-mouthed church friends, and a curious case of dognapping."
      },
      {
        "id": "tvmaze:2649314",
        "title": "Trippin' Over Trippin'",
        "season": 1,
        "episode": 2,
        "released": "2023-10-18",
        "overview": "Judge Ms. Pat settles cases that feature a wig job gone wrong when one client goes from Farrah Fawcett to Joe Dirt, a boss tripping over tips after his employee refuses to cough up extra dough, and exes debating."
      },
      {
        "id": "tvmaze:2668266",
        "title": "Girls Trip No Dudes Allowed",
        "season": 1,
        "episode": 3,
        "released": "2023-10-25",
        "overview": "Judge Ms. Pat settles cases that include a disagreement between besties over limo rides and tamale lies, a broken girls' trip NDA, and a busted family heirloom."
      },
      {
        "id": "tvmaze:2668267",
        "title": "I Ain't God, I Don't Love You",
        "season": 1,
        "episode": 4,
        "released": "2023-10-25",
        "overview": "Judge Ms. Pat settles cases that features cousins whose cruise plans sunk, former friends fighting over a missing monkey, and a mother and daughter's dispute over a phone bill way past due."
      },
      {
        "id": "tvmaze:2668268",
        "title": "Catfished and Carjacked",
        "season": 1,
        "episode": 5,
        "released": "2023-11-01",
        "overview": "Judge Ms. Pat settles cases, including a loan between friends that turns to carjacking, a trespassing incident in which a romp is caught on ring camera, and a friend who wants her loan paid back."
      },
      {
        "id": "tvmaze:2668269",
        "title": "Body by Insurance Check",
        "season": 1,
        "episode": 6,
        "released": "2023-11-01",
        "overview": "Judge Ms. Pat settles cases that include unapproved dress alterations that removed breast breathing room, twins disputing over a rental property party, and a husband and wife on the brink of divorce after she stole his insurance money."
      },
      {
        "id": "tvmaze:2675427",
        "title": "We Ain't Even Married",
        "season": 1,
        "episode": 7,
        "released": "2023-11-08",
        "overview": "Judge Ms. Pat settles cases that include blown off babysitting duties that ruined a sister's \"pasta &amp; lobsta\" plans, a couple that loses engagement rings but never their love and a younger brother DONE taking care of his needy big bro."
      },
      {
        "id": "tvmaze:2675428",
        "title": "Even God Can't Fix Ugly",
        "season": 1,
        "episode": 8,
        "released": "2023-11-08",
        "overview": "Judge Ms. Pat settles cases that include a niece suing her uncle for a pageant loan but he says they are MORE than even, a daughter suing her mother for a questionable car repossession and a little sis suing her big sis for crashing her crib."
      },
      {
        "id": "tvmaze:2683643",
        "title": "Poppin' Off Over Popped Bottles",
        "season": 1,
        "episode": 9,
        "released": "2023-11-15",
        "overview": "Judge Ms. Pat settles cases that include a son suing his lying-money-mooching-mama, lifelong best friends disputing over rent money and a cousin who took back her bottle service birthday present."
      },
      {
        "id": "tvmaze:2683644",
        "title": "Catering Job Catastrophe",
        "season": 1,
        "episode": 10,
        "released": "2023-11-15",
        "overview": "Judge Ms. Pat settles cases that include a hairy situation between salon owner and stylist, a woman trying to hook her friend up with a catering job and a poor paint job that dried up a friendship."
      },
      {
        "id": "tvmaze:2685195",
        "title": "Vacay For Babay?",
        "season": 1,
        "episode": 11,
        "released": "2023-11-22",
        "overview": "Judge Ms. Pat presides over cases involving best friends bickering about a glam job gone wrong, cousins disputing over a slip and fall accident and expenses incurred on a baby-making trip."
      },
      {
        "id": "tvmaze:2685196",
        "title": "Livin' Aint Free",
        "season": 1,
        "episode": 12,
        "released": "2023-11-29",
        "overview": "Judge Ms. Pat settles cases involving an unpaid loan between a woman and her sole employee, a barber shop rent dispute and sisters at odds with one another over a missing necklace."
      },
      {
        "id": "tvmaze:2693145",
        "title": "Don't Change Your Tune Now!",
        "season": 1,
        "episode": 13,
        "released": "2023-12-06",
        "overview": "Judge Ms. Pat hears cases involving a woman seeking repayment from a would-be rapper, a divorcing couple's dispute over a car loan and a mother suing her daughter for tax money."
      },
      {
        "id": "tvmaze:2693147",
        "title": "Synthetic Shenanigans",
        "season": 1,
        "episode": 14,
        "released": "2023-12-13",
        "overview": "Judge Ms. Pat settles cases that include a friendship that came to a screeching halt at a reggae fest, exes who are at war over synthetic wigs and friends brawling over a bad boutique review."
      },
      {
        "id": "tvmaze:2706707",
        "title": "You A Nasty Roomie!",
        "season": 1,
        "episode": 15,
        "released": "2023-12-20",
        "overview": "Judge Ms. Pat settles cases that include a roommate from hell and one nasty razor, an engaged couple whose trust issues got taken out on a car and a sister-in-law whose house-sitting caused a tsunami setback."
      },
      {
        "id": "tvmaze:2832289",
        "title": "Shady Sister Swipe",
        "season": 1,
        "episode": 16,
        "released": "2024-05-29",
        "overview": "A roommate is more focused on romance than bromance; a little sister is stiffed by her credit card swiping big sister; a couple clashes over a lost social media opportunity."
      },
      {
        "id": "tvmaze:2881803",
        "title": "No Benjamins, No Beats",
        "season": 1,
        "episode": 17,
        "released": "2024-06-05",
        "overview": "Judge Ms. Pat settles cases that include a social media standoff over an unpaid wig install, a music video payment remix and one sister who refuses to pay the other for a loan because she feels like she's loaded!"
      },
      {
        "id": "tvmaze:2896796",
        "title": "When Love Gives You Lemons",
        "season": 1,
        "episode": 18,
        "released": "2024-06-12",
        "overview": "A business exchange turns into a money pit; exes fight over a lemonade business; cousins fight over a crashed car."
      },
      {
        "id": "tvmaze:2906583",
        "title": "Take The Man, Leave The Bags",
        "season": 1,
        "episode": 19,
        "released": "2024-06-19",
        "overview": "Judge Ms. Pat settles cases that include a situationship turned sour, a mother suing her daughter over a cruise bill and ex-besties who are fighting over gifts, not the guy."
      },
      {
        "id": "tvmaze:2916506",
        "title": "A Hairy Situation",
        "season": 1,
        "episode": 20,
        "released": "2024-06-26",
        "overview": "Cases that include hairy services exchange, former friends with benefits fighting over free massages and an ex-girlfriend who wants her ex-boyfriend to kick rocks after he returns her kicks."
      },
      {
        "id": "tvmaze:2953323",
        "title": "These Clothes Are Real…Real Fake",
        "season": 2,
        "episode": 1,
        "released": "2024-07-31",
        "overview": "Judge Ms. Pat settles three cases that include former friends fighting over fake fashion, a social media show turned sour and a couple who wants to make it official, after they solve their loan dispute."
      },
      {
        "id": "tvmaze:2953324",
        "title": "Sis, This Wedding Cake Is Wack",
        "season": 2,
        "episode": 2,
        "released": "2024-08-07",
        "overview": "Judge Ms. Pat settles three cases that include pals from the pen fighting over money owed for transcription work, exes in a delivery app dispute, and sisters whose relationship is a mess over a hot mess wedding cake."
      },
      {
        "id": "tvmaze:2974515",
        "title": "Tinderoni Troubles",
        "season": 2,
        "episode": 3,
        "released": "2024-08-14",
        "overview": "Judge Ms. Pat settles three cases that include sisters suing their mom for a car loan, but mom says they got into two accidents in one day, a roommate situationship that ended after a week and cousins fighting over a busted up water heater."
      },
      {
        "id": "tvmaze:2974529",
        "title": "Jealous Exes & Cracked Screens",
        "season": 2,
        "episode": 4,
        "released": "2024-08-21",
        "overview": "Judge Ms. Pat settle three cases; besties who fell out over a turkey burger fall; a music video that was never shot because the talent looked like Kelly No-Roland; two jealous exes and a broken cell phone."
      },
      {
        "id": "tvmaze:2980314",
        "title": "Cuz, You Botched My BBL",
        "season": 2,
        "episode": 5,
        "released": "2024-08-28",
        "overview": "Judge Ms. Pat settles three cases that include a botched BBL that left cousins beefing, friends fighting over a dog haircut gone wrong and sisters squabbling over money owed for rap career management."
      },
      {
        "id": "tvmaze:2984281",
        "title": "DROP THE MIC & MY CHECK!",
        "season": 2,
        "episode": 6,
        "released": "2024-09-04",
        "overview": "Judge Ms. Pat settles three cases that include one bad balloon arch, a mom suing her spoiled son for stealing her credit card to buy  himself a mic, and friends feuding over a Louis Vuitton slide that became a high-priced chew toy."
      },
      {
        "id": "tvmaze:2990694",
        "title": "Scissors & Sabotage",
        "season": 2,
        "episode": 7,
        "released": "2024-09-18",
        "overview": "Judge Ms. Pat settles three cases that include a gospel rapping mom suing her daughter for making music without her; former friends beefing over an unpaid check; former hair stylists who cut each other out of their lives over beauty supplies."
      },
      {
        "id": "tvmaze:2994939",
        "title": "Pump the Breaks and Pay Me",
        "season": 2,
        "episode": 8,
        "released": "2024-09-18",
        "overview": "Judge Ms. Pat settles three cases that include a sister suing her baby brother for crashing her car, friends feuding over a copycat cheesecake, and sisters who trippin over trips that never took off."
      },
      {
        "id": "tvmaze:3003149",
        "title": "Drippin' & Dippin' Out On The Car Payment",
        "season": 2,
        "episode": 9,
        "released": "2024-09-25",
        "overview": "Settling three cases that include co-parents who can't agree on who owes for a failed vacay, a big sister suing her little sister after missing a Drake concert, and a husband and wife suing their dripped down cousin for not paying his car note."
      },
      {
        "id": "tvmaze:3004583",
        "title": "Slayed Faces, Fried Edges",
        "season": 2,
        "episode": 10,
        "released": "2024-10-02",
        "overview": "Judge Ms. Pat settles three cases that include cousins clashing over a crashed car, a photographer mom battling her client daughter who won't pay up, and an auntie waging war against her nephew after he fried her edges right off!"
      },
      {
        "id": "tvmaze:3215531",
        "title": "If We Ain't a Thing, Gimme Back My Ring!",
        "season": 2,
        "episode": 11,
        "released": "2025-04-30",
        "overview": "Judge Ms. Pat settles three cases, including sisters squabbling over a stolen and wrecked car, best friends who can't agree on what ‘treat yo' self' means when it's on someone else's card, and exes in a standoff over who keeps the engagement ring."
      },
      {
        "id": "tvmaze:3225307",
        "title": "Kicked out on Christmas",
        "season": 2,
        "episode": 12,
        "released": "2025-05-07",
        "overview": "Ms. Pat settles three cases, including a daughter suing her mother for ruining her credit, an uncle fighting with his niece over a costly yacht trip, and a rent dispute between exes."
      },
      {
        "id": "tvmaze:3240901",
        "title": "Ghost Ridin' My Whip",
        "season": 2,
        "episode": 13,
        "released": "2025-05-14",
        "overview": "Judge Ms. Pat settles three cases, including sisters fighting over borrowed clothes, friends wigging out over a hair disaster, and ex-BFFs duking it out over an unpaid car note."
      },
      {
        "id": "tvmaze:3233737",
        "title": "Forget the Kisses, You Keyed My Car",
        "season": 2,
        "episode": 14,
        "released": "2025-05-21",
        "overview": "Judge Ms. Pat settles three cases, including an ex suing her former flame for keying her car, a sibling dispute over unpaid rent, and a promo deal gone wrong between ex-besties."
      },
      {
        "id": "tvmaze:3243421",
        "title": "You Stole My Chanel, Go to Hell",
        "season": 2,
        "episode": 15,
        "released": "2025-05-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3248773",
        "title": "My Paycheck Doesn't Check Out",
        "season": 2,
        "episode": 16,
        "released": "2025-06-04",
        "overview": "Judge Ms. Pat settles three cases that include an employee chasing down back pay from their boss, cousins butting heads over a suspended driver's license, and a friend who made a surprise pitstop in their buddy's ride!"
      },
      {
        "id": "tvmaze:3261872",
        "title": "You Botched My Hairdo & Stole My Boo",
        "season": 2,
        "episode": 17,
        "released": "2025-06-11",
        "overview": "Judge Ms. Pat settles three cases that include friends suing each other over whacky wheel woes, a sister suing her brother over a dog bite and a client confronting his stylist over a bad braids &amp; a broken heart."
      },
      {
        "id": "tvmaze:3270607",
        "title": "Rent, Romance & Regret",
        "season": 2,
        "episode": 18,
        "released": "2025-06-18",
        "overview": "Judge Ms. Pat settles three cases that include an ex suing his former partner over rent, former friends feuding over a sports betting blunder, and a daughter's drama with her mom over a trucking training course."
      },
      {
        "id": "tvmaze:3275565",
        "title": "Busted Bathroom Blowout",
        "season": 2,
        "episode": 19,
        "released": "2025-06-25",
        "overview": "Judge Ms. Pat settles three cases that include an employer suing his colleague over a model recruitment misstep, a mother suing her daughter over a house renovation, and two friends beefing over glam services for her maternity shoot."
      },
      {
        "id": "tvmaze:3283289",
        "title": "You Owe Me for VIP",
        "season": 2,
        "episode": 20,
        "released": "2025-07-02",
        "overview": "Judge Ms. Pat settles three cases that include brothers beefing over a damaged door &amp; lost key, former friends fighting over a pricey VIP fee, and besties blowing up over a beach vacation turned babysitting blunder."
      },
      {
        "id": "tvmaze:3402666",
        "title": "Bail, Baecation & Betrayal",
        "season": 3,
        "episode": 1,
        "released": "2025-11-04",
        "overview": "Judge Ms. Pat settles three cases — exes beefing over bail money and shady vacations, to a circus director who got played by his own contortionist, and a superfan who swiped his famous friend's card for a taco truck."
      },
      {
        "id": "tvmaze:3429836",
        "title": "The Wig, The Whip & The Woof",
        "season": 3,
        "episode": 2,
        "released": "2025-11-04",
        "overview": "Judge Ms. Pat settles three cases– exes fighting over hidden cheating footage &amp; a busted ride, cousins beefing after a dog turned Thanksgiving into an ER trip &amp; and an influencer calling out their hairstylist for a red-carpet disaster."
      },
      {
        "id": "tvmaze:3429834",
        "title": "You Can't Pay Rent With A Kidney",
        "season": 3,
        "episode": 3,
        "released": "2025-11-11",
        "overview": "Judge Ms. Pat settles three cases? a friend ghosting on a floor remodel job, an aunt chasing rent from her kidney-donating niece who won't leave, and a pet mom billing her ex after her dog got sick from fried chicken snagged off."
      },
      {
        "id": "tvmaze:3429835",
        "title": "Garbage, Grudges, And Grown-Up Rent",
        "season": 3,
        "episode": 4,
        "released": "2025-11-11",
        "overview": "Judge Ms. Pat settles three wild disputes: a neighbor demanding payback for trash duty and lawn care, an ex-accused of ditching a birthday bash over parking drama, and a son dragging his money hungry mom to court for sky-high rent."
      },
      {
        "id": "tvmaze:3439838",
        "title": "Siblings, Strip Clubs, & Stacks",
        "season": 3,
        "episode": 5,
        "released": "2025-11-18",
        "overview": "It's a wild day in court as Judge Ms. Pat settles three cases – from a twerk that broke a Vegas mirror to siblings fighting over strip club debts, and a man demanding payback after his ex-bestie gambled away their catering profits."
      },
      {
        "id": "tvmaze:3439839",
        "title": "Botox, Backstabs, & Busted Friendships",
        "season": 3,
        "episode": 6,
        "released": "2025-11-18",
        "overview": "Judge Ms. Pat settles three cases a Botox-happy mom who spent her daughter's dog funds on her face, a sister who loses her job when her sibling quits to chase a skincare dream, &amp; a comic who's footing the vaca bill after her bestie got hit by a car."
      },
      {
        "id": "tvmaze:3441171",
        "title": "Ditched The Bday Bash For A Smash",
        "season": 3,
        "episode": 7,
        "released": "2025-11-25",
        "overview": "Judge Ms. Pat settles three crazy cases? a birthday tradition ruined by a bestie's secret Vegas fling with her friend's brother, a roommate who stole the couch and dog when he moved out, and an actress chasing a paycheck."
      },
      {
        "id": "tvmaze:3441172",
        "title": "You Sold the Show & Sold Me Out",
        "season": 3,
        "episode": 8,
        "released": "2025-12-02",
        "overview": "Judge Ms. Pat settles three cases: a comic fuming after her friend sold out their showcase but kept all the cash, a woman upset after her BFF wrecked her grandma's Chevy with a bad oil change, and a man ghosted after bankrolling."
      }
    ]
  }
}