{
  "meta": {
    "id": "tvmaze:7677",
    "type": "series",
    "name": "Grand Designs: House of the Year",
    "description": "Every year the Royal Institute of British Architects looks for the best new home in Britain, and this time Grand Designs is along for the ride.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504203.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/601/1504203.jpg",
    "videos": [
      {
        "id": "tvmaze:3457120",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2025-12-10",
        "overview": "The search for the House of the Year 2025 reaches its finale, as Kevin McCloud, architect Damion Burrows and conservation architect Natasha Huq visit homes that have been dramatically transformed through rescue, re-invention or bold re-imagining. On the Isle of Wight, barns on the brink of collapse are saved and reborn as a luminous retreat, their battered shells now glowing with life. In London, a 1960s townhouse is stripped back, rebuilt and transformed into a striking example of high-end brutalism, the height of architectural sophistication in its day and re-imagined for modern family life. In Somerset, a draughty 1960s bungalow is swept away and replaced with a low-energy, loft-like house that almost disappears into the landscape. In Bath, a tired bungalow is completely overhauled, its flimsy frame wrapped in cedar shingles. In Suffolk, the very idea of what a house can be is completely transformed, where one home becomes four buildings - sleeping, living, working and utility - in a radical feat of architectural imagination. And finally, after finding out which of these incredible transformations has been shortlisted, the winner of the RIBA House of the Year 2025 is crowned."
      },
      {
        "id": "tvmaze:431653",
        "title": "Country Living",
        "season": 1,
        "episode": 1,
        "released": "2015-11-04",
        "overview": ""
      },
      {
        "id": "tvmaze:431654",
        "title": "House of the Year",
        "season": 1,
        "episode": 2,
        "released": "2015-11-11",
        "overview": ""
      },
      {
        "id": "tvmaze:431655",
        "title": "Grand Designs: House of the Year",
        "season": 1,
        "episode": 3,
        "released": "2015-11-18",
        "overview": ""
      },
      {
        "id": "tvmaze:431656",
        "title": "The Final",
        "season": 1,
        "episode": 4,
        "released": "2015-11-25",
        "overview": ""
      },
      {
        "id": "tvmaze:988378",
        "title": "Country Homes",
        "season": 2,
        "episode": 1,
        "released": "2016-11-24",
        "overview": "In this first episode, Kevin and co profile five amazing country homes on the long-list for the prize: including a large house camouflaged within a hill; a loving restoration in Wiltshire of a prototype modernist retreat; a Scottish home that blends an agricultural exterior with a sleek modern interior; and a slice of spectacular California modernism in Cornwall. Kevin then reveals which of these homes will make it onto the final shortlist."
      },
      {
        "id": "tvmaze:988478",
        "title": "Boundary Pushers",
        "season": 2,
        "episode": 2,
        "released": "2016-12-01",
        "overview": "Kevin McCloud hosts the competition run in conjunction with the Royal Institute of British Architects that celebrates excellence in housing design. Kevin is joined by Damion Burrows and Zac Monro as they explore some of Britain's most cutting-edge homes, all of them in the running for the prestigious prize - the Bafta of the architecture world. This time Kevin, Zac and Damion profile five homes that are testbeds for architectural ideas, pushing the boundaries for residential design: a cool, concealed house built from glass and concrete; an uber-creative Wallace and Gromit-style house in Edinburgh squeezed onto a disused plot; a gorgeous, low-slung modern home in Cumbria camouflaged with stone; an experimental extension in London with a Japanese flavour; and an elegant house in Buckinghamshire that combines sustainability with glamour. Kevin then reveals which one has made it onto the shortlist and is in with a chance of winning House of the Year 2016."
      },
      {
        "id": "tvmaze:991561",
        "title": "Space Makers",
        "season": 2,
        "episode": 3,
        "released": "2016-12-08",
        "overview": "Kevin McCloud reveals another five homes vying to be crowned House of the Year 2016. These are houses that create space out of the smallest sites. There's an ultra-stylish one bedroom live/work space with an experimental garden roof; the transformation of a dark mews into a light and airy family home; a beautiful blend of beach living and high architecture in Dungeness; a clever extension in Harrogate; and a narrow beachfront garage that's been made over into a stunning home packed with a large art collection."
      },
      {
        "id": "tvmaze:996016",
        "title": "The Final",
        "season": 2,
        "episode": 4,
        "released": "2016-12-15",
        "overview": "Kevin McCloud reveals the winner of the Royal Institute of British Architects House of the Year 2016. First though, there are four extraordinary nominated houses to review, all of which offer a creative response to a tricky site. There is a house stitched into a wall that sits between a Zen courtyard and an English walled garden; a clever, open plan family home built in a former allotment; a house made from a group of red tin pods on a piece of urban wasteland; and a large, glamorous home in Northumberland that creatively pulls northern light through the house."
      },
      {
        "id": "tvmaze:1348774",
        "title": "Local Materials",
        "season": 3,
        "episode": 1,
        "released": "2017-11-07",
        "overview": "The Local Materials category include an upscale shepherd's hut, a sleek Modernist house in Bath, and a London townhouse"
      },
      {
        "id": "tvmaze:1348775",
        "title": "Water",
        "season": 3,
        "episode": 2,
        "released": "2017-11-14",
        "overview": "This time, five designs with a watery connection, including a glamorous white, curvy, cliff-top home, a cork-clad house on stilts, and a unique home in London, with porthole windows and a gangplank"
      },
      {
        "id": "tvmaze:1352712",
        "title": "Homes in the Country",
        "season": 3,
        "episode": 3,
        "released": "2017-11-21",
        "overview": "This time, the shortlist for the Royal Institute of British Architects House of the Year includes a luxurious tree house and a converted 17th century barn in Devon."
      },
      {
        "id": "tvmaze:1357182",
        "title": "The Minimalists and the Winner",
        "season": 3,
        "episode": 4,
        "released": "2017-11-28",
        "overview": "In this final episode, Kevin McCloud reveals the winner of the most prestigious prize for residential architecture: the Royal Institute of British Architects House of the Year 2017. But first, Kevin, the architect Damion Burrows, and Michelle Ogundehin, editor-at-large of Elle Decoration, sift the final category from the long list, all of them homes that share a pared-back, minimal look. First, on the site of a former caretaker's shed in London, they visit a small but perfectly formed home with oak panelling and sleek polished concrete floors. In Suffolk, a suite of three buildings clad in flint and burned larch, are wrapped around a Persian-inspired courtyard. There's a finely crafted contemporary home packed onto a tiny site in south London; and finally, a luxurious family home, complete with swimming pool, built out of smoked oak and brick."
      },
      {
        "id": "tvmaze:1553973",
        "title": "Houses That Dare to Be Different",
        "season": 4,
        "episode": 1,
        "released": "2018-11-07",
        "overview": "A beautiful red house and a controversial glass building in Henley are just two of the daring, spectacular homes competing to go through to the final of the prestigious architectural award"
      },
      {
        "id": "tvmaze:1557349",
        "title": "Houses with a Past",
        "season": 4,
        "episode": 2,
        "released": "2018-11-14",
        "overview": "Five inspiring homes with a past bid for a place in the final, including a London gin distillery, a Devon farmhouse and a 400-year-old wreck"
      },
      {
        "id": "tvmaze:1561879",
        "title": "Extreme Houses",
        "season": 4,
        "episode": 3,
        "released": "2018-11-21",
        "overview": "Kevin McCloud, architect Damion Burrows, and design expert Michelle Ogundehin visit four more stunning homes looking to be crowned Riba House of the Year 2018. This time, the theme is Extreme Houses. There's an awe-inspiring set of cantilevered black boxes which push the limits of engineering; a far-flung 21st century crofter's cottage by a Loch in Scotland; a curvaceous minimal concrete home in London; and in Northern Ireland, a sculptural home designed around a single shape - the wedge. Which of them will make it onto the shortlist for the overall big prize?"
      },
      {
        "id": "tvmaze:1565570",
        "title": "The Final",
        "season": 4,
        "episode": 4,
        "released": "2018-11-28",
        "overview": "In this final episode, Kevin exclusively reveals the winner of the most prestigious prize for residential architecture, the Riba House of the Year 2018. But first, alongside architect Damion Burrows and design expert Michelle Ogundehin, he explores the last group of houses on the long list. Each one uses materials in interesting ways. In leafy Berkshire, there's a perfectly crafted timber box, with sleek concrete floors and giant six-metre windows. In Belfast, there is a small but perfectly formed house with black larch cladding. In Surrey, a completely revamped 1930s house with a pale brick and glass modernist extension blends beautifully into its setting. And finally, an experimental house in London makes the materials it's built from part of the design. Kevin then reveals which of these properties has made it onto the shortlist before exclusively announcing the overall winner of House of the Year."
      },
      {
        "id": "tvmaze:1734704",
        "title": "Experimental",
        "season": 5,
        "episode": 1,
        "released": "2019-10-23",
        "overview": ""
      },
      {
        "id": "tvmaze:1740994",
        "title": "Surroundings",
        "season": 5,
        "episode": 2,
        "released": "2019-10-30",
        "overview": ""
      },
      {
        "id": "tvmaze:1745460",
        "title": "Down to Earth",
        "season": 5,
        "episode": 3,
        "released": "2019-11-06",
        "overview": ""
      },
      {
        "id": "tvmaze:1750692",
        "title": "The Final",
        "season": 5,
        "episode": 4,
        "released": "2019-11-13",
        "overview": ""
      },
      {
        "id": "tvmaze:2215097",
        "title": "Houses That Take You by Surprise",
        "season": 6,
        "episode": 1,
        "released": "2021-11-17",
        "overview": "Kevin McCloud presents homes in the running for the 2021 Royal Institute of British Architects House of the Year. In the first programme, Kevin and his co-presenters, architect Damion Burrows and design expert Michelle Ogundehin, visit five breathtaking houses competing for a place on the shortlist - a 1960s- inspired water tower in rural Norfolk, a 21st-century addition to a Victorian London street, a sleek beach house beside a busy south coast boatyard, a 14th-century fortress in Cumbria with a radically contemporary interior and a Georgian farmhouse with an angular, space-age extension."
      },
      {
        "id": "tvmaze:2216625",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2021-11-24",
        "overview": "Kevin McCloud, Damion Burrows and Michelle Ogundehin visit five properties demonstrating exceptional use of materials and craftsmanship. They include a bold contemporary barn, forged from corten steel and concrete, a small urban house squeezed into a plot the size of a London Tube carriage, and a Scandi-Scottish lochside bolthole, hewn from Highland stone and Danish oak. The others are a wooden wonderland extension in east London and a Surrey home with an extraordinary engineered timber roof."
      },
      {
        "id": "tvmaze:2216626",
        "title": "Problem-Solving Houses",
        "season": 6,
        "episode": 3,
        "released": "2021-12-01",
        "overview": "Kevin McCloud, Damion Burrows and Michelle Ogundehin visit five properties that solve problems, including a camouflaged home that blends into its overlooked setting"
      },
      {
        "id": "tvmaze:2231841",
        "title": "The Final",
        "season": 6,
        "episode": 4,
        "released": "2021-12-08",
        "overview": "Kevin McCloud, Damion Burrows and Michelle Ogundehin visit the final five properties, one of which is added to the shortlist, before the winner is announced. This week they focus on houses that reinvent beloved types of building, including a 21st-century reboot of the classic Kentish oast, a low-key eco-home in Devon which turns the idea of the country house on its head and a cool contemporary reimagining of the suburban family house in Surrey."
      },
      {
        "id": "tvmaze:2432634",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2022-11-16",
        "overview": "Kevin McCloud is joined by architect Damion Burrows, design expert Michelle Ogundehin and conservation architect Natasha Huq to review the properties in the running for the 2022 Royal Institute of British Architects House of the Year award. They begin with five hard-to-build houses, from a playful pink beach house built to withstand fierce winds to a meticulous renovation of a 1960s home in Derbyshire and a DIY eco-home in Stirlingshire. They also visit a difficult-to-build reimagining of a redbrick house in Dorset and a London new-build that faced challenge after challenge."
      },
      {
        "id": "tvmaze:2432905",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2022-11-23",
        "overview": "Kevin McCloud visits five recently transformed homes that have been shortlisted for the RIBA House of the Year award. A barn renovation in Sussex, a reborn parchment factory in Northamptonshire, an eco-friendly mews house in London, a former cowshed in Dorset and two fused flats in the Kyles of Bute."
      },
      {
        "id": "tvmaze:2438942",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2022-11-30",
        "overview": "Kevin McCloud visits homes that, along with being nominated for the RIBA House of the Year prize, have pioneered a new architectural style by fusing mock-Tudor, modernism and industrial chic. A home in Derbyshire that experiments with reorganising space, a small-space design in an infill plot, an eco-extension on a historic cottage in Suffolk and a home in London remodelled complete with a mountain on the roof."
      },
      {
        "id": "tvmaze:2438974",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2022-12-07",
        "overview": "Kevin McCloud visits five houses praised for their use of materials and craftsmanship. A barn conversion in East Anglia, a minimal hymn to brick in Northern Ireland, an eco-terrace in London, a timber based eco-home in the Fens and an extension in Norwich. The winner of the RIBA House of the Year award is finally revealed."
      },
      {
        "id": "tvmaze:3441268",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2025-11-19",
        "overview": "Kevin McCloud is joined by architect Damion Burrows and conservation architect Natasha Huq to review the houses in the running for the 2025 Royal Institute of British Architects House of the Year award. The first six include up are a jewel-like home on a remote Hebridean island, a retreat carved into rock on the Cornish cliffs and a London home built behind a butcher's shop, where everything must be hauled through a one-metre alleyway."
      },
      {
        "id": "tvmaze:3441269",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2025-11-26",
        "overview": "On the Kent coast, a contemporary home makes the beach itself part of everyday life, blending work with an endless sense of escape. In east London, a landlocked plot is transformed into a sun-filled sanctuary, precisely angled to catch every ray while shutting out the city around it. In suburban Surrey, a burst of tropical colour, terracotta and greenery conjures the Caribbean. In London, a calm retreat draws on Japanese traditions, with timber frames and courtyards that blur the line between house and garden. In Wiltshire, soaring rooflines stretch outwards to frame vast views of cathedral spires and meadows. California comes to south London in the form of a dazzling American-style glass and steel home. Each house offers an experience like no other. But only the best will earn a place on the shortlist."
      },
      {
        "id": "tvmaze:3457119",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2025-12-03",
        "overview": "The search for the House of the Year 2025 continues with a home in Bannau Brycheiniog, the Brecon Beacons, built from sandstone quarried in the mountains it overlooks. Also, a project that used modern methods to reinvent Norwich's medieval brick tradition and a Suffolk property where handmade brick and Douglas fir beams combine in a striking cruciform design. Finally, an 18th-century Essex barn brought back to life beam-by-beam, its historic frame repaired with seasoned oak using centuries-old techniques."
      }
    ]
  }
}