{
  "meta": {
    "id": "tvmaze:63727",
    "type": "series",
    "name": "Gladiators",
    "description": "Gladiators welcomes a brand new generation of superhumans who will compete against contestants in the ultimate test of speed and strength. The new series will include brand new games alongside classic challenges, culminating at the end of each episode with fan favourite The Eliminator.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/499/1247733.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/499/1247733.jpg",
    "videos": [
      {
        "id": "tvmaze:3459114",
        "title": "Celebrity Special",
        "season": 2,
        "episode": null,
        "released": "2025-12-25",
        "overview": "Bradley and Barney Walsh host this special edition of the iconic series, which sees celebrities Joe Wicks, Sam Thompson, Nicola Adams and Vogue Williams take on the Gladiators."
      },
      {
        "id": "tvmaze:2732383",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2024-01-13",
        "overview": "Bradley and Barney Walsh host a revival of the competition show. Four contenders must face five brutal events before going head to head in the legendary Eliminator. Who has the will and the skill to conquer the infamous travelator and win a place in the quarter-finals? In the first episode, Legend makes a statement on Hang Tough, Sabre gets her claws out in The Ring and contenders feel Viper's venom on the Collision Bridge."
      },
      {
        "id": "tvmaze:2744715",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2024-01-20",
        "overview": "Contenders ready? Gladiators is back! Bradley and Barney Walsh host the iconic competition show, re-imagined for BBC One and BBC iPlayer. Get set for all the classic, action-packed battles alongside jaw-dropping new events and 16 mighty Gladiators.Four contenders must face our resident superhumans across five brutal events before going head-to-head in the legendary Eliminator. Who has the will and the skill to conquer the infamous Travelator and win a place in the quarter-finals? In this round, the contenders must take on the Gladiators in a brand new, terrifying event. The Edge is a giant lattice suspended high in the arena which contenders must cross. Facing them is one angry Gladiator determined to send them hurtling towards the floor 30 feet below."
      },
      {
        "id": "tvmaze:2744716",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2024-01-27",
        "overview": "Four contenders must face our resident superhumans across five brutal events before going head-to-head in the legendary Eliminator. Who has the will and the skill to conquer the infamous Travelator and win a place in the quarter-finals? Get ready to watch more epic events as the Gladiators hit hard in Duel, the contenders hit back in Gauntlet and buckle up for the tightest Eliminator of the series so far."
      },
      {
        "id": "tvmaze:2753163",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2024-02-03",
        "overview": "Bradley and Barney Walsh host as contenders take on the superhuman Gladiators for a quarter-final place. Comet takes on Hang Tough, and Diamond races up The Wall."
      },
      {
        "id": "tvmaze:2766501",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2024-02-10",
        "overview": "Bradley and Barney Walsh host a revival of the competition show in which four contenders must face five brutal events before going head to head in the legendary Eliminator. Legend gets into trouble on the Collision bridge and Fury gets ferocious in The Ring in a show that features the greatest comeback of the series so far."
      },
      {
        "id": "tvmaze:2770412",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2024-02-17",
        "overview": "Bradley and Barney Walsh host as contenders take on the superhuman Gladiators for a semi-final place. The Gladiators take the rules into their own hands in Gauntlet."
      },
      {
        "id": "tvmaze:2770414",
        "title": "Episode 7",
        "season": 1,
        "episode": 7,
        "released": "2024-02-24",
        "overview": "Bradley and Barney Walsh host as contenders take on the superhuman Gladiators for a semi-final place. Nitro meets his match and Viper's left hissing in Gauntlet."
      },
      {
        "id": "tvmaze:2784174",
        "title": "Episode 8",
        "season": 1,
        "episode": 8,
        "released": "2024-03-02",
        "overview": "Fire and Fury are in the Ring, Sabre clings on in Hang Tough, and there are two epic Eliminators as four contenders face the Gladiators for a place in the semi-finals."
      },
      {
        "id": "tvmaze:2784175",
        "title": "Episode 9",
        "season": 1,
        "episode": 9,
        "released": "2024-03-09",
        "overview": "Fury hits hard on the Edge, and Phantom ghosts his opponent in Duel, as the contenders battle it out for a place in the grand final."
      },
      {
        "id": "tvmaze:2798639",
        "title": "Episode 10",
        "season": 1,
        "episode": 10,
        "released": "2024-03-23",
        "overview": ""
      },
      {
        "id": "tvmaze:2807313",
        "title": "The Final",
        "season": 1,
        "episode": 11,
        "released": "2024-03-30",
        "overview": "Contenders ready? Bradley and Barney Walsh host as the Gladiators bring their A-game to the grand final. Everything comes down to this for the final four contenders as they battle it out to be crowned Gladiators Champion 2024."
      },
      {
        "id": "tvmaze:3108684",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2025-01-18",
        "overview": "The Gladiators are back, tougher than ever. Hosts Bradley and Barney Walsh reveal the return of the iconic event Atlaspheres as the gritty Contenders battle for a spot in the quarter-finals."
      },
      {
        "id": "tvmaze:3117941",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2025-01-25",
        "overview": "A new Gladiator storms into the arena, making a destructive debut. Bradley and Barney host as gritty Contenders take on the superhuman Gladiators for a quarter-final spot."
      },
      {
        "id": "tvmaze:3128153",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2025-02-01",
        "overview": "A thrilling new event unleashed is unleashed and leaves the Contenders running for their lives. Bradley and Barney host as the gritty Contenders take on the Gladiators for a quarter-final spot."
      },
      {
        "id": "tvmaze:3138978",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2025-02-15",
        "overview": "Records are smashed, and the Gladiators hunt down the Contenders on the Unleash track. Bradley and Barney host as the gritty Contenders take on the Gladiators for a quarter-final spot."
      },
      {
        "id": "tvmaze:3149024",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2025-02-22",
        "overview": "In the last round of the heats, four more brave Contenders fight for the remaining spots in the quarter-finals. The daughter of a British boxing icon faces the Gladiators."
      },
      {
        "id": "tvmaze:3149025",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2025-03-01",
        "overview": "In the first round of the quarter-finals, four Contenders battle Gladiators for a place in the semis. An unexpected series of events during Hang Tough shocks the arena."
      },
      {
        "id": "tvmaze:3149026",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2025-03-08",
        "overview": "In the second quarter-final, four Contenders battle it out for a place in the semis. A punishing new event sees Contenders pitted against each other in an exhilarating caged race."
      },
      {
        "id": "tvmaze:3166577",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2025-03-15",
        "overview": "In the last of the quarter-finals, determined Contenders battle it out for a place in the semis. An incredible performance on the Eliminator results in a record-breaking time."
      },
      {
        "id": "tvmaze:3177898",
        "title": "Episode 9",
        "season": 2,
        "episode": 9,
        "released": "2025-03-22",
        "overview": "In the first of the semi-finals, four determined Contenders face the mighty Gladiators before taking on the gruelling Eliminator as they battle for a place in the grand final."
      },
      {
        "id": "tvmaze:3184499",
        "title": "Episode 10",
        "season": 2,
        "episode": 10,
        "released": "2025-04-05",
        "overview": "In the second semi-final, tensions rise between the Gladiators, resulting in a scrap in the arena as four determined Contenders battle for a coveted place in the grand final."
      },
      {
        "id": "tvmaze:3202407",
        "title": "The Final",
        "season": 2,
        "episode": 11,
        "released": "2025-04-12",
        "overview": "In the 2025 grand final, four incredible finalists battle the Gladiators and give everything they've got in the Eliminator to be crowned this year's Gladiators champion."
      }
    ]
  }
}