{
  "meta": {
    "id": "tvmaze:4887",
    "type": "series",
    "name": "Fatal Attraction",
    "description": "Each pulse-pounding hour-long episode of Fatal Attraction centers around an incredible and dangerous romance. Shocking crime, kidnapping or even murder is only half of the story! In the end, the \"true love\" that draws these couples together isn't the kind that celebrates silver anniversaries – instead it leads to cross-country manhunts, bizarre cover-ups and dramatic trials. Driven by powerful, real-life stories, Fatal Attraction weaves together intimate, first-person interviews, exclusive interrogation footage and rare archival material. Along the way, it gives you a glimpse into the dark heart of a dangerous romance. Listen as the key players, family of the survivors and those that investigated the horrific crimes reveal the secrets to each sordid tale. Fatal Attraction…because love doesn't just hurt. It can kill!",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/574/1436125.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/574/1436125.jpg",
    "videos": [
      {
        "id": "tvmaze:3466361",
        "title": "A Facade of Forgiveness",
        "season": 16,
        "episode": 18,
        "released": "2025-12-08",
        "overview": ""
      },
      {
        "id": "tvmaze:308676",
        "title": "With This Bullet, I Thee Kill",
        "season": 1,
        "episode": 1,
        "released": "2013-06-03",
        "overview": "A twisted love triangle is uncovered in the opener of this series examining crimes of passion."
      },
      {
        "id": "tvmaze:308677",
        "title": "Broken Vows, Bloody Murder",
        "season": 1,
        "episode": 2,
        "released": "2013-06-10",
        "overview": "A pastor's wife is murdered outside their Houston home."
      },
      {
        "id": "tvmaze:308678",
        "title": "Prisoner of Love",
        "season": 1,
        "episode": 3,
        "released": "2013-06-17",
        "overview": "Jealousy and obsession destroy a couple's romance."
      },
      {
        "id": "tvmaze:308679",
        "title": "A Devil in Uniform",
        "season": 1,
        "episode": 4,
        "released": "2013-06-24",
        "overview": "A web of secrets and lies is uncovered after a woman goes missing."
      },
      {
        "id": "tvmaze:308680",
        "title": "Shopping for Murder",
        "season": 1,
        "episode": 5,
        "released": "2013-07-01",
        "overview": "An obsession with money tears a couple apart."
      },
      {
        "id": "tvmaze:308681",
        "title": "Blazing Fury",
        "season": 1,
        "episode": 6,
        "released": "2013-07-15",
        "overview": "A woman who found romance online suddenly goes missing."
      },
      {
        "id": "tvmaze:308682",
        "title": "Till Death Do Us Part",
        "season": 1,
        "episode": 7,
        "released": "2013-07-22",
        "overview": "A horrendous crime tears a couple apart."
      },
      {
        "id": "tvmaze:308683",
        "title": "A Cry in the Dark",
        "season": 1,
        "episode": 8,
        "released": "2013-07-29",
        "overview": "A murder is uncovered as police search for a missing couple."
      },
      {
        "id": "tvmaze:308684",
        "title": "Ambushed by Love",
        "season": 2,
        "episode": 1,
        "released": "2013-12-02",
        "overview": "Craig and Cynthia Anderson were madly in love, but it wasn't long before their fairytale romance was put to the test. When a man intrudes on the Anderson's property, they gun him down and claim self-defense. However, when he survives the incident, investigators learn there may be more to this story than meets the eye."
      },
      {
        "id": "tvmaze:308685",
        "title": "The Devil Beside Me",
        "season": 2,
        "episode": 2,
        "released": "2013-12-09",
        "overview": "Winston and Darlene George seemed to have the perfect marriage, but a tragic act of violence would rip them apart forever. When investigators begin to search for answers, they discover a tangled web of sex, lies, and greed."
      },
      {
        "id": "tvmaze:308686",
        "title": "Collegiate Killing",
        "season": 2,
        "episode": 3,
        "released": "2013-12-16",
        "overview": "A bright future and a loving fiancée, grad student Denita Smith seemed to have it all…until she was found at the bottom of her stairs, a bullet hole in the back of her head. Who would want to kill Denita?"
      },
      {
        "id": "tvmaze:308687",
        "title": "The Sinner and the Saint",
        "season": 2,
        "episode": 4,
        "released": "2014-01-06",
        "overview": "Kristopher Miller and Kim Griffin had just begun their steamy new romance when a tragic crime would stop it dead in its tracks. Investigators initially expect the crime to be linked to gang violence, which is prevalent in the area. However, after digging deeper they discover a chilling tale of jealousy and vengeance."
      },
      {
        "id": "tvmaze:308688",
        "title": "Murder in Niagara",
        "season": 2,
        "episode": 5,
        "released": "2014-01-13",
        "overview": "On the surface, Robert and Ahkenya Johnson had a picture perfect marriage. But according to friends and family, Robert's behavior had become increasingly erratic. When the mother of two is found by her husband was he the last person to see her alive? He's got an alibi, but will it convince authorities and Ahkenya's family?"
      },
      {
        "id": "tvmaze:308689",
        "title": "Tragic Rebound",
        "season": 2,
        "episode": 6,
        "released": "2014-01-27",
        "overview": "Tamika Huston had big dreams of becoming a singer and a promising future ahead of her, but when she inexplicably goes missing, friends and family worry they'll never get to see her reach her full potential. The search for answers will lead law enforcement down a slew of different paths—will they ever be able to track down this beautiful young songstress?"
      },
      {
        "id": "tvmaze:308690",
        "title": "Hell Hath No Fury",
        "season": 2,
        "episode": 7,
        "released": "2014-02-03",
        "overview": "Brian and Elicia Hughes seemed to have a picture perfect marriage; high school sweethearts with two daughters and a nice home in an affluent neighborhood. But when a 911 call leads to a disturbing crime, their perfect life turns up to be not so perfect."
      },
      {
        "id": "tvmaze:308691",
        "title": "Sins & Secrets",
        "season": 2,
        "episode": 8,
        "released": "2014-02-10",
        "overview": "Pastor Anthony Hopkins and his wife, Arletha, were living their dreams with their seven beautiful children. Years later, someone comes forward with a shocking revelation that will prove there was more to Arletha's death than anyone could ever imagine."
      },
      {
        "id": "tvmaze:308692",
        "title": "Budding Bloodsheed",
        "season": 2,
        "episode": 9,
        "released": "2014-02-24",
        "overview": "Tiffany and Antwan fell head over heels in love for each other, but once Tiffany had Antwan's child, she found starting a family in high school was far from easy. And when an argument between the two lovers leaves Antwan dead, everyone's wondering what could push this girl to kill her first love."
      },
      {
        "id": "tvmaze:308693",
        "title": "Raging Revenge",
        "season": 2,
        "episode": 10,
        "released": "2014-03-03",
        "overview": "Tawanna Barnes-Copeland seemed to have it all – three beautiful daughters and a budding romance. Until one fateful day when her daughter came home to find the unthinkable. The investigation would leave detectives wondering – was Tawanna the victim of a deadly robbery? Or was there someone out there who wanted her dead?"
      },
      {
        "id": "tvmaze:308694",
        "title": "Horror on the Highway",
        "season": 2,
        "episode": 11,
        "released": "2014-03-10",
        "overview": "The story of Ryan and Serika Holness begins in Jamaica, but ends tragically in a Maryland field. Ryan's reports of a carjacker sends police on a manhunt but when detectives add up the evidence, they start to believe the killer may be closer than they think."
      },
      {
        "id": "tvmaze:308695",
        "title": "If I Can't Have You",
        "season": 2,
        "episode": 12,
        "released": "2014-03-17",
        "overview": "When dashing young Michael Brooks falls for a sexy older woman named Dorothy Washington, their desire for each other can't be contained. But when Michael is brutally gunned down inside Dorothy's apartment, their steamy romance would be forever put on hold. As law enforcement attempt to piece together what happened, they uncover a twisted tale of lies, jealousy, and violence."
      },
      {
        "id": "tvmaze:308696",
        "title": "Fallen Hero",
        "season": 2,
        "episode": 13,
        "released": "2014-03-24",
        "overview": "When Officer Wayne Irby stops by Denise Miller's home on a courtesy call, she falls hard for the man in uniform. But when both Wayne and Denise turn up missing, his fellow officers find out just how mad love can be!"
      },
      {
        "id": "tvmaze:308697",
        "title": "Texas Tragedy",
        "season": 2,
        "episode": 14,
        "released": "2014-03-31",
        "overview": "When beautiful young coed Tynesha Stewart goes missing just miles from her boyfriend's apartment, her family and friends grow more anxious by the hour. But a shocking confession from a familiar face not only divulges Tynesha's fate, but also the presence of a true monster, and a sickening crime."
      },
      {
        "id": "tvmaze:308698",
        "title": "A Lethal Love Affair",
        "season": 2,
        "episode": 15,
        "released": "2014-06-09",
        "overview": "Latrese Curtis's stabbed corpse turns up beside a highway, days after her wedding to husband Darin. As investigators begin to probe into the case, they unveil a tortuous web of sex, deception and scandal that shocks even the most jaded among them."
      },
      {
        "id": "tvmaze:308699",
        "title": "Burning Rage",
        "season": 2,
        "episode": 16,
        "released": "2014-06-16",
        "overview": "Pregnant Detroiter Latonya Bowman is abducted, immolated, shot and left to die.As she and her unborn son struggle to recover, detectives try to determine who would want to do this to her. A murder plot of shocking proportions slowly emerges."
      },
      {
        "id": "tvmaze:308700",
        "title": "All in the Family",
        "season": 2,
        "episode": 17,
        "released": "2014-06-23",
        "overview": "Nurse Kenyatae Collier-Brewer - a wife and mother of three - vanishes sans explanation. Her husband Darron immediately informs the police, who locate her abandoned vehicle and plunge into a web of deception and cover-ups."
      },
      {
        "id": "tvmaze:308701",
        "title": "Harvard Homicide",
        "season": 2,
        "episode": 18,
        "released": "2014-06-30",
        "overview": "Co-eds Jabrai Copney and Brittany Smith enjoyed a fairy tale romance until 2009, when a young man turned up dead on campus, and Brittany also vanished. Investigators soon uncovered a bizarre web of lies and double-crosses that led straight to conviction."
      },
      {
        "id": "tvmaze:308702",
        "title": "Deadly Rampage",
        "season": 2,
        "episode": 19,
        "released": "2014-07-07",
        "overview": "Shanda Merritt and Carl Davis became a 21st century Bonnie and Clyde given their taste for crime. Then Carl left Shanda and attempted to go straight. This triggered a domino-like series of vile actions that killed one man and put another at death's door."
      },
      {
        "id": "tvmaze:308703",
        "title": "Love Triangle Tragedy",
        "season": 2,
        "episode": 20,
        "released": "2014-07-14",
        "overview": "22-year-old Erika Yancey vanishes, prompting a massive search. An airport baggage handler with a penchant for meeting men online, she is no stranger to risk. But soon the investigation leads in another direction and unveils a fatal love affair."
      },
      {
        "id": "tvmaze:308704",
        "title": "Pure Evil",
        "season": 2,
        "episode": 21,
        "released": "2014-07-21",
        "overview": "Nova Henry and Eddy Curry's relationship hits the skids when Eddy gets drafted to the NBA and saddles Nova with two children. Then Nova and her infant daughter Ava turn up dead in the middle of an ugly custody battle, and investigators are baffled."
      },
      {
        "id": "tvmaze:308705",
        "title": "Millionaire Murder",
        "season": 2,
        "episode": 22,
        "released": "2014-07-28",
        "overview": "Atlanta businessman-playboy Lance Herndon is found bludgeoned to death in his bathroom in August 1996. As investigators delve into his personal life, they encounter a number of angry and jealous mistresses, any one of whom could be the culprit."
      },
      {
        "id": "tvmaze:308706",
        "title": "Toxic Romance",
        "season": 2,
        "episode": 23,
        "released": "2014-08-04",
        "overview": "Reginald Daye falls helplessly in love with Crystal Magnum. He sees their union as kismet, but is stabbed to death in his home not long after.The subsequent investigation unearths a scandalous and long-buried secret in the community of Durham."
      },
      {
        "id": "tvmaze:308707",
        "title": "California Cold Case",
        "season": 2,
        "episode": 24,
        "released": "2014-08-11",
        "overview": "Marie Singleton disappears in late 1994, after falling for Andre Jackson and conceiving his child. The ensuing investigation stretches out over decades until a discovery solves the case and suggests that Marie may have been at risk from the beginning."
      },
      {
        "id": "tvmaze:308708",
        "title": "Lethal Liaison",
        "season": 2,
        "episode": 25,
        "released": "2014-08-25",
        "overview": "Cicely Bolden is stabbed to death in the wake of a sexual romance with Larry Dunn. Investigators look into the case and discover many buried secrets and a shocking conclusion."
      },
      {
        "id": "tvmaze:308709",
        "title": "Feast of the Flesh",
        "season": 3,
        "episode": 1,
        "released": "2015-01-05",
        "overview": "When Manny and Exondia first met, sparks immediately began to fly. It wasn't long before the couple's sensual romance blossomed into something more—they were soon having a baby and getting married. But only five years into their blissful union, Manny would go inexplicably missing, ripping the life of this happy couple apart at the seams. Exondia is crushed when the investigation into Manny's disappearance reveals a sordid secret—he was having an affair. Investigators wonder if Exondia's husband could have run off to start a new life with this other woman…but could there be a more sinister reason for Manny's disappearance?"
      },
      {
        "id": "tvmaze:308710",
        "title": "Law and Murder",
        "season": 3,
        "episode": 2,
        "released": "2015-01-12",
        "overview": "Chancy Jones and Phyllis Malone never expected to find love as a result of a domestic violence call, but that's exactly what happened. When Chancy, a Memphis police officer, comes to Phyllis' rescue, the dashing knight-in-shining-armor and beautiful damsel-in-distress have an instant connection. It isn't long before a sexy romance ignites, and it appears nothing can tear the couple apart. But Chancy and Phyllis' flame is swiftly put out when she's discovered murdered inside her vehicle. Is it possible her past of domestic violence has come back to haunt her? Or could Phyllis' search for love have awoken something much worse…"
      },
      {
        "id": "tvmaze:308711",
        "title": "A Sinister Affair",
        "season": 3,
        "episode": 3,
        "released": "2015-01-19",
        "overview": "Yamisha Thomas and Sylvester Davis had chemistry that couldn't be tamed. Sparks flew in the bedroom, and Sylvester was a great father figure for Yamisha's young daughter. Just when it seemed their relationship couldn't get more perfect, Yamisha goes inexplicably missing after she fails to pick up her daughter from a family member's home. Detectives are puzzled as to what could've happened to this beautiful young mother. The investigation into her disappearance will reveal some alarming secrets, and beg the question…did her past come back to haunt her?"
      },
      {
        "id": "tvmaze:684630",
        "title": "Deadly Secret",
        "season": 3,
        "episode": 4,
        "released": "2015-01-26",
        "overview": "\"Cece\" Dove was a vivacious young woman looking for love. But when she mysteriously disappears, investigators can't help but wonder if her online dating profile could have landed her in the hands of an internet predator. And when, on the other side of town, the body of a male is discovered, the victim of a heinous murder, investigators make an incredible discovery causing the cases to collide in the most shocking of ways."
      },
      {
        "id": "tvmaze:684631",
        "title": "Dance of Death",
        "season": 3,
        "episode": 5,
        "released": "2015-02-02",
        "overview": "Debbie Flores-Narvaez was a beautiful showgirl looking to fall in love. But when she vanishes without a trace, investigators can't help but wonder if she had gotten caught up in the lifestyle of the night and had ended up as just another of the lost souls missing from the City of Sin. But when Debbie's car turns up across town, investigators uncover a love triangle involving the reigning queen of the Vegas showgirls and a dark secret so lurid it could be worth killing for."
      },
      {
        "id": "tvmaze:684632",
        "title": "Deadly Jealousy",
        "season": 3,
        "episode": 6,
        "released": "2015-02-09",
        "overview": "Jennifer Lewis never expected that she'd have a relationship as meaningful as the one she had with God, but that changed when she met the charming and devout, Melvin Reed. And soon a fast and deep romance blossomed, held together by their mutual love of God. But Jennifer and Melvin's romance is snuffed out prematurely when Jennifer is shot on campus at close-range. Is it possible a secret from her past has come back to haunt her or had her search for love put her in contact with something much more sinister…"
      },
      {
        "id": "tvmaze:684633",
        "title": "The Boy Is Mine",
        "season": 3,
        "episode": 7,
        "released": "2015-02-23",
        "overview": "Curtisha Morning was an ambitious young student focused on her career and not her love life But that all changed when she met Brown. Carl opened up a new exciting world that Curtisha had never experienced. But when Curtisha vanishes into thin air, investigators are at a loss for what could have happened to the ambitions young teen. But soon a dark secret is exposed, one so reprehensible it just might prove motive for murder."
      },
      {
        "id": "tvmaze:684634",
        "title": "Mortal Matrimony",
        "season": 3,
        "episode": 8,
        "released": "2015-03-02",
        "overview": "For Juatasha Denton, failure was not in her vocabulary. She always got what she wanted in life and love, and what she wanted most was Ray McCaster. And soon innocent flirtations turned into full-blown romance and they ended up tying the knot. But their happy world of married bliss is shattered when a dismembered body is found just miles from the couple's house. Investigators are about to uncover a secret so dark it may just have brought the young lovers on a collision course with evil."
      },
      {
        "id": "tvmaze:684635",
        "title": "AWOL Abduction",
        "season": 3,
        "episode": 9,
        "released": "2015-03-09",
        "overview": "When Kimberly Parker said \"I do\" to, Elihue Parker, he promised her the world. But their dreams for a bright future are dashed when Elihue turns up missing. As investigators delve deeper, they uncover a twisted ring of greed and deception that will leave them face to face with pure evil."
      },
      {
        "id": "tvmaze:684636",
        "title": "Heart of Darkness",
        "season": 3,
        "episode": 10,
        "released": "2015-03-16",
        "overview": "When Wynetta Wright met hard-nosed cop Richmond Phillips, sparks flew right away and soon they were embroiled in a heated romance. Nine months later, Wynetta had given birth to their daughter, Jaylin. But nearly a year later, their hopes of happiness are soon dashed as both Wynetta and baby Jaylin unexpectedly disappear. As investigators delve deeper into Wynetta and Jaylin's disappearance they find themselves suddenly caught in a sordid web of love and lust, bringing them face to face with an evil that can't be named."
      },
      {
        "id": "tvmaze:684637",
        "title": "Last Act",
        "season": 3,
        "episode": 11,
        "released": "2015-03-23",
        "overview": "When local actress Pasinetta Prince met charmer, Patrick Bauldwin, he fanned her flame and together they formed the perfect partnership. But the curtain dropped on their love affair when Pasinetta was found strangled in her own home. And as investigators wade through the cast of suspects, they soon uncover a sordid secret that will rattle the community to its core."
      },
      {
        "id": "tvmaze:684638",
        "title": "Dangerous Addiction",
        "season": 3,
        "episode": 12,
        "released": "2015-03-30",
        "overview": "When navy veteran, Eric Clark met gorgeous Constance Harris a friendship developed that soon shot into the stratosphere of love. Marriage quickly followed. But their dreams of happiness were cut short when Eric did not make it back home from a trip to Atlanta and is later found shot to death. As investigators delve into the case, they are soon led on a frenzied manhunt for a diabolical killer, in the process revealing a murky world where greed and betrayal take the front seat."
      },
      {
        "id": "tvmaze:684639",
        "title": "A Flaming Hot Fling",
        "season": 3,
        "episode": 13,
        "released": "2015-04-06",
        "overview": "An ex-running back is killed in a suspicious fire."
      },
      {
        "id": "tvmaze:684640",
        "title": "Big Rig Rage",
        "season": 3,
        "episode": 14,
        "released": "2015-04-13",
        "overview": "A truck driver is shot to death in the sleeping compartment of her rig."
      },
      {
        "id": "tvmaze:684641",
        "title": "Bayou Bloodshed",
        "season": 3,
        "episode": 15,
        "released": "2015-04-20",
        "overview": "A high-profile attorney is found murdered in her office."
      },
      {
        "id": "tvmaze:684642",
        "title": "Innocence Slaughtered",
        "season": 3,
        "episode": 16,
        "released": "2015-04-27",
        "overview": "A popular teen is stabbed to death after meeting an older basketball star."
      },
      {
        "id": "tvmaze:684643",
        "title": "A Lethal Love",
        "season": 3,
        "episode": 17,
        "released": "2015-05-04",
        "overview": "A father and his two children are found murdered. Investigators soon find themselves targeting an unexpected suspect."
      },
      {
        "id": "tvmaze:684644",
        "title": "Grim Obsession",
        "season": 3,
        "episode": 18,
        "released": "2015-05-11",
        "overview": "A successful businessman falls into a relationship with a wild young woman, that ends with his shooting death."
      },
      {
        "id": "tvmaze:684645",
        "title": "Jarring Jealousy",
        "season": 3,
        "episode": 19,
        "released": "2015-05-18",
        "overview": "On March 9, 2013, 21 year old, Shadae Taylor-Brooks' body was found deceased in her apartment in Lancaster, Pennsylvania. A terrifying picture of jealousy and abuse will emerge and the circumstances surrounding her death will prove to be a challenge for authorities."
      },
      {
        "id": "tvmaze:684646",
        "title": "A Scorching Suspicion",
        "season": 3,
        "episode": 20,
        "released": "2015-06-01",
        "overview": "On December 30, 2010, University of Florida student, Saleha Huuda's charred body is found along a roadside brushfire in Gainesville, Florida. Detectives learn that Saleha's 21 year old boyfriend, Antonio Drayton, was seeing other women. With their relationship based on a history of abuse, lies and betrayal, anyone could be the killer."
      },
      {
        "id": "tvmaze:684647",
        "title": "Metered Murder",
        "season": 3,
        "episode": 21,
        "released": "2015-06-08",
        "overview": "A cabbie is found murdered in his cab, and investigators discover family secrets and lies."
      },
      {
        "id": "tvmaze:684648",
        "title": "A Deadly Message",
        "season": 3,
        "episode": 22,
        "released": "2015-06-15",
        "overview": "Police investigate bags of dismembered body parts found around town."
      },
      {
        "id": "tvmaze:684649",
        "title": "The Devil You Know",
        "season": 3,
        "episode": 23,
        "released": "2015-06-22",
        "overview": "A young mother vanishes after falling in love with a man."
      },
      {
        "id": "tvmaze:684650",
        "title": "Death Toll",
        "season": 3,
        "episode": 24,
        "released": "2015-06-29",
        "overview": "Gunfire shatters the world of a tollbooth worker and her security guard lover."
      },
      {
        "id": "tvmaze:684651",
        "title": "Old Habits Die Hard",
        "season": 3,
        "episode": 25,
        "released": "2015-07-13",
        "overview": "A troubled teen is murdered in his car after moving in with family members."
      },
      {
        "id": "tvmaze:684652",
        "title": "Crippled by Blood",
        "season": 3,
        "episode": 26,
        "released": "2015-07-20",
        "overview": "A teen mother and her brother are found shot to death in their home."
      },
      {
        "id": "tvmaze:308712",
        "title": "Entrepre-murder",
        "season": 3,
        "episode": 27,
        "released": "2015-09-07",
        "overview": "The 2009 disappearance of Lesley Davis and her husband Lyle Herring are investigated in Los Angeles."
      },
      {
        "id": "tvmaze:308722",
        "title": "The Iris of Evil",
        "season": 3,
        "episode": 28,
        "released": "2015-09-14",
        "overview": "The 2006 murder of Ericka Graham in Toledo, Ohio, is investigated. The victim was shot to death in her apartment. Her boyfriend, Charles McDonald, is the chief suspect."
      },
      {
        "id": "tvmaze:308723",
        "title": "Blazed Outrage",
        "season": 3,
        "episode": 29,
        "released": "2015-09-21",
        "overview": "A single mom falls for a charming man but their romance goes up in smoke due to a crime of terrifying proportions."
      },
      {
        "id": "tvmaze:308736",
        "title": "Sin for the Son",
        "season": 3,
        "episode": 30,
        "released": "2015-09-28",
        "overview": "A Caribbean mother moves to Toronto for a better life but ends up in a house of horrors."
      },
      {
        "id": "tvmaze:423063",
        "title": "What Lies Beneath",
        "season": 4,
        "episode": 1,
        "released": "2015-11-02",
        "overview": "In the season premiere, a football player becomes a prime suspect when his girlfriend goes missing and detectives expose a trail of lies, cheating and murder amongst other players."
      },
      {
        "id": "tvmaze:441754",
        "title": "Excess Baggage",
        "season": 4,
        "episode": 2,
        "released": "2015-11-09",
        "overview": "A woman's disappearance is investigated, unearthing a tale of violence, deception and disguise."
      },
      {
        "id": "tvmaze:467817",
        "title": "Hidden Homicide",
        "season": 4,
        "episode": 3,
        "released": "2015-11-16",
        "overview": "An Iraqi war veteran goes missing only for her body to reappear on her house's front lawn, and the investigation reveals things aren't as they seem."
      },
      {
        "id": "tvmaze:518959",
        "title": "Two-Timing Terror",
        "season": 4,
        "episode": 4,
        "released": "2015-12-07",
        "overview": "A woman disappears after reconnecting with an old flame."
      },
      {
        "id": "tvmaze:557471",
        "title": "Social Media Murder",
        "season": 4,
        "episode": 5,
        "released": "2015-12-14",
        "overview": "A brutal stabbing results in the death of a high school football player and a friend and the investigation reveals an unlikely killer."
      },
      {
        "id": "tvmaze:557473",
        "title": "Blood in the Bayou",
        "season": 4,
        "episode": 6,
        "released": "2016-01-04",
        "overview": "A beautiful woman is kidnapped in broad daylight and the investigation unearths a twisted tale of treachery."
      },
      {
        "id": "tvmaze:566839",
        "title": "Badge of Betrayal",
        "season": 4,
        "episode": 7,
        "released": "2016-01-11",
        "overview": "A police officer vanishes after an affair with a female inmate."
      },
      {
        "id": "tvmaze:583621",
        "title": "Sex, Drugs and Murder",
        "season": 4,
        "episode": 8,
        "released": "2016-01-18",
        "overview": "A couple are attacked in a hail of gunfire, and investigators find they were targeted because of sexual habits."
      },
      {
        "id": "tvmaze:583622",
        "title": "High-Rise Hit",
        "season": 4,
        "episode": 9,
        "released": "2016-01-25",
        "overview": "A car salesman is killed, unearthing a tale of passion, deceit and jealousy."
      },
      {
        "id": "tvmaze:596790",
        "title": "A Plot to Kill",
        "season": 4,
        "episode": 10,
        "released": "2016-02-01",
        "overview": "A man is brutally murdered by an unexpected killer."
      },
      {
        "id": "tvmaze:633528",
        "title": "She Never Came Home",
        "season": 4,
        "episode": 11,
        "released": "2016-02-08",
        "overview": "A college student disappears and the investigation reveals a possible love triangle."
      },
      {
        "id": "tvmaze:633529",
        "title": "Blood and Black Magic",
        "season": 4,
        "episode": 12,
        "released": "2016-02-22",
        "overview": "A woman's murder reveals dark secrets behind her and husband's seemingly perfect life."
      },
      {
        "id": "tvmaze:633530",
        "title": "Family Massacre",
        "season": 4,
        "episode": 13,
        "released": "2016-02-29",
        "overview": "The murder of a woman, her three children and her mother leads detectives on a shocking investigation."
      },
      {
        "id": "tvmaze:655797",
        "title": "Hidden Agenda",
        "season": 4,
        "episode": 14,
        "released": "2016-03-07",
        "overview": "A woman is assaulted in a series of strange, brutal attacks and investigators uncover a story of deception, jealousy and rage."
      },
      {
        "id": "tvmaze:655798",
        "title": "Deadly Ultimatum",
        "season": 4,
        "episode": 15,
        "released": "2016-03-14",
        "overview": "A high school cheerleader and class president is murdered after getting caught in a twisted love triangle in a small South Carolina town."
      },
      {
        "id": "tvmaze:667182",
        "title": "Lavish Lies",
        "season": 4,
        "episode": 16,
        "released": "2016-03-21",
        "overview": "An attack by a gunman leaves Thomas Randolph injured and his wife Sharron dead. Over the next 20 years, Thomas pulls through and creates a life the rich and famous would envy, but detectives are about to expose two shocking co-conspirators in his wife's murder that will turn his world upside down."
      },
      {
        "id": "tvmaze:684653",
        "title": "Deadly Double Life",
        "season": 4,
        "episode": 17,
        "released": "2016-03-28",
        "overview": "A social worker is murdered in her truck and authorities unearth a dark secret."
      },
      {
        "id": "tvmaze:684654",
        "title": "Deadly Trio",
        "season": 4,
        "episode": 18,
        "released": "2016-04-04",
        "overview": "A young executive is shot and killed, revealing a secret love affair that stuns her friends and family."
      },
      {
        "id": "tvmaze:694613",
        "title": "Killer Cult",
        "season": 4,
        "episode": 19,
        "released": "2016-04-11",
        "overview": "A woman is reported missing soon after a four-year-old boy disappears in the same area, leading investigators down a treacherous path into a house of horrors."
      },
      {
        "id": "tvmaze:706411",
        "title": "Demons of the Past",
        "season": 4,
        "episode": 20,
        "released": "2016-04-18",
        "overview": "A recovering addict is gunned down outside his home after getting his life seemingly back on track."
      },
      {
        "id": "tvmaze:813850",
        "title": "Road Trip Terror",
        "season": 5,
        "episode": 1,
        "released": "2016-06-06",
        "overview": "A 56-year-old woman is killed when her truck catches fire, exposing a romance that turned deadly."
      },
      {
        "id": "tvmaze:832451",
        "title": "Ruthless Rivalry",
        "season": 5,
        "episode": 2,
        "released": "2016-06-13",
        "overview": "A woman falls victim to gang warfare when she is killed in a parked car."
      },
      {
        "id": "tvmaze:832452",
        "title": "Fight or Flight",
        "season": 5,
        "episode": 3,
        "released": "2016-06-20",
        "overview": "A flight attendant vanishes and authorities find her murdered in a forest preserve."
      },
      {
        "id": "tvmaze:845155",
        "title": "When the Smoke Clears",
        "season": 5,
        "episode": 4,
        "released": "2016-06-27",
        "overview": "A woman's body is discovered in the aftermath of a fire that covers a deadly tale of obsession."
      },
      {
        "id": "tvmaze:859470",
        "title": "Slaying in the Streets",
        "season": 5,
        "episode": 5,
        "released": "2016-07-11",
        "overview": "A young man is shot by an unknown attacker and his girlfriend vanishes, leading investigators into a path of lies and deceit."
      },
      {
        "id": "tvmaze:866780",
        "title": "Wrecked By Love",
        "season": 5,
        "episode": 6,
        "released": "2016-07-18",
        "overview": "An aspiring rapper is killed in a car accident, but a funeral director makes a shocking discovery that makes police investigate the accident as a murder."
      },
      {
        "id": "tvmaze:870273",
        "title": "Watcher in the Night",
        "season": 5,
        "episode": 7,
        "released": "2016-07-25",
        "overview": "A party ends in a mass shooting and investigators discover it was a crime of passion."
      },
      {
        "id": "tvmaze:876295",
        "title": "Lethal Weapon",
        "season": 5,
        "episode": 8,
        "released": "2016-08-01",
        "overview": "A woman is fatally shot in her home, but her husband maintains she killed her herself by accident while playing with his gun."
      },
      {
        "id": "tvmaze:884025",
        "title": "Into the Woods",
        "season": 5,
        "episode": 9,
        "released": "2016-08-08",
        "overview": "A woman goes missing after an ominous threat is made against her."
      },
      {
        "id": "tvmaze:894611",
        "title": "In the Line of Fire",
        "season": 5,
        "episode": 10,
        "released": "2016-08-22",
        "overview": "A woman is shot by a stray bullet, resulting in a car accident and revealing a romance that turned violent."
      },
      {
        "id": "tvmaze:932958",
        "title": "Deception in D.C.",
        "season": 5,
        "episode": 11,
        "released": "2016-08-29",
        "overview": "A woman mysteriously dies in an apparent suicide, but evidence of foul play is soon discovered."
      },
      {
        "id": "tvmaze:910914",
        "title": "A Heart Divided",
        "season": 5,
        "episode": 12,
        "released": "2016-09-12",
        "overview": "A nurse is murdered in her home by an unknown killer."
      },
      {
        "id": "tvmaze:932959",
        "title": "Smoke and Mirrors",
        "season": 5,
        "episode": 13,
        "released": "2016-09-19",
        "overview": "A rising Chicago star disappears without a trace."
      },
      {
        "id": "tvmaze:932960",
        "title": "Thicker Than Water",
        "season": 5,
        "episode": 14,
        "released": "2016-09-26",
        "overview": "A woman's dreams evaporate following a shooting in Decatur, Georgia."
      },
      {
        "id": "tvmaze:932961",
        "title": "Death Trap",
        "season": 5,
        "episode": 15,
        "released": "2016-10-03",
        "overview": "A man is murdered on a backcountry road."
      },
      {
        "id": "tvmaze:932962",
        "title": "Gone Too Soon",
        "season": 5,
        "episode": 16,
        "released": "2016-10-10",
        "overview": "A young woman disappears and her body is found a week later and authorities examine her dating life for clues."
      },
      {
        "id": "tvmaze:961261",
        "title": "Death by Secrets",
        "season": 5,
        "episode": 17,
        "released": "2016-10-17",
        "overview": "Detectives investigate the discovery of a beautiful nursing student found shot to death inside her car."
      },
      {
        "id": "tvmaze:961262",
        "title": "Without a Trace",
        "season": 5,
        "episode": 18,
        "released": "2016-10-24",
        "overview": "A popular salon owner mysteriously disappears, revealing a story of passion, jealously and murder in a tight-knit suburban community."
      },
      {
        "id": "tvmaze:963778",
        "title": "Murder in a College Town",
        "season": 5,
        "episode": 19,
        "released": "2016-10-31",
        "overview": "A pre-med student vanishes without a trace while evidence that reveals her disappearance and murder slips by the detectives."
      },
      {
        "id": "tvmaze:963779",
        "title": "Murder, M.D.",
        "season": 5,
        "episode": 20,
        "released": "2016-11-07",
        "overview": "A doctor is found shot to death in her parking lot and the police search for the murderer with a motive."
      },
      {
        "id": "tvmaze:985892",
        "title": "What Nobody Knew",
        "season": 5,
        "episode": 21,
        "released": "2016-11-14",
        "overview": "Diamond Dunn and her mother Elzina Brown were pillars of their Bronx, New York neighborhood, where they were known as much for their warmth and charm as for their civic duty. When beautiful Diamond wins the devotion of a handsome suitor, Elzina relishes a mother's pride in seeing her daughter blissfully in love. But the dream for a happy future shatters with the crack of gunfire inside Elzina's apartment, where love lies bleeding and life hangs by a thread."
      },
      {
        "id": "tvmaze:985893",
        "title": "Gasping for Air",
        "season": 5,
        "episode": 22,
        "released": "2016-11-21",
        "overview": "A mother is killed and police zero in on two suspects: an ex-boyfriend and a strange stalker."
      },
      {
        "id": "tvmaze:995258",
        "title": "Deadly Divorce",
        "season": 5,
        "episode": 23,
        "released": "2016-11-28",
        "overview": "A rocky marriage falls apart when a man's younger brother is found dead on his family's porch."
      },
      {
        "id": "tvmaze:1004456",
        "title": "Master of Deceit",
        "season": 5,
        "episode": 24,
        "released": "2016-12-05",
        "overview": "A budding romance sparks envy from an past boyfriend, which makes him go to dangerous lengths to seek revenge."
      },
      {
        "id": "tvmaze:1004457",
        "title": "Early Morning Murder",
        "season": 5,
        "episode": 25,
        "released": "2016-12-12",
        "overview": "A bus driver is killed on her way to work after starting a new relationship and her killer stays at large for nearly a full year."
      },
      {
        "id": "tvmaze:1028288",
        "title": "A Text from the Grave",
        "season": 6,
        "episode": 1,
        "released": "2017-01-02",
        "overview": "In the sixth season premiere, a woman vanishes without a trace after moving from Trinidad to be with her long-standing boyfriend."
      },
      {
        "id": "tvmaze:1028289",
        "title": "Risky Rendezvous",
        "season": 6,
        "episode": 2,
        "released": "2017-01-02",
        "overview": "A man with two lovers is found dead in his apartment parking lot and detectives are left with a large list of suspects."
      },
      {
        "id": "tvmaze:1028290",
        "title": "Blazing Love Triangle",
        "season": 6,
        "episode": 3,
        "released": "2017-01-09",
        "overview": "A young woman disappears without a trace and authorities unearth a story of secrecy and jealousy."
      },
      {
        "id": "tvmaze:1039997",
        "title": "Dangerous Appeal",
        "season": 6,
        "episode": 4,
        "released": "2017-01-16",
        "overview": "A husband's double life surfaces after he is shot in cold blood."
      },
      {
        "id": "tvmaze:1039998",
        "title": "A Deadly Snowfall",
        "season": 6,
        "episode": 5,
        "released": "2017-01-23",
        "overview": "A teen romance turns deadly when a high school senior is killed, but mental illness proves to be an underlying factor."
      },
      {
        "id": "tvmaze:1050476",
        "title": "Puppet Master",
        "season": 6,
        "episode": 6,
        "released": "2017-01-30",
        "overview": "An Air Force vet encounters a stalker from his past set on taking him for everything he's worth."
      },
      {
        "id": "tvmaze:1050477",
        "title": "Hair Stylist Homicide",
        "season": 6,
        "episode": 7,
        "released": "2017-02-06",
        "overview": "A power couple face a scandal after an investigation unearths a series of lies, manipulations, and lovers."
      },
      {
        "id": "tvmaze:1051503",
        "title": "House of Horrors",
        "season": 6,
        "episode": 8,
        "released": "2017-02-13",
        "overview": "A triple homicide sees two lovers killed along with one of their mothers inside their own home."
      },
      {
        "id": "tvmaze:1051505",
        "title": "Killer or Victim",
        "season": 6,
        "episode": 9,
        "released": "2017-02-20",
        "overview": "A young couple are murdered by someone from their past."
      },
      {
        "id": "tvmaze:1051506",
        "title": "Masked Mayhem",
        "season": 6,
        "episode": 10,
        "released": "2017-02-27",
        "overview": "A Portland woman is shot, sparking fear across the city as investigators face strange alliances, missing suspects and unclear motives."
      },
      {
        "id": "tvmaze:1092410",
        "title": "Internet Dating Mystery",
        "season": 6,
        "episode": 11,
        "released": "2017-03-06",
        "overview": "A mother of four disappears after trying online dating."
      },
      {
        "id": "tvmaze:1093722",
        "title": "Clinical Nightmare",
        "season": 6,
        "episode": 12,
        "released": "2017-03-13",
        "overview": "An entrepreneur takes a nightmarish turn."
      },
      {
        "id": "tvmaze:1093723",
        "title": "Secrets in the Storm",
        "season": 6,
        "episode": 13,
        "released": "2017-03-20",
        "overview": "A shocking crime surfaces after a woman falls for a rising star."
      },
      {
        "id": "tvmaze:1197022",
        "title": "Horror at the Hotel",
        "season": 6,
        "episode": 14,
        "released": "2017-06-05",
        "overview": "Destynee Burkes felt blessed to find true love until she's found dead in a Florida hotel room. Will simmering secrets prove her fairytale romance was really a spine-curling nightmare? With a murderous maniac on the loose, there's no telling how high the body count will climb."
      },
      {
        "id": "tvmaze:1197023",
        "title": "Roadside Homicide",
        "season": 6,
        "episode": 15,
        "released": "2017-06-12",
        "overview": "When the body of Angela Alex is discovered on a secluded road, family and friends are left desperate for answers. While investigators have their theories, their case is blown wide open when it is revealed that Angela was pregnant. As they dig deeper, they learn that appearances aren't always what they seem—and for some, a secret just might be worth killing for."
      },
      {
        "id": "tvmaze:1197024",
        "title": "Behind Closed Doors",
        "season": 6,
        "episode": 16,
        "released": "2017-06-19",
        "overview": "Everyone thought Megan Neely had put her checkered past behind her and found happiness in love. But when she disappears, no one knows if this is the vanishing act of a woman with her own warped agenda or something far more sinister."
      },
      {
        "id": "tvmaze:1197025",
        "title": "Burning Confession",
        "season": 6,
        "episode": 17,
        "released": "2017-06-26",
        "overview": "When mother-daughter duo Cherie Adams and Curtria Duncan are found brutally stabbed to death in their burning Chicago apartment, both the community and police force are left stunned—why would anyone want to hurt this quiet, friendly pair? As the investigation heats up, detectives discover that both women had their fair share of secrets…and clandestine lovers."
      },
      {
        "id": "tvmaze:1232285",
        "title": "Bad Blood",
        "season": 6,
        "episode": 18,
        "released": "2017-07-10",
        "overview": "A tragedy hits a woman and destroys a seemingly story book life."
      },
      {
        "id": "tvmaze:1232286",
        "title": "Shooting Spree",
        "season": 6,
        "episode": 19,
        "released": "2017-07-17",
        "overview": "When probation officer Cynthia Rolle is found shot dead in her own driveway, police fear that a vengeful probationer might be on the loose. But before detectives can investigate further, the killer makes it clear that she was only the first victim in a string of shootings that leaves a small town terrified."
      },
      {
        "id": "tvmaze:1232287",
        "title": "Road Rage",
        "season": 6,
        "episode": 20,
        "released": "2017-07-24",
        "overview": "After the tragic loss of his mother, love rescues Jeffrey Moore from the depths of despair. But a speeding vehicle will soon run him off his road to recovery. Leaving everyone asking: was this a horrible accident or something far more sinister?"
      },
      {
        "id": "tvmaze:1264283",
        "title": "Enraged Exchange",
        "season": 6,
        "episode": 21,
        "released": "2017-07-31",
        "overview": "When police respond to reports of a car crash, they find Floyd McLean dead behind the wheel—but not from injuries sustained in the collision. As police dig deeper into the case, they unravel the story of a family man with a lifetime of secrets that just may have gotten him killed."
      },
      {
        "id": "tvmaze:1264284",
        "title": "Stabbed in the Back",
        "season": 6,
        "episode": 22,
        "released": "2017-08-07",
        "overview": "A family's worst nightmare becomes a reality when a loving husband and father is attacked in the dead of the night. After the brutal stabbing of Damario Morris, his wife tries to protect their children from the horrible truth, but as the facts of the case emerge, nothing can shield them from the truth."
      },
      {
        "id": "tvmaze:1264292",
        "title": "Night Terror",
        "season": 6,
        "episode": 23,
        "released": "2017-08-14",
        "overview": "When police officer Crystal Parker is found shot to death in her bed, the entire town of East Point, Georgia is stunned."
      },
      {
        "id": "tvmaze:1264293",
        "title": "D.C. Disappearance",
        "season": 6,
        "episode": 24,
        "released": "2017-08-21",
        "overview": "Yolanda Baker goes missing after a family event, and the police begin an investigation that will keep the community on edge for a decade."
      },
      {
        "id": "tvmaze:1264294",
        "title": "Southside Serial Killer",
        "season": 6,
        "episode": 25,
        "released": "2017-09-04",
        "overview": "In the seaosn finale, when Chicago police find a 40-year-old woman shot dead, they have no way of knowing they're about to uncover even more carnage."
      },
      {
        "id": "tvmaze:1264295",
        "title": "The Eye of the Storm",
        "season": 7,
        "episode": 1,
        "released": "2017-09-11",
        "overview": "An assailant guns down a pastor, devastating his wife; detectives need to solve two decades worth of bloody secrets."
      },
      {
        "id": "tvmaze:1264296",
        "title": "Hotel Horror",
        "season": 7,
        "episode": 2,
        "released": "2017-09-18",
        "overview": "When a couple disappears from their hotel room, detectives find hidden deceit and malevolence that will end in a tragic investigation."
      },
      {
        "id": "tvmaze:1290221",
        "title": "Campus Crisis",
        "season": 7,
        "episode": 3,
        "released": "2017-09-25",
        "overview": "Ardena Carter's life resembles a fairy tale, but when she vanishes, the community must band together and find her before they lose her forever."
      },
      {
        "id": "tvmaze:1290341",
        "title": "Twisted Affair",
        "season": 7,
        "episode": 4,
        "released": "2017-10-02",
        "overview": "After 23-year-old Trudie Hall vanishes, scandals simmer to the surface, leading to multiple theories about what really happened to her."
      },
      {
        "id": "tvmaze:1325427",
        "title": "Deadly Obsession",
        "season": 7,
        "episode": 5,
        "released": "2017-10-09",
        "overview": "A woman is gunned down while sitting in a car with her boyfriend and police question if there's more to their romance than meets the eye."
      },
      {
        "id": "tvmaze:1325428",
        "title": "A Young Life That Ended in Tragedy",
        "season": 7,
        "episode": 6,
        "released": "2018-01-01",
        "overview": "Mylon Lowe, a 24-year-old, is found dead in his apartment; clues point in a multitude of disturbing directions. aka Seductive Set-Up"
      },
      {
        "id": "tvmaze:1387137",
        "title": "Grave Secrets",
        "season": 7,
        "episode": 7,
        "released": "2018-01-08",
        "overview": "When Sherri Jackson fails to show up for work one day, her family panics. For over a year, her family, friends, and the police search for her."
      },
      {
        "id": "tvmaze:1387138",
        "title": "Scorned",
        "season": 7,
        "episode": 8,
        "released": "2018-01-22",
        "overview": "In Lake City, Florida, police visit the home of Tommy Kellum during a welfare check and find themselves in the middle of a horrific homicide case."
      },
      {
        "id": "tvmaze:1387139",
        "title": "An Unlikely Witness",
        "season": 7,
        "episode": 9,
        "released": "2018-01-29",
        "overview": "The police investigate the murder of a woman killed in her own home, with a surprising witness possibly able to help detectives solve the case."
      },
      {
        "id": "tvmaze:1387140",
        "title": "Horror at the Holidays",
        "season": 7,
        "episode": 10,
        "released": "2018-02-05",
        "overview": "When Jerryell Foster doesn't show up for Thanksgiving dinner, her close-knit family wonders how she could disappear without a trace."
      },
      {
        "id": "tvmaze:1387141",
        "title": "Dear Diary",
        "season": 7,
        "episode": 11,
        "released": "2018-02-12",
        "overview": "A 15-year-old girl vanishes from her home one night and the community is thrust into a manhunt to find her and whoever is responsible for her disappearance."
      },
      {
        "id": "tvmaze:1387142",
        "title": "In Cold Blood",
        "season": 7,
        "episode": 12,
        "released": "2018-02-19",
        "overview": "Jonathan Harris has a new lease on life after receiving two kidney transplants, and looks forward to life with his girlfriend."
      },
      {
        "id": "tvmaze:1387143",
        "title": "Shot to the Heart",
        "season": 7,
        "episode": 13,
        "released": "2018-02-26",
        "overview": "High school sweethearts Re'Mano and Eugenia Campbell live a fairytale life until things take a turn for the worse."
      },
      {
        "id": "tvmaze:1437234",
        "title": "The Secrets We Keep",
        "season": 7,
        "episode": 14,
        "released": "2018-04-09",
        "overview": "Police search for a missing grandmother after a large quantity of blood is found in the footwell of her abandoned car."
      },
      {
        "id": "tvmaze:1437235",
        "title": "Wrong Turn",
        "season": 7,
        "episode": 15,
        "released": "2018-04-16",
        "overview": "Asia Harris is gunned down in her car on a secluded, dark road, which shakes up her family. The police discover the victim had secrets of her own when they start to investigate her murder."
      },
      {
        "id": "tvmaze:1437236",
        "title": "Up in Flames",
        "season": 7,
        "episode": 16,
        "released": "2018-04-23",
        "overview": "In Sacramento, California, a young woman is found dead amid ashes in her apartment. A quest for the truth opens up a Pandora's box of secrets and multiple motives for murder."
      },
      {
        "id": "tvmaze:1437237",
        "title": "When Death Comes Knocking",
        "season": 7,
        "episode": 17,
        "released": "2018-04-30",
        "overview": "The future is full of promise for lovers Michael Days and Pamela Lawson, then Michael is murdered right in front of Pamela in their own home."
      },
      {
        "id": "tvmaze:1459777",
        "title": "Lured by Love",
        "season": 7,
        "episode": 18,
        "released": "2018-05-07",
        "overview": "When Ka'Loni Flynn is found shot dead on a rural road, investigators wonder if she's the victim of a carjacking gone wrong, or something far more sinister."
      },
      {
        "id": "tvmaze:1459778",
        "title": "Devastating Disappearance",
        "season": 7,
        "episode": 19,
        "released": "2018-05-14",
        "overview": "Young mother Ericka Bradley disappears without a trace. Police attempt to piece together the cause of her disappearance."
      },
      {
        "id": "tvmaze:1468365",
        "title": "Deadly Ambition",
        "season": 7,
        "episode": 20,
        "released": "2018-05-21",
        "overview": "Sixteen-year-old Arrijana Hill is stabbed to death in her home in a gated community. As police dig deeper, they uncover a tangled web of teenage drama."
      },
      {
        "id": "tvmaze:1474316",
        "title": "Monster Among Us",
        "season": 7,
        "episode": 21,
        "released": "2018-06-04",
        "overview": "The authorities investigate the lives of a mother and daughter when they are both found brutally murdered in their apartment."
      },
      {
        "id": "tvmaze:1474317",
        "title": "Death of Deception",
        "season": 7,
        "episode": 22,
        "released": "2018-06-11",
        "overview": "A pregnant teenager's body is found, and investigators delve into the world of adolescent drama, before they unravel a web of lies to unmask the culprit."
      },
      {
        "id": "tvmaze:1474318",
        "title": "Deadly Ambush",
        "season": 7,
        "episode": 23,
        "released": "2018-06-18",
        "overview": "When US Air Force Sergeant Derrick Tolliver is gunned down in an apparent home burglary, the police are called in to investigate. The crime scene doesn't add up, however, and the suspects remain at large."
      },
      {
        "id": "tvmaze:1474319",
        "title": "Deserted by Love",
        "season": 7,
        "episode": 24,
        "released": "2018-06-25",
        "overview": "In Pinole, California, Alice Sin vanishes just days before her son's first birthday, and her family and friends are desperate to figure out what could have happened to her."
      },
      {
        "id": "tvmaze:1488185",
        "title": "Unforeseen Enemy",
        "season": 7,
        "episode": 25,
        "released": "2018-07-09",
        "overview": "After a young mother is murdered, all of the evidence points to one suspect, but new information sends detectives scrambling when they're on the verge of closing the case."
      },
      {
        "id": "tvmaze:1488186",
        "title": "The Masked Killer",
        "season": 7,
        "episode": 26,
        "released": "2018-07-16",
        "overview": "A masked gunman surprises a woman and her lover in bed; after a burst of gunfire leaves her lover dead, the woman says she can identify the disguised gunman; detectives hope that telephone records will prove her right."
      },
      {
        "id": "tvmaze:1488187",
        "title": "Behind Locked Doors",
        "season": 7,
        "episode": 27,
        "released": "2018-07-23",
        "overview": "Theresa Williams was a mother of four who dedicated her life to giving love to those who needed it most. But when her sister feels in her heart something is terribly wrong, she arrives at Theresa's home to find her two youngest children wandering around outside and Theresa brutally murdered behind locked doors."
      },
      {
        "id": "tvmaze:1488188",
        "title": "Sinister Scheme",
        "season": 7,
        "episode": 28,
        "released": "2018-07-30",
        "overview": "When a married couple is gunned down in their car just yards from their home, police suspect it may be a crime of passion. But at the heart of this mystery lies an unimaginable conspiracy, fueled by a far more complicated and sinister motive."
      },
      {
        "id": "tvmaze:1507485",
        "title": "Vigilante Justice",
        "season": 7,
        "episode": 29,
        "released": "2018-08-06",
        "overview": "After a woman is found stabbed to death in her bed, suspicion falls on her ex-boyfriend; however, the case takes a turn when the ex-boyfriend is gunned down, prompting investigators to look at the victim's estranged husband whose love runs deep."
      },
      {
        "id": "tvmaze:1507486",
        "title": "Whisper in the Woods",
        "season": 7,
        "episode": 30,
        "released": "2018-08-13",
        "overview": "The disappearance of a young mother and her three-year-old son throws a small Southern town into complete turmoil."
      },
      {
        "id": "tvmaze:1593859",
        "title": "Unbridled Greed",
        "season": 8,
        "episode": 1,
        "released": "2019-01-28",
        "overview": "When a retired Chicago steelworker is gunned down outside his home, police suspect he was targeted by a street gang."
      },
      {
        "id": "tvmaze:1597035",
        "title": "Left for Dead",
        "season": 8,
        "episode": 2,
        "released": "2019-02-04",
        "overview": "After a 27-year-old pregnant woman is found stabbed to death in her apartment, police are tasked with solving a double murder."
      },
      {
        "id": "tvmaze:1597036",
        "title": "Driven by Revenge",
        "season": 8,
        "episode": 3,
        "released": "2019-02-11",
        "overview": "After 33-year-old Jamel Campbell is found shot dead in a Groton, Conn., hotel room, accusations of infidelity explode and bring to light a bevy of suspects."
      },
      {
        "id": "tvmaze:1597037",
        "title": "All for Nothing",
        "season": 8,
        "episode": 4,
        "released": "2019-02-18",
        "overview": "In Cleveland, firefighter William Walker is gunned down outside his home; to find the killer, detectives must cut through a web of deception, but nothing prepares them for the truth."
      },
      {
        "id": "tvmaze:1597038",
        "title": "Signal to Kill",
        "season": 8,
        "episode": 5,
        "released": "2019-02-25",
        "overview": "The body of a pregnant teenager is found in a park outside of Chicago, and police discover someone close to the victim with a personal motive."
      },
      {
        "id": "tvmaze:1614791",
        "title": "Where Evil Lurks",
        "season": 8,
        "episode": 6,
        "released": "2019-03-11",
        "overview": "In Dale, S.C., a woman and her two children are found shot in the head; while investigators fear there could be more carnage, the cold-hearted truth will shake this community to its core."
      },
      {
        "id": "tvmaze:1637684",
        "title": "Poisoned Mind",
        "season": 8,
        "episode": 7,
        "released": "2019-04-15",
        "overview": "Aspiring actress Lilius Landrum is on the verge of success, but then she is found murdered and decapitated."
      },
      {
        "id": "tvmaze:1637685",
        "title": "A Calculated Plot",
        "season": 8,
        "episode": 8,
        "released": "2019-04-22",
        "overview": "After a young single mother is murdered, her secret online dating profile leads police to suspect that her killer was a spurned lover."
      },
      {
        "id": "tvmaze:1645060",
        "title": "Up In Smoke",
        "season": 8,
        "episode": 9,
        "released": "2019-04-29",
        "overview": "Marcus and Lisa Toney are a Chicago power couple destined for great things when a pipe bomb kills Marcus, leaving police to wonder who would have wanted him dead."
      },
      {
        "id": "tvmaze:1647793",
        "title": "Secrets by the River",
        "season": 8,
        "episode": 10,
        "released": "2019-05-06",
        "overview": "Danielle Locklear goes missing, and while her family is baffled, the community bands together to search for the missing teenager."
      },
      {
        "id": "tvmaze:1712083",
        "title": "Last Call",
        "season": 8,
        "episode": 11,
        "released": "2019-09-09",
        "overview": "When a pregnant woman's body is found floating in the Hudson River, detectives suspect she has committed suicide, but as new evidence surfaces, officers realise they have a homicide on their hands."
      },
      {
        "id": "tvmaze:1712084",
        "title": "Bound by Love",
        "season": 8,
        "episode": 12,
        "released": "2019-09-16",
        "overview": "Police scramble to solve the murder of a young mother found bound hand and foot in a bathtub in Phenix City, AL."
      },
      {
        "id": "tvmaze:1712085",
        "title": "At All Costs",
        "season": 8,
        "episode": 13,
        "released": "2019-09-23",
        "overview": "A business owner who wins the lottery seems to have everything going for him until he is found dead inside his van."
      },
      {
        "id": "tvmaze:1712086",
        "title": "Last Valentine",
        "season": 8,
        "episode": 14,
        "released": "2019-09-30",
        "overview": "After Pamela Butler vanishes, her family becomes frantic searching for answers, as authorities find no evidence of foul play or anything suspicious on her home security footage."
      },
      {
        "id": "tvmaze:1712087",
        "title": "Strangers in the Park",
        "season": 8,
        "episode": 15,
        "released": "2019-10-07",
        "overview": "After a single mother is shot outside her home, investigators turn to witnesses for a list of suspects. After a gang member fleeing the scene is identified, he makes a surprising confession."
      },
      {
        "id": "tvmaze:1712088",
        "title": "Love on the Run",
        "season": 8,
        "episode": 16,
        "released": "2019-10-14",
        "overview": "A Jane Doe is found burned beyond recognition in a New York state park. An hour and a half away in the Bronx, Jasmine Nunez disappears with her boyfriend."
      },
      {
        "id": "tvmaze:1712089",
        "title": "Bloody Superstition",
        "season": 8,
        "episode": 17,
        "released": "2019-10-21",
        "overview": "When two immigrants from Ghana are found murdered in their million-dollar Maryland home, the search for the killer leads investigators into the world of Caribbean religion."
      },
      {
        "id": "tvmaze:1712090",
        "title": "Next Stop, Murder",
        "season": 8,
        "episode": 18,
        "released": "2019-10-28",
        "overview": "After three victims are gunned down at a bus stop, no one knows who the intended target was or what the motive could be. Detectives pursue every possible angle, until finally uncovering a conspiracy with an unbelievable criminal mastermind."
      },
      {
        "id": "tvmaze:1712091",
        "title": "The Helping Hand",
        "season": 8,
        "episode": 19,
        "released": "2019-11-04",
        "overview": "US Air Force Sgt P.J. Jennings Jr is always ready to lend a helping hand, then he is found murdered in his apartment. After finding a clue, police are forced to consider the possibility that P.J.'s selflessness may have led to his demise."
      },
      {
        "id": "tvmaze:1712092",
        "title": "Swipe Right for Murder",
        "season": 8,
        "episode": 20,
        "released": "2019-11-11",
        "overview": "When a contractor is found murdered, suspicion falls on the women he met through a dating app. The police suspect a crime of passion, but it turns out to be a conspiracy resulting in the death of a man who was just trying to do the right thing."
      },
      {
        "id": "tvmaze:1712093",
        "title": "Caught in a Lie",
        "season": 9,
        "episode": 1,
        "released": "2019-11-18",
        "overview": "When a woman is killed in what looks like a home invasion, police quickly hone in on two suspects."
      },
      {
        "id": "tvmaze:1712094",
        "title": "Bonds of Love",
        "season": 9,
        "episode": 2,
        "released": "2019-11-25",
        "overview": "When a hardworking nurse is shot and left on the side of the road, police don't know who could have wanted to kill her."
      },
      {
        "id": "tvmaze:1712095",
        "title": "Acts of Rage",
        "season": 9,
        "episode": 3,
        "released": "2019-12-02",
        "overview": "When a transgender woman goes missing from a small town, police suspect she may have disappeared in order to complete her transition."
      },
      {
        "id": "tvmaze:1712096",
        "title": "A Shot in the Crowd",
        "season": 9,
        "episode": 4,
        "released": "2019-12-09",
        "overview": "When a 21-year-old woman is shot dead in a bad part of town, police have to find out if it was gang related or perhaps a twisted love triangle."
      },
      {
        "id": "tvmaze:1712097",
        "title": "Shot in the Dark",
        "season": 9,
        "episode": 5,
        "released": "2019-12-16",
        "overview": "When a high school cheerleader is found murdered, police question whether she was killed by a jealous rival who hoped to take her place as prom queen."
      },
      {
        "id": "tvmaze:1712098",
        "title": "Runaway Love",
        "season": 9,
        "episode": 6,
        "released": "2019-12-23",
        "overview": "When a 26-year-old mother goes missing, no one knows what to think. Could she have had an accident? Or could she have run away to start a new life?"
      },
      {
        "id": "tvmaze:1786941",
        "title": "Engaged to Murder",
        "season": 9,
        "episode": 7,
        "released": "2020-01-06",
        "overview": "When a mother of three is found shot to death in her bedroom, her fiancé is the prime suspect."
      },
      {
        "id": "tvmaze:1787064",
        "title": "Holiday Homicide",
        "season": 9,
        "episode": 8,
        "released": "2020-01-13",
        "overview": "In Detroit, Michigan, a cop's wife is killed in what looks like a botched robbery; as secrets simmer to the surface, police suspect a more personal motive; the pieces of the puzzle don't fit until a shocking confession blows the case wide open."
      },
      {
        "id": "tvmaze:1790459",
        "title": "Flames of Betrayal",
        "season": 9,
        "episode": 9,
        "released": "2020-01-27",
        "overview": "Firefighters responding to an apartment fire make a grisly discovery: the charred body of a young woman; detectives investigating the case wonder if this is the work of a killer who murdered four people only a few days earlier."
      },
      {
        "id": "tvmaze:1790460",
        "title": "Lying in Wait",
        "season": 9,
        "episode": 10,
        "released": "2020-02-03",
        "overview": "When a decorated Navy commander is found dead in a hotel room, those close to him suspect suicide; when autopsy results point to homicide, investigators sort through numerous lies to uncover a calculated plot fueled by lust and greed."
      },
      {
        "id": "tvmaze:1790461",
        "title": "Fueled by Rage",
        "season": 9,
        "episode": 11,
        "released": "2020-02-10",
        "overview": "Two carpooling commuters find the body of a woman whose throat was slashed in a parking lot; the savage wounds suggest that the murder was a crime of passion fueled by rage."
      },
      {
        "id": "tvmaze:1790462",
        "title": "One Step Ahead",
        "season": 9,
        "episode": 12,
        "released": "2020-02-17",
        "overview": "University student Corey Robinson ends up dead in an extended-stay hotel room; while sifting through his love affairs, investigators catch wind of a mysterious person whose true identity must be revealed in order to solve the crime."
      },
      {
        "id": "tvmaze:1790463",
        "title": "Blazing Deception",
        "season": 9,
        "episode": 13,
        "released": "2020-02-24",
        "overview": "After Monica Sykes disappears, questions start swirling around the men in her life, including a current boyfriend, a recent ex and a young police officer."
      },
      {
        "id": "tvmaze:1790464",
        "title": "An Unlikely Mastermind",
        "season": 9,
        "episode": 14,
        "released": "2020-03-02",
        "overview": "When Paul Shealey is found shot in the head in a creek, there's no shortage of suspects; as detectives learn about Paul's criminal past, multiple exes and flashy lifestyle, it seems like he may have been an easy target."
      },
      {
        "id": "tvmaze:1790465",
        "title": "Web of Seduction",
        "season": 9,
        "episode": 15,
        "released": "2020-03-09",
        "overview": "After single mother Amber Owens disappears, police uncover a slew of complicated relationships involving her children's father, her new boyfriend and the women both men were seeing on the side."
      },
      {
        "id": "tvmaze:1790466",
        "title": "Hiding in Plain Sight",
        "season": 9,
        "episode": 16,
        "released": "2020-03-16",
        "overview": "When LaJoya McCoy's close-knit family requests a welfare check after they haven't heard from her in days, all signs point to foul play; investigators race to find the missing mother of two, dead or alive."
      },
      {
        "id": "tvmaze:1790467",
        "title": "Killer on the Run",
        "season": 9,
        "episode": 17,
        "released": "2020-03-23",
        "overview": "When a young single mother goes missing, police focus on the men in her life: her child's father, a disappointed ex, and her current boyfriend; but the investigation takes a new direction when her boyfriend is also nowhere to be found."
      },
      {
        "id": "tvmaze:1790468",
        "title": "False Redemption",
        "season": 9,
        "episode": 18,
        "released": "2020-03-30",
        "overview": "When newlywed Trina Winston goes missing, her family assumes she's fallen back into old drug habits she's worked so hard to defeat."
      },
      {
        "id": "tvmaze:1790469",
        "title": "Mask of a Killer",
        "season": 9,
        "episode": 19,
        "released": "2020-04-06",
        "overview": "When the family of Shalisa O'Dell find her beaten to death at home, police immediately look at her boyfriend and ex as suspects; but as they uncover more about Shalisa, including her moonlighting job at a gentleman's club, the suspect list grows."
      },
      {
        "id": "tvmaze:1790470",
        "title": "Storm of Lies",
        "season": 9,
        "episode": 20,
        "released": "2020-04-13",
        "overview": "Pregnant mother Megan Price is found dead in her home; there's evidence that multiple people didn't want her new baby to see the light of day."
      },
      {
        "id": "tvmaze:1839064",
        "title": "Grave Betrayal",
        "season": 10,
        "episode": 1,
        "released": "2020-04-20",
        "overview": "When a former Miss Bahamas contestant disappears in Florida, her family fears something horrible has happened to her."
      },
      {
        "id": "tvmaze:1844423",
        "title": "Masked Secrets",
        "season": 10,
        "episode": 2,
        "released": "2020-04-27",
        "overview": "A young Detroit woman seems to have it all -- a loving family, a doting boyfriend, an exciting new job -- until one day, she inexplicably goes missing."
      },
      {
        "id": "tvmaze:1853049",
        "title": "Capital Murder",
        "season": 10,
        "episode": 3,
        "released": "2020-05-04",
        "overview": "When a hardworking mother of three disappears during her lunch hour, investigators wonder who could have targeted her and why; after police finally find her body dumped in a field, they shift their focus to the men in her life."
      },
      {
        "id": "tvmaze:1859308",
        "title": "Field of Deception",
        "season": 10,
        "episode": 4,
        "released": "2020-05-11",
        "overview": "When a young mother is found shot dead, investigators uncover a twisted web of jealousy and a love triangle that could be to blame."
      },
      {
        "id": "tvmaze:1859309",
        "title": "Casualty of Love",
        "season": 10,
        "episode": 5,
        "released": "2020-05-18",
        "overview": "When an Army sergeant home on leave is gun downed on New Year's Eve, police suspect the straight-arrow soldier may have been killed over beef with someone from his past."
      },
      {
        "id": "tvmaze:1867905",
        "title": "Senseless Slaying",
        "season": 10,
        "episode": 6,
        "released": "2020-05-25",
        "overview": ""
      },
      {
        "id": "tvmaze:1873205",
        "title": "A Sinner's Secret",
        "season": 10,
        "episode": 7,
        "released": "2020-06-01",
        "overview": ""
      },
      {
        "id": "tvmaze:1876926",
        "title": "Dangerous Love",
        "season": 10,
        "episode": 8,
        "released": "2020-06-08",
        "overview": ""
      },
      {
        "id": "tvmaze:1934498",
        "title": "Without Warning",
        "season": 10,
        "episode": 9,
        "released": "2020-09-28",
        "overview": "When a homeowner in a troubled Brooklyn neighborhood is gunned down at his front door, police suspect a robbery gone bad."
      },
      {
        "id": "tvmaze:1936180",
        "title": "Victim of Success",
        "season": 10,
        "episode": 10,
        "released": "2020-10-05",
        "overview": "She was in love and enjoying a life of glitz and glamour, until she became the victim of an unlikely kidnapping turned murder."
      },
      {
        "id": "tvmaze:1936181",
        "title": "A Mother's Intuition",
        "season": 10,
        "episode": 11,
        "released": "2020-10-12",
        "overview": "When a young woman goes missing after a night out with friends, her family fears the worst."
      },
      {
        "id": "tvmaze:1936182",
        "title": "When a Killer Goes Free",
        "season": 10,
        "episode": 12,
        "released": "2020-10-19",
        "overview": "When a single mom disappears after celebrating Independence Day in Milwaukee, her family immediately knows something is wrong."
      },
      {
        "id": "tvmaze:1936183",
        "title": "Murder in Midtown",
        "season": 10,
        "episode": 13,
        "released": "2020-10-26",
        "overview": "When a young woman never returns to work after her lunch break, friends and family worry that she's missing. But when her mother goes to check on her, the truth is even more devastating - her daughter has been shot to death in the bathroom of her apartment. As investigators dig into the case, they'll uncover a love triangle and a series of 911 calls that will lead them to a cold-blooded killer."
      },
      {
        "id": "tvmaze:1936184",
        "title": "A Concrete Alibi",
        "season": 10,
        "episode": 14,
        "released": "2020-11-02",
        "overview": "A young, Memphis wife and mother seemed to have it all, until she disappears without a trace one morning. As investigators uncover affairs, stalking, and even arson, they realize finding her won't be easy. And when the truth is finally revealed, it's nothing anyone could have imagined."
      },
      {
        "id": "tvmaze:1936185",
        "title": "A Sister's Loyalty",
        "season": 10,
        "episode": 15,
        "released": "2020-11-09",
        "overview": ""
      },
      {
        "id": "tvmaze:1936186",
        "title": "Fool Me Twice",
        "season": 10,
        "episode": 16,
        "released": "2020-11-23",
        "overview": ""
      },
      {
        "id": "tvmaze:1974835",
        "title": "A Fallen Star",
        "season": 10,
        "episode": 17,
        "released": "2020-11-30",
        "overview": "An Atlanta rapper who is on the verge of stardom is shot dead; evidence on the scene seems to point to a straightforward case of self-defense."
      },
      {
        "id": "tvmaze:1974836",
        "title": "Thou Shalt Not Kill",
        "season": 10,
        "episode": 18,
        "released": "2020-12-07",
        "overview": "A brilliant, beautiful college student goes missing; the case takes one shocking turn after another."
      },
      {
        "id": "tvmaze:1982733",
        "title": "A Wicked Rival",
        "season": 10,
        "episode": 19,
        "released": "2020-12-14",
        "overview": "On January 13, 2017, 34 year old, Julii Johnson is gunned down in front of her boyfriends house in Warren, Michigan. When detectives find a half million dollars hiding in her boyfriends house they wonder if this is what cost Julii her life."
      },
      {
        "id": "tvmaze:1986312",
        "title": "The Lone Wolf",
        "season": 10,
        "episode": 20,
        "released": "2020-12-21",
        "overview": ""
      },
      {
        "id": "tvmaze:2048160",
        "title": "Out of Luck",
        "season": 11,
        "episode": 1,
        "released": "2021-03-22",
        "overview": "A young woman disappears without a trace and evidence suggests she may not be coming back. To find her, investigators will have to root out a dark secret and hope that their killer is ..."
      },
      {
        "id": "tvmaze:2051646",
        "title": "A Call for Help",
        "season": 11,
        "episode": 2,
        "released": "2021-03-29",
        "overview": "A teenage girl is shot during a confrontation between her current and former boyfriends; her call for help to 911 leads police to conclude it's an open-and-shut case."
      },
      {
        "id": "tvmaze:2055839",
        "title": "A Wolf in Sheep's Clothing",
        "season": 11,
        "episode": 3,
        "released": "2021-04-05",
        "overview": "When a reformed wild child settles down with the man of her dreams it seems as if everything is falling into place — until she's found murdered."
      },
      {
        "id": "tvmaze:2063034",
        "title": "Double Devastation",
        "season": 11,
        "episode": 4,
        "released": "2021-04-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2065028",
        "title": "Meeting a Murderer",
        "season": 11,
        "episode": 5,
        "released": "2021-04-19",
        "overview": "When a responsible 16-year-old girl vanishes, her family fears the worst. Could she have been kidnapped, or even trafficked? As police and family search for her, a shocking story soon surfaces revealing she kept a deadly secret, and the terrible truth of what happened hits far closer to home."
      },
      {
        "id": "tvmaze:2071714",
        "title": "Storm of Betrayal",
        "season": 11,
        "episode": 6,
        "released": "2021-04-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2076102",
        "title": "Friends Without Benefits",
        "season": 11,
        "episode": 7,
        "released": "2021-05-03",
        "overview": ""
      },
      {
        "id": "tvmaze:2079599",
        "title": "Silent Witness",
        "season": 11,
        "episode": 8,
        "released": "2021-05-10",
        "overview": ""
      },
      {
        "id": "tvmaze:2085006",
        "title": "Writing on the Wall",
        "season": 11,
        "episode": 9,
        "released": "2021-05-17",
        "overview": "A menacing message scrubbed on the wall of the murder victim's home reads, \"You gave me HIV.\" But was that the true motive behind her gruesome stabbing death? Or was her killer just creating smoke and mirrors?"
      },
      {
        "id": "tvmaze:2089597",
        "title": "Serial Confessions",
        "season": 11,
        "episode": 10,
        "released": "2021-05-24",
        "overview": "A woman is found dead inside a motel room, and police quickly learn that she was an escort; there are multiple suspects, from her last client to her latest boyfriend, but the investigation puts the police on the trail of a serial killer instead."
      },
      {
        "id": "tvmaze:2095804",
        "title": "Never to Return",
        "season": 11,
        "episode": 11,
        "released": "2021-05-31",
        "overview": "A single mother seems happy and in love, but then, she disappears without a trace. Rumors swirl that a troubled past has returned to haunt her, but the truth, which has forced her children to bare a horrible secret, is even more shocking."
      },
      {
        "id": "tvmaze:2179352",
        "title": "Hidden Connections",
        "season": 11,
        "episode": 12,
        "released": "2021-10-04",
        "overview": "When a young mother is gunned down outside her apartment, the police immediately have a lot of questions; the investigation reveals several possible suspects , her current and previous beaus, and multiple women who may be angry about her pregnancy."
      },
      {
        "id": "tvmaze:2183349",
        "title": "An Envious Execution",
        "season": 11,
        "episode": 13,
        "released": "2021-10-11",
        "overview": "After a hail of gunfire leaves two people dead, police quickly identify a suspect, but they struggle to pin him for the crime until a strange coincidence makes them realize he's already in their crosshairs for another murder."
      },
      {
        "id": "tvmaze:2188432",
        "title": "Blazing Betrayal",
        "season": 11,
        "episode": 14,
        "released": "2021-10-18",
        "overview": "A woman is found dead in a suspicious house fire."
      },
      {
        "id": "tvmaze:2196726",
        "title": "A Revival's Revenge",
        "season": 11,
        "episode": 15,
        "released": "2021-10-25",
        "overview": "A loving mother is killed in a violent hit and run and police initially suspect this was a tragic accident; shocking evidence surfaces that proves this woman was brutally targeted."
      },
      {
        "id": "tvmaze:2202254",
        "title": "A Key Witness",
        "season": 11,
        "episode": 16,
        "released": "2021-11-01",
        "overview": "A young mother is found stabbed to death in her tub, and police first suspect her recent ex, but he produces an airtight alibi; when it looks like the case may never be solved, a frightened witness finally finds the courage to come forward."
      },
      {
        "id": "tvmaze:2207496",
        "title": "The Devil Within",
        "season": 11,
        "episode": 17,
        "released": "2021-11-08",
        "overview": "Shortly after a large worker's comp settlement gave one family a chance at a good life, the husband and father is found dead in his truck; as police expose dark secrets, they're led to a cold-blooded killer nobody expected."
      },
      {
        "id": "tvmaze:2209258",
        "title": "Friendly Fire",
        "season": 11,
        "episode": 18,
        "released": "2021-11-15",
        "overview": "When the body of a young woman is found in a vacant lot, friends she was out with the night she disappeared tell police they saw her leave in a mysterious black car."
      },
      {
        "id": "tvmaze:2214735",
        "title": "Caught in a Web",
        "season": 11,
        "episode": 19,
        "released": "2021-11-22",
        "overview": "A young man survives a near fatal shooting, rebuilds his life, and starts looking for love, only to disappear without a trace."
      },
      {
        "id": "tvmaze:2217732",
        "title": "Blinded by Love",
        "season": 11,
        "episode": 20,
        "released": "2021-11-29",
        "overview": "When a kindhearted janitor is beaten to death in his home, it doesn't take long to learn he was embroiled in a love triangle with his wife and a close friend."
      },
      {
        "id": "tvmaze:2255926",
        "title": "A Homicidal Haze",
        "season": 12,
        "episode": 1,
        "released": "2022-01-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2261606",
        "title": "Devil in Disguise",
        "season": 12,
        "episode": 2,
        "released": "2022-01-31",
        "overview": "When a nursing student disappears, suspicion immediately falls on her boyfriend and the other woman in his life; police struggle to pinpoint a suspect until a guilty conscience leads them to her body -- and her killer."
      },
      {
        "id": "tvmaze:2266249",
        "title": "The Evil Within",
        "season": 12,
        "episode": 3,
        "released": "2022-02-07",
        "overview": "A bright, young scientist is brutally murdered at work without witnesses; detectives struggle to identify the killer until he's found hiding in plain sight."
      },
      {
        "id": "tvmaze:2269988",
        "title": "Chasing a Monster",
        "season": 12,
        "episode": 4,
        "released": "2022-02-14",
        "overview": "A missing persons case takes a heartbreaking turn and launches a manhunt when detectives discover a body in an abandoned car."
      },
      {
        "id": "tvmaze:2273800",
        "title": "An American Nightmare",
        "season": 12,
        "episode": 5,
        "released": "2022-02-21",
        "overview": "When a loving and successful married couple meets a deadly fate, will investigators discover a trail of dark secrets?"
      },
      {
        "id": "tvmaze:2277703",
        "title": "What's Done is Done",
        "season": 12,
        "episode": 6,
        "released": "2022-02-28",
        "overview": "A woman is found dead by the railroad tracks in New Jersey; the victim's boyfriend is the prime suspect until police discover a secret relationship she had with another man."
      },
      {
        "id": "tvmaze:2284734",
        "title": "A Lethal Engagement",
        "season": 12,
        "episode": 7,
        "released": "2022-03-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2288161",
        "title": "Gone in the Dark",
        "season": 12,
        "episode": 8,
        "released": "2022-03-14",
        "overview": "When a young woman disappears after a weekend with her boyfriend, her worried family wonders what could have happened; the boyfriend claims she left with a male friend, but the friend denies it; someone is lying, and detectives must find the truth."
      },
      {
        "id": "tvmaze:2294161",
        "title": "Downward Spiral",
        "season": 12,
        "episode": 9,
        "released": "2022-03-21",
        "overview": "When a woman goes missing, police are reluctant to jump on the case because of her past; when they begin investigating the circumstances surrounding her disappearance, detectives find alarming evidence, leading to an even more disturbing crime."
      },
      {
        "id": "tvmaze:2298013",
        "title": "Death in the Desert",
        "season": 12,
        "episode": 10,
        "released": "2022-03-28",
        "overview": "When a young man leaves his troubled life in the city behind for a peaceful desert town, he finds love among the desert heat; when he is brutally gunned down inside his own home, police wonder if his past has come back to haunt him."
      },
      {
        "id": "tvmaze:2357686",
        "title": "Murder by the Bay",
        "season": 12,
        "episode": 11,
        "released": "2022-04-04",
        "overview": ""
      },
      {
        "id": "tvmaze:2311411",
        "title": "Monster in Disguise",
        "season": 12,
        "episode": 12,
        "released": "2022-04-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2308917",
        "title": "A Fight for Justice",
        "season": 12,
        "episode": 13,
        "released": "2022-04-18",
        "overview": ""
      },
      {
        "id": "tvmaze:2312951",
        "title": "Highway Homicide",
        "season": 12,
        "episode": 14,
        "released": "2022-04-25",
        "overview": ""
      },
      {
        "id": "tvmaze:2317282",
        "title": "Warning Signs",
        "season": 12,
        "episode": 15,
        "released": "2022-05-02",
        "overview": ""
      },
      {
        "id": "tvmaze:2320414",
        "title": "Deadly Vendetta",
        "season": 12,
        "episode": 16,
        "released": "2022-05-09",
        "overview": ""
      },
      {
        "id": "tvmaze:2323820",
        "title": "A Bleeding Heart",
        "season": 12,
        "episode": 17,
        "released": "2022-05-16",
        "overview": ""
      },
      {
        "id": "tvmaze:2327203",
        "title": "Severed Ties",
        "season": 12,
        "episode": 18,
        "released": "2022-05-23",
        "overview": ""
      },
      {
        "id": "tvmaze:2330541",
        "title": "Target or Tragedy",
        "season": 12,
        "episode": 19,
        "released": "2022-05-30",
        "overview": ""
      },
      {
        "id": "tvmaze:2333652",
        "title": "Unmasking Evil",
        "season": 12,
        "episode": 20,
        "released": "2022-06-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2338212",
        "title": "Bonds of Love",
        "season": 12,
        "episode": 21,
        "released": "2022-06-13",
        "overview": ""
      },
      {
        "id": "tvmaze:2342456",
        "title": "Caught on Camera",
        "season": 12,
        "episode": 22,
        "released": "2022-06-20",
        "overview": ""
      },
      {
        "id": "tvmaze:2347813",
        "title": "Point of No Return",
        "season": 12,
        "episode": 23,
        "released": "2022-06-27",
        "overview": ""
      },
      {
        "id": "tvmaze:2357687",
        "title": "Sheltered By Evil",
        "season": 12,
        "episode": 24,
        "released": "2022-07-04",
        "overview": ""
      },
      {
        "id": "tvmaze:2355418",
        "title": "Layers of Lies",
        "season": 12,
        "episode": 25,
        "released": "2022-07-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2358654",
        "title": "Truth Be Told",
        "season": 12,
        "episode": 26,
        "released": "2022-07-18",
        "overview": "Police believe it was a failed drug deal when a husband and father was discovered stabbed in a motel. But can it be a more sinister reason?"
      },
      {
        "id": "tvmaze:2361802",
        "title": "Homefront Homicide",
        "season": 12,
        "episode": 27,
        "released": "2022-07-25",
        "overview": ""
      },
      {
        "id": "tvmaze:2365128",
        "title": "His Last Breath",
        "season": 12,
        "episode": 28,
        "released": "2022-08-01",
        "overview": ""
      },
      {
        "id": "tvmaze:2372925",
        "title": "A Fight for Life",
        "season": 13,
        "episode": 1,
        "released": "2022-08-22",
        "overview": ""
      },
      {
        "id": "tvmaze:2382640",
        "title": "Fame's Fatality",
        "season": 13,
        "episode": 2,
        "released": "2022-08-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2382641",
        "title": "Happily Never After",
        "season": 13,
        "episode": 3,
        "released": "2022-09-05",
        "overview": "After a former cheerleader is found dead in the trunk of her car, police find surveillance video that shows a man running from the scene. Did her fairytale romance take a deadly turn?"
      },
      {
        "id": "tvmaze:2383539",
        "title": "Fleeing into Danger",
        "season": 13,
        "episode": 4,
        "released": "2022-09-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2413163",
        "title": "Deadly Obsession",
        "season": 13,
        "episode": 5,
        "released": "2022-09-19",
        "overview": "When a young woman arrives at the hospital with gunshot wounds, police attempt to locate the shooter; when the victim passes away, solving the case seems easier said than done until a witness reveals information that turn the case on its head."
      },
      {
        "id": "tvmaze:2393872",
        "title": "From Redemption to Revenge",
        "season": 13,
        "episode": 6,
        "released": "2022-09-26",
        "overview": "An ex-con's redemption is cut short when he's found shot in his home; police soon learn that his girlfriend is also missing and may be a second victim."
      },
      {
        "id": "tvmaze:2399095",
        "title": "Never Saw It Coming",
        "season": 13,
        "episode": 7,
        "released": "2022-10-03",
        "overview": "When a woman is found with a single gunshot wound to her head, her family is shocked; a free spirit and devoted mother, she loved life. As detectives dig, they question if her happiness was just a façade, or if her death was by someone else's hand."
      },
      {
        "id": "tvmaze:2403260",
        "title": "Touch of Evil",
        "season": 13,
        "episode": 8,
        "released": "2022-10-10",
        "overview": ""
      },
      {
        "id": "tvmaze:2410530",
        "title": "His Final Act",
        "season": 13,
        "episode": 9,
        "released": "2022-10-17",
        "overview": ""
      },
      {
        "id": "tvmaze:2413979",
        "title": "A Lost Light",
        "season": 13,
        "episode": 10,
        "released": "2022-10-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2417730",
        "title": "All or Nothing",
        "season": 13,
        "episode": 11,
        "released": "2022-10-31",
        "overview": ""
      },
      {
        "id": "tvmaze:2427843",
        "title": "From Beyond the Grave",
        "season": 13,
        "episode": 12,
        "released": "2022-11-07",
        "overview": "When a nursing student succumbs to a gunshot to the head, detectives' strongest suspects all have strong alibis; but when a recording of the victim is found, police will hear her name her own killer from beyond the grave, exposing one alibi as a lie."
      },
      {
        "id": "tvmaze:2432714",
        "title": "Heat of the Moment",
        "season": 13,
        "episode": 13,
        "released": "2022-11-14",
        "overview": "A 911 call reports a trailer on fire, police arrive to find a victim lying in the front yard. Was this an unfortunate tragedy or a plan to cover up the truth?"
      },
      {
        "id": "tvmaze:2428950",
        "title": "Without a Trace",
        "season": 13,
        "episode": 14,
        "released": "2022-11-21",
        "overview": ""
      },
      {
        "id": "tvmaze:2433914",
        "title": "Entrepreneur's Ending",
        "season": 13,
        "episode": 15,
        "released": "2022-11-28",
        "overview": ""
      },
      {
        "id": "tvmaze:2436854",
        "title": "Holding on to Hope",
        "season": 13,
        "episode": 16,
        "released": "2022-12-05",
        "overview": ""
      },
      {
        "id": "tvmaze:2440652",
        "title": "Death Is Forever",
        "season": 13,
        "episode": 17,
        "released": "2022-12-12",
        "overview": "When a man is killed during an ambush in his home, police aren't certain if this was a botched robbery, or an intentional, cold-blooded killing; digging deeper, they discover a love triangle that led to a jealous rage with dire consequences."
      },
      {
        "id": "tvmaze:2444956",
        "title": "Justice Served Cold",
        "season": 13,
        "episode": 18,
        "released": "2022-12-19",
        "overview": "When a mother vanishes, all that's left is a gasoline-doused car, an estranged husband and a missing man who may have seen her last; police suspect foul play, but without a body or solid evidence, it will take years to bring a killer to justice."
      },
      {
        "id": "tvmaze:2449913",
        "title": "Game Over",
        "season": 13,
        "episode": 19,
        "released": "2022-12-26",
        "overview": "When 27-year-old Meshach Cornwall is found dead at the bottom of a staircase, police suspect it was a tragic accident until items missing from his home suggest a robbery; as detectives dig into Meshach's online life, a devious suspect emerges."
      },
      {
        "id": "tvmaze:2453711",
        "title": "Undone by Arrogance",
        "season": 13,
        "episode": 20,
        "released": "2023-01-02",
        "overview": "When a young woman's body is discovered wrapped in a trash bag and dumped in an Atlanta suburb, police must find who is responsible for this horrific crime; they realize that bringing her cold-blooded killer to justice will be easier said than done."
      },
      {
        "id": "tvmaze:2458440",
        "title": "Murder Most Foul",
        "season": 13,
        "episode": 21,
        "released": "2023-01-09",
        "overview": ""
      },
      {
        "id": "tvmaze:2492012",
        "title": "Twice the Terror",
        "season": 13,
        "episode": 22,
        "released": "2023-02-27",
        "overview": ""
      },
      {
        "id": "tvmaze:2494836",
        "title": "Sister Act",
        "season": 13,
        "episode": 23,
        "released": "2023-03-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2498919",
        "title": "Walking in Her Truth",
        "season": 13,
        "episode": 24,
        "released": "2023-03-13",
        "overview": ""
      },
      {
        "id": "tvmaze:2502442",
        "title": "Driven by Jealousy",
        "season": 13,
        "episode": 25,
        "released": "2023-03-20",
        "overview": ""
      },
      {
        "id": "tvmaze:2513951",
        "title": "Open to Love",
        "season": 13,
        "episode": 26,
        "released": "2023-03-27",
        "overview": ""
      },
      {
        "id": "tvmaze:2525496",
        "title": "Without A Word",
        "season": 13,
        "episode": 27,
        "released": "2023-04-03",
        "overview": ""
      },
      {
        "id": "tvmaze:2524454",
        "title": "Murderous Greed",
        "season": 13,
        "episode": 28,
        "released": "2023-04-10",
        "overview": ""
      },
      {
        "id": "tvmaze:2528420",
        "title": "Grave Consequences",
        "season": 13,
        "episode": 29,
        "released": "2023-04-17",
        "overview": ""
      },
      {
        "id": "tvmaze:2534798",
        "title": "Enraged by Envy",
        "season": 13,
        "episode": 30,
        "released": "2023-04-24",
        "overview": "Detectives uncover a fatal love triangle, violent pasts, and intense wrath after a woman was found dead in her kitchen, her siblings immediately suspect who is responsible."
      },
      {
        "id": "tvmaze:2529766",
        "title": "Chasing Justice",
        "season": 13,
        "episode": 31,
        "released": "2023-05-01",
        "overview": ""
      },
      {
        "id": "tvmaze:2536188",
        "title": "Master of Manipulation",
        "season": 13,
        "episode": 32,
        "released": "2023-05-08",
        "overview": ""
      },
      {
        "id": "tvmaze:2540141",
        "title": "Nightmare on Campus",
        "season": 13,
        "episode": 33,
        "released": "2023-05-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2545965",
        "title": "Love That Kills",
        "season": 13,
        "episode": 34,
        "released": "2023-05-22",
        "overview": ""
      },
      {
        "id": "tvmaze:2551613",
        "title": "An Unthinkable End",
        "season": 13,
        "episode": 35,
        "released": "2023-05-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2557807",
        "title": "Deadly Silence",
        "season": 13,
        "episode": 36,
        "released": "2023-06-05",
        "overview": ""
      },
      {
        "id": "tvmaze:2562827",
        "title": "Alter Ego",
        "season": 13,
        "episode": 37,
        "released": "2023-06-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2579348",
        "title": "A Gentle Giant",
        "season": 13,
        "episode": 38,
        "released": "2023-06-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2575951",
        "title": "Eyes Of A Killer",
        "season": 13,
        "episode": 39,
        "released": "2023-07-03",
        "overview": "When a beloved caretaker is gunned down in a parking lot, an entire community is left mourning; detectives ask whether the case was a random crime or the work of a man who'd been following her."
      },
      {
        "id": "tvmaze:2580293",
        "title": "A Targeted Attack",
        "season": 13,
        "episode": 40,
        "released": "2023-07-10",
        "overview": "When two roommates are found shot inside their home, barely clinging to life, detectives struggle to determine the shooter's intended target; possibilities include a robbery gone wrong, a vindictive drug dealer and a scorned former lover."
      },
      {
        "id": "tvmaze:2591135",
        "title": "Heartland Homicide",
        "season": 13,
        "episode": 41,
        "released": "2023-07-17",
        "overview": "A widowed mother of four is found stabbed to death, and police suspect sexual assault; when detectives uncover a workplace romance, they wonder if the man she was seen talking to could be her killer, and Uber could be their key to cracking the case."
      },
      {
        "id": "tvmaze:2597035",
        "title": "Her Final Fight",
        "season": 13,
        "episode": 42,
        "released": "2023-07-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2607396",
        "title": "Caught in the Act",
        "season": 13,
        "episode": 43,
        "released": "2023-07-31",
        "overview": ""
      },
      {
        "id": "tvmaze:2607397",
        "title": "The Buried Truth",
        "season": 13,
        "episode": 44,
        "released": "2023-08-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2612879",
        "title": "Dangerous Double Life",
        "season": 13,
        "episode": 45,
        "released": "2023-08-14",
        "overview": ""
      },
      {
        "id": "tvmaze:2618459",
        "title": "Deadly Desire",
        "season": 13,
        "episode": 46,
        "released": "2023-08-21",
        "overview": ""
      },
      {
        "id": "tvmaze:2624542",
        "title": "Resurfaced Secrets",
        "season": 13,
        "episode": 47,
        "released": "2023-08-28",
        "overview": "When a single mom who is working hard to get her life on track vanishes, leaving only a cryptic text message as a clue, detectives must race to find the truth before it's entombed in concrete forever."
      },
      {
        "id": "tvmaze:2630378",
        "title": "Intercepting a Killer",
        "season": 13,
        "episode": 48,
        "released": "2023-09-04",
        "overview": "When a young woman and her friend are gunned down outside her parent's home, detectives struggle to find a motive; she could be collateral damage in a drive-by shooting, caught in the crossfire of a shootout, or a victim of a jealous rage."
      },
      {
        "id": "tvmaze:2643429",
        "title": "The Ultimate Betrayal",
        "season": 13,
        "episode": 49,
        "released": "2023-09-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2639752",
        "title": "Over the Edge",
        "season": 13,
        "episode": 50,
        "released": "2023-09-18",
        "overview": "When a young mother disappears after her recent struggles with post-partum depression, her family fears the worst; when her body is found at the bottom of a cliff, they wonder if she took her own life or if someone took it from her."
      },
      {
        "id": "tvmaze:2663893",
        "title": "A Cryptic Call",
        "season": 14,
        "episode": 1,
        "released": "2023-10-16",
        "overview": ""
      },
      {
        "id": "tvmaze:2663894",
        "title": "A Deadly Feud",
        "season": 14,
        "episode": 2,
        "released": "2023-10-23",
        "overview": ""
      },
      {
        "id": "tvmaze:2663895",
        "title": "A Violent Vendetta",
        "season": 14,
        "episode": 3,
        "released": "2023-10-30",
        "overview": ""
      },
      {
        "id": "tvmaze:2673375",
        "title": "Dual Disappearance",
        "season": 14,
        "episode": 4,
        "released": "2023-11-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2679181",
        "title": "A Violent Vanishing",
        "season": 14,
        "episode": 5,
        "released": "2023-11-13",
        "overview": ""
      },
      {
        "id": "tvmaze:2688910",
        "title": "A Deadly Scheme",
        "season": 14,
        "episode": 6,
        "released": "2023-11-20",
        "overview": "When a charitable woman is stabbed to death by a panhandler, the city is left gripped with fear; as her husband calls for action, police begin to question the witness's story."
      },
      {
        "id": "tvmaze:2688911",
        "title": "A Thanksgiving Tragedy",
        "season": 14,
        "episode": 7,
        "released": "2023-11-27",
        "overview": ""
      },
      {
        "id": "tvmaze:2694234",
        "title": "Smoldering Secrets",
        "season": 14,
        "episode": 8,
        "released": "2023-12-04",
        "overview": ""
      },
      {
        "id": "tvmaze:2699025",
        "title": "Death at the Doorstep",
        "season": 14,
        "episode": 9,
        "released": "2023-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2706340",
        "title": "New Orleans Nightmare",
        "season": 14,
        "episode": 10,
        "released": "2023-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:2719168",
        "title": "The Price of Naivete",
        "season": 14,
        "episode": 11,
        "released": "2024-01-01",
        "overview": "When a sheltered, small-town girl is killed in the big city, it looks like she was the unintentional victim of a drive-by shooting; police soon uncover a shocking cell phone video that could be the smoking gun needed to break the case."
      },
      {
        "id": "tvmaze:2728680",
        "title": "Evil in the Everglades",
        "season": 14,
        "episode": 12,
        "released": "2024-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:2739750",
        "title": "Playing a Dangerous Game",
        "season": 14,
        "episode": 13,
        "released": "2024-01-22",
        "overview": "When the grisly remains of a beloved football coach are found in his Texas home, detectives and loved ones desperately search for answers. Did he become a victim of his secret lifestyle, was he hunted for his debts, or was this a crime of passion?"
      },
      {
        "id": "tvmaze:2746126",
        "title": "Fireworks and Foul Play",
        "season": 14,
        "episode": 14,
        "released": "2024-01-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2764942",
        "title": "The Devil is Real",
        "season": 14,
        "episode": 15,
        "released": "2024-02-05",
        "overview": ""
      },
      {
        "id": "tvmaze:2768781",
        "title": "A Hunted Heart",
        "season": 14,
        "episode": 16,
        "released": "2024-02-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2767801",
        "title": "The Blade of a Broken Heart",
        "season": 14,
        "episode": 17,
        "released": "2024-02-19",
        "overview": "A young father who was excited to watch his sons grow up is fatally stabbed on Thanksgiving weekend. When detectives uncover a love triangle, they question the motive behind his murder and find a killer determined to have their pie ... and eat it too."
      },
      {
        "id": "tvmaze:2770119",
        "title": "At the Water's Edge",
        "season": 14,
        "episode": 18,
        "released": "2024-02-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2777103",
        "title": "Backroad Betrayal",
        "season": 14,
        "episode": 19,
        "released": "2024-03-04",
        "overview": ""
      },
      {
        "id": "tvmaze:2784920",
        "title": "Dancing with the Devil",
        "season": 14,
        "episode": 20,
        "released": "2024-03-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2791774",
        "title": "Thread of Deception",
        "season": 14,
        "episode": 21,
        "released": "2024-03-18",
        "overview": ""
      },
      {
        "id": "tvmaze:2802166",
        "title": "Money Hungry",
        "season": 14,
        "episode": 22,
        "released": "2024-03-25",
        "overview": ""
      },
      {
        "id": "tvmaze:2802167",
        "title": "Horror Beneath the Ashes",
        "season": 14,
        "episode": 23,
        "released": "2024-04-01",
        "overview": ""
      },
      {
        "id": "tvmaze:2807466",
        "title": "Struck by Jealousy",
        "season": 14,
        "episode": 24,
        "released": "2024-04-08",
        "overview": ""
      },
      {
        "id": "tvmaze:2815245",
        "title": "Ride or Die",
        "season": 14,
        "episode": 25,
        "released": "2024-04-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2837689",
        "title": "Scratching the Surface",
        "season": 14,
        "episode": 26,
        "released": "2024-04-22",
        "overview": ""
      },
      {
        "id": "tvmaze:2857160",
        "title": "Unfulfilled Duty",
        "season": 14,
        "episode": 27,
        "released": "2024-05-20",
        "overview": ""
      },
      {
        "id": "tvmaze:2887976",
        "title": "The Look of a Killer",
        "season": 14,
        "episode": 28,
        "released": "2024-05-27",
        "overview": ""
      },
      {
        "id": "tvmaze:2890653",
        "title": "Death in the Cul-De-Sac",
        "season": 14,
        "episode": 29,
        "released": "2024-05-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2880536",
        "title": "Burdened By Silence",
        "season": 14,
        "episode": 30,
        "released": "2024-06-03",
        "overview": ""
      },
      {
        "id": "tvmaze:2881794",
        "title": "Unearthed Secrets",
        "season": 14,
        "episode": 31,
        "released": "2024-06-05",
        "overview": ""
      },
      {
        "id": "tvmaze:2894969",
        "title": "Killer Confessions",
        "season": 14,
        "episode": 32,
        "released": "2024-06-10",
        "overview": ""
      },
      {
        "id": "tvmaze:2914203",
        "title": "The Devil Inside Me",
        "season": 14,
        "episode": 33,
        "released": "2024-06-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2917881",
        "title": "A Tangled Web",
        "season": 14,
        "episode": 34,
        "released": "2024-06-17",
        "overview": ""
      },
      {
        "id": "tvmaze:2906741",
        "title": "Sinful Betrayal",
        "season": 14,
        "episode": 35,
        "released": "2024-06-19",
        "overview": ""
      },
      {
        "id": "tvmaze:2917882",
        "title": "Too Close for Comfort",
        "season": 14,
        "episode": 36,
        "released": "2024-06-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2916494",
        "title": "Lover's Quarrel",
        "season": 14,
        "episode": 37,
        "released": "2024-06-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2932388",
        "title": "A Countryside Conspiracy",
        "season": 14,
        "episode": 38,
        "released": "2024-07-01",
        "overview": ""
      },
      {
        "id": "tvmaze:2922790",
        "title": "Into Thin Air",
        "season": 14,
        "episode": 39,
        "released": "2024-07-03",
        "overview": ""
      },
      {
        "id": "tvmaze:2930374",
        "title": "A Picture Worth a Thousand Words",
        "season": 14,
        "episode": 40,
        "released": "2024-07-08",
        "overview": ""
      },
      {
        "id": "tvmaze:2931695",
        "title": "Evil Escapes",
        "season": 14,
        "episode": 41,
        "released": "2024-07-10",
        "overview": ""
      },
      {
        "id": "tvmaze:2937601",
        "title": "Downfall Comes in Deceit",
        "season": 14,
        "episode": 42,
        "released": "2024-07-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2937602",
        "title": "One for the Money",
        "season": 14,
        "episode": 43,
        "released": "2024-07-17",
        "overview": ""
      },
      {
        "id": "tvmaze:2939977",
        "title": "Fatal Façade",
        "season": 14,
        "episode": 44,
        "released": "2024-07-22",
        "overview": ""
      },
      {
        "id": "tvmaze:2941070",
        "title": "No Remorse",
        "season": 14,
        "episode": 45,
        "released": "2024-07-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2946576",
        "title": "A Love That Won't Let Go",
        "season": 14,
        "episode": 46,
        "released": "2024-07-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2953680",
        "title": "Depraved Mind",
        "season": 14,
        "episode": 47,
        "released": "2024-07-31",
        "overview": ""
      },
      {
        "id": "tvmaze:2967566",
        "title": "Deadly Delusion",
        "season": 14,
        "episode": 48,
        "released": "2024-08-05",
        "overview": ""
      },
      {
        "id": "tvmaze:2957319",
        "title": "Trail of Violence",
        "season": 14,
        "episode": 49,
        "released": "2024-08-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2960927",
        "title": "Black Friday Bloodshed",
        "season": 14,
        "episode": 50,
        "released": "2024-08-12",
        "overview": ""
      },
      {
        "id": "tvmaze:2965903",
        "title": "Deathly Betrothal",
        "season": 14,
        "episode": 51,
        "released": "2024-08-14",
        "overview": ""
      },
      {
        "id": "tvmaze:2974526",
        "title": "Devilish Deception",
        "season": 14,
        "episode": 52,
        "released": "2024-08-19",
        "overview": ""
      },
      {
        "id": "tvmaze:2977890",
        "title": "Femme Fatale",
        "season": 14,
        "episode": 53,
        "released": "2024-08-21",
        "overview": ""
      },
      {
        "id": "tvmaze:2980336",
        "title": "Cold-Blooded Cover-Up",
        "season": 14,
        "episode": 54,
        "released": "2024-08-26",
        "overview": ""
      },
      {
        "id": "tvmaze:2981430",
        "title": "Dangerous Liaison",
        "season": 14,
        "episode": 55,
        "released": "2024-08-28",
        "overview": ""
      },
      {
        "id": "tvmaze:2993033",
        "title": "The Twisted Truth",
        "season": 14,
        "episode": 56,
        "released": "2024-09-02",
        "overview": ""
      },
      {
        "id": "tvmaze:2985423",
        "title": "Sinful Secrets",
        "season": 14,
        "episode": 57,
        "released": "2024-09-04",
        "overview": ""
      },
      {
        "id": "tvmaze:2989969",
        "title": "A Bad Connection",
        "season": 14,
        "episode": 58,
        "released": "2024-09-09",
        "overview": ""
      },
      {
        "id": "tvmaze:2991243",
        "title": "Silent Betrayal",
        "season": 14,
        "episode": 59,
        "released": "2024-09-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2994947",
        "title": "Entangled in Jealousy",
        "season": 14,
        "episode": 60,
        "released": "2024-09-16",
        "overview": ""
      },
      {
        "id": "tvmaze:2996634",
        "title": "Out of Control",
        "season": 14,
        "episode": 61,
        "released": "2024-09-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3002977",
        "title": "A Chilling Demise",
        "season": 14,
        "episode": 62,
        "released": "2024-09-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3004587",
        "title": "Out of the Ordinary",
        "season": 14,
        "episode": 63,
        "released": "2024-09-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3007997",
        "title": "A Fatal Fairytale",
        "season": 14,
        "episode": 64,
        "released": "2024-09-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3009301",
        "title": "Desperate Measures",
        "season": 14,
        "episode": 65,
        "released": "2024-10-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3022710",
        "title": "Deadly Allure",
        "season": 14,
        "episode": 66,
        "released": "2024-10-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3014890",
        "title": "Shadow of Jealousy",
        "season": 14,
        "episode": 67,
        "released": "2024-10-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3017966",
        "title": "A Deadly Dose",
        "season": 14,
        "episode": 68,
        "released": "2024-10-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3020448",
        "title": "Ritualistic Obsession",
        "season": 14,
        "episode": 69,
        "released": "2024-10-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3025554",
        "title": "Predator in the Park",
        "season": 14,
        "episode": 70,
        "released": "2024-10-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3027375",
        "title": "I Love You to Death",
        "season": 14,
        "episode": 71,
        "released": "2024-10-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3030033",
        "title": "Dark Desires",
        "season": 14,
        "episode": 72,
        "released": "2024-10-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3031909",
        "title": "Chilling Premonitions",
        "season": 14,
        "episode": 73,
        "released": "2024-10-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3034816",
        "title": "Brutal Betrayal",
        "season": 14,
        "episode": 74,
        "released": "2024-11-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3035655",
        "title": "Miracles and Monsters",
        "season": 14,
        "episode": 75,
        "released": "2024-11-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3041349",
        "title": "Bitter Rivalry",
        "season": 14,
        "episode": 76,
        "released": "2024-11-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3068398",
        "title": "Houston Homicide",
        "season": 14,
        "episode": 77,
        "released": "2024-11-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3058562",
        "title": "Rhyme of Revenge",
        "season": 14,
        "episode": 78,
        "released": "2024-11-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3061594",
        "title": "A Dangerous Affair",
        "season": 14,
        "episode": 79,
        "released": "2024-11-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3066681",
        "title": "Disastrous Dreaming",
        "season": 14,
        "episode": 80,
        "released": "2024-11-25",
        "overview": "After fulfilling her American dream, a woman suddenly disappears. Police suspect foul play. With her family's help they zero in on a suspect. But once she is found brutally slain, they're afraid her killer has slipped through their fingers."
      },
      {
        "id": "tvmaze:3063861",
        "title": "Divine Delusions",
        "season": 14,
        "episode": 81,
        "released": "2024-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3069049",
        "title": "Collateral Damage",
        "season": 14,
        "episode": 82,
        "released": "2024-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3076954",
        "title": "Harlem Horror",
        "season": 14,
        "episode": 83,
        "released": "2024-12-16",
        "overview": "A loving grandmother's house becomes the center of a double murder investigation."
      },
      {
        "id": "tvmaze:3088813",
        "title": "The Company You Keep",
        "season": 14,
        "episode": 85,
        "released": "2024-12-23",
        "overview": "When a single mother vanishes without a trace, friends and family fear the worst. As detectives piece together the evening of her disappearance, a scorned lover fueled by bitter resentment emerges at the heart of the investigation."
      },
      {
        "id": "tvmaze:3114032",
        "title": "A Monster in the Making",
        "season": 14,
        "episode": 89,
        "released": "2025-01-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3119269",
        "title": "Deadly Dating Game",
        "season": 14,
        "episode": 90,
        "released": "2025-02-03",
        "overview": "When a beloved cancer survivor is found dead on the side of a rural highway, police fear her blossoming dating life played a role in her tragic demise. As detectives retrace her final days, they discover an obsessive killer hiding in plain sight."
      },
      {
        "id": "tvmaze:3138010",
        "title": "Toxic Intentions",
        "season": 14,
        "episode": 91,
        "released": "2025-02-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3143705",
        "title": "Devil's Playground",
        "season": 14,
        "episode": 92,
        "released": "2025-02-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3153360",
        "title": "Impulse to Kill",
        "season": 14,
        "episode": 93,
        "released": "2025-03-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3157300",
        "title": "Shattered Ambitions",
        "season": 14,
        "episode": 94,
        "released": "2025-02-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3160356",
        "title": "From Hope to Horror",
        "season": 14,
        "episode": 95,
        "released": "2025-03-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3166000",
        "title": "Familial Lies",
        "season": 14,
        "episode": 96,
        "released": "2025-03-17",
        "overview": "When a dedicated security guard is found murdered in her apartment, police initially suspect a fatal home invasion. But as detectives interview their victim's friends and family, they discover an unassuming assailant consumed by jealousy and greed."
      },
      {
        "id": "tvmaze:3180865",
        "title": "The Cost of Desire",
        "season": 14,
        "episode": 97,
        "released": "2025-03-31",
        "overview": ""
      },
      {
        "id": "tvmaze:3183546",
        "title": "Fame and Felony",
        "season": 14,
        "episode": 98,
        "released": "2025-03-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3186179",
        "title": "Flames of Revenge",
        "season": 14,
        "episode": 99,
        "released": "2025-04-07",
        "overview": "When a young teacher and animal lover abandons her dogs for days, her family knows something is wrong; during the search, investigators receive a tip from loved ones, leading them to investigate a tumultuous past that blows the case wide open."
      },
      {
        "id": "tvmaze:3194820",
        "title": "Deadly Arrangement",
        "season": 14,
        "episode": 100,
        "released": "2025-04-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3366430",
        "title": "Unmasking a monster",
        "season": 15,
        "episode": 4,
        "released": "2025-01-29",
        "overview": "A healthcare worker goes missing"
      },
      {
        "id": "tvmaze:3379742",
        "title": "Dealing With Evil",
        "season": 15,
        "episode": 36,
        "released": "2025-09-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3379743",
        "title": "A Threat Inked in Blood",
        "season": 15,
        "episode": 37,
        "released": "2025-09-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3202726",
        "title": "Love and Lies",
        "season": 15,
        "episode": 47,
        "released": "2025-04-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3209958",
        "title": "Lured by Lies",
        "season": 15,
        "episode": 48,
        "released": "2025-04-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3214979",
        "title": "Propensity for Violence",
        "season": 15,
        "episode": 49,
        "released": "2025-05-05",
        "overview": ""
      },
      {
        "id": "tvmaze:3224032",
        "title": "A Volatile Situation",
        "season": 15,
        "episode": 50,
        "released": "2025-05-12",
        "overview": "When a young boy discovers his pregnant mother fatally shot inside their home, investigators are determined to bring her killer to justice. As they uncover details about her love life, a killer driven by a heartless motive emerges."
      },
      {
        "id": "tvmaze:3231546",
        "title": "A Deal with the Devil",
        "season": 15,
        "episode": 51,
        "released": "2025-05-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3241583",
        "title": "A Senseless Tragedy",
        "season": 15,
        "episode": 52,
        "released": "2025-05-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3247838",
        "title": "An Evil Spirit",
        "season": 15,
        "episode": 53,
        "released": "2025-06-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3259274",
        "title": "Troubled Waters",
        "season": 15,
        "episode": 54,
        "released": "2025-06-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3276488",
        "title": "Between Two Lies",
        "season": 15,
        "episode": 55,
        "released": "2025-06-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3273859",
        "title": "Heartless Homicide",
        "season": 15,
        "episode": 56,
        "released": "2025-06-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3279437",
        "title": "Keep Your Friends Close",
        "season": 15,
        "episode": 57,
        "released": "2025-06-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3287985",
        "title": "Crossed Twice",
        "season": 15,
        "episode": 58,
        "released": "2025-07-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3293395",
        "title": "Sinister Secrets",
        "season": 15,
        "episode": 59,
        "released": "2025-07-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3300606",
        "title": "Evil Intentions",
        "season": 15,
        "episode": 60,
        "released": "2025-07-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3316294",
        "title": "Flames of Deception",
        "season": 15,
        "episode": 61,
        "released": "2025-07-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3321800",
        "title": "Trail of a Killer",
        "season": 15,
        "episode": 62,
        "released": "2025-08-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3326611",
        "title": "Controlled by Love",
        "season": 15,
        "episode": 63,
        "released": "2025-08-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3335137",
        "title": "Monster in Plain Sight",
        "season": 15,
        "episode": 64,
        "released": "2025-08-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3333359",
        "title": "Burning Secrets",
        "season": 15,
        "episode": 65,
        "released": "2025-08-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3348688",
        "title": "Ticking Time Bomb",
        "season": 15,
        "episode": 66,
        "released": "2025-09-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3085973",
        "title": "The Cost of Loyalty",
        "season": 16,
        "episode": 1,
        "released": "2024-12-30",
        "overview": "After surviving the murder of her mother as a child, a young woman from the Bronx grows up to become a victim's advocate. When her dismembered body is found in a park, the community is stunned."
      },
      {
        "id": "tvmaze:3092621",
        "title": "Deadly Double-Cross",
        "season": 16,
        "episode": 2,
        "released": "2025-01-06",
        "overview": "Two friends disappear during a shopping trip and when they're found brutally murdered days later, stunning secrets and shocking theories about an affair begin to emerge; law enforcement must race to find their killer and bring them to justice."
      },
      {
        "id": "tvmaze:3098200",
        "title": "Pursuing a Phantom",
        "season": 16,
        "episode": 3,
        "released": "2025-01-13",
        "overview": "When a nurse is abducted outside of her workplace, police race to locate her. But hope fades when video is uncovered of a mysterious man cleaning out her car and the woman nowhere to be seen. With leads drying up, will they find the killer in time?"
      },
      {
        "id": "tvmaze:3107250",
        "title": "Unmasking a Monster",
        "season": 16,
        "episode": 4,
        "released": "2025-01-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3365460",
        "title": "A Desperate Act",
        "season": 16,
        "episode": 7,
        "released": "2025-09-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3382130",
        "title": "Trapped in a Twisted Fairy Tale",
        "season": 16,
        "episode": 8,
        "released": "2025-09-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3389153",
        "title": "Burning Betrayal",
        "season": 16,
        "episode": 9,
        "released": "2025-10-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3394732",
        "title": "Deep Rooted Evil",
        "season": 16,
        "episode": 10,
        "released": "2025-10-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3395724",
        "title": "A Deadly Charade",
        "season": 16,
        "episode": 11,
        "released": "2025-10-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3423765",
        "title": "Tracing the Truth",
        "season": 16,
        "episode": 12,
        "released": "2025-10-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3430486",
        "title": "A Calculated Cover-Up",
        "season": 16,
        "episode": 13,
        "released": "2025-11-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3437447",
        "title": "A Chase for Justice",
        "season": 16,
        "episode": 14,
        "released": "2025-11-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3436558",
        "title": "A Cold-Hearted Killer",
        "season": 16,
        "episode": 15,
        "released": "2025-11-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3441549",
        "title": "Storm of Jealousy",
        "season": 16,
        "episode": 16,
        "released": "2025-11-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3459294",
        "title": "A Vendetta in Videtta",
        "season": 16,
        "episode": 17,
        "released": "2025-12-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3466361",
        "title": "A Facade of Forgiveness",
        "season": 16,
        "episode": 18,
        "released": "2025-12-08",
        "overview": ""
      }
    ]
  }
}