{
  "meta": {
    "id": "tvmaze:81568",
    "type": "series",
    "name": "The Thundermans: Undercover",
    "description": "Phoebe and Max are assigned a mission in their new hi-tech beach home base, where their superhero identities remain a secret. They bring Chloe along to help her have a normal life, but the trio must stop the threats of Secret Shores and the true supervillain known as the Mastermind.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/548/1371133.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/548/1371133.jpg",
    "videos": [
      {
        "id": "tvmaze:3334281",
        "title": "The Most Thunderful Time of the Year",
        "season": 1,
        "episode": 26,
        "released": "2025-12-17",
        "overview": "Phoebe and Max tell holiday stories to compete in the Thundermans Story Slam, but it's Chloe's story that makes them understand the meaning of the holiday."
      },
      {
        "id": "tvmaze:3085880",
        "title": "Thundercover",
        "season": 1,
        "episode": 1,
        "released": "2025-01-11",
        "overview": "Phoebe and Max are assigned a new mission in their hi-tech beach home base, where their superhero identities remain a secret. They bring Chloe along to help her have a normal life, but the trio must stop the threats of Secret Shores and the true supervillain known as the Mastermind."
      },
      {
        "id": "tvmaze:3123338",
        "title": "Faulty Powers",
        "season": 1,
        "episode": 2,
        "released": "2025-01-22",
        "overview": "A training accident makes Chloe's powers faulty; Max tries to cure her and gets a misleading positive result, so she goes to a party; but his treatment actually creates brand new powers Chloe can't control."
      },
      {
        "id": "tvmaze:3123339",
        "title": "Bummer School",
        "season": 1,
        "episode": 3,
        "released": "2025-01-29",
        "overview": "Chloe, Jinx and Booch are designing a school mascot, but Max and Phoebe's feud over their jobs ruins the project; Chloe criticizes them, and the twins realize their fighting affects Chloe now that they're guardians."
      },
      {
        "id": "tvmaze:3126319",
        "title": "The Parent Zap",
        "season": 1,
        "episode": 4,
        "released": "2025-02-05",
        "overview": "After Phoebe and Max let Chloe's friends watch a horror movie and eat candy, Jinx and Booch's parents want to meet Chloe's; with Hank and Barb away, Max and Phoebe transform into them to help Chloe; it goes well until the real Hank and Barb show up."
      },
      {
        "id": "tvmaze:3128650",
        "title": "Save the Date",
        "season": 1,
        "episode": 5,
        "released": "2025-02-12",
        "overview": "Max bets Phoebe she can't turn off being a superhero and go on a normal date. Chloe helps Phoebe do well on the date, but Max tries to sabotage by crying wolf. Suddenly, a real supervillain emerges and puts Max and Chloe in serious danger."
      },
      {
        "id": "tvmaze:3138004",
        "title": "Cherry Bad Things",
        "season": 1,
        "episode": 6,
        "released": "2025-02-26",
        "overview": "Cherry visits and Max discovers Phoebe never took her sparkle power away; Phoebe promises to do so and has a girls' night with Cherry while Max hosts Jinx; Colosso gets jealous; Cherry's powers malfunction, nearly blowing Phoebe's cover."
      },
      {
        "id": "tvmaze:3138005",
        "title": "Not So Fast and Furious",
        "season": 1,
        "episode": 7,
        "released": "2025-03-05",
        "overview": "A new super-fast villain is wreaking havoc in Secret Shores; after Billy's speed accidentally triggers an avalanche, he decides to hang up his cape and retire."
      },
      {
        "id": "tvmaze:3149765",
        "title": "For Your Spies Only",
        "season": 1,
        "episode": 8,
        "released": "2025-03-12",
        "overview": "Max and Phoebe attend a parent-teacher night, leaving Chloe to have friends over without adult supervision; Jinx finds the Air Lair and believes spies are targeting the school and his meddling puts Max and Phoebe's school jobs at risk."
      },
      {
        "id": "tvmaze:3164235",
        "title": "No Friend in Sight",
        "season": 1,
        "episode": 9,
        "released": "2025-03-19",
        "overview": "Chloe feels smothered and thinks it's because Phoebe and Max need friends. In trying to make friends, Phoebe and Max accidentally make the same friend named Brenda and fight over her."
      },
      {
        "id": "tvmaze:3170661",
        "title": "All About Steve",
        "season": 1,
        "episode": 10,
        "released": "2025-03-26",
        "overview": "Billy brings a new sidekick, Steve, to town and wants him to join the T-Force; Phoebe and Max agree to consider him, but when they eventually reject Steve for having a very lame power, he turns evil."
      },
      {
        "id": "tvmaze:3171439",
        "title": "Tide and Prejudice",
        "season": 1,
        "episode": 11,
        "released": "2025-04-02",
        "overview": "The former protector of Secret Shores arrives at the Thundermans' beach house and reclaims it as his home; Phoebe, Max and Chloe try to reason with him, but when a protest at the school goes wrong, the former hero proves more harmful than helpful."
      },
      {
        "id": "tvmaze:3171440",
        "title": "Prank You, Next",
        "season": 1,
        "episode": 12,
        "released": "2025-04-09",
        "overview": "Max seeks help dealing with a mystery prankster at school from his old principal, who was always the target of his pranks."
      },
      {
        "id": "tvmaze:3179156",
        "title": "From Dust Till Dawn",
        "season": 1,
        "episode": 13,
        "released": "2025-04-16",
        "overview": "Chloe struggles with her leadership skills; when a villain attacks her school field trip, Max and Phoebe have to put Chloe in charge while they try to take down the villain and defuse his dangerous astronomical weapon."
      },
      {
        "id": "tvmaze:3179157",
        "title": "Summer of Secrets",
        "season": 1,
        "episode": 14,
        "released": "2025-07-17",
        "overview": "Chloe has been missing school by going on missions with her siblings; she has to go to summer school to catch up on everything she has missed; Max, acting as the substitute for summer school, has a new student who agrees to tutor her."
      },
      {
        "id": "tvmaze:3179158",
        "title": "I Know What You Did This Summer",
        "season": 1,
        "episode": 15,
        "released": "2025-07-17",
        "overview": "B.C. invites Chloe to a launch party at Splat By The Sea; at the same time, Jinx and Booch invite Chloe to protest outside the party; not wanting to hurt anyone's feelings Chloe tries to do both; Pheobe keeps working with Captain Perfect."
      },
      {
        "id": "tvmaze:3298855",
        "title": "The Summer I Turned Giddy",
        "season": 1,
        "episode": 16,
        "released": "2025-07-24",
        "overview": "Max is upset that Phoebe secretly partnered with Captain Perfect; he decides to have a new superhero partner, his best friend Gideon; things go wrong when Max tries to make Gideon a better superhero."
      },
      {
        "id": "tvmaze:3298854",
        "title": "A Midsummer Night's Scheme",
        "season": 1,
        "episode": 17,
        "released": "2025-07-24",
        "overview": "Captain Perfect's younger sister, Penny, is headed down the path of becoming a supervillain; eager to impress Captain Perfect, Max takes it upon himself to guide her toward a better path."
      },
      {
        "id": "tvmaze:3307346",
        "title": "Cruel Summer",
        "season": 1,
        "episode": 18,
        "released": "2025-07-31",
        "overview": "Max flees from Phoebe and Captain Perfect to prove his innocence when he is wrongly accused of committing a crime."
      },
      {
        "id": "tvmaze:3307347",
        "title": "Endless Summer",
        "season": 1,
        "episode": 19,
        "released": "2025-07-31",
        "overview": "Max pretends to turn evil to infiltrate Mastermind's henchmen and steal the Chip-Chucker, a device that previously turned him evil."
      },
      {
        "id": "tvmaze:3334275",
        "title": "The Max of Life",
        "season": 1,
        "episode": 20,
        "released": "2025-09-10",
        "overview": "Max misses being famous and having fans, so he decides to break Booch's sandwich-stacking record to be famous again; Chloe rallies behind Bootch, so that she can take back her record."
      },
      {
        "id": "tvmaze:3334276",
        "title": "Love Is in the Lair",
        "season": 1,
        "episode": 21,
        "released": "2025-09-17",
        "overview": "Mrs. Wong visits Secret Shores and threatens to reveal the Thundermans' superhero identities to the town; but Max and Phoebe's plan to have Dr. Colosso keep her quiet backfires in ways they could not have imagined."
      },
      {
        "id": "tvmaze:3334277",
        "title": "She's All Splat",
        "season": 1,
        "episode": 22,
        "released": "2025-09-24",
        "overview": "With Cherry working at Splat by Sea, Max ropes her into a fake dating scheme to score discounts at the restaurant. Chloe faces a tough choice between winning a trivia competition or supporting her brother Billy when he wants to join her team."
      },
      {
        "id": "tvmaze:3334278",
        "title": "Party All the Crime",
        "season": 1,
        "episode": 23,
        "released": "2025-10-01",
        "overview": "Chloe's birthday party is cancelled, and Max and Phoebe compete to throw her a new one; when Max's time-stopping birthday gift falls into the wrong hands, he must work with Phoebe to stop some party poopers from ruining Chloe's birthday."
      },
      {
        "id": "tvmaze:3334279",
        "title": "The Mastermind Unmasked Part 1",
        "season": 1,
        "episode": 24,
        "released": "2025-10-08",
        "overview": "Max and Phoebe discover that Lazlo Chance may be the evil Mastermind and enlist Chloe to help, but Chloe is torn between her head and her heart."
      },
      {
        "id": "tvmaze:3334280",
        "title": "The Mastermind Unmasked Part 2",
        "season": 1,
        "episode": 25,
        "released": "2025-10-15",
        "overview": "When The Mastermind forces Chloe to steal a magical amulet that grants him superhero powers, the Thundermans unite to stop his plan. Chloe must reveal her identity to save her friends."
      }
    ]
  }
}