{
  "meta": {
    "id": "tvmaze:87254",
    "type": "series",
    "name": "Weather Hunters",
    "description": "Weather Hunters entertains and educates kids about the impact weather has on our daily lives, and inspires young kids to pursue a future in STEM. Understanding that representation in the media matters, the series includes diverse cast, helping to make science accessible to all viewers.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/588/1471541.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/588/1471541.jpg",
    "videos": [
      {
        "id": "tvmaze:3394953",
        "title": "Christmas in Africa",
        "season": 1,
        "episode": 11,
        "released": "2025-12-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3370754",
        "title": "The Windy Day",
        "season": 1,
        "episode": 1,
        "released": "2025-09-08",
        "overview": "Lily and her family move into the home once occupied by her great grandpa Wallace Hunter. Moving day becomes even more exciting when strong winds prevent Lily's dad Al from delivering his weather report, and the whole family pitches in."
      },
      {
        "id": "tvmaze:3370755",
        "title": "The Vansformer",
        "season": 1,
        "episode": 2,
        "released": "2025-09-09",
        "overview": "Lily and her family discover a surprise Great Grandpa Wallace left for them in the garage -- a mobile weather station that can fly! They embark on their first weather hunting expedition -- above the clouds."
      },
      {
        "id": "tvmaze:3370756",
        "title": "Finding Cumulus",
        "season": 1,
        "episode": 3,
        "released": "2025-09-10",
        "overview": "The Hunters discover a stowaway in their picnic basket. The unknown guest, a dog, appears frightened so the family investigates the cause. As their new furry friend warms up to them, they gain a new member of the family in the process."
      },
      {
        "id": "tvmaze:3370757",
        "title": "Cold Snap",
        "season": 1,
        "episode": 4,
        "released": "2025-09-11",
        "overview": "The Hunter's nice warm spring day is derailed when a cold snap suddenly hits. Worried about the low temperature's effect on outdoor plants, the kids band together to protect the gardens in their neighborhood."
      },
      {
        "id": "tvmaze:3370758",
        "title": "A Dark and Stormy Night",
        "season": 1,
        "episode": 5,
        "released": "2025-09-15",
        "overview": "The Hunters monitor a thunderstorm, but when the power goes out, their drone stops working. With no way to keep a direct eye on the storm, the Hunters get creative so they can still alert all their neighbors about the storm's location."
      },
      {
        "id": "tvmaze:3370759",
        "title": "The Leaf Painter",
        "season": 1,
        "episode": 6,
        "released": "2025-09-16",
        "overview": "After playing in a pile of leaves, the Hunter kids wonder why they change color so the family heads to the state park to investigate the mystery and to find the Leaf Painter -- a man, who Benny claims, paints all of the leaves."
      },
      {
        "id": "tvmaze:3370760",
        "title": "Foggy Trick or Treat",
        "season": 1,
        "episode": 7,
        "released": "2025-09-17",
        "overview": "Corky and Lily go trick-or-treating but get lost when a sudden fog rolls in. They fight their fear and try to find their way as their parents search for them. When they finally reunite, the family continue their hunt for treats together."
      },
      {
        "id": "tvmaze:3370761",
        "title": "Corky's Weird Desert Mystery",
        "season": 1,
        "episode": 8,
        "released": "2025-09-22",
        "overview": "The Hunters venture into the desert to investigate a weather mystery surrounding massive rocks that seemingly move all on their own. Settling on two theories, the Hunters set up camp in the desert hoping to uncover the truth."
      },
      {
        "id": "tvmaze:3370762",
        "title": "The Word on the Bird",
        "season": 1,
        "episode": 9,
        "released": "2025-09-23",
        "overview": "When an injured bird who is struggling to fly appears in the Hunter's backyard, the kids spring to action. In a test against time, they try to speed up the bird's recovery so it can join its bird friends migrating South for the Winter."
      },
      {
        "id": "tvmaze:3370763",
        "title": "No Snow Snow Day",
        "season": 1,
        "episode": 10,
        "released": "2025-09-24",
        "overview": "Just as the Hunters gear up for a snow day, they find no snow on the ground. After they investigate the lack of accumulation, they head to a nearby mountain and find an abundance of snow perfect for snow dragon building and snowshoeing."
      },
      {
        "id": "tvmaze:3394953",
        "title": "Christmas in Africa",
        "season": 1,
        "episode": 11,
        "released": "2025-12-08",
        "overview": ""
      }
    ]
  }
}