{
  "meta": {
    "id": "tvmaze:3909",
    "type": "series",
    "name": "The Great British Sewing Bee",
    "description": "Amateur sewers take on challenges as they compete to be named Britain's best home sewer.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/581/1454841.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/581/1454841.jpg",
    "videos": [
      {
        "id": "tvmaze:3458242",
        "title": "Celebrity Christmas Special 2025",
        "season": 11,
        "episode": null,
        "released": "2025-12-24",
        "overview": "Brand new host Sophie Willan takes the helm as judges Patrick Grant and Esme Young put four celebrities' sewing skills to the test.They'll be welcoming into the sewing room professional dancer and Strictly Come Dancing judge Anton Du Beke, comedian Lucy Beaumont, actress Susan Wakoma and Gladiator Tom Wilson, AKA Hammer. They put their twist on a pattern for a festive present sack and turn second-hand party wear into an outfit inspired by 'The twelve days of Christmas' in the Transformation Challenge. Finally, they create an outfit for real life models inspired by their favourite Christmas treat."
      },
      {
        "id": "tvmaze:251165",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2013-04-02",
        "overview": "Claudia Winkleman presents a series from the makers of The Great British Bake Off in which eight hopefuls are tested on their sewing and dressmaking skills as they compete to be crowned Britain's best amateur sewer.Over three challenges, they must follow a simple pattern for an A-line skirt, transform a high street top by altering the neckline and produce a made-to-measure dress for a model under intense time pressure. The judges, May Martin from the Women's Institute and Savile Row's Patrick Grant, scrutinise every stitch as they look out for puckering seam lines and perfect top stitching. One sewer is awarded garment of the week whilst two leave the Sewing Bee."
      },
      {
        "id": "tvmaze:251166",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2013-04-09",
        "overview": "Claudia Winkleman hosts a series in which some of the country's best home sewers are tested on their sewing and dressmaking skills in order to be crowned best amateur sewer by judges May Martin of the Women's Institute and Savile Row's Patrick Grant. In this edition, the six remaining contestants face three more challenges, including following a pattern for a pair of men's trousers. Tackling a fly fastening leaves most of the sewers baffled, but the second challenge - to add patch pockets to a high street skirt - produces some imaginative results. Finally the sewers create a made-to-measure silk blouse for their model. The slippery fabric is too much for two competitors, and they are eliminated from the programme."
      },
      {
        "id": "tvmaze:251167",
        "title": "Semi Final",
        "season": 1,
        "episode": 3,
        "released": "2013-04-16",
        "overview": "Claudia Winkleman presents the semi-final. The four amateur sewers return to compete in three more challenges. Savile Row's Patrick Grant and sewing teacher May Martin set them a pattern for a child's dress which tests their ability to follow couture techniques on a miniature scale. In the alteration challenge they are asked to tailor a dress with precision and they create a made-to-measure jacket which must fit their model perfectly, after which one of them is asked to leave the Sewing Bee."
      },
      {
        "id": "tvmaze:251168",
        "title": "Final",
        "season": 1,
        "episode": 4,
        "released": "2013-04-23",
        "overview": "The final of brand new series, The Great British Sewing Bee, presented by Claudia Winkleman, reaches its climax. The three finalists compete in three tough challenges set by Savile Row's Patrick Grant and sewing expert May Martin who must decide who will take the title of Britain's best amateur sewer. The first test is to follow a pattern for a man's shirt. The judges are looking for perfect top stitching with no pleats or puckers but the complicated challenge drives one sewer to tears. In the second challenge they have to show off their hand sewing skills, decorating an evening bag, and for the finale they are asked to create the most demanding garment so far - a stunning made-to-measure evening dress in a luxury fabric. The finalists are in for a surprise when they see who their models are."
      },
      {
        "id": "tvmaze:251170",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2014-02-18",
        "overview": "The Great British Sewing Bee returns for an eight-part series presented by Claudia Winkleman. Ten of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.The first episode tests the sewers on the three core fabrics in a dressmaker's cupboard: cotton, wool and silk. The surprise Pattern Challenge tasks the sewers with making a simple tunic top out of straightforward cotton. Some excel at producing the perfect top, some struggle to finish, and others cut corners - to their cost.In the Alteration Challenge the sewers demonstrate their ability to transform a plain high street woollen skirt in just 90 minutes, creating mini skirts with frills, pencil skirts with peplums, and dungarees.Finally, the sewers face the toughest of core fabrics when asked to fit a made-to-measure silk nightgown for a model."
      },
      {
        "id": "tvmaze:251171",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2014-02-25",
        "overview": "Claudia Winkleman welcomes the nine home sewers back to the sewing room to face three more challenges. This episode tests their ability to match and combine patterned fabric. First the judges, Savile Row's Patrick Grant and sewing expert May Martin, surprise the sewers with a pattern for a pleated skirt. The catch is that they must match the pattern of the fabric across those pleats without changing the size of the skirt, which catches a few of the sewers out.They must show their ingenuity by combining two patterned men's shirts into one garment - the results range from a little sailor dress to a boob tube.Finally, they make made-to-measure men's patterned pyjamas which must both match across the seams and fit their male model perfectly."
      },
      {
        "id": "tvmaze:251172",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2014-03-04",
        "overview": "Claudia Winkleman hosts The Great British Sewing Bee as the eight amateur sewers prepare to do battle again in three challenges designed to test their ability to handle stretchy fabric.The judges - Savile Row's Patrick Grant and sewing expert May Martin - first give them a surprise pattern for a simple pair of leggings with resulting snug and saggy bottoms.Next, the sewers are free to do whatever they like to turn an oversized T-shirt into a completely different garment - and they come up with some ingenious alterations, from a toddler's leotard to an asymmetric minidress.Finally, they face the most fitted made-to-measure challenge yet."
      },
      {
        "id": "tvmaze:251173",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2014-03-11",
        "overview": "Claudia Winkleman welcomes the seven home sewers as they return to the sewing room to make clothes on a miniature scale.They face three challenges to test their ability to make children's clothes, starting with toddler dungarees. For the alteration challenge they are given a sweatshirt, track suit bottoms and, of all things, a pillowcase. From these items they have to rustle up a fancy dress outfit and the sewers produce everything from mini Johnny Depp pirate outfits to dinosaur costumes complete with tail.Finally, they must create a spectacular made-to-measure prom dress for a teenager. To their complete surprise, the models are people they know from home."
      },
      {
        "id": "tvmaze:251174",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2014-03-18",
        "overview": "The six home sewers are taken out of their comfort zone by Claudia Winkleman when the judges set them three challenges which require them to handle some of the most difficult fabrics to sew with.The surprise pattern is for a nylon anorak, which means ironing the garment could prove disastrous.For the first time, the sewers handle something which isn't a textile, as a high street top is transformed with leather. And, in a new twist to the series, they pair up to be each other's 'fit buddies' as they are asked to make a pair of trousers for themselves - in delicate velvet."
      },
      {
        "id": "tvmaze:251175",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2014-03-25",
        "overview": "Claudia Winkleman takes the five home sewers back in time for the quarter-final.Patrick Grant of Savile Row and sewing teacher May Martin have tracked down an original pattern from the 1930s to surprise the sewers with. Without the markings and guidance of a modern-day pattern, they must figure out the codes to make a complex silky blouse. To make the challenge a true sewing re-enactment, they are each given an antique 1930s sewing machine to work on. Some of the sewers actually learn to sew on these machines, while others are horrified at a machine that is so basic in comparison to the modern ones they are used to.Next, the sewers relive the days of 'make do and mend', when they are given a man's suit to transform into a wearable garment for a woman. Finally, they take on the most ambitious made-to-measure challenge yet - a complex and hefty coat taken from a historic or vintage"
      },
      {
        "id": "tvmaze:251176",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2014-04-01",
        "overview": "Claudia Winkleman welcomes the four remaining sewers back to the sewing room. They face three challenges - none of which permit a pattern for guidance. First, they must demonstrate their ability to drape on the stand by making a dress out of a piece of fabric straight onto the mannequin - a practice made popular in the 1930s. Next, they alter a dress by adding a pair of perfectly symmetrical sleeves. Finally, they bring in their favourite garment from home, make a new copy and fit it to themselves. Some play it safe to reproduce simple dresses while others take ambitious risks. Who will be rewarded with a place in the final?"
      },
      {
        "id": "tvmaze:251177",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2014-04-08",
        "overview": "The Great British Sewing Bee reaches its climax as the three finalists enter the sewing room for the very last time.Sewing expert May Martin and Savile Row's Patrick Grant must decide who will take the title of Britain's best amateur sewer. They set the contestants three tough couture-themed challenges.The first surprise pattern tests their hand-sewing skills, when they are asked to make a man's tie. It sounds straightforward but, as it is couture week, the judges expect nothing less than perfection. For the alteration challenge they give the finalists a choice of wedding dresses from which they must produce a child's bridesmaid dress. Finally they are asked to fit a stunning made-to-measure couture gown for a model they were not expecting.Family, friends and the other contestants are reunited in the sewing room to see one person crowned the winner of The Great British Sewing Bee 2014."
      },
      {
        "id": "tvmaze:251179",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2015-02-05",
        "overview": "The Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Ten of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.In the first episode, ten nervous home sewers are asked to work with a core fabric found in every dressmaker's cupboard: cotton. With shaking fingers and sweaty palms, the sewers attempt to create their best work under the watchful gaze of the judges. The fabric-lovers take on 3D construction in a pair of women's trousers (complete with complicated invisible zip), have to totally transform a bog standard denim shirt in just 90 minutes and are asked to produce a stunning summer dress for their real-life models. Everything from uneven hemlines to spots matched with military precision is offered up to the judges, but who will crack under the pressure of the sewing room?"
      },
      {
        "id": "tvmaze:251180",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2015-02-12",
        "overview": "The Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Some of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.The nine remaining amateur sewers prepare to do battle again, in a bid to bag garment of the week and secure their place in the running to win The Great British Sewing Bee. The three challenges this week test the sewers' ability to make clothes on a miniature scale, starting with a child's waistcoat done the tailor's way, before attempting to breathe new life into a boring t-shirt and hand-me-down dress. The sewing room enters completely into the atmosphere of child's play for the final fancy-dress challenge - creating everything from miniature boxing shorts with matching gloves, a pink elephant ballerina and even a blue-footed booby bird."
      },
      {
        "id": "tvmaze:251181",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2015-02-19",
        "overview": "The Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Some of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.Claudia takes the eight sewers back in time to the 1950s, when home sewing was at its height. Having transformed the sewing room in line with the era, judges Patrick Grant and May Martin have also tracked down one of the biggest-selling dressmaking patterns of the time - dubbed 'the walk-away dress' because you could 'start it after breakfast and walk away in it for luncheon!'. Next, the sewers enter the world of make do and mend when they are given a vintage gem which they must transform into a wearable garment. Finally, they face an ambitious made-to-measure challenge when they are asked to make a 1950s blouse in unforgiving sheer fabric. This delicate and fiddly fabric shows every stitch, both inside and out. There is nowhere to hide as the sewers struggle to control the most mobile of materials."
      },
      {
        "id": "tvmaze:251182",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2015-02-26",
        "overview": "The Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Some of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.Claudia opens the sewing room doors once more as the seven remaining amateur sewers prepare to take on a set of tasks designed to test their ability to add shape and structure to clothing. The sewers try to keep track of the twelve pieces of fabric needed to make a boned corset, then it's back to the 80s to deconstruct a power suit Maggie Thatcher would have been proud of!Finally they face the most demanding made-to-measure challenge yet, making a traditional kilt from scratch. This iconic garment requires precision and skillful pattern cutting. The sewers take Patrick back to his roots, but whose ode to the Highlands will impress him most?"
      },
      {
        "id": "tvmaze:251183",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2015-03-05",
        "overview": "The Great British Sewing Bee returns for a six-part series presented by Claudia Winkleman. Some of the country's best home sewers face three challenges to make or alter an item of clothing under intense time pressure. Each week, their creations are judged by Savile Row's Patrick Grant and sewing expert May Martin, until one of them is crowned Britain's best amateur sewer.It's the semi-final, and the intensity in the sewing room increases as the five remaining sewers are welcomed back to demonstrate their skills with tricky and technical fabrics. The first task sees the sewers coming unstuck with delicate lace and slippery satins, next they take on the totally unexpected in the alteration challenge, and finally they are asked to make an entire leather jacket in just six and a half hours. There are triumphs and disasters as the sewers race against the clock to finish their garments, and the stress levels reach a new high as they learn that not one, but two sewers will be leaving the sewing room."
      },
      {
        "id": "tvmaze:251184",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2015-03-12",
        "overview": "The competition reaches its conclusion as the three finalists enter the sewing room for the very last time.Judges May Martin and Patrick Grant must decide who has done enough to be crowned Britain's best amateur sewer, and they have saved their most complicated and demanding challenges for last. Across the three garments, they will be looking for avant-garde cutting-edge designs and the trickiest pattern cutting ever seen on the Sewing Bee.The formidable first challenge sees the sewers taking on a pattern as complex as origami - with no diagrams to help them. The brain-teasing instructions almost prove too much for one of the finalists.The next challenge sees alterations so extraordinary they leave Patrick speechless, and finally they are asked to fit an avant-garde dress for a model they weren't expecting, before Claudia Winkleman announces the winner of this year's Great British Sewing Bee."
      },
      {
        "id": "tvmaze:773746",
        "title": "Basic Construction",
        "season": 4,
        "episode": 1,
        "released": "2016-05-16",
        "overview": "Claudia Winkleman hosts a new eight-part series of The Great British Sewing Bee.Under the scrutiny of Savile Row's Patrick Grant and Central St Martin's Esme Young, ten fresh-faced home sewers face three challenges designed to test their skill and understanding of basic garment construction. First, the sewers follow a pattern for a woman's top made up of four pieces. However, it is deceptively difficult, demanding accurate pattern matching skills, a steady hand for cutting and precision sewing.Next, the judges want their personal style and imagination to come to the fore by transforming a maternity dress in just 90 minutes. Finally, they take on the Made to Measure challenge, fitting a skirt to a real model. Who can keep their cool to produce a flattering waistline and perfectly level hem, and who will falter and be the first to leave the sewing room?"
      },
      {
        "id": "tvmaze:779916",
        "title": "Children's Week",
        "season": 4,
        "episode": 2,
        "released": "2016-05-23",
        "overview": "Nine amateur sewers return hoping to show judges Patrick Grant and Esme Young that they can make beautiful clothes on a miniature scale. First, the sewers must carefully follow a pattern to make a babygrow from stretch cotton jersey - but who will get the gusset and poppers in the right place and who will end up going off-piste?Next, the sewers must show they can handle slippery satin and chiffon, by totally transforming an adult bridesmaid dress into a wearable garment for a boy or a girl. For the final challenge, real children replace the mannequins as the sewers strive to create perfectly fitted woollen capes, knowing the judges will scrutinise every cut and stitch before deciding who deserves to stay and who must bid farewell to the Sewing Bee."
      },
      {
        "id": "tvmaze:789944",
        "title": "Lingerie Week",
        "season": 4,
        "episode": 3,
        "released": "2016-05-30",
        "overview": "Eight sewers return to the sewing room to take on delicate lingerie. The three demanding challenges require the sewers to work with the fiddliest of pattern pieces and the most delicate fabric.First, they follow a pattern for a bra which proves testing for even the most dextrous of sewers, requiring precision engineering and some of the smallest pattern pieces ever seen in the sewing room. Next the sewers get their hands on some charity shop silk scarves which they have to transform into a piece of lingerie. Finally the sewers make luxury robes for their male and female models. It is a challenge that requires a delicate touch, an exacting eye for detail and a fastidious feel for fit."
      },
      {
        "id": "tvmaze:808731",
        "title": "International Week",
        "season": 4,
        "episode": 4,
        "released": "2016-06-06",
        "overview": "It is 'international week' as Patrick and Esme set the seven remaining sewers the challenge of tackling techniques and garment styles from other cultures and continents.First up, they face a fiendishly hard-to-follow pattern for a Chinese Qipao-style top. This complex garment has an asymmetrical neckline, fiddly zip insertion and is made in a fabric that frays - not a challenge for the faint-hearted.After battling with brocade, things don't get any easier on the fabric front as, for their alteration challenge, they are tasked with transforming saris. By repurposing yards and yards of beautifully draped, embroidered georgette, the sewers have just 90 minutes to create totally new, wearable items of clothing with a distinctly eastern flavour.Finally, for the 'made to measure' challenge, the judges take the sewers to an entirely new continent - Africa. Using vividly patterned wax print fabric, they attempt to create West African inspired dresses. Figure hugging garments that demand impeccable fitting skills and an understanding of how this robust printed cotton can be used to create a dramatic, accentuated silhouette."
      },
      {
        "id": "tvmaze:818948",
        "title": "1960s Week",
        "season": 4,
        "episode": 5,
        "released": "2016-06-13",
        "overview": "This week, the sewing room is transported back to the 1960s as the six remaining sewers revive vintage garments, take on time-honoured techniques and wrestle with antique equipment in an attempt to show Patrick and Esme they deserve a place in the quarter-finals.For their first challenge, the sewers are asked to follow a pattern for an iconic 60s colour block dress. With multiple panels and clean, crisp lines required, precision is everything. For their alteration challenge, the sewers take a classic 1960s rainmac, but trying to make a wearable garment from PVC is no mean feat. For the made to measure challenge, the sewing room goes from squeak to chic as the sewers try to create impeccably fitted, flawlessly finished 1960s-inspired jackets. There are only five places in the quarter-final and with such a labour-intensive, tailored item as a jacket to perfect, the stakes have never been higher and achieving the perfect sew has never been harder."
      },
      {
        "id": "tvmaze:829566",
        "title": "Activewear",
        "season": 4,
        "episode": 6,
        "released": "2016-06-20",
        "overview": "Claudia Winkleman hosts the quarter-final of the Great British Sewing Bee, where the five remaining sewers sweat it out over activewear, creating complex, hard-wearing garments from the most technical of fabrics.For the pattern challenge, judges Patrick Grant and Esme Young ask the sewers to make a man's Lycra cycling top, which requires expert handling of a fabric that stretches in all directions and a complex zip insertion that tests their patience. Next, for the alteration challenge, the sewers use all their ingenuity to transform garish 1980s ski suits into children's jackets. Finally, the made to measure challenge sees the sewers create the most fitted garments ever attempted on the Sewing Bee - yoga outfits - to secure one of four places in the semi-final."
      },
      {
        "id": "tvmaze:834550",
        "title": "Puzzling Patterns and Pattern Cutting",
        "season": 4,
        "episode": 7,
        "released": "2016-06-27",
        "overview": "Claudia Winkleman hosts the semi-final of the Great British Sewing Bee, where just four sewers are left to battle it out to for a place in the final.All that stands in the way are three challenges designed by judges Patrick Grant and Esme Young. This week, they want to test the sewers' knowledge of complex patterns and pattern cutting. For the pattern challenge, the sewers are tasked with making an asymmetric yoked skirt inspired by modern Japanese pattern cutting. This brain-teasing pattern requires the sewers to stitch one of the most technically difficult and curved seams ever seen in the sewing room.Next, it is the alteration challenge and the sewers are asked to transform a duvet cover into a female garment. To add to the difficulty level, the judges declare it is a no-waste challenge so every scrap of fabric needs to be used by draping and sculpting it around the mannequin. How will the sewers cope with this radical approach to creating clothes?For their made to measure challenge, their ability to draft and create patterns is put to the test as the judges seek to draw out the sewers' inner designer. Creating their own patterns in the sewing room, as well as constructing and fitting their dresses is the sternest test yet of their all-round sewing skill and their ability to imagine clothes, but who will flourish and who will fail to make the grade so tantalisingly close to that place in the grand final?"
      },
      {
        "id": "tvmaze:847484",
        "title": "Evening Wear",
        "season": 4,
        "episode": 8,
        "released": "2016-07-04",
        "overview": "Claudia Winkleman hosts the grand final of the Great British Sewing Bee. Having made it through seven weeks of tough sewing challenges, the three finalists fight it out for the title of Britain's best amateur sewer. But first, they must create three pieces of evening wear to impress judges Patrick Grant and Esme Young.First up is the pattern challenge, in which the sewers demonstrate their precision by creating an immaculate man's pin-tucked dress shirt. Next is the alteration challenge. They must use all their sewing ingenuity and imagination by taking a classic tuxedo and transform it into a little black dress. For the final made-to-measure challenge, the sewers make floor-length evening gowns for a model of their choice. Who has the ability to handle the most delicate, luxurious of fabrics and show off their advanced technical skills under intense pressure?Across the three challenges, the judges will choose one sewer who has shown themselves to have all-round ability, attention to detail and vision for beautiful clothes. For the announcement, the other sewers return to the sewing room, joined by the finalists' friends and family to see who will be crowned the winner."
      },
      {
        "id": "tvmaze:1597550",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2019-02-12",
        "overview": "The Sewing Bee is back with brand new host Joe Lycett for eight weeks of brainteasing patterns, spectacular transformations and stunning made-to-measure outfits. Savile Row's Patrick Grant and Central St Martin's Esme Young scrutinise every stitch as ten of the country's best home sewers take up a needle and thread and tackle everything from jumpsuits to swimsuits to evening gowns.They are eased in gently with cotton fabric, but that doesn't mean it's going to be easy. For their first pattern challenge the judges have chosen a Dior-inspired ‘wiggle dress' designed to hug the female form. It requires precision and accurate darts, and any diversion from the instructions could result in an ill-fitting garment.Next their design skills and sewing instincts are tested in the Transformation Challenge, when the sewers are tasked with transforming three second-hand items of denim clothing into a single, stylish new garment in just 90 minutes.For their final challenge, the mannequins are gone and replaced with real live models who the sewers must flawlessly fit with a made-to-measure jumpsuit. Who will achieve the perfect body rise, avoiding the dreaded camel toe? Who will create clothes worthy of Garment of the Week? And who will drop a stitch at this early stage, becoming the first to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1606323",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2019-02-19",
        "overview": "Joe Lycett hosts as the nine remaining home sewers return to the nation's most famous sewing room for children's week. The garments might be mini but they are a mammoth challenge being fiddly to sew.To test the sewers' dexterity, judges Patrick Grant and Esme Young kick off the pattern challenge with a wardrobe staple of every child – a hoodie. The task requires a tricky combination of hard-to-handle stretch fabrics, small pattern pieces and getting to grips with the ruthless overlocker which cuts the fabric as it sews. Next, in the transformation challenge, the sewers let their imaginations run wild, turning faux fur coats into fantastical fancy dress beasts.Finally, the Sewing Bee welcomes dancing mini-models for made-to-measure dance costumes. These must be perfectly fitted but allow enough freedom of movement for the dancing children to perform the Hornpipe, the Tarantella and Highland dancing down the catwalk. Who will tango their way to the top and win garment of the week, and who will stumble, becoming the second sewer to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1609610",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2019-02-26",
        "overview": "With Joe Lycett hosting, the eight remaining home sewers head back in time to the 1970s, attempting to revive the glamorous, rebellious and sometimes ridiculous style of the decade. This is more than a stroll down memory lane as they tackle the decade's most fiddly, floaty and anarchic garments.First up, judges Patrick Grant and Esme Young challenge the sewers to get their groove on with the trickiest pattern so far, flared jeans. Creating the perfect bell-bottomed trousers involves grappling with vintage machines, heavyweight fabrics and taking on such daunting technical hurdles as the zip fly and flat-felled seam, hopefully without getting in a flap. For the transformation challenge, fabric flies and anarchy rules as the sewers let rip with their imagination, turning t-shirts and tartan into provocative punk-inspired outfits in just 90 minutes.In the made to measure challenge the sewers take on their final icon of 70s fashion, the maxi dress. Working with sheer, slippery fabrics, they must create a form-fitting bodice and floaty skirt that embodies the glamour that makes the maxi dress popular to this day. Who will boogie their way to garment of the week, and for whom will 70s week signal the end of an era, as they become the third sewer to wave goodbye to the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1613221",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2019-03-05",
        "overview": "The fabrics in the haberdashery go technical, as the seven remaining home sewers take on man-made fabrics designed for sport and the great outdoors. Host Joe Lycett keeps spirits high, as the sewers jump in at the deep end, with a pattern for a lined swimsuit. Containing so many seemingly identical pieces, it's a challenge that throws the sewing room into confusion, with a great deal of conferring, before judges Patrick Grant and Esme Young offer their brutally honest feedback.Next, the transformation challenge arrives with a surprise, as instead of garments, the sewers are presented with discarded festival tents. What's more, a dashing dachshund becomes the sewers' muse, as they attempt to transform old tents into stylish, practical winter coats for pooches, to be displayed on dog mannequins.For the final challenge, male models arrive in the Sewing Room to be fitted with made-to-measure luxury tracksuits. It's double the work for the sewers, who attempt to create both trousers and jackets, using scuba, mesh and micro-fibre. But who'll deserve a podium finish, winning Garment of the Week, and who'll fall short of the mark, becoming the fourth sewer to leave the Great British Sewing Bee."
      },
      {
        "id": "tvmaze:1616276",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2019-03-12",
        "overview": "The fashion industry is the biggest polluter of our planet next to oil, so for the first time on The Great British Sewing Bee, it is Reduce, Reuse and Recycle Week, with all the fabric in the haberdashery replaced with charity shop clothes and soft-furnishings. To breathe new life into this old fabric, host Joe Lycett kicks the six remaining home sewers off with a pattern for a pussy-bow blouse, which must be pieced together from four second-hand garments. This time, judges Patrick Grant and Esme Young are not only looking for precision sewing, but also the ability to design and create garments using attractive colour combinations.In a twist to the usual transformation challenge, the sewers are faced with all the scraps and off-cuts collected throughout their journey on the Sewing Bee so far. Together, they collectively pool their leftover fabric to create stunning and inventive new patchwork garments.Finally the sewers come armed with discarded curtains and soft furnishings from home, challenged to create a made to a measure day dress, perfectly fitted to their model. Julie Andrews hasn't got a patch on this bunch as they set to work on their brocade, net curtains and blinds, before one person is awarded Garment of the Week and the fifth sewer is asked to leave the Sewing Bee."
      },
      {
        "id": "tvmaze:1620699",
        "title": "Episode 6",
        "season": 5,
        "episode": 6,
        "released": "2019-03-19",
        "overview": "With Joe Lycett hosting, the quarter-finalists face British and Irish fabrics week. First up it is the pattern challenge, which this week is a stern test of their soft tailoring skills, as judges Patrick Grant and Esme Young ask the sewers to create a ‘worker's jacket' from linen. It is a garment full of complex techniques, using a fabric that can easily crease and fray, made all the more nerve-wracking as they must precisely follow Patrick's personal pattern.Next it is the transformation challenge, and the sewers are asked to take inspiration from the British seaside by turning stripy deckchairs and parasols, covered in hard wearing Burnley ‘ticking' fabric, into stylish garments, in just 90 minutes.For the final challenge, the models arrive in the Sewing Room to be fitted with made-to-measure coats, constructed from wool the sewers have sourced from across the British Isles. These are the largest garments they've attempted so far on the Sewing Bee, and the sewers must once again draw on tailoring prowess, to ensure their coats hang and fit perfectly. Whose wool coats will be the pride of Britain and who will unravel, missing out on a coveted place in the semi-final?"
      },
      {
        "id": "tvmaze:1626629",
        "title": "Episode 7",
        "season": 5,
        "episode": 7,
        "released": "2019-03-26",
        "overview": "Joe Lycett hosts the semi-final, as the four remaining sewers go global, taking on garments and techniques from around the world. Firstly, the semi-finalists must follow a pattern like none they have encountered before, as judges Patrick Grant and Esme Young ask them to make a pair of Indian dhoti pants. Using a process based on the centuries-old tradition of folding and draping large rectangular pieces of fabric, these wide-legged, heavily pleated trousers prove a perplexing, visually striking, proposition.Next up, it is the transformation challenge, as the sewers take on a garment from West Africa, the Dashiki. This colourful, strikingly patterned men's tunic must be transformed into a brand new outfit in just 90 minutes, making imaginative use of the Dashiki's distinctive, bold print.For their final challenge, the made to measure, the sewers take on the fiendishly tricky high end Japanese couture technique of origami. Tasked with creating an origami top for their model, the sewers must sculpt dramatic, arresting garments, drawing on the ancient art of paper-folding. It proves to be a pain-staking process, pushing the sewers pattern drafting, fabric-handling and precision sewing to new heights. But only three of these four incredibly talented sewers can make it through to the grand final."
      },
      {
        "id": "tvmaze:1626630",
        "title": "Episode 8",
        "season": 5,
        "episode": 8,
        "released": "2019-04-02",
        "overview": "Hosted by Joe Lycett, The Great British Sewing Bee reaches its dramatic denouement as the three finalists compete for the title of Britain's best amateur sewer. They take on a trio of evening wear challenges. Bringing together a range of advanced sewing skills, from tailoring, to high-end designing and delicate handling of luxury fabrics, perfecting evening wear is a pinnacle for any home sewer. Judges Patrick Grant and Esme Young begin by asking the sewers to follow the most complex pattern yet – a double-breasted waistcoat. Even if they master the multitude of intricate processes, the sewers face the ultimate challenge of sewing blind, as the waistcoat must be stitched together inside-out, before one final, nail-biting reveal.Next it is the sewers' final chance to show off their instinct for design in the transformation challenge, as they attempt to turn the domestic into the dramatic by repurposing net curtains into exquisite, red carpet-ready, pieces of evening wear.Lastly, for the most important made-to-measure challenge of the competition, the sewers attempt to construct and fit glamorous strapless evening gowns for their models, this time hand-picked for friends and family. Creating a unique, jaw-dropping gown using yards of luxury fabric, suspended entirely from a fitted corset, will take a feat of daring construction and their most precise sewing yet. Once the final stitch is in place and the catwalk is over, the sewers' friends and family, along with past competitors, arrive to celebrate. But once the judges have made their decision, there can only be one winner."
      },
      {
        "id": "tvmaze:1837016",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2020-04-22",
        "overview": "The Great British Sewing Bee is back, with 12 sewers competing this time. Joe Lycett kicks off ten weeks of the most perplexing patterns, eye-popping transformations and stunning made-to-measure garments yet. Scrutinising every stitch are Saville Row's Patrick Grant and Central Saint Martins's Esme Young, testing the sewers across a huge range of garments from rugby shirts to children's dungarees, flamenco skirts to a boned basque, via food fancy dress. In their first week, the sewers are eased in gently with wardrobe staples that might look familiar but aren't necessarily straightforward to make. For their pattern challenge, the judges ask for a wrap skirt, a garment whose clean crisp lines can only be achieved through precise cutting, accurate stitching and a judicious choice of fabric. Next, the contestants' ability to make the ordinary extraordinary is put to the test in the transformation challenge, as they transform two plain men's office shirts into a stylish new garment to fit a female mannequin. For the week's final challenge, the mannequins are replaced with human models as the sewers attempt to make their first made-to-measure garment - a tea dress. This classic below-the-knee and above-the-ankle dress allows for interpretation, letting the contestants' personalities shine through whether they opt for a vintage or contemporary style. It also proves to be a benchmark test of their ability to achieve a flawless fit and to impress the judges with the finer details. Battling against the clock to showcase their skill and creativity, who will stitch their way to Garment of the Week, and who will unravel at this early stage, becoming the first to leave the Great British Sewing Bee"
      },
      {
        "id": "tvmaze:1846581",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2020-04-29",
        "overview": "With Joe Lycett hosting, things are hotting up in the sewing room as the 11 remaining sewers return for holiday week. First up, it is the pattern challenge, which this week is a pair of palazzo pants, perfect for keeping cool whilst abroad. The sewers are asked to insert an invisible zip and pockets, and the judges have a keen eye on how well the sewers pattern match bold prints. Next, for their transformation challenge, the sewers are asked to turn towels into stylish beach cover-ups in just 90 minutes.For the final challenge, male models arrive in the sewing room to be fitted with a made-to-measure holiday shirt, using bright and colourful fabrics. The sewers must create a perfectly relaxed fit. Whose holiday shirt will bring on the sunshine, and who will become the second person to leave the sewing room?"
      },
      {
        "id": "tvmaze:1846870",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2020-05-06",
        "overview": "Joe Lycett welcomes the ten remaining home sewers back to the nation's most famous sewing room for children's week. The garments might be mini, but they are a mammoth challenge because they are fiddly to sew.To test the sewers' dexterity, judges Patrick Grant and Esme Young kick off the pattern challenge with a classic for any little girl's wardrobe – a smocked dress. The task requires the sewers to combine tricky techniques, including making a bias binding and a Peter Pan collar, and, most difficult of all, creating a smocked bodice. Next, in the transformation challenge, the sewers let their imaginations run wild, turning sleeping bags into food shaped fancy dress. Finally, the Sewing Bee welcomes mini-models for the made-to-measure task, which is to make a pair of dungarees for a girl or boy. These must be perfectly fitted but allow enough freedom of movement to play in.Who will climb their way to the top and win garment of the week, and who will stumble, becoming the third sewer to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1855133",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2020-05-13",
        "overview": "Joe Lycett hosts as the nine remaining sewers return to the nation's most famous sewing room for sportswear week. To test the sewers' ability to create practical and stylish sportswear, judges Patrick Grant and Esme Young kick off the pattern challenge with a rugby shirt. The task requires a tricky combination of hard-to-handle stretch fabrics and a fiendishly difficult-to-construct placket. Then, in the transformation challenge, the sewers take cover and turn cagoules into miniature waterproof onesies for toddlers. Finally, the made-to-measure challenge involves tennis outfits. These must be perfectly fitted but allow enough freedom of movement to win a grand slam. Who will smash their way to the top and win garment of the week, and who will score a double fault, becoming the fourth sewer to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1861043",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2020-05-20",
        "overview": "The eight remaining sewers return to the sewing room for lingerie and sleepwear week. The garments might look luxurious, but working with the slippery and delicate fabrics is hugely challenging.To test the sewers' handling skills, judges Patrick Grant and Esme Young kick off the pattern challenge with a boned basque. The task requires sewing together small pattern pieces for a precise fit and creating a tricky hook and eye fastening. Next, in the transformation challenge, the sewers transform pajamas and nightwear into summer dresses.Finally, the models are back to be fitted for two-piece female sleep sets, each of which has to incorporate lace somewhere in the design. These must fit comfortably, and the luxurious fabrics must be finished precisely and expertly. Who will have a dream of a week and win garment of the week, and who will have a nightmare, becoming the fifth sewer to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1865407",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2020-05-27",
        "overview": "The fashion industry is the biggest polluter of our planet besides oil, so for reduce, reuse and recycle week, all the fabric in the haberdashery is replaced with charity shop clothes and soft furnishings. To breathe new life into this old fabric, host Joe Lycett kicks the seven remaining home sewers off with a pattern for a man's bomber jacket, which must be pieced together from four secondhand women's garments. Judges Patrick Grant and Esme Young are looking for precision sewing and the ability to design and create garments using attractive colour combinations.In the transformation challenge, the sewers are tasked with turning laundry bags into stylish, wearable garments, and then have to use old knitwear to create a made-to-measure jumper dress, perfectly fitted to their model. One of the jumpers has to be brought in from home and mean something to them personally. It's a Sewing Bee first, as the sewers have never been asked to sew with knitted fabrics before."
      },
      {
        "id": "tvmaze:1869223",
        "title": "Episode 7",
        "season": 6,
        "episode": 7,
        "released": "2020-06-03",
        "overview": "With Joe Lycett hosting, the six remaining home sewers head back in time to the 1980s, attempting to revive the glamorous - and sometimes ridiculous - style of the decade. This is more than a stroll down memory lane, as they tackle the decade's most tailored, fun and over the top garments.First, judges Patrick Grant and Esme Young challenge the sewers to get down to business with the trickiest pattern so far, a woman's power jacket. Creating the perfect jacket involves grappling with tailoring fabrics and taking on such daunting technical hurdles as lapel construction and inserting shoulder pads, hopefully without getting in a flap. For the transformation challenge, it's party time as the sewers let rip with their imagination, turning high-vis work clothes into party outfits.In the made-to-measure challenge, the sewers take on their final icon of eighties fashion, the cocktail dress. Working with bold, shiny fabrics, they must create a knee-length-or-above dress that embodies the excess of the 1980s. Who will disco dance their way to garment of the week, and for whom will eighties week signal the end of an era, as they become the seventh sewer to wave goodbye to the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:1874488",
        "title": "Episode 8",
        "season": 6,
        "episode": 8,
        "released": "2020-06-10",
        "overview": "Joe Lycett hosts the quarter final, as the five remaining sewers go global, taking on garments and techniques from around the world.First, they must follow a pattern they have never encountered before, as judges Patrick Grant and Esme Young ask them to make a Filipino terno blouse. Delicate-looking but deceptively robust, this garment involves difficult-to-handle fabrics worked into distinctive, voluminous butterfly sleeves and intricate covered buttons.Next, it's the transformation challenge, as the sewers take on Provencal table cloths from France. These colourful, strikingly patterned cloths must be transformed into a brand new outfit in just 90 minutes, making imaginative use of the distinctive, bold print.And for the made-to-measure challenge, the sewers take on the dramatic Flamenco skirt from southern Spain. They must create a perfect figure-hugging fit combined with impactful ruffles achieved by inserting yards and yards of fabric into the skirt.Who will win a place in the coveted semi-final?"
      },
      {
        "id": "tvmaze:1878590",
        "title": "Episode 9",
        "season": 6,
        "episode": 9,
        "released": "2020-06-17",
        "overview": "The amateur sewer competition hosted by Joe Lycett continues. This time, the four remaining contestants take part in the semi final, creating garments inspired by silver screen. First, the semi-finalists must follow a pattern like none they have encountered before, as judges Patrick Grant and Esme Young ask them to make a dress inspired by Marilyn Monroe's in The Seven Year Itch. In the Transformation Challenge, the sewers have to make a sci-fi inspired outfit in just 90 minutes, before creating a made to measure flapper dress for the final task of the semi final."
      },
      {
        "id": "tvmaze:1883767",
        "title": "Episode 10",
        "season": 6,
        "episode": 10,
        "released": "2020-06-24",
        "overview": "The contest, hosted by Joe Lycett, reaches its final stage as the last three contestants take on a trio of celebration wear challenges before the winner is announced. Judges Patrick Grant and Esme Young start by challenging the sewers to make a little boys kilt without a pattern. In the Transformation Challenge, they each attempt to turn party dresses into fun outfits fit to wear at a carnival, before finally creating unique gowns using luxury fabric in the Made to Measure challenge. At the end of the three challenges, one of the competitors is crowned this year's winner."
      },
      {
        "id": "tvmaze:2056428",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2021-04-14",
        "overview": "Joe Lycett is back in charge, with twelve of Britain's most talented home sewers competing to win one of TV's toughest creative challenges. Judges Patrick Grant and Esme Young cast an expert eye over the garments, in the contest to find Britain's best amateur sewer.Week One sees Patrick and Esme settling the contestants in with a trio of challenges based on everyday wardrobe staples. They start with their first Pattern Challenge, creating the simple, clean lines of the versatile classic sleeveless blouse known as a shell top. For the Transformation Challenge, the sewers must turn old t-shirts into completely new garments for men, women or children, in just 90 minutes. And in the Made to Measure, mannequins are replaced with real-life models. Who will whip up a well-fitting buffet dress and win themselves Garment of the Week, and whose hopes of staying in the competition will flounder?"
      },
      {
        "id": "tvmaze:2067871",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2021-04-21",
        "overview": "Joe Lycett hosts as Summer Week hits the sewing room, with three challenges themed around sewing clothes to look and feel cool in even the fiercest heat.Patrick and Esme's Pattern Challenge is a pair of paperbag shorts. They might be a small garment, but creating the signature shape means perfecting pockets, tackling tricky turn-ups and wrestling an elastic waistband with a mind of its own.The sewers hit the beach in the Transformation, sculpting second-hand men's swimming gear into a woman's outfit worthy of sunset cocktails, all in just 90 minutes.Finally, button-down sun dresses are the focus of the Made to Measure. As well as style, fit and finish, the judges have their eagle eyes primed for perfectly aligned buttonholes and secure fastenings. Who will miss the mark and be the second sewer to leave the competition?"
      },
      {
        "id": "tvmaze:2071763",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2021-04-28",
        "overview": "Joe Lycett hosts as the ten remaining home sewers return to the nation's most famous sewing room for gent's classics week. In a gentle first test of tailoring, judges Patrick Grant and Esme Young kick off the Pattern Challenge with a Sewing Bee first - a baker boy cap. The cap requires perfect symmetry in its construction, a supporting brim and a snug fit to get that full Peaky Blinders look.Next, in the Transformation Challenge, they have just 90 minutes to smarten up and convert secondhand men's jackets and blazers into a garment for a woman.Finally, for the Made to Measure challenge the sewers must make a casual utility jacket, which should have a relaxed fit and include at least three pockets. Who will make something for the perfect gent and win Garment of the Week, and who will become the third sewer to leave the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:2076380",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2021-05-05",
        "overview": "Joe Lycett hosts as the nine remaining sewers go global, taking on garments and techniques from around the world. First, they must follow a pattern as judges Patrick Grant and Esme Young ask them to make a French Breton top. Horizontal stripes must be perfectly matched, the wide-set boat neck must lie completely flat, and the fiddly button placket must be expertly constructed.Next up, it's the Transformation Challenge, with the sewers taking on sarongs. These colourful cloths must be transformed into a brand new outfit in just 90 minutes, making imaginative use of the distinctive, bold print.For their final challenge, the Made to Measure, the sewers make outfits inspired by the life and art of the iconic Mexican artist Frida Kahlo. Known as much for her personal style as her vivid artwork, the sewers must use Kahlo as their inspiration while creating a modern garment that fits their model perfectly. Who will ace this creative brief and win Garment of the Week, and who will have to leave the sewing room?"
      },
      {
        "id": "tvmaze:2079072",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2021-05-12",
        "overview": "It's children's week in the sewing room and judges Patrick Grant and Esme Young's pattern challenge choice is a classic for any toddler's wardrobe - a romper suit. The transformation task sees the sewers turning an adult wetsuit into a kids' fancy dress costume, before they tackle a children's raincoat, remembering it must be fully waterproof but allow enough movement for jumping in muddy puddles."
      },
      {
        "id": "tvmaze:2086082",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2021-05-19",
        "overview": "The fashion industry is the biggest polluter of our planet next to oil, so The Great British Sewing Bee returns to Reduce, Reuse and Recycle Week, with all the usual fabric in the haberdashery being replaced with charity shop clothes and soft-furnishings. Host Joe Lycett kicks the six remaining home sewers off with a pattern for a gentleman's waistcoat using just second-hand clothes.In the Transformation Challenge, the sewers are tasked with changing items of army surplus into a stylish and wearable garment for a woman.Finally, the sewers are asked to use old jeans to create a Made to Measure dress. Jeans are one of the most polluting garments to manufacture, so to breathe a new lease of life into them, the sewers must create a new denim dress that fits their model perfectly. At the end someone will win Garment of the Week and the sixth sewer is asked to leave the Sewing Bee."
      },
      {
        "id": "tvmaze:2093239",
        "title": "Episode 7",
        "season": 7,
        "episode": 7,
        "released": "2021-05-26",
        "overview": "Joe Lycett hosts as temperatures drop and winter hits the sewing room, with challenges themed around keeping warm and adding sparkle to the coldest months of the year.Patrick and Esme's Pattern Challenge this week is a man's flannel shirt. The sewers must create cuffs and collars, challenging both their construction technique and precise sewing skills.The sewers wrap up warm for the Transformation, turning old scarves into a new wearable garment in a mere 90 minutes.Finally, in the Made to Measure, they are asked to make a festive winter party dress. Working with tricky-to-handle fabrics, including velvets and sequins, each must create a perfect fit for their model. Who will cheer the judges' spirits and win Garment of the Week, and who will be sent out into the cold?"
      },
      {
        "id": "tvmaze:2098733",
        "title": "Episode 8",
        "season": 7,
        "episode": 8,
        "released": "2021-06-02",
        "overview": "Joe Lycett hosts as the five remaining sewers tackle challenges inspired by music and the movies, taking on garments and techniques from the silver screen. First, they must follow a pattern like none they've encountered before, as judges Patrick Grant and Esme Young ask them to make a dress inspired by Baby from Dirty Dancing. The techniques involved in creating the iconic dance dress include a tightly fitted bodice and perfect full circle skirt.Next up, it's the Transformation Challenge, and just like Julie Andrews's Maria in The Sound of Music, the sewers are asked to adapt old curtains into play clothes for children.For their final challenge, the Made to Measure, the sewers take on the disco era with an outfit inspired by the movie Dreamgirls. Tasked with creating a dazzling 1970s-influenced dress fit for dancing the night away, they must ensure it skims the model's body using tricky technical fabrics. But only four of these five talented sewers can make it through to the semi-final."
      },
      {
        "id": "tvmaze:2105470",
        "title": "Episode 9",
        "season": 7,
        "episode": 9,
        "released": "2021-06-09",
        "overview": "Joe Lycett hosts the semi-final, as the four remaining sewers go back in time to the 1940s. Attempting to revive both the glamorous and thrifty styles of the decade, they tackle its most elegant and innovative garments.First up, judges Patrick Grant and Esme Young challenge the sewers to make the decade's most famous trousers, Oxford bags, perfect for dancing the jitterbug and swing, but tricky to make. Creating the perfect trouser involves grappling with oversized pattern pieces, fly zips and a waistband with pleats to make room for the extra-wide legs.For the Transformation Challenge, it's time to take a leap of faith, as the sewers are set a wartime task to turn old parachutes into glamorous dresses.In the Made to Measure challenge, the sewers take on their final icon of 1940s fashion, Dior's New Look. Characterised by an hourglass silhouette and involving masses of fabric, this style means each sewer must exaggerate their model's figure to create the iconic shape. Who will sew their way to victory and win Garment of the Week, and for whom will 40s week signal the end of an era, as they become the ninth sewer to wave goodbye to the Great British Sewing Bee?"
      },
      {
        "id": "tvmaze:2105471",
        "title": "Episode 10",
        "season": 7,
        "episode": 10,
        "released": "2021-06-16",
        "overview": "The Great British Sewing Bee reaches its dramatic denouement, as the three finalists compete for the title of Britain's best amateur sewer, taking on a trio of challenges for special occasions. Bringing together a range of advanced sewing skills, from couture techniques to the handling of delicate luxury fabrics, perfecting occasion wear is a pinnacle for any home sewer. Judges Patrick Grant and Esme Young start by challenging the sewers to make a little girl's bridesmaid dress packed with complex elements including puff sleeves, a lined bodice and a bound buttonhole.Next, it's the sewers' final chance to show off their instinct for design in the Transformation Challenge. They attempt to turn homeware items such as cushions, bead curtains and table cloths into dramatic and fun outfits fit to wear at a summer festival.Lastly, for the most important Made to Measure challenge of the competition, the sewers attempt to construct and fit glamorous off-the-shoulder evening gowns for their models. Creating a unique, red-carpet-worthy gown using yards of luxury fabric is a feat of daring construction and requires their most precise sewing yet. Once the final stitch is in place and the catwalk is over, the judges will make their decision and crown this year's winner."
      },
      {
        "id": "tvmaze:2312638",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2022-04-27",
        "overview": "Sara Pascoe welcomes 12 of Britain's most talented home sewers into the sewing room, which is in an historic woollen mill on the outskirts of Leeds. Week One sees judges Patrick Grant and Esme Young ask them to create a capsule wardrobe consisting of three items.First, for the Pattern Challenge, they must produce a wool mini skirt with piped patch pockets. For the Transformation Challenge, the task is to turn lockdown loungewear into a going-out top for an adult, and in the Made to Measure, the sewers must perfectly fit a wrap dress to their model.One sewer gets off to a flying start, being awarded Garment of the Week, while another's hopes are dashed as they become the first to be sent home."
      },
      {
        "id": "tvmaze:2317424",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2022-05-04",
        "overview": "The sewers take to their marks for Sports Week as host Sara Pascoe sets three new challenges.Patrick and Esme's Pattern Challenge is a Sewing Bee first: a pair of high-top trainers. Sewing bespoke footwear means tackling a range of unfamiliar techniques, including punching eyelets and stitching soles - all of which must be done twice to create a perfect pair.The sewers need to be on the ball in the Transformation Challenge, converting old netball kits into a garment to wear off the court in just 90 minutes. For the Made to Measure Challenge, they each fit a jacket inspired by their sporting hero. As well as fit and finish, the judges will be looking to see if their hero's personality or style is evident.Who will win garment of the week, and who will be last over the finish line?"
      },
      {
        "id": "tvmaze:2320206",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2022-05-11",
        "overview": "The ten remaining home sewers create light and airy outfits for summer week. Patrick and Esme kick off with a pattern for a high fashion shirred midi dress with puff sleeves. The sewers are put to the test sewing with elastic to create a romantic and dreamy day dress.In the Transformation Challenge, there's no hanging about as they're given just 90 minutes to turn garden hammocks into summer garments. Finally, the sewers must make a two-piece co-ordinated trousered outfit for having fun in the sun. Who will impress and win Garment of the Week, and who will become the third sewer to leave the competition?"
      },
      {
        "id": "tvmaze:2323633",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2022-05-18",
        "overview": "The Great British Sewing Bee does its bit for the planet with Reduce, Reuse and Recycle week. Host Sara Pascoe invites the nine remaining home sewers to create a quilted patchwork jacket from a load of old scraps from past Sewing Bees.Next, in the Transformation Challenge, the sewers breathe new life into boring old coats by completely deconstructing them and refashioning them into brand new stylish outerwear.For the Made to Measure, the sewers fit a maxi dress to a model using only an unwanted duvet cover. Who will ace this creative brief and win Garment of the Week, and who will have to leave the sewing room?"
      },
      {
        "id": "tvmaze:2327036",
        "title": "Episode 5",
        "season": 8,
        "episode": 5,
        "released": "2022-05-25",
        "overview": "It's Children's Week in the sewing room, and Sara Pascoe invites the sewers to make a cute sailor suit for a toddler. The task requires them to make elasticated shorts and a top with a square collar and ties.For the Transformation Challenge, the sewers turn old school clothes into a cool outfit to be seen in outside school. Then things get scary when mini-models enter the sewing room for a Halloween-themed Made to Measure. Whose costume will go down a treat and win Garment of the Week, and who will leave with a whimper?"
      },
      {
        "id": "tvmaze:2330199",
        "title": "Episode 6",
        "season": 8,
        "episode": 6,
        "released": "2022-06-01",
        "overview": "Music Week brings three different musical and sartorial genres to the Sewing Bee. Sara Pascoe kicks off the week with a pattern for the parka coat that was adopted by Mod culture in the 1960s. With its classic fishtail vent and complex zip opening and hood, this is a feat of engineering.Country music is the inspiration for the Transformation Challenge, as the sewers take old denim and turn it into stage gear worthy of Dolly Parton. Finally, the Made to Measure is an homage to David Bowie and his many incarnations. The sewers pay tribute with Bowie-inspired outfits fitted to a model."
      },
      {
        "id": "tvmaze:2332992",
        "title": "Episode 7",
        "season": 8,
        "episode": 7,
        "released": "2022-06-08",
        "overview": "A place in the quarter-final is at stake this week, and the challenges are all about lingerie. Host Sara Pascoe starts the sewers off with a fiddly pattern for a lace underwired bra and matching knicker set. With such small pattern pieces, there is no margin for error, and Patrick and Esme's eagle eyes will spot every mistake.The Transformation Challenge requires the sewers to take thermal underwear and turn it into daywear. Then male models fill the sewing room to be fitted for a pair of luxury pyjamas. One sewer wins Garment of the Week and another is asked to leave the Sewing Room."
      },
      {
        "id": "tvmaze:2336977",
        "title": "Episode 8",
        "season": 8,
        "episode": 8,
        "released": "2022-06-15",
        "overview": "The quarter-final takes the sewers back to the golden era of the 1930s. Esme and Patrick set them a Pattern Challenge for a pair of women's sailor-inspired trousers with a complex bib-front button opening and equally tricky pockets.Then the sewers show off their ability to think on their feet when they are given men's shirts to turn into 1930s women's blouses. Finally, it's time for a touch of Hollywood glamour when they are asked to perfectly fit a bias-cut evening gown reminiscent of outfits worn by Katharine Hepburn and Bette Davis."
      },
      {
        "id": "tvmaze:2342362",
        "title": "Episode 9",
        "season": 8,
        "episode": 9,
        "released": "2022-06-22",
        "overview": "Sara Pascoe welcomes the four semi-finalists into the Sewing Room to celebrate the influences of Japanese design and sewing. For the Pattern Challenge, Esme has collaborated with a Japanese designer to come up with a kimono-inspired dress that proves to be a brain-teaser. This is for a place in the final, after all.The Transformation Challenge is on a smaller scale than usual, as the sewers take worn-out denim and apply the Japanese techniques of sashiko and boro to mend areas of wear and tear, enhancing it with appliqué and embroidery.Finally, their Made to Measure challenge is to fit an outfit to their model which has elements of origami folds and pleats."
      },
      {
        "id": "tvmaze:2347413",
        "title": "Episode 10",
        "season": 8,
        "episode": 10,
        "released": "2022-06-29",
        "overview": "It's the grande finale, and it's Party Week as the finalists compete for the title of Britain's best amateur sewer. They take on a trio of party-themed challenges, starting with the pattern for one of Esme's iconic Swanky Modes designs - the Amorphous dress. Made from one piece of Lycra and manipulated into shape with a connection of D-rings, this garment is all about precision and fabric handling.Then it's their final chance to show off their ability to think on their feet as they take on the Transformation Challenge. They are brought face-to-face with all their scraps from the past nine weeks and must fashion them into an outfit that they would wear to a party.Finally, they fit a red-carpet jumpsuit using sparkles and luxury fabrics to a model who is a friend or a family member. The previously eliminated sewers return for a reunion, and the judges have the difficult task of deciding who will be crowned Britain's best amateur sewer."
      },
      {
        "id": "tvmaze:2545480",
        "title": "Episode 1",
        "season": 9,
        "episode": 1,
        "released": "2023-05-24",
        "overview": "Sara Pascoe welcomes 12 sewers to the Sewing Bee in Leeds. Judges Patrick Grant and Esme Young want to see how the newbies deal with 'Classics with a Twist'. For their first Pattern Challenge, the sewers make a top with a twist at its centre, which is a straightforward construction with a tricky brain-teaser.For the 90-minute Transformation Challenge, they take the office uniform – a pencil skirt and blouse – and give it their own personal twist to reflect their style.Finally, in the Made to Measure round, the sewers meet their models for the first time, and they attempt to perfectly fit a dress that has cut-out details. Who will impress the judges and win Garment of the Week, and whose hopes of staying in the competition won't last beyond Week One?"
      },
      {
        "id": "tvmaze:2550470",
        "title": "Episode 2",
        "season": 9,
        "episode": 2,
        "released": "2023-05-31",
        "overview": "It's not exactly a holiday this week for the sewers, as judges Patrick Grant and Esme Young task them with creating garments based around a travel wardrobe.It's a Sewing Bee first in the Pattern Challenge, when Sara Pascoe reveals they have to make a rucksack. This fiendishly tricky challenge involves battling complex strap construction, complete with metal hardware for adjustment. They must also add a lining to create a robust and stylish bag ready to hit the backtracking trail.It's off to the seaside in the Transformation, when the sewers are challenged to sculpt windbreakers into emergency rainwear.And staying in the sun, they attempt another Sewing Bee first with made- to-measure swimsuits. For some, their costume is designed for open-water swimming, for others it's strictly poolside posing. Who will make a splash, and who will take a nose dive and be the second sewer to leave the competition?"
      },
      {
        "id": "tvmaze:2557804",
        "title": "Episode 3",
        "season": 9,
        "episode": 3,
        "released": "2023-06-07",
        "overview": "The ten remaining sewers celebrate clothes from west Africa. Sara Pascoe and judges Patrick Grant and Esme Young are joined by a special guest judge, Nigerian fashion designer Banke Kuku. The Pattern Challenge takes inspiration from a Ghanaian batakari or fugu tunic, which first involves sewing strips of handwoven deboya fabric.In the Transformation Challenge, the sewers focus on Nigeria. They have 90 minutes to turn beautiful hand-dyed adire fabric into stunning dresses by draping the fabric on the stand.Finally, for the Made-to-Measure round, the sewers make boubous, a dramatic and flowing wide-sleeved robe worn by men and women across west Africa. Who will make something to impress all three judges and win Garment of the Week, and who will become the third sewer to leave the competition?"
      },
      {
        "id": "tvmaze:2561256",
        "title": "Episode 4",
        "season": 9,
        "episode": 4,
        "released": "2023-06-14",
        "overview": "Taking on the fast fashion industry, the second most polluting industry in the world, Sara Pascoe welcomes back Reduce Reuse Recycle week. First, the sewers attempt a zero-waste pattern for a pair of trousers, which involves complex mathematical skills to work out how to create the pattern pieces without leaving a scrap of waste fabric.In the Transformation Challenge, the sewers use up a mountain of waste tote bags to create a garment. They can combine several bags to transform them in just 90 minutes, making imaginative use of the different prints and straps.Finally, the sewers have been asked to source second-hand crochet blankets to create a made-to-measure outfit. They need to ensure that while chopping up their blankets, they don't unravel before they are sewn into outfits."
      },
      {
        "id": "tvmaze:2566664",
        "title": "Episode 5",
        "season": 9,
        "episode": 5,
        "released": "2023-06-21",
        "overview": "It's Art Week as the remaining sewers tackle three challenges inspired by the world of art. First, Sara reveals they must make a skirt inspired by the modernist movement. The techniques involved include appliqueing abstract shapes and making a sash tied in an enormous, Esme-pleasing bow.In the Transformation Challenge, the sewers are asked to take huge canvases painted by local art students and turn them into dresses making clever use of the sculptural fabric and the painted design. Finally, for the Made to Measure, the sewers take inspiration from the 20th-century surrealist movement, which drew on artists' dreams and subconscious. The sewers dig deep into their own dreams to create fantastical outfits for a mind-bending catwalk."
      },
      {
        "id": "tvmaze:2570792",
        "title": "Episode 6",
        "season": 9,
        "episode": 6,
        "released": "2023-06-28",
        "overview": "It's Kids' Week in the sewing room, and Sara Pascoe invites the seven remaining sewers to follow the pattern for a child's dragon dressing gown. The task requires the sewers to use a thick towelling fabric to create the dragon spikes, while the rough seams need finishing with a neat binding. The hood is topped off with googly eyes and spiky teeth.For the Transformation Challenge, the sewers personalise denim jackets using hand-me-downs. They can applique, add trims or totally deconstruct the jackets.Finally, mini models are welcomed for the Made-to-Measure challenge, which this week is to make special-occasion outfit for a five-year-old. As well as being party-ready, these outfits must be comfortable, allowing enough movement for playing games and dancing. Who will win Garment of the Week, and who will have to leave the party early, becoming the sixth sewer to leave the competition?"
      },
      {
        "id": "tvmaze:2578821",
        "title": "Episode 7",
        "season": 9,
        "episode": 7,
        "released": "2023-07-05",
        "overview": "A place in the quarter-final is at stake, and this week host Sara Pascoe takes the sewers on a trip down memory lane to the 1990s.First up, in the Pattern Challenge, the sewers are asked to make the 90s most popular trousers – cargo pants. Loved by hip-hop musicians and British girl bands alike, these trousers involve grappling with unfamiliar bellows pockets and a fly zip.For the Transformation Challenge, the sewers take household textiles and rustle up a 90s celebrity-themed fancy dress outfit.Finally, in the Made-to-Measure Challenge, the sewers take on the legendry supermodel dress. These bodycon and body-skimming dresses summed up the glamour and decadence of the decade. Who will make it into the quarter-final, and who will take a tumble on the catwalk?"
      },
      {
        "id": "tvmaze:2580831",
        "title": "Episode 8",
        "season": 9,
        "episode": 8,
        "released": "2023-07-12",
        "overview": "The quarter-final sees the five remaining sewers make garments inspired by history's most influential fashion Icons.For the Pattern Challenge, judges Patrick Grant and Esme Young draw on old-time Hollywood glamour with a dress reminiscent of Audrey Hepburn's little black dress in Breakfast at Tiffany's – a garment that demands a tight-fitting bodice and elegant cut.The Transformation Challenge is inspired by the Sewing Bee's very own fashion icon, Esme Young, and her work with fashion label Swanky Modes, specifically their range of clothes made from shower curtains, shot by legendary fashion photographer Helmut Newton for Nova magazine.Finally, in the Made-to-Measure Challenge, it's an all-male affair as the sewers have been asked to make smoking jackets. This tailoring test is combined with tricky-to-handle fabrics alongside the added pressure of creating a perfect fit for their model. Who will secure icon status and win Garment of the Week, and who will be a fashion fail?"
      },
      {
        "id": "tvmaze:2589705",
        "title": "Episode 9",
        "season": 9,
        "episode": 9,
        "released": "2023-07-19",
        "overview": "Sara Pascoe welcomes the four semi-finalists into the sewing room as they get to work with utilitarian clothing, with a place in the final at stake.Judges Patrick Grant and Esme Young challenge the sewers to make an office staple – the trench coat, which originated as part of a military uniform. They must tackle the multiple parts that make this coat so distinctive, from the storm flaps to the epaulettes to the double-breasted design.The sewers really need to use their imaginations in the Transformation Challenge as it turns to housework and making a garment from old cleaning products, including cleaning cloths, rubber gloves and mopheads.The Made-to-Measure Challenge is boiler suits. Once worn to stoke boilers, they are now a fixture on the catwalk and high street alike. Multiple pockets feature, but the sewers' biggest challenge is to make sure their boiler suits fit their models perfectly around the crotch and bottom.Who will get promoted to the final, and who will be pipped to the post and take their leave of the competition?"
      },
      {
        "id": "tvmaze:2594978",
        "title": "Episode 10",
        "season": 9,
        "episode": 10,
        "released": "2023-07-26",
        "overview": "It's the grand finale of The Great British Sewing Bee as the three finalists compete for the title of Britain's best amateur sewer, making the most glamourous and extravagant of garments.Patrick Grant and Esme Young kick things off by challenging the sewers to make a Victoriana-style evening dress. These dresses require delicate fabrics to create the glamorous effect, but they are tricky to handle, especially when the pattern demands a fitted bodice, puff sleeves and frilled cuffs.Next, it's the sewers' final chance to show off their instinct for design in the Transformation Challenge, as they attempt to turn female party wear into a glamorous men's red-carpet outfit, inspired by figures such as Billy Porter, Timothee Chalamet and Harry Styles.Finally, they fit a Met Gala-worthy 'two-in-one' dress for their models, who this week are a friend or family member. Creating a dress which transforms from one dress into another whilst on the catwalk will take a feat of engineering and leap of imagination.The past sewers return for a reunion, while the judges will make their decision then crown this year's best amateur sewer."
      },
      {
        "id": "tvmaze:2856075",
        "title": "Episode 1",
        "season": 10,
        "episode": 1,
        "released": "2024-05-21",
        "overview": "Kiell Smith-Bynoe welcomes the 12 sewers to the sewing room as we kick off the tenth series celebrating Sewing turning ten. In the first week, judges Patrick Grant and Esme Young task the new sewers with challenges inspired by the very first set in our first series. For their first Pattern Challenge, it's a denim A-line midiskirt.For the 90-minute Transformation Challenge, rather than altering the neckline of a T-shirt, they have to transform it into a completely new garment.Finally, in the Made-to-Measure, the sewers meet their models for the first time to make their interpretation of a casual day dress.Who will impress the judges and win Garment of the Week, and whose hopes of staying in the competition won't last beyond week one?"
      },
      {
        "id": "tvmaze:2870912",
        "title": "Episode 2",
        "season": 10,
        "episode": 2,
        "released": "2024-05-28",
        "overview": "It's week 2, and judges Patrick and Esme have set three challenges inspired by the wide world of sport.In the first challenge, the sewers are presented with a pattern for a sportswear staple perfect for the winter months, the half zip fleece.In the Transformation Challenge, the sewers face a sticky wicket as they are tasked with creating a whole new outfit from cricket whites and protection.Finally, in honour of 2024 being an Olympic year, in the Made-to-Measure, the sewers nominate a country and make an outfit for a specific sport fit for an international sporting event."
      },
      {
        "id": "tvmaze:2880461",
        "title": "Episode 3",
        "season": 10,
        "episode": 3,
        "released": "2024-06-04",
        "overview": "It's not exactly a holiday for the sewers in Week 3 as Patrick Grant and Esme Young task them with creating garments based around travel.In the Pattern Challenge, the judges channel holidays as the sewers are challenged to make a summer blouse using old tablecloths. Then they set sail in the Transformation Challenge and make bags using nautical paraphernalia.In the Made-to-Measure, The Sewing Bee heads to the coast with outfits inspired by the French Riviera. Who will make a fashion faux pas and who will turn heads with some je ne sais quoi?"
      },
      {
        "id": "tvmaze:2894692",
        "title": "Episode 4",
        "season": 10,
        "episode": 4,
        "released": "2024-06-11",
        "overview": "Taking on the fast fashion industry, the second most polluting industry in the world, Kiell Smith-Bynoe welcomes back Reduce Reuse Recycle week. First, the sewers attempt a quilted bag using scraps sandwiched between sheets of organza.In the Transformation Challenge, the sewers come face to face with the idea of the mountains of discarded clothes created every day by the fashion industry. In 90 minutes they are tasked with cherry-picking items from textile waste to create a brand new item in a colour palette of their choosing.Finally, in a Sewing Bee first, the sewers take wedding dresses and repurpose them in to an outfit fit for a party. They cut, dye and even paint the dress and produce a range of ingenuous garments."
      },
      {
        "id": "tvmaze:2900931",
        "title": "Episode 5",
        "season": 10,
        "episode": 5,
        "released": "2024-06-18",
        "overview": "The ten remaining sewers celebrate fashion and textiles from India. Kiell Smith-Bynoe and judges Patrick Grant and Esme Young are joined by a special guest judge, Priya Khanchandani.The Pattern Challenge takes inspiration from the jacket popularised by the first prime minister of India, Jawaharlal Nehru.In the Transformation, the sewers are challenged to make an outfit from two fabrics originating in India, calico and Madras cotton.Finally, for the Made to Measure the sewers create evening wear taking inspiration from elements of the sari."
      },
      {
        "id": "tvmaze:2915193",
        "title": "Episode 6",
        "season": 10,
        "episode": 6,
        "released": "2024-06-25",
        "overview": "It's Children's Week, and Kiell Smith-Bynoe invites the seven remaining sewers to follow the pattern for a child's sequined bomber jacket. With sequins proving tricky to tackle and ribbing around the cuffs and neck, the sewers' skills will once again be under the microscope.For the Transformation Challenge, the sewers are asked to make animal themed fancy dress for a toddler from beach towels with eye-catching results.Finally, the Sewing Bee welcomes mini models for the Made-to-Measure. The sewers' challenge is to unearth a childhood photo and use it as inspiration to create a brand new outfit to fit their mini models.Who will breeze through it like child's play, and who will be on the naughty step?"
      },
      {
        "id": "tvmaze:2920542",
        "title": "Episode 7",
        "season": 10,
        "episode": 7,
        "released": "2024-07-03",
        "overview": "A place in the quarter-final is at stake, and this week the sewers must face three technically-taxing challenges from the world of lingerie.First up, in the Pattern Challenge, it is time for bed as the sewers are asked to make a pyjama blouse. Piping is an intricate undertaking, and it should cover the cuffs and front.For the Transformation Challenge, the sewers take shapewear and lace and, using their unique structure and form, create new outfits.Finally, it's ‘boom or bustier' as the sewers tackle boning and make bustier dresses in the Made-to-Measure. Their ability to fit a model is put to the test - there is nowhere to hide if a bustier dress is not fitted well."
      },
      {
        "id": "tvmaze:2929951",
        "title": "Episode 8",
        "season": 10,
        "episode": 8,
        "released": "2024-07-10",
        "overview": "The quarter-final sees the five remaining sewers make garments inspired by divas past and present. From Elton to Mariah, this week's theme is most definitely fabulous.For the Pattern Challenge, judges Patrick Grant and Esme Young take Tina Turner's iconic fringed dress as inspiration and challenge the sewers to create their own versions with multiple layers of fringing.The Transformation Challenge envisages the diva on their day off, still fabulous but this time slipping into something more comfortable in animal print.Finally, in the Made to Measure, the sewers get to choose a stage outfit for their favourite diva. From Beyoncé to Lady Gaga, the sewers have all bases covered when it comes to stage presence."
      },
      {
        "id": "tvmaze:2936584",
        "title": "Episode 9",
        "season": 10,
        "episode": 9,
        "released": "2024-07-17",
        "overview": "Kiell Smith-Bynoe welcomes the four semi-finalists into the sewing room as the judges set three challenges inspired by design icons.First up, master pattern cutter Cristobal Balenciaga is the inspiration for the Pattern Challenge, as the sewers recreate a version of one of his dresses.In the Transformation Challenge, taking the lead from the iconic Jean Paul Gaultier, the sewers are given a pile of neck ties and tasked with using them to create a brand new garment.Finally, in the Made to Measure, Coco Chanel is in the spotlight as the sewers get the chance to scour her long career to find a style to make an outfit inspired by her work.Four remaining sewers, three challenges, but one will miss out on a place in the final."
      },
      {
        "id": "tvmaze:2939950",
        "title": "Episode 10",
        "season": 10,
        "episode": 10,
        "released": "2024-07-24",
        "overview": "It's the grand finale as the three finalists compete for the title of Britain's best amateur sewer.Patrick Grant and Esme Young kick things off by challenging the sewers to make opera gloves. These gloves require delicate fabrics and precision sewing - a true test at this stage of the competition.Next, it's the sewers' last chance to show off their instinct for design in the Transformation Challenge. They attempt to turn party paraphernalia, such as napkins, paper hats and even bunting, into a complete party outfit.Finally, for the first time in ten years of Sewing Bee, the sewers create a full outfit by draping on their models within the time allowed for the challenge. They have had a chance to plan, but it is in the sewing room where all the hard work will be done. This is their final chance to show the judges why they deserve to win.Three finalists, three challenges, but only one sewer will be crowned the tenth winner of the competition."
      },
      {
        "id": "tvmaze:3293323",
        "title": "Episode 1",
        "season": 11,
        "episode": 1,
        "released": "2025-07-15",
        "overview": "Sara Pascoe returns to the sewing room with 12 new hopefuls for a brand new series of The Great British Sewing Bee.In week one, judges Patrick Grant and Esme Young challenge the sewers to prove their ability to create shape. First up, the Pattern Challenge sees them crafting a tie-front blouse, using gathers to add volume.Next, in the 90-minute Transformation Challenge, circle skirts are reimagined into brand new garments.Finally, the Made-to-Measure challenge tests their skills with pleats as they design a perfectly shaped dress.One sewer will impress and earn Garment of the Week, but for another, it's the end of the road as they leave the sewing room for good."
      },
      {
        "id": "tvmaze:3300287",
        "title": "Episode 2",
        "season": 11,
        "episode": 2,
        "released": "2025-07-22",
        "overview": "It's Week 2, and judges Patrick Grant and Esme Young put the 11 remaining sewers through their paces with three challenges themed around activewear.First, the sewers take on a technical Pattern Challenge, constructing a seven-panel cap. In the Transformation Challenge, they give new life to unwanted cycling gear, turning it into stylish new garments.Finally, in the Made to Measure, the sewers must create an athleisure outfit – something practical enough for the gym but stylish enough for a coffee shop."
      },
      {
        "id": "tvmaze:3305407",
        "title": "Episode 3",
        "season": 11,
        "episode": 3,
        "released": "2025-07-29",
        "overview": "It's Week 3, and the theme is design icons. Judges Patrick Grant and Esme Young challenge the sewers to channel fashion's most influential figures across three creative tasks.First up, in the Pattern Challenge, the sewers put their own spin on the timeless Diane von Furstenberg wrap dress. Then, it's a bold Transformation Challenge as they turn home furnishings into punk-inspired looks, paying tribute to Vivienne Westwood.Finally, glamour takes over the sewing room in the Made to Measure, where the sewers create luxurious garments inspired by the iconic style of Versace."
      },
      {
        "id": "tvmaze:3311868",
        "title": "Episode 4",
        "season": 11,
        "episode": 4,
        "released": "2025-08-05",
        "overview": "It's week 4, and the 10 remaining sewers celebrate the rich fashion and textile traditions of Korea. Renowned fashion designer Eudon Choi joins as a special guest judge.In the Pattern Challenge, the sewers take on the jeogori, a historic Korean garment now seen in contemporary womenswear and K-Pop style. In the Transformation Challenge, taekwondo outfits and colourful belts are reimagined into striking new creations.Finally, in the Made to Measure Challenge, the sewers design evening wear inspired by the cheollik, once worn by military officials and now a symbol of modern Korean fashion."
      },
      {
        "id": "tvmaze:3317971",
        "title": "Episode 5",
        "season": 11,
        "episode": 5,
        "released": "2025-08-12",
        "overview": "This week, it's the fast fashion industry, the second most polluting in the world, with Sara Pascoe leading Reduce, Reuse, Recycle week.In the Pattern Challenge, the sewers create a zero-waste workwear jacket.The Transformation Challenge brings a surprise as the sewers enter the sewing room to find two tents. Discarded camping gear is given new life as the sewers transform their tent into a complete outfit.Finally, in the Made to Measure, inspired by the Make Do and Mend campaign, the sewers raid their wardrobes and those of family and friends to create fresh outfits from garments no longer worn - embracing the essence of sustainability."
      },
      {
        "id": "tvmaze:3324113",
        "title": "Episode 6",
        "season": 11,
        "episode": 6,
        "released": "2025-08-19",
        "overview": "It's Children's Week, and for the first time ever, the show introduces elements of adaptive fashion.The sewers tackle a pattern for children's dungarees, with adaptive fashion designer Victoria Jenkins joining the judges to help assess their efforts.In the Transformation Challenge, sustainability is key as the sewers repurpose maternity wear into toddler outfits, giving new life to old garments.Finally, the Sewing Bee welcomes mini models for the Made to Measure challenge. The sewers are tasked with creating outfits inspired by what their models want to be when they grow up, ranging from polar explorer to beekeeper to politician.The results are unexpected, and a perfect fit could secure a place in next week's competition.Who will handle it like child's play, and who will be sent to the naughty step?"
      },
      {
        "id": "tvmaze:3329981",
        "title": "Episode 7",
        "season": 11,
        "episode": 7,
        "released": "2025-08-26",
        "overview": "A place in the quarter-final is on the line this week as the sewers tackle three challenges inspired by art.In the Pattern Challenge, the sewers are tasked with creating a baby-doll dress, taking inspiration from Turner Prize-winning potter Grayson Perry, whose distinctive aesthetic sets the tone.Next, in the Transformation Challenge, the sewers work with used painter's overalls, which they must turn into an asymmetric outfit, showcasing their creativity and resourcefulness.Finally, in the Made to Measure Challenge, the sewers embrace the bold colours and shapes of pop art. Drawing inspiration from the post-war art movement led by Andy Warhol, they create stunning garments that capture the essence of this iconic style.Who will secure their spot in the quarter-final, and who will fall short?"
      },
      {
        "id": "tvmaze:3337101",
        "title": "Episode 8",
        "season": 11,
        "episode": 8,
        "released": "2025-09-02",
        "overview": "It's week eight, and the five remaining sewers take a trip to the movies with three challenges inspired by iconic moments from the silver screen.For the Pattern Challenge, judges Patrick Grant and Esme Young turn to legendary costume designer Edith Head, a frequent collaborator with Alfred Hitchcock, as they task the sewers with recreating the jacket worn by Tippy Hedren's character in The Birds.In the Transformation Challenge, the sewers are given red cinema curtains and tiebacks, challenging them to transform these into glamorous outfits fit for a Hollywood party.Finally, in the Made to Measure, the sewers let their imaginations run wild, designing an outfit for a character from a horror film, where creativity and spookiness come together."
      },
      {
        "id": "tvmaze:3345870",
        "title": "Episode 9",
        "season": 11,
        "episode": 9,
        "released": "2025-09-09",
        "overview": "Sara Pascoe welcomes the semi-finalists into the sewing room, and with judges Patrick Grant and Esme Young, sets three 1920s-inspired challenges that will test the sewers' creativity and skill.First, in the Pattern Challenge, the sewers must recreate iconic plus fours, a staple of 1920s outdoor pursuits, combining practicality and style from the era.Next, for the Transformation Challenge, the sewers take inspiration from tennis legend Rene Lacoste, inventor of the polo shirt, and are given a selection of polos to turn into modern, colour-blocked garments.Finally, in the Made to Measure, it's time to create an outfit for a 1920s party. From the bold fashion of Weimar Berlin to the lively style of swinging Soho, it's time to embrace the revolutionary fashion of this iconic decade.With only four sewers remaining, one will miss out on a place in the final."
      },
      {
        "id": "tvmaze:3353227",
        "title": "Episode 10",
        "season": 11,
        "episode": 10,
        "released": "2025-09-16",
        "overview": "It's the grand finale, and the three finalists are ready to compete for the coveted title of Britain's best amateur sewer.The judges, Patrick Grant and Esme Young, set three tough challenges to test their skills for one final time.First up, the sewers are tasked with creating the deceptively complex bias cut slip dress. Precision is key - one mistake in fabric cutting could cost them the chance to continue.Next, it's time for the Transformation Challenge, where the sewers must demonstrate their creativity by making garments using sheer fabric.Finally, the sewers tackle the masterful art of trompe l'oeil, creating illusions with fabric to fit their chosen friend or family member. This technique, often seen on the runway, tricks the eye into seeing something unexpected.Three finalists, three challenges, but only one winner will be crowned the tenth champion of The Great British Sewing Bee."
      }
    ]
  }
}