{
  "meta": {
    "id": "tvmaze:75183",
    "type": "series",
    "name": "Shifting Gears",
    "description": "Shifting Gears centers on Matt, a stubborn, widowed owner of a classic car restoration shop. When Matt's estranged daughter and her teenage kids move into his house, the real restoration begins.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/585/1463471.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/585/1463471.jpg",
    "videos": [
      {
        "id": "tvmaze:3428072",
        "title": "Nutcracker",
        "season": 2,
        "episode": 8,
        "released": "2025-12-10",
        "overview": "This holiday season, the Parkers discover that romance isn't always a smooth ride as Matt and Eve are on thin ice; Gabe enlists Riley to help Amelie impress his mom; Carter seeks help with his promposal."
      },
      {
        "id": "tvmaze:3049935",
        "title": "Restoration",
        "season": 1,
        "episode": 1,
        "released": "2025-01-08",
        "overview": "Matt, the widowed owner of a classic car restoration shop, is confronted with his most unexpected and challenging project yet when his estranged daughter and her adolescent children come crashing back into his life."
      },
      {
        "id": "tvmaze:3087529",
        "title": "Accommodations",
        "season": 1,
        "episode": 2,
        "released": "2025-01-15",
        "overview": "Matt joins Riley at Carter's high school open house."
      },
      {
        "id": "tvmaze:3106172",
        "title": "Job",
        "season": 1,
        "episode": 3,
        "released": "2025-01-22",
        "overview": "Riley, desperate for work, reluctantly takes a job at Matt's shop; Gabriel and Stitch secretly stray from Matt's vision on a high-stakes restomod project."
      },
      {
        "id": "tvmaze:3107518",
        "title": "Grief",
        "season": 1,
        "episode": 4,
        "released": "2025-01-29",
        "overview": "When Riley discovers a closet filled with her late mother's clothes, she insists Matt hasn't processed her death and urges him to see a grief counselor; Gabriel faces a crisis of confidence when he's put in charge of the shop for a day."
      },
      {
        "id": "tvmaze:3115581",
        "title": "Jimmy",
        "season": 1,
        "episode": 5,
        "released": "2025-02-05",
        "overview": "Riley's estranged husband, Jimmy, shows up to win her back, much to Matt's dismay; Riley finds support in an unexpected place."
      },
      {
        "id": "tvmaze:3122989",
        "title": "Valentine's",
        "season": 1,
        "episode": 6,
        "released": "2025-02-12",
        "overview": "A Valentine's Day visit to his late wife's grave sparks an unexpected connection for Matt in an unlikely place; Riley is thrust into the spotlight for a promotional video at the dance studio."
      },
      {
        "id": "tvmaze:3138956",
        "title": "Picnic",
        "season": 1,
        "episode": 7,
        "released": "2025-02-26",
        "overview": "The feud between Parker Customs and Premiere Dance Lab heats up when Matt confronts the owner over a picnic table placed in the shared alleyway; Carter's need for \"me time\" sparks a conversation with Matt."
      },
      {
        "id": "tvmaze:3144742",
        "title": "Career",
        "season": 1,
        "episode": 8,
        "released": "2025-03-05",
        "overview": "Georgia invites Matt and Riley to speak at her school's Career Day, where playful competition turns tense when Riley learns Georgia is ashamed of her job; Gabriel mentors Carter's car project until a more urgent piece of business arises."
      },
      {
        "id": "tvmaze:3144745",
        "title": "Gummies",
        "season": 1,
        "episode": 9,
        "released": "2025-03-12",
        "overview": "Riley is horrified when she finds weed gummies in Carter's pocket, prompting surprising advice from Matt; Eve inadvertently lands Gabriel and Stitch in hot water after asking them to donate to a charity auction."
      },
      {
        "id": "tvmaze:3160867",
        "title": "Kiss",
        "season": 1,
        "episode": 10,
        "released": "2025-03-19",
        "overview": "When Jimmy returns with a new job and a proposition for Riley and the kids to move into his house, Riley is torn between her past and her future; Matt's feud with Eve flares up once again after she damages his car."
      },
      {
        "id": "tvmaze:3305506",
        "title": "Secret",
        "season": 2,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "Matt wrestles with his feelings for Eve, and Charlotte convinces him to go to a grief group; Riley struggles with her own \"will she or won't she\" about her feelings for Gabe."
      },
      {
        "id": "tvmaze:3364391",
        "title": "Date",
        "season": 2,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "Matt and Eve go on their first date but have different ideas of what it should entail; Riley befriends the mom of Georgia's new friend; Carter mediates a tiff between Gabe and Stitch."
      },
      {
        "id": "tvmaze:3372414",
        "title": "Passion",
        "season": 2,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "When Carter's job pays more than Riley's, she decides to find her forever career and clashes with Matt over her future; Gabriel \"Fluffy\" Iglesias drops by Parker Customs; Matt debates letting go of a piece of the past."
      },
      {
        "id": "tvmaze:3383304",
        "title": "Danger",
        "season": 2,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "When a raccoon appears in the Parkers' yard, Matt sees a chance to teach Carter a lesson about facing his fears; Riley struggles to navigate the world of dating apps and goes on her first post-divorce date."
      },
      {
        "id": "tvmaze:3383305",
        "title": "Scary",
        "season": 2,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "Matt plans to spend Halloween with Eve, but the real terror begins when Eve wants to sleep over; with Carter and Georgia out for the night, Riley invites Gabe and Stitch to a Halloween party, hoping to relive the crazy, epic Halloweens of her past."
      },
      {
        "id": "tvmaze:3392507",
        "title": "Loyalty",
        "season": 2,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "Matt's dream build turns into a nightmare when controversy between Stitch and the client threatens to derail everything; Riley hires Carter at her coffee business and quickly learns that working with family brews more tension than drinks."
      },
      {
        "id": "tvmaze:3425959",
        "title": "License",
        "season": 2,
        "episode": 7,
        "released": "2025-12-03",
        "overview": "Matt's plan to prove he's the better driving teacher hits a snag when he learns his license is expired; Riley's two worlds collide as she struggles to keep both her business and family afloat."
      },
      {
        "id": "tvmaze:3428072",
        "title": "Nutcracker",
        "season": 2,
        "episode": 8,
        "released": "2025-12-10",
        "overview": "This holiday season, the Parkers discover that romance isn't always a smooth ride as Matt and Eve are on thin ice; Gabe enlists Riley to help Amelie impress his mom; Carter seeks help with his promposal."
      },
      {
        "id": "tvmaze:3428073",
        "title": "Dog",
        "season": 2,
        "episode": 9,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3428074",
        "title": "Friend",
        "season": 2,
        "episode": 10,
        "released": "2026-01-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3446864",
        "title": "TBA",
        "season": 2,
        "episode": 11,
        "released": "2026-01-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3446865",
        "title": "TBA",
        "season": 2,
        "episode": 12,
        "released": "2026-01-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3446866",
        "title": "TBA",
        "season": 2,
        "episode": 13,
        "released": "2026-02-04",
        "overview": ""
      }
    ]
  }
}