{
  "meta": {
    "id": "tvmaze:59574",
    "type": "series",
    "name": "Château DIY at Christmas",
    "description": "From to sprucing up the salóns to decking the hallways, chateau owners get Christmas-ready.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/540/1351239.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/540/1351239.jpg",
    "videos": [
      {
        "id": "tvmaze:3464739",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2025-12-15",
        "overview": "Alison and Zion are transforming Château de la Boutinière into a giant advent calendar. Over at Chateau de Cézérac, Jon and Carmen work against the clock to finish a bedroom before Santa arrives. And at Château Chomet, Debbie and Dave throw their first ever Christmas bash; what could possibly go wrong? Expect sawdust, sequins and seasonal chaos in this merry mix of DIY and château cheer!"
      },
      {
        "id": "tvmaze:3464741",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2025-12-16",
        "overview": "From sprucing up the salóns to decking the hallways, discover what it takes to renovate beautiful chateaux at Christmas in France. It's beginning to look a lot like... festive mayhem! At Château de Cézérac, Jon and Carmen are dashing through their DIY list to get a bedroom guest-ready before a Christmas bash. Over at Château de la Fare, Janet and Philip's carol concert might be more 'Silent Night' if the chimney doesn't let the smoke or Santa through. And at Château de la Grillère, Tim and Sharon are dreaming of a very tall Christmas... but their twelve-metre tree and three-metre ceilings aren't exactly a match made in tinsel. It's sleigh bells, sparkle and a touch of seasonal silliness at our châteaux!"
      },
      {
        "id": "tvmaze:3464743",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2025-12-17",
        "overview": "In the Dordogne at Château Domaine de le Barde, Tim and Krys are turning their stairs into a medieval Christmas wonder. In Languedoc at Château du Puits es Pratx, Lily and Luke are cracking on with a sparkling end-of-year celebration full of surprises. And at Château Lagorce, Anna and Edward are roasting not one, not two, but three Christmas birds for an irresistible festive feast."
      },
      {
        "id": "tvmaze:3464746",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2025-12-18",
        "overview": "In the Dordogne at Château des Vieilles Vignes, Nick and Nicole are in a festive frenzy, racing to finish their grand dining room before guests arrive for a glittering Christmas celebration. Over at Château de Pican, Jane and Rory are busy making room in the stables for a very special new arrival. And in the heart of France at Château de Lalande, Stephanie is determined to unveil her beautifully restored chapel before Christmas, while Ashley and Terry treat their nephew Jonathan to a chocolate-filled festive adventure."
      },
      {
        "id": "tvmaze:3464749",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2025-12-19",
        "overview": "In the heart of France at Château de Lalande, it's opening day for Stephanie and her beautifully restored chapel, but with rain pouring down, she'll need a Christmas miracle to keep spirits high. Over in the Loire Valley, Ben and Billie are serving up a Christmas Eve fish feast with plenty of festive sparkle at Château La Grande Maison. And in Brittany at Moulin du Couesnon, Donna and Paul are lighting up their grand old property and spreading Christmas cheer with hard hats, fairy lights and all!"
      }
    ]
  }
}