{
  "meta": {
    "id": "tvmaze:9363",
    "type": "series",
    "name": "Christmas in Rockefeller Center",
    "description": "NBC celebrates the lighting of the world's most famous Christmas tree with Christmas in Rockefeller Center. The arrival of the holidays wouldn't be complete without a dazzling display of musical talent and the lighting of the world's most famous Christmas tree, live from Rockefeller Center in New York City on the Wednesday evening following Thanksgiving..",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499930.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499930.jpg",
    "videos": [
      {
        "id": "tvmaze:3460611",
        "title": "94th Annual Christmas in Rockefeller Center",
        "season": 2026,
        "episode": 1,
        "released": "2026-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3076792",
        "title": "93rd Annual Christmas in Rockefeller Center",
        "season": 2025,
        "episode": 1,
        "released": "2025-12-03",
        "overview": "Continuing a tradition spanning over nine decades, NBC celebrates the holiday season with the annual lighting of one of the world's most famous trees in the heart of New York City during the beloved \"Christmas in Rockefeller Center.\" Hosted by Reba McEntire, the dazzling display of musical talents and star-studded surprises remains one of the holiday season's most anticipated events.Audiences will experience a star-studded evening of festive performances from many musical guests, including Marc Anthony, Halle Bailey, Michael Bublé, Kristin Chenoweth, Laufey, New Edition, Brad Paisley, Carly Pearce, the Radio City Rockettes, and Gwen Stefani. In line with tradition, the Radio City Rockettes, celebrating their 100th anniversary this year, will wow viewers with a festive performance. NBC's \"TODAY\" anchors Savannah Guthrie, Craig Melvin, and Al Roker will join the tree lighting for special appearances.The annual holiday special celebrates the lighting of a 75-foot-tall, 45-foot-wide Norway Spruce from East Greenbush, NY. The tree weighs approximately 11 tons, will be adorned with more than 50,000 multi-colored LED lights, and topped with a three-dimensional Swarovski star."
      },
      {
        "id": "tvmaze:1979181",
        "title": "Christmas In Rockefeller Center 1997",
        "season": 1997,
        "episode": 1,
        "released": "1997-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3064454",
        "title": "71",
        "season": 2003,
        "episode": 1,
        "released": "2003-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3064453",
        "title": "72",
        "season": 2004,
        "episode": 1,
        "released": "2004-11-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3064457",
        "title": "73",
        "season": 2005,
        "episode": 1,
        "released": "2005-11-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3064456",
        "title": "74",
        "season": 2006,
        "episode": 1,
        "released": "2006-11-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3064455",
        "title": "75",
        "season": 2007,
        "episode": 1,
        "released": "2007-11-28",
        "overview": ""
      },
      {
        "id": "tvmaze:505162",
        "title": "Christmas In Rockefeller Center 2008",
        "season": 2008,
        "episode": 1,
        "released": "2008-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:505163",
        "title": "Christmas In Rockefeller Center 2009",
        "season": 2009,
        "episode": 1,
        "released": "2009-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:505164",
        "title": "Christmas In Rockefeller Center 2010",
        "season": 2010,
        "episode": 1,
        "released": "2010-11-30",
        "overview": ""
      },
      {
        "id": "tvmaze:505165",
        "title": "Christmas In Rockefeller Center 2011",
        "season": 2011,
        "episode": 1,
        "released": "2011-11-30",
        "overview": ""
      },
      {
        "id": "tvmaze:505166",
        "title": "Christmas In Rockefeller Center 2012",
        "season": 2012,
        "episode": 1,
        "released": "2012-11-28",
        "overview": ""
      },
      {
        "id": "tvmaze:505167",
        "title": "Christmas In Rockefeller Center 2013",
        "season": 2013,
        "episode": 1,
        "released": "2013-12-04",
        "overview": ""
      },
      {
        "id": "tvmaze:505168",
        "title": "Christmas In Rockefeller Center 2014",
        "season": 2014,
        "episode": 1,
        "released": "2014-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:505169",
        "title": "Christmas In Rockefeller Center 2015",
        "season": 2015,
        "episode": 1,
        "released": "2015-12-02",
        "overview": "The 83rd annual tree-lighting ceremony in New York; Savannah Guthrie, Al Roker and Natalie Morales host; performers include Sting, James Taylor featuring Chris Botti, Mary J. Blige, Andrea Bocelli, The Band Perry, Andy Grammer and Carly Rae Jepsen."
      },
      {
        "id": "tvmaze:976913",
        "title": "Christmas In Rockefeller Center 2016",
        "season": 2016,
        "episode": 1,
        "released": "2016-11-30",
        "overview": "The arrival of the holidays wouldn't be complete without a dazzling display of musical talent and the lighting of the world's most famous Christmas tree, live from Rockefeller Center in New York City and hosted by \"Today\" anchors Matt Lauer, Savannah Guthrie, Al Roker and Hoda Kotb. The star-studded evening will feature musical performances from Tony Bennett, Neil Diamond, Josh Groban, Tori Kelly, Sarah McLachlan, Dolly Parton, Jordan Smith, Garth Brooks &amp; Trisha Yearwood, the Radio City Rockettes and more, performing current hits and holiday classics. Prior to the primetime telecast, an additional live hour of the special will be broadcast on select NBC stations (7-8 p.m. ET). Check local listings.The Roots, Anthony Hamilton &amp; the HamilTones and Pentatonix will join NBC's star-studded special \"Christmas in Rockefeller Center,\" set to air live from Rockefeller Center in New York on Wednesday, Nov. 30 (8-9 p.m. ET/PT). The Roots will perform two songs, one of which will feature Anthony Hamilton &amp; the HamilTones. Two of \"SNL's\" brightest stars this fall, Alec Baldwin and Kate McKinnon, will be on hand to help light the Christmas tree."
      },
      {
        "id": "tvmaze:1351470",
        "title": "Chirstmas in Rockefeller Center 2017",
        "season": 2017,
        "episode": 1,
        "released": "2017-11-29",
        "overview": "The 85th annual holiday special in New York will celebrate the lighting of a 75-foot tall, 50-foot wide Norway Spruce from State College, Penn. The tree weighs approximately 13 tons and is approximately 80 years old. It will be adorned with more than 50,000 multi-colored LEDs and will be topped with a stunning Swarovski star made up of 25,000 crystals and one million facets. The evening with include festive performances by Brett Eldridge, Jennifer Nettles, Leslie Odom Jr., Pentatonix, Gwen Stefani, The Tenors, Harry Connick Jr., Auli'i Cravalho, Seal, and Train, with additional acts to be announced."
      },
      {
        "id": "tvmaze:1546101",
        "title": "Chirstmas in Rockefeller Center 2018",
        "season": 2018,
        "episode": 1,
        "released": "2018-11-28",
        "overview": "NBC kicks off the holidays with the lighting of the iconic tree in the heart of New York City on the 86th annual \"Christmas in Rockefeller Center.\" The evening will include festive musical performances from Diana Ross, Tony Bennett &amp; Diana Krall, Brett Eldredge, Darci Lynne Farmer, John Legend, Ella Mai, Martina McBride, the New York City Ballet's production of \"George Balanchine's The Nutcracker,\" Pentatonix, Kellie Pickler, Rob Thomas and the Radio City Rockettes in the annual celebration. NBC's \"Today\" anchors Savannah Guthrie, Hoda Kotb, Al Roker, and Craig Melvin host. Billy Porter and the PAL Cops &amp; Kids Chorus in New York City, with a special introduction by Tony Danza, will also lend their voices to the additional live hour of the special to be broadcast on select NBC stations."
      },
      {
        "id": "tvmaze:1745450",
        "title": "87th Annual Christmas in Rockefeller Center",
        "season": 2019,
        "episode": 1,
        "released": "2019-12-04",
        "overview": "Just before the lighting of the iconic tree in Rockefeller Plaza, audiences will be treated to festive performances by Chicago, Brett Eldredge, Derek &amp; Julianne Hough, John Legend, Idina Menzel, Lea Michele, NE-YO, Gwen Stefani, Straight No Chaser, Skylar Astin &amp; Alex Newell from NBC's midseason drama, \"Zoey's Extraordinary Playlist,\" and appearances by Miss America 2019 Nia Franklin and the Radio City Rockettes. NBC's \"Today\" anchors Savannah Guthrie, Hoda Kotb, Craig Melvin, Al Roker will host the joyous event.The 87th annual holiday special will celebrate the lighting of a 77-foot tall, 46-foot wide Norway Spruce from Village of Florida in Orange County, N.Y. The tree weighs approximately 12 tons and is approximately 70-75 years old. It will be adorned with more than 50,000 multi-colored LEDs and will be topped with a stunning Swarovski star."
      },
      {
        "id": "tvmaze:1978610",
        "title": "88th Annual Christmas in Rockefeller Center",
        "season": 2020,
        "episode": 1,
        "released": "2020-12-02",
        "overview": "The annual tree-lighting ceremony in New York features performances from Dolly Parton, Meghan Trainor, Kelly Clarkson, Brett Eldredge, Tori Kelly, Goo Goo Dolls, Leslie Odom Jr., Dan &amp; Shay, the cast of Ain't Too Proud, and the Radio City Rockettes."
      },
      {
        "id": "tvmaze:2215876",
        "title": "89th Annual Christmas in Rockefeller Center",
        "season": 2021,
        "episode": 1,
        "released": "2021-12-01",
        "overview": "NBC kicks off the holiday season with the annual lighting of the iconic Christmas tree in the heart of New York City with the \"89th Christmas in Rockefeller Center.\" The evening combines festive musical performances by Alessia Cara, Harry Connick Jr., Mickey Guyton, Norah Jones, Brad Paisley, Rob Thomas, Carrie Underwood, and more. Also, the evening includes a duet featuring Paisley and Thomas and a special performance by the Radio City Rockettes.NBC News' TODAY co-anchors Savannah Guthrie, Hoda Kotb, Al Roker, and Craig Melvin host the highly anticipated holiday special. Before the primetime telecast, an additional live hour of the special will be broadcast on all NBC Owned Television Stations and numerous NBC affiliates from coast to coast, starting at 7 p.m. ET. Access Daily and Access Hollywood's Mario Lopez and NBC 4 New York's Natalie Pasquarella and David Ushery host this special live hour."
      },
      {
        "id": "tvmaze:2228593",
        "title": "90th Annual Christmas in Rockefeller Center",
        "season": 2022,
        "episode": 1,
        "released": "2022-11-30",
        "overview": "NBC kicks off the holiday season by lighting one of the world's most famous Christmas trees in the heart of New York City for the 90th time with the annual \"Christmas in Rockefeller Center.\"Viewers are treated to festive performances by Jimmie Allen, Andrea Bocelli along with Matteo Bocelli and Virginia Bocelli, David Foster and Katharine McPhee, Brett Eldredge, Mickey Guyton, Alicia Keys, The Muppets of Sesame Street, Dan + Shay, Blake Shelton, The Shindellas, Gwen Stefani, Louis York and more. The evening also includes a performance by the Radio City Rockettes from their iconic \"Christmas Spectacular\" and a special bit by Amy Poehler and Maya Rudolph. Plus, Shelton and Stefani deliver a rare nationally televised duet of their holiday single, \"You Make It Feel Like Christmas.\"NBC News \"TODAY\" co-anchors Savannah Guthrie, Hoda Kotb, and Craig Melvin, with \"Access Hollywood\" host Mario Lopez, co-host the highly anticipated live telecast.The holiday special celebrates the lighting of an 82-foot-tall, 50-foot-wide Norway spruce from Queensbury, New York. The tree weighs approximately 14 tons and will be adorned with more than 50,000 multi-colored LED lights and topped with a three-dimensional Swarovski star covered in 3 million crystals."
      },
      {
        "id": "tvmaze:2440496",
        "title": "91st Annual Christmas in Rockefeller Center",
        "season": 2023,
        "episode": 1,
        "released": "2023-11-29",
        "overview": "The 91st annual tree-lighting ceremony kicks off the holiday season with a dazzling display of musical talents, star-studded surprises, and the lighting of the Rockefeller Center Christmas tree; Emmy and Grammy Award winner Kelly Clarkson hosts.NBC News' TODAY co-anchors Savannah Guthrie, Hoda Kotb, Al Roker, and Craig Melvin co-host the highly anticipated holiday special. Before the special, an additional live hour broadcasts on various NBC channels and affiliates nationwide, starting at 7 p.m. ET and hosted by ACCESS Hollywood Host Mario Lopez and WNBC anchors Natalie Pasquarella and David Ushery."
      },
      {
        "id": "tvmaze:2698996",
        "title": "92nd Annual Christmas in Rockefeller Center",
        "season": 2024,
        "episode": 1,
        "released": "2024-12-04",
        "overview": "Hosted by Kelly Clarkson, the dazzling display of musical talents, star-studded surprises, and the lighting of the world's most famous Christmas tree remains one of the holiday season's most anticipated events. Audiences are treated to festive performances by an all-star lineup of musical guests featuring Backstreet Boys, Dan + Shay, Megan Hilty, Jennifer Hudson, Coco Jones, Little Big Town, RAYE, and Thalia. In line with tradition, the Radio City Rockettes, stars of the annual Christmas Spectacular at Radio City Music Hall, will wow viewers with a festive performance. NBC's \"TODAY\" anchors Savannah Guthrie, Hoda Kotb, Al Roker, and Craig Melvin will once again join the tree lighting for a special appearance."
      }
    ]
  }
}