{
  "meta": {
    "id": "tvmaze:52058",
    "type": "series",
    "name": "Celebrity Wheel of Fortune",
    "description": "Celebrity Wheel of Fortune welcomes celebrity contestants to come spin the world's most famous wheel and solve word puzzles for a chance to win up to one million dollars. All of the money won by the celebrity contestants will go to a charity of their choice.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/588/1470996.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/588/1470996.jpg",
    "videos": [
      {
        "id": "tvmaze:3364386",
        "title": "Sebastian Maniscalco, Meghan Trainor and Taye Diggs",
        "season": 6,
        "episode": 8,
        "released": "2025-12-11",
        "overview": "Celebrity contestants Sebastian Maniscalco, Meghan Trainor and Taye Diggs."
      },
      {
        "id": "tvmaze:1975054",
        "title": "Leslie Jones, Chandra Wilson, and Tony Hawk",
        "season": 1,
        "episode": 1,
        "released": "2021-01-07",
        "overview": "Participants include Leslie Jones, Chandra Wilson and Tony Hawk."
      },
      {
        "id": "tvmaze:2003182",
        "title": "Drew Carey, Teri Hatcher, and Chrissy Metz",
        "season": 1,
        "episode": 2,
        "released": "2021-01-14",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Drew Carey (playing for Greater Cleveland Food Bank), Teri Hatcher (playing for The People's Concern) and Chrissy Metz (playing for Blessings in a Backpack) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2003183",
        "title": "Rob Riggle, Joe Tessitore, and Jeannie Mai",
        "season": 1,
        "episode": 3,
        "released": "2021-01-21",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Rob Riggle (playing for Meals on Wheels), Joe Tessitore (playing for Wide Horizons for Children) and Jeannie Mai (playing for No Kid Hungry) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2005422",
        "title": "Constance Zimmer, Maria Menounos, and Yvette Nicole Brown",
        "season": 1,
        "episode": 4,
        "released": "2021-01-28",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Constance Zimmer (playing for WC Kitchen), Maria Menounos (playing for The Brain Trust &amp; UCLA Foundation) and Yvette Nicole Brown (playing for donorschoose.org) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2013776",
        "title": "Paul Reubens, Nicole Byer, And Joel McHale",
        "season": 1,
        "episode": 5,
        "released": "2021-02-11",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Paul Reubens (playing for Feeding America), Nicole Byer (playing for Okra Project) and Joel McHale (playing for Union Rescue Mission) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2018074",
        "title": "Jennie Garth, Karamo Brown, and Patton Oswalt",
        "season": 1,
        "episode": 6,
        "released": "2021-02-18",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Jennie Garth (playing for Central Illinois Food Bank), Karamo Brown (playing for Hollywood Food Coalition) and Patton Oswalt (playing for WC Kitchen) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2024425",
        "title": "Robert Herjavec, Chris Harrison, and Alfonso Ribeiro",
        "season": 1,
        "episode": 7,
        "released": "2021-02-25",
        "overview": "This week \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Robert Herjavec (playing for Seattle Union Gospel Mission), Chris Harrison (playing for Feeding America) and Alfonso Ribeiro (playing for No Kid Hungry) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2016351",
        "title": "Rachael Leigh Cook, Sherri Shepherd, and Kevin Nealon",
        "season": 1,
        "episode": 8,
        "released": "2021-03-04",
        "overview": "This week's season finale episode of \"Celebrity Wheel of Fortune\" welcomes celebrity contestants Rachael Leigh Cook (playing for Feeding America), Sherri Shepherd (playing for Reel Beauty) and Kevin Nealon (playing for The Store) as they compete for a chance to win up to $1 million for their chosen charity."
      },
      {
        "id": "tvmaze:2131646",
        "title": "Jason Alexander, Michael Mizanin and Cheryl Burke",
        "season": 2,
        "episode": 1,
        "released": "2021-09-26",
        "overview": "This episode's celebrity contestants include Jason Alexander (playing for Americares), Michael Mizanin (playing for Connor's Cure at the V Foundation for Cancer Research) and Cheryl Burke (playing for PhilDev)."
      },
      {
        "id": "tvmaze:2166454",
        "title": "Andy Richter, Vanilla Ice and Caroline Rhea",
        "season": 2,
        "episode": 2,
        "released": "2021-10-03",
        "overview": "This episode's celebrity contestants include Andy Richter (playing for Los Angeles Regional Food Bank), Vanilla Ice (playing for Little Smiles) and Caroline Rhea (playing for Dempsey Center)."
      },
      {
        "id": "tvmaze:2172305",
        "title": "Donny Osmond, Jeff Garlin and Amber Riley",
        "season": 2,
        "episode": 3,
        "released": "2021-10-10",
        "overview": "This episode's celebrity contestants include Donny Osmond (playing for Caesars Cares), Jeff Garlin (playing for F Cancer) and Amber Riley (playing for A Place Called Home)."
      },
      {
        "id": "tvmaze:2178724",
        "title": "Melissa Joan Hart, Tituss Burgess and Lacey Chabert",
        "season": 2,
        "episode": 4,
        "released": "2021-10-17",
        "overview": "This episode's celebrity contestants include Melissa Joan Hart (playing for Youth Villages), Tituss Burgess (playing for Broadway Dreams Foundation Corporation) and Lacey Chabert (playing for New Day Foundation For Families)."
      },
      {
        "id": "tvmaze:2189708",
        "title": "Anthony Michael Hall, Mario Cantone and Loni Love",
        "season": 2,
        "episode": 5,
        "released": "2021-10-31",
        "overview": "No tricks, only treats for Save the Children, The Actors Fund and Project Angel Food, who will each receive a minimum of $30,000 as Anthony Michael Hall, Mario Cantone and Loni Love spin the iconic Wheel on the Halloween episode."
      },
      {
        "id": "tvmaze:2194279",
        "title": "Joey Fatone, Wanya Morris and Shawn Stockman",
        "season": 2,
        "episode": 6,
        "released": "2021-11-07",
        "overview": "This episode's celebrity contestants include Joey Fatone (playing for Barnstable Brown Diabetes Center at the University of Kentucky), Wanya Morris (playing for Boys &amp; Girls Clubs of America) and Shawn Stockman (playing for Children's Hospital of Philadelphia)."
      },
      {
        "id": "tvmaze:2198980",
        "title": "Vivica A. Fox, Michelle Trachtenberg and Jason Mraz",
        "season": 2,
        "episode": 7,
        "released": "2021-11-14",
        "overview": "This episode's celebrity contestants include Vivica A. Fox (playing for Alexandria House &amp; Best Buddies International), Michelle Trachtenberg (playing for Good+Foundation) and Jason Mraz (playing for True Colors United)."
      },
      {
        "id": "tvmaze:2215453",
        "title": "Nia Vardalos, Jodie Sweetin and John Michael Higgins",
        "season": 2,
        "episode": 8,
        "released": "2021-12-05",
        "overview": "This episode's celebrity contestants include Nia Vardalos (playing for Hope 4 Kids), Jodie Sweetin (playing for Girls Inc.) and John Michael Higgins (playing for Actors Equity Foundation)."
      },
      {
        "id": "tvmaze:2218195",
        "title": "James Pickens, Jr., Brooke Burns and Johnny Weir",
        "season": 2,
        "episode": 9,
        "released": "2021-12-12",
        "overview": "This episode's celebrity contestants include James Pickens Jr. (playing for Hands for Hope aka Hands4Hope), Brooke Burns (playing for Just Keep Livin Foundation) and Johnny Weir (playing for Special Olympics)."
      },
      {
        "id": "tvmaze:2229503",
        "title": "Tara Lipinski, Raven-Symoné and Tori Spelling",
        "season": 2,
        "episode": 10,
        "released": "2022-01-02",
        "overview": "This episode's celebrity contestants include Tara Lipinski (playing for Amy Selkirk Breast Cancer Research Fund at the Baylor Scott &amp; White Dallas Foundation), Raven-Symoné (playing for Goodwill Southern California) and Tori Spelling (playing for Every Mother Counts)."
      },
      {
        "id": "tvmaze:2237036",
        "title": "Marcia Cross, Karl-Anthony Towns and Anthony Anderson",
        "season": 2,
        "episode": 11,
        "released": "2022-01-09",
        "overview": "This episode's celebrity contestants include Marcia Cross (playing for Stand Up To Cancer), Karl-Anthony Towns (playing for Vera Institute of Justice) and Anthony Anderson (playing for Anderson Family Foundation)."
      },
      {
        "id": "tvmaze:2237037",
        "title": "Curtis Stone, Haley Joel Osment and Tatyana Ali",
        "season": 2,
        "episode": 12,
        "released": "2022-01-23",
        "overview": "This episode's celebrity contestants include Curtis Stone (playing for Chrysalis), Haley Joel Osment (playing for Los Angeles Regional Food Bank) and Tatyana Ali (playing for Commonsense Childbirth)."
      },
      {
        "id": "tvmaze:2238622",
        "title": "Von Miller, Ali Wentworth and Laverne Cox",
        "season": 2,
        "episode": 13,
        "released": "2022-01-30",
        "overview": "This episode's celebrity contestants include Von Miller (playing for Von's Vision Foundation), Ali Wentworth (playing for Good+Foundation) and Laverne Cox (playing for Trans Justice Funding Project, an Initiative of the Tides Center)."
      },
      {
        "id": "tvmaze:2348076",
        "title": "Amanda Seales, Snoop Dogg and Mark Duplass",
        "season": 3,
        "episode": 1,
        "released": "2022-09-25",
        "overview": "Celebrity contestants Amanda Seales, Snoop Dogg and Mark Duplass."
      },
      {
        "id": "tvmaze:2389103",
        "title": "Tiki Barber, Lauren Ash and Jim Jefferies",
        "season": 3,
        "episode": 2,
        "released": "2022-09-29",
        "overview": "Celebrity contestants Tiki Barber, Lauren Ash and Jim Jefferies."
      },
      {
        "id": "tvmaze:2391994",
        "title": "Kristen Schaal, Kevin McKidd and Ron Funches",
        "season": 3,
        "episode": 3,
        "released": "2022-10-02",
        "overview": "Celebrity contestants Kristen Schaal, Kevin McKidd and Ron Funches."
      },
      {
        "id": "tvmaze:2393890",
        "title": "Nikki Glaser, Tig Notaro and Thomas Lennon",
        "season": 3,
        "episode": 4,
        "released": "2022-10-09",
        "overview": "Celebrity contestants Nikki Glaser, Tig Notaro and Thomas Lennon."
      },
      {
        "id": "tvmaze:2398512",
        "title": "Phil Rosenthal, Carla Hall and Jet Tila",
        "season": 3,
        "episode": 5,
        "released": "2022-10-16",
        "overview": "Celebrity contestants Phil Rosenthal, Carla Hall and Jet Tila."
      },
      {
        "id": "tvmaze:2404115",
        "title": "Francia Raisa, Joel Madden, Jenifer Lewis",
        "season": 3,
        "episode": 6,
        "released": "2022-10-23",
        "overview": "Celebrity contestants Francia Raisa, Joel Madden and Jenifer Lewis."
      },
      {
        "id": "tvmaze:2411024",
        "title": "Kate Flannery, Steve Agee and Austin Creed",
        "season": 3,
        "episode": 7,
        "released": "2022-10-30",
        "overview": "Celebrity contestants Kate Flannery, Steve Agee and Austin Creed."
      },
      {
        "id": "tvmaze:2413961",
        "title": "Jaime Camil, Michael Rapaport and June Diane Raphael",
        "season": 3,
        "episode": 8,
        "released": "2022-11-06",
        "overview": "Celebrity contestants Jaime Camil, Michael Rapaport and June Diane Raphael."
      },
      {
        "id": "tvmaze:2417046",
        "title": "Paul Scheer, Luenell and Mary Lynn Rajskub",
        "season": 3,
        "episode": 9,
        "released": "2022-11-13",
        "overview": "Paul Scheer plays for SELAH Neighborhood Homeless Coalition, Luenell plays for Make-A-Wish and Mary Lynn Rajskub plays for Harvest Home LA."
      },
      {
        "id": "tvmaze:2428967",
        "title": "RuPaul, Gayle King and Julie Bowen",
        "season": 3,
        "episode": 10,
        "released": "2022-12-04",
        "overview": "Celebrity contestants RuPaul, Gayle King and Julie Bowen."
      },
      {
        "id": "tvmaze:2419820",
        "title": "Sasheer Zamata, Jack Black and Kal Penn",
        "season": 3,
        "episode": 11,
        "released": "2022-12-06",
        "overview": "Jack Black plays for 24th Street Theatre, Kal Penn plays for Myrtle Avenue Revitalization Project and Sasheer Zamata plays for SELAH Neighborhood Homeless Coalition."
      },
      {
        "id": "tvmaze:2428968",
        "title": "London Hughes, Fortune Feimster and Bobby Berk",
        "season": 3,
        "episode": 12,
        "released": "2022-12-13",
        "overview": "Celebrity contestants London Hughes, Fortune Feimster and Bobby Berk."
      },
      {
        "id": "tvmaze:2443360",
        "title": "Janelle James, Sheryl Lee Ralph and Chris Perfetti",
        "season": 3,
        "episode": 13,
        "released": "2023-01-04",
        "overview": "Janelle James plays for Innocence Project; Sheryl Lee Ralph plays for Donors Choose; and Chris Perfetti plays for GLSEN."
      },
      {
        "id": "tvmaze:2511075",
        "title": "Vanna White, Ken Jennings and Mayim Bialik",
        "season": 3,
        "episode": 14,
        "released": "2023-05-10",
        "overview": "Co-host Vanna White competes against Jeopardy! hosts Ken Jennings and Mayim Bialik; Pat Sajak's daughter Maggie fills in for Vanna at the board."
      },
      {
        "id": "tvmaze:2627424",
        "title": "Brendan Hunt, Melissa Villaseñor and Joe Buck",
        "season": 4,
        "episode": 1,
        "released": "2023-09-27",
        "overview": "Celebrity contestants Brendan Hunt, Melissa Villaseñor and Joe Buck."
      },
      {
        "id": "tvmaze:2642206",
        "title": "Kel Mitchell, Kim Fields and Penn Jillette",
        "season": 4,
        "episode": 2,
        "released": "2023-10-04",
        "overview": "Celebrity contestants Kel Mitchell, Kim Fields and Penn Jillette."
      },
      {
        "id": "tvmaze:2642207",
        "title": "Rashad Jennings, Marcellus Wiley and Jared Allen",
        "season": 4,
        "episode": 3,
        "released": "2023-10-18",
        "overview": "Celebrity contestants Rashad Jennings, Marcellus Wiley and Jared Allen."
      },
      {
        "id": "tvmaze:2642208",
        "title": "Gabriel Iglesias, Noah Mills and Danielle Pinnock",
        "season": 4,
        "episode": 4,
        "released": "2023-10-25",
        "overview": "Celebrity contestants Gabriel Iglesias, Noah Mills and Danielle Pinnock."
      },
      {
        "id": "tvmaze:2642209",
        "title": "Natasha Leggero, Roy Wood Jr. and Kyle Brandt",
        "season": 4,
        "episode": 5,
        "released": "2023-11-15",
        "overview": "Celebrity contestants Natasha Leggero, Roy Wood Jr. and Kyle Brandt."
      },
      {
        "id": "tvmaze:2642210",
        "title": "Tim Gunn, Debbie Gibson and Luis Guzman",
        "season": 4,
        "episode": 6,
        "released": "2023-11-29",
        "overview": "Celebrity contestants Tim Gunn, Debbie Gibson and Luis Guzman."
      },
      {
        "id": "tvmaze:2642211",
        "title": "Lauren Lapkus, Ego Nwodim and Jeff Ross",
        "season": 4,
        "episode": 7,
        "released": "2023-12-06",
        "overview": "Celebrity contestants spin to win for charity with Lauren Lapkus (Crohn's &amp; Colitis Foundation), Ego Nwodim (Seen&amp;Heard) and Jeff Ross (Meals on Wheels America)."
      },
      {
        "id": "tvmaze:2642212",
        "title": "Lil Rel Howery, Paula Abdul and Matt Rogers",
        "season": 4,
        "episode": 8,
        "released": "2023-12-13",
        "overview": "Celebrity contestants Lil Rel Howery, Paula Abdul and Matt Rogers."
      },
      {
        "id": "tvmaze:2642213",
        "title": "Sarah Levy, Christian Siriano and Krysten Ritter",
        "season": 4,
        "episode": 9,
        "released": "2024-05-06",
        "overview": "Celebrity contestants spin to win for charity with Sarah Levy, Christian Siriano and Krysten Ritter."
      },
      {
        "id": "tvmaze:2643736",
        "title": "Neil deGrasse Tyson, Robin Thede and Tony Hale",
        "season": 4,
        "episode": 10,
        "released": "2024-05-13",
        "overview": "Celebrity contestants spin to win for charity with Neil deGrasse Tyson, Robin Thede and Tony Hale."
      },
      {
        "id": "tvmaze:3187134",
        "title": "Joe Manganiello, Tiffany Haddish and Matt Walsh",
        "season": 5,
        "episode": 1,
        "released": "2025-04-30",
        "overview": "Celebrity contestants Joe Manganiello, Tiffany Haddish and Matt Walsh."
      },
      {
        "id": "tvmaze:3187190",
        "title": "Wendi McLendon-Covey, Ben Schwartz and Adam Pally",
        "season": 5,
        "episode": 2,
        "released": "2025-05-07",
        "overview": "Celebrity contestants Wendi McLendon-Covey, Ben Schwartz and Adam Pally."
      },
      {
        "id": "tvmaze:3187161",
        "title": "Rainn Wilson, Ellie Kemper and Oscar Nuñez",
        "season": 5,
        "episode": 3,
        "released": "2025-05-14",
        "overview": "Celebrity contestants Rainn Wilson, Ellie Kemper and Oscar Nuñez."
      },
      {
        "id": "tvmaze:3187162",
        "title": "Katharine McPhee, Andrew Rannells and Josh Gad",
        "season": 5,
        "episode": 4,
        "released": "2025-05-20",
        "overview": "Celebrity contestants Katharine McPhee, Andrew Rannells and Josh Gad."
      },
      {
        "id": "tvmaze:3225697",
        "title": "Sam Richardson, Regina Hall and Randall Park",
        "season": 5,
        "episode": 5,
        "released": "2025-05-21",
        "overview": "Celebrity contestants Sam Richardson, Regina Hall and Randall Park."
      },
      {
        "id": "tvmaze:3232674",
        "title": "Ilana Glazer, Chelsea Peretti and Moshe Kasher",
        "season": 5,
        "episode": 6,
        "released": "2025-05-27",
        "overview": "Celebrity contestants Ilana Glazer, Chelsea Peretti and Moshe Kasher."
      },
      {
        "id": "tvmaze:3232675",
        "title": "Dulcé Sloan, Jessica Capshaw and Pete Holmes",
        "season": 5,
        "episode": 7,
        "released": "2025-05-28",
        "overview": "Celebrity contestants Dulcé Sloan, Jessica Capshaw and Pete Holmes."
      },
      {
        "id": "tvmaze:3241570",
        "title": "Justin Long, Rachael Harris and Cameron Brink",
        "season": 5,
        "episode": 8,
        "released": "2025-06-03",
        "overview": "Celebrity contestants Justin Long, Rachael Harris and Cameron Brink."
      },
      {
        "id": "tvmaze:3241571",
        "title": "Renée Elise Goldsberry, Bernadette Peters and Jesse Tyler Ferguson",
        "season": 5,
        "episode": 9,
        "released": "2025-06-10",
        "overview": "Celebrity contestants Renée Elise Goldsberry, Bernadette Peters and Jesse Tyler Ferguson."
      },
      {
        "id": "tvmaze:3305505",
        "title": "Jenna Johnson Chmerkovskiy, Derek Hough and Bruno Tonioli",
        "season": 6,
        "episode": 1,
        "released": "2025-09-26",
        "overview": "Celebrities Jenna Johnson Chmerkovskiy, Derek Hough and Bruno Tonioli compete."
      },
      {
        "id": "tvmaze:3348555",
        "title": "Joey McIntyre, Retta, Oliver Hudson",
        "season": 6,
        "episode": 2,
        "released": "2025-10-03",
        "overview": "Celebrity contestants Joey McIntyre, Retta and Oliver Hudson."
      },
      {
        "id": "tvmaze:3364381",
        "title": "Katie Lowes, Malin Akerman, Jaime Ray Newman",
        "season": 6,
        "episode": 3,
        "released": "2025-10-17",
        "overview": "Celebrity contestants Katie Lowes, Malin Akerman and Jaime Ray Newman."
      },
      {
        "id": "tvmaze:3364382",
        "title": "Alex Borstein, Paul Feig, Michael Zegen",
        "season": 6,
        "episode": 4,
        "released": "2025-10-24",
        "overview": "Celebrity contestants Alex Borstein, Paul Feig and Michael Zegen."
      },
      {
        "id": "tvmaze:3364383",
        "title": "Candace Parker, Dwight Howard and Rich Eisen",
        "season": 6,
        "episode": 5,
        "released": "2025-10-31",
        "overview": "Celebrity contestants Candace Parker, Dwight Howard and Rich Eisen."
      },
      {
        "id": "tvmaze:3364384",
        "title": "Big Sean, Tori Kelly and 2 Chainz",
        "season": 6,
        "episode": 6,
        "released": "2025-11-07",
        "overview": "Celebrity contestants Big Sean, Tori Kelly and 2 Chainz."
      },
      {
        "id": "tvmaze:3364385",
        "title": "Liza Koshy, Paul Walter Hauser, Phoebe Robinson",
        "season": 6,
        "episode": 7,
        "released": "2025-11-14",
        "overview": "Celebrity contestants Liza Koshy, Paul Walter Hauser and Phoebe Robinson."
      },
      {
        "id": "tvmaze:3364386",
        "title": "Sebastian Maniscalco, Meghan Trainor and Taye Diggs",
        "season": 6,
        "episode": 8,
        "released": "2025-12-11",
        "overview": "Celebrity contestants Sebastian Maniscalco, Meghan Trainor and Taye Diggs."
      },
      {
        "id": "tvmaze:3364387",
        "title": "Max Greenfield, D'Arcy Carden and Timothy Simons",
        "season": 6,
        "episode": 9,
        "released": "2026-01-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3426513",
        "title": "TBA",
        "season": 6,
        "episode": 10,
        "released": "2026-01-16",
        "overview": ""
      }
    ]
  }
}