{
  "meta": {
    "id": "tvmaze:45593",
    "type": "series",
    "name": "1000-lb Sisters",
    "description": "Tipping the scales at over 1,000 pounds combined, the Slaton sisters try to lose enough weight to qualify for and undergo life-changing bariatric surgery and pursue their dreams.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/564/1410096.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/564/1410096.jpg",
    "videos": [
      {
        "id": "tvmaze:3458017",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2026-01-06",
        "overview": ""
      },
      {
        "id": "tvmaze:1783515",
        "title": "Meet the Slaton Sisters",
        "season": 1,
        "episode": 1,
        "released": "2020-01-01",
        "overview": "The Slaton's are larger-than-life sisters who have always relied on each other and food for support. Amy, age 31, is desperate to have children, but hasn't been able to due to her weight. While Tammy, age 32, is one step away from being bedridden."
      },
      {
        "id": "tvmaze:1785372",
        "title": "1,000 Pounds to Freedom",
        "season": 1,
        "episode": 2,
        "released": "2020-01-08",
        "overview": "Amy and Tammy go to Atlanta to meet Dr. Procter to discuss weight loss surgery. When they arrive, Dr. Procter gives Tammy a hefty weight loss goal before he will approve her for surgery, meanwhile the Dietician has more bad news for Amy."
      },
      {
        "id": "tvmaze:1785373",
        "title": "Breaking Point",
        "season": 1,
        "episode": 3,
        "released": "2020-01-15",
        "overview": "Amy and Tammy eagerly begin their weight loss journey. Sticking to their diets is a matter of life or death but proves to be a real struggle. The pressure to reach their goals culminates in a huge fight that threatens their diets and relationship."
      },
      {
        "id": "tvmaze:1790446",
        "title": "A House Divided",
        "season": 1,
        "episode": 4,
        "released": "2020-01-22",
        "overview": "After a stressful first month of dieting, the sisters head back to Atlanta for their one-month check in with Dr. Procter to find out if they are on the right path to their weight goals. The results force Amy to make a difficult decision."
      },
      {
        "id": "tvmaze:1792778",
        "title": "Wedding and Weigh-ins",
        "season": 1,
        "episode": 5,
        "released": "2020-01-29",
        "overview": "Amy decides to have a real wedding ceremony because if she gets approved for surgery, she's afraid she may not survive. After the wedding, the sisters head to Atlanta hoping for a life-changing final weigh-in."
      },
      {
        "id": "tvmaze:1793089",
        "title": "Under the Knife",
        "season": 1,
        "episode": 6,
        "released": "2020-02-05",
        "overview": "Amy undergoes gastric bypass surgery to change her life, but endangers herself by not sticking to the post-op diet. Tammy seeks support from her love interest, Jerry. Two months later, the sisters reveal the changes they've made."
      },
      {
        "id": "tvmaze:1990471",
        "title": "Life-Altering News",
        "season": 2,
        "episode": 1,
        "released": "2021-01-04",
        "overview": "While Amy reaps the benefits of weight-loss surgery, her sister Tammy worries that she gained weight during quarantine. A visit to urgent care gives Amy life-changing news. Tammy's family confronts her over her health."
      },
      {
        "id": "tvmaze:1999294",
        "title": "Tippin' the Scales",
        "season": 2,
        "episode": 2,
        "released": "2021-01-11",
        "overview": "The Slatons head back to Atlanta to see Dr. Proctor. Amy is worried about dropping the news that she got pregnant so soon after surgery, against doctor's orders. Tammy returns knowing she's gained all the weight back."
      },
      {
        "id": "tvmaze:2006552",
        "title": "Wake-Up Call",
        "season": 2,
        "episode": 3,
        "released": "2021-01-18",
        "overview": "Tammy and Amy blame each other for their issues in therapy. When Tammy gets devastating news from Dr. Procter, her brother Chris makes a life-altering decision. A very pregnant Amy can't stop overeating, and the results are disastrous."
      },
      {
        "id": "tvmaze:2012464",
        "title": "A Fork in the Road",
        "season": 2,
        "episode": 4,
        "released": "2021-01-25",
        "overview": "The Slatons are shocked by the cause of Amy's trip to the emergency room. Plus, Tammy must step on the scales again after a month of not sticking to her diet."
      },
      {
        "id": "tvmaze:2016398",
        "title": "Dropping Bombs",
        "season": 2,
        "episode": 5,
        "released": "2021-02-01",
        "overview": "Tammy's new doctor gives her what feels like an insurmountable weight goal, but it's not the only challenge she's facing. Amy and Michael drop a bomb that changes everything."
      },
      {
        "id": "tvmaze:2022255",
        "title": "There's Something About Jerry",
        "season": 2,
        "episode": 6,
        "released": "2021-02-08",
        "overview": "Tammy's boyfriend, Jerry, comes to visit just in time to celebrate the sisters' favourite holiday: Halloween. Tammy's sister Misty questions Jerry's intentions. Amy has to face another weigh-in after her concerning appointment with Dr. Procter."
      },
      {
        "id": "tvmaze:2028961",
        "title": "Jerry Bites Back",
        "season": 2,
        "episode": 7,
        "released": "2021-02-15",
        "overview": "Amy counts down the days until her delivery with an eccentric photo shoot, while the family worries that Jerry is derailing Tammy's diet. Tammy reveals her big secret to Jerry."
      },
      {
        "id": "tvmaze:2031632",
        "title": "Everybody Hurts",
        "season": 2,
        "episode": 8,
        "released": "2021-02-22",
        "overview": "When Tammy and Amy go see a psychic, they both get disturbing news. The family rallies together, and they are willing to try anything to help Tammy lose weight. Amy must face her worst fears when she's rushed to the ER."
      },
      {
        "id": "tvmaze:2037312",
        "title": "Labor of Love",
        "season": 2,
        "episode": 9,
        "released": "2021-03-01",
        "overview": "Amy gets unsettling news about the birth of her baby as her high-risk pregnancy has last-minute complications; with their next weigh-in ahead of them, Chris and Tammy are cautiously optimistic until Tammy steps on the scale."
      },
      {
        "id": "tvmaze:2040867",
        "title": "Do or Die",
        "season": 2,
        "episode": 10,
        "released": "2021-03-08",
        "overview": "Recovering from the coronavirus, Tammy now needs constant oxygen, and her weight spirals; Chris faces his final weigh-in; Amy makes a big decision about her future; with Tammy's romance heating up, the family takes matters into its own hands."
      },
      {
        "id": "tvmaze:2205916",
        "title": "Welcome to Rehab",
        "season": 3,
        "episode": 1,
        "released": "2021-11-15",
        "overview": "Tammy makes a life-altering decision. Amy finally gets a taste of the life she's always wanted, and an emergency surgery has repercussions for Chris."
      },
      {
        "id": "tvmaze:2213976",
        "title": "Goodbye Freedom",
        "season": 3,
        "episode": 2,
        "released": "2021-11-22",
        "overview": "Tammy is back from rehab, and Amy comes to a drastic decision regarding her sister. With his bariatric surgery on the line, Chris tries to shed weight."
      },
      {
        "id": "tvmaze:2217324",
        "title": "Tammy's New Squeeze",
        "season": 3,
        "episode": 3,
        "released": "2021-11-29",
        "overview": "Amy is upset that Tammy's new nurse isn't pushing her enough. Tammy has started slacking, and the family worries about what could be the cause. Chris and Tammy clash when he confronts her about the new man in her life."
      },
      {
        "id": "tvmaze:2221111",
        "title": "Heavy Hoarders",
        "season": 3,
        "episode": 4,
        "released": "2021-12-06",
        "overview": "When Amy tries to get her house in order, she must confront some demons from her past. Tammy admits to a few cheat days just before her first doctor's appointment since rehab. Chris steps on the scale that could change his life."
      },
      {
        "id": "tvmaze:2228364",
        "title": "Pushed Too Far",
        "season": 3,
        "episode": 5,
        "released": "2021-12-13",
        "overview": "After Tammy's bad doctor's appointment, Chris comes down on Amy for enabling her sister. The family worries Tammy's new boyfriend is leading her down the wrong path. Amy's idea of having a meet and greet to help Tammy has its own set of problems."
      },
      {
        "id": "tvmaze:2233297",
        "title": "Man vs. Scale",
        "season": 3,
        "episode": 6,
        "released": "2021-12-20",
        "overview": "Tammy must see a new therapist, but things don't go the way she'd hoped. Amy wants to lose her excess skin, but she gets bad news at the plastic surgeon's office. Chris faces the scale. If he's below 400 pounds, his surgery is on."
      },
      {
        "id": "tvmaze:2237733",
        "title": "The Moment of Truth",
        "season": 3,
        "episode": 7,
        "released": "2021-12-27",
        "overview": "Chris faces a weigh-in to get approved for bariatric surgery; with Tammy's weight at a standstill, Amy and Michael make a life-altering decision; the family's fears about Tammy's choice in partners are realized."
      },
      {
        "id": "tvmaze:2241263",
        "title": "A Very Slaton Vacation",
        "season": 3,
        "episode": 8,
        "released": "2022-01-03",
        "overview": "While Chris makes progress after his surgery, Tammy gets discouraging news; Amy plans a unique bash for Tammy's 35th birthday; the family excitedly plan their first vacation together with all five siblings, but concerns rise about Tammy's mobility."
      },
      {
        "id": "tvmaze:2245069",
        "title": "Smoky Mountain Meltdown",
        "season": 3,
        "episode": 9,
        "released": "2022-01-10",
        "overview": "The family vacation starts off terribly when Tammy refuses to enter the cabin; Chris hopes he's lost enough weight to fulfill a life-long dream."
      },
      {
        "id": "tvmaze:2248050",
        "title": "Moving Up and Partying Down",
        "season": 3,
        "episode": 10,
        "released": "2022-01-17",
        "overview": "After a rift on the family vacation, Amy returns home and drops a bomb on Tammy. While Amy focuses on her new life, Tammy makes a decision that takes her even further away from her weight-loss goals."
      },
      {
        "id": "tvmaze:2255005",
        "title": "End of an Era",
        "season": 3,
        "episode": 11,
        "released": "2022-01-24",
        "overview": "Amy and Michael finally move out of the duplex, while Tammy's partying phase takes a turn for the worse. Amanda tries to get through to her sister before it's too late, and Amy's in for a rude awakening at her annual check up with Dr. Procter."
      },
      {
        "id": "tvmaze:2260476",
        "title": "Never Say Never",
        "season": 3,
        "episode": 12,
        "released": "2022-01-31",
        "overview": "Amy sees a pediatric dietitian and faces some difficult truths about Gage's diet. Dr. Smith makes a house call and confronts Tammy about her partying lifestyle. While on the road with Chris, Tammy's health hits a dangerous low point."
      },
      {
        "id": "tvmaze:2431948",
        "title": "The Sweet and Sour Life",
        "season": 4,
        "episode": 1,
        "released": "2023-01-17",
        "overview": "Having survived yet another brush with death, Tammy recovers at rehab, but a new scare threatens her life; the family adjusts to life without Tammy; Amy's big surprise stuns everyone."
      },
      {
        "id": "tvmaze:2469140",
        "title": "Can't Have Your Cake and Eat it Too",
        "season": 4,
        "episode": 2,
        "released": "2023-01-24",
        "overview": "Tammy's seemingly good progress inspires Amy to visit, reuniting the siblings for the first time in months; Amanda begins a new chapter in her life; Amy learns she's at risk of serious complications if she doesn't get her eating under control."
      },
      {
        "id": "tvmaze:2474862",
        "title": "I Don't Want to Taco Bout It",
        "season": 4,
        "episode": 3,
        "released": "2023-01-31",
        "overview": "Tammy hits a tipping point at rehab, and more bad news from back home sends her into a downward spiral; Chris gets a reality check during a check in with Dr. Smith; the family says goodbye to a beloved family member."
      },
      {
        "id": "tvmaze:2479498",
        "title": "Icing on the Cake",
        "season": 4,
        "episode": 4,
        "released": "2023-02-07",
        "overview": "After finding out Tammy's been robbed, Misty and Amanda visit to break the news in person; while Chris pushes ahead toward his surgery goal, Amy has a setback and is rushed to the ER; with her sisters by her side, Tammy faces the results of her weigh in."
      },
      {
        "id": "tvmaze:2484071",
        "title": "Greatest Thing Since Sliced Bread",
        "season": 4,
        "episode": 5,
        "released": "2023-02-14",
        "overview": "Tammy struggles to cope after surviving a near-death experience; Amy realizes being an overweight mom may prove to be too much; Chris is desperate to get rid of excess skin; Amanda offloads some dead weight of her own."
      },
      {
        "id": "tvmaze:2488162",
        "title": "A Lot of Cooks in the Kitchen",
        "season": 4,
        "episode": 6,
        "released": "2023-02-21",
        "overview": "Amy feels from giving birth and finding out Michael has COVID-19; after 20 years, Chris gets back on the horse; Tammy is almost at the finish line for surgery approval, but worries she won't pass her final assessments."
      },
      {
        "id": "tvmaze:2491567",
        "title": "Proof Is in the Pudding",
        "season": 4,
        "episode": 7,
        "released": "2023-02-28",
        "overview": "After years of struggling, Tammy finally has her weight loss surgery, but things are not as straightforward as expected; Amy meets with Dr. Procter and gets an ambitious weight loss goal."
      },
      {
        "id": "tvmaze:2491568",
        "title": "Forbidden Fruit",
        "season": 4,
        "episode": 8,
        "released": "2023-03-07",
        "overview": "Tammy wants to come home, but a setback causes a major blowup between her and the family; when a new man enters Tammy's life, all bets are off; Amy feels the stress of motherhood; Amanda contemplates a new chapter."
      },
      {
        "id": "tvmaze:2498360",
        "title": "Walkin' on Eggshells",
        "season": 4,
        "episode": 9,
        "released": "2023-03-14",
        "overview": "Tammy announces her engagement to the family and reveals that her big day is only two weeks away; Amy takes up maid of honor duties; the family wonders if there's another reason Tammy is rushing down the aisle."
      },
      {
        "id": "tvmaze:2498361",
        "title": "Apple of My Eye",
        "season": 4,
        "episode": 10,
        "released": "2023-03-21",
        "overview": "It's Tammy's wedding day; Amanda and Misty take Caleb to task over his true intentions; Amy struggles to get the venue decorated and keep her emotions in check; a wardrobe malfunction and a case of cold feet threaten to derail the nuptials."
      },
      {
        "id": "tvmaze:2688195",
        "title": "Bringing Home the Bacon",
        "season": 5,
        "episode": 1,
        "released": "2023-12-12",
        "overview": "As Tammy heads home after 14 months in rehab, she's forced to make the most difficult decision of her life. Fed up with not having help, Amy feels her marriage is starting to unravel. Amanda and Misty reveal they're getting bariatric surgery."
      },
      {
        "id": "tvmaze:2702919",
        "title": "Fork You! I'm Done!",
        "season": 5,
        "episode": 2,
        "released": "2023-12-19",
        "overview": "Tammy hosts a housewarming party and has a few choice words for her mom; Amy's world is turned upside down when she finally confronts Michael over his lack of help with raising their two boys; meanwhile, Caleb hasn't been honest with Tammy."
      },
      {
        "id": "tvmaze:2702920",
        "title": "Well-Done and Over With",
        "season": 5,
        "episode": 3,
        "released": "2023-12-26",
        "overview": "After the blowout with Michael, Amy makes the hardest decision of her life; Chris and Tammy have a long-overdue appointment with Dr. Smith; worried about surgery, Amanda and Misty do a last-minute cleanse to sweat out nicotine."
      },
      {
        "id": "tvmaze:2702921",
        "title": "The Grapes of Wrath",
        "season": 5,
        "episode": 4,
        "released": "2024-01-02",
        "overview": "Amanda and Misty get big news and take a major step in their health journey; Amy and Tammy blow off some steam; Amy gets some devastating news from her lawyer that sends her reeling."
      },
      {
        "id": "tvmaze:2702922",
        "title": "The Custard-y Battle",
        "season": 5,
        "episode": 5,
        "released": "2024-01-09",
        "overview": "Amy faces Michael in court at their first divorce hearing; Chris finds an unusual way to get healthy food; Tammy explores the possibility of having kids; Tammy heads to rehab for a recon mission after learning some information about Caleb."
      },
      {
        "id": "tvmaze:2702923",
        "title": "Fried, Cried and Tried",
        "season": 5,
        "episode": 6,
        "released": "2024-01-16",
        "overview": "Caleb surprises Tammy with a romantic dinner date, but it goes south when Tammy learns what's on the menu; the Slatons attend a Zumba class together, but Amy's lack of self-care leads to a meltdown that has the whole family feeling déjà vu."
      },
      {
        "id": "tvmaze:2732622",
        "title": "Dill With It",
        "season": 5,
        "episode": 7,
        "released": "2024-01-23",
        "overview": "The family preps for their very first beach vacation, and Tammy hits some major milestones; while everyone flies, Amy opts for a nine-hour car ride which leaves her and the boys cranky; Chris gives Amy some tough love."
      },
      {
        "id": "tvmaze:2739075",
        "title": "Boiling Point",
        "season": 5,
        "episode": 8,
        "released": "2024-01-30",
        "overview": "Amanda reels after leaving dinner; Chris crosses something off his bucket list; Tammy tries to have fun but misses Caleb; fed up with her siblings critiquing her, Amy reaches her boiling point and explodes."
      },
      {
        "id": "tvmaze:2739076",
        "title": "Sunflower",
        "season": 5,
        "episode": 9,
        "released": "2024-02-06",
        "overview": "Amy is ashamed of her behavior in Florida and wants to make amends, but she worries Amanda won't accept her apology; when Tammy gets some devastating news, her whole world is turned upside down, and her family rallies behind her in support."
      },
      {
        "id": "tvmaze:3001721",
        "title": "Life is Going to Be Gouda",
        "season": 6,
        "episode": 1,
        "released": "2024-10-08",
        "overview": "Tammy takes small steps towards independence, Amy moves home but struggles with ghosts of the past, the sisters get new looks to go with their new attitude, and an upcoming Dr. Smith appointment has everyone on edge."
      },
      {
        "id": "tvmaze:3013756",
        "title": "Recipe for Disaster",
        "season": 6,
        "episode": 2,
        "released": "2024-10-15",
        "overview": "Dr. Smith holds an all-sibling weigh-in appointment, and the moment of truth is a tough pill to swallow for some. With her recent makeover, Amy looks ahead to her new life. Tammy and Amanda's long-running sibling feud reaches new heights."
      },
      {
        "id": "tvmaze:3020186",
        "title": "War and Peas",
        "season": 6,
        "episode": 3,
        "released": "2024-10-22",
        "overview": "Tammy needs a new place to live but finds more problems than solutions; Amy makes a peace offering with some questionable ingredients."
      },
      {
        "id": "tvmaze:3023930",
        "title": "I Candy-cane't",
        "season": 6,
        "episode": 4,
        "released": "2024-10-29",
        "overview": "A time for cheer is met with jeer as the entire family remains divided during Christmas, and Amy celebrates her first Christmas as a single mom and decides to try on heels for the first time ever."
      },
      {
        "id": "tvmaze:3024835",
        "title": "Carbe Diem",
        "season": 6,
        "episode": 5,
        "released": "2024-11-12",
        "overview": "Chris gears up for his upcoming appointment with a plastic surgeon and encourages Tammy to tag along; Amy whips up dinner for the whole family; dinner gets thrown into chaos when one of the siblings drops some big news."
      },
      {
        "id": "tvmaze:3030893",
        "title": "Limo Beans",
        "season": 6,
        "episode": 6,
        "released": "2024-11-19",
        "overview": "Tammy has her heart set on skin removal but is met with a roadblock; Amy works on rebuilding her self-esteem; Chris and Misty get closer to their goals, but Amanda falls behind."
      },
      {
        "id": "tvmaze:3046281",
        "title": "Turning a New Beef",
        "season": 6,
        "episode": 7,
        "released": "2024-11-26",
        "overview": "Tammy and Amy beef over their big night out, Chris and Amy see a genealogist and the results make the family consider taking a trip overseas, and the family decides to do a 5k but tempers quickly flare."
      },
      {
        "id": "tvmaze:3047119",
        "title": "Peas Out, Yo!",
        "season": 6,
        "episode": 8,
        "released": "2024-12-03",
        "overview": "Everyone prepares for London amid another flare up between Tammy and Amanda; Chris and Tammy visit Dr. Turner hoping to get approved for skin removal surgery; the family participates in a 5K and Amanda makes her move to Florida."
      },
      {
        "id": "tvmaze:3047121",
        "title": "Bangers and Clash",
        "season": 6,
        "episode": 9,
        "released": "2024-12-10",
        "overview": "The family arrives in London for their first international vacation and learns even more surprising news about their ancestry; Tammy is pushed to her physical limits; a major meltdown puts the rest of the trip in jeopardy."
      },
      {
        "id": "tvmaze:3047122",
        "title": "Nothing is Impastable",
        "season": 6,
        "episode": 10,
        "released": "2024-12-17",
        "overview": "The family deals with the aftermath of Amy's meltdown. Back home, Chris gets skin removal surgery. Amy has a risqué photoshoot. Tammy finds doctors who can do her skin removal surgery but some test results force Tammy to confess a long-held secret."
      },
      {
        "id": "tvmaze:3084755",
        "title": "Clapback",
        "season": 6,
        "episode": 11,
        "released": "2024-12-17",
        "overview": "Tammy, Amy and their siblings sit down to watch some of their most memorable clips from the past seasons and clapback at comments from viewers."
      },
      {
        "id": "tvmaze:3184816",
        "title": "Thinking With Her Vajayjay",
        "season": 7,
        "episode": 1,
        "released": "2025-04-15",
        "overview": "Tammy and Amy are back—facing life's most unexpected hurdles, including navigating new romances and health hurdles."
      },
      {
        "id": "tvmaze:3202543",
        "title": "Smitten Like a New York Kitten",
        "season": 7,
        "episode": 2,
        "released": "2025-04-22",
        "overview": "Tammy gets a push to reveal her personal life to her family. Amy's life gets even more chaotic, pushing her to make a rash decision. Chris and his wife make a big decision about her health."
      },
      {
        "id": "tvmaze:3202544",
        "title": "Chewy Ca(ra)mel",
        "season": 7,
        "episode": 3,
        "released": "2025-04-29",
        "overview": "Tammy reveals to her sisters that she's dating a woman and their reaction surprises her. Chris and Tammy check-in on their skin removal progress, and a harrowing moment at the petting zoo sees Amy's life turned upside down."
      },
      {
        "id": "tvmaze:3214274",
        "title": "The Big Camel in the Room",
        "season": 7,
        "episode": 4,
        "released": "2025-05-06",
        "overview": "Amy reels emotionally and physically from her camel bite and arrest. Chris explores a passion project, and Tammy expands her circle and fulfills a childhood dream."
      },
      {
        "id": "tvmaze:3214777",
        "title": "Keep the Eye on the Tiger",
        "season": 7,
        "episode": 5,
        "released": "2025-05-13",
        "overview": "Tammy takes a big step forward in her relationship with Andrea; with Amy's court date looming, her boyfriend has a life-altering surprise up his sleeve that leaves everyone speechless."
      },
      {
        "id": "tvmaze:3231545",
        "title": "She's Got This Mantality",
        "season": 7,
        "episode": 6,
        "released": "2025-05-20",
        "overview": "The older siblings are stunned when they hear about Amy's new life update. Chris, Misty and Tammy fulfill a lifelong dream and go ziplining. Amy finally has her day in court."
      },
      {
        "id": "tvmaze:3247837",
        "title": "I'm Going to Police-Fully Duck Out",
        "season": 7,
        "episode": 7,
        "released": "2025-06-03",
        "overview": "Amy faces the judge for the final time. Tammy addresses Amy about her weight gain. The family heads to Pittsburgh for Tammy's skin removal surgery but while Tammy goes under the knife, the siblings go head-to-head in the waiting room."
      },
      {
        "id": "tvmaze:3254762",
        "title": "Her Turkey Gobler's Gone",
        "season": 7,
        "episode": 8,
        "released": "2025-06-10",
        "overview": "A missing tool in the operating room causes delays to Tammy's extreme skin removal; Amy decides she's had enough and makes a bold move; Tammy and Amy exchange words that may cause irrevocable changes to their relationship."
      },
      {
        "id": "tvmaze:3280409",
        "title": "We Be Trippin'",
        "season": 7,
        "episode": 9,
        "released": "2025-06-17",
        "overview": "Amy and Tammy revisit the junkyard with their siblings. After 6 years of dieting, significant weight loss and surgery, they are encouraged for what they've achieved. After encouragement from Tammy, Amy agrees to get back on track and lose weight."
      }
    ]
  }
}