{
  "meta": {
    "id": "tvmaze:85252",
    "type": "series",
    "name": "The Great Escapers",
    "description": "Ever wished you could go on holiday with the cast of Coronation Street, I'm A Celebrity…, The Chase or Loose Women? Well now you can, sort of…The Great Escapers is a brand-new prime time series, which will take some of the nation's best known ITV faces and send them off on their very first holiday together. We know they've worked alongside each other for many years, but can they now holiday together? Let's see as they pack their bags, jet off to the sunshine and check in to their hotel. The Great Escapers will show the celebrities as we've never seen them before.In each episode, three stars will compete to give their colleagues the best holiday experience they can. But will one star's dream day out prove to be another's worst nightmare?Jet2holidays will have a friendly overseas customer helper on hand throughout the experience to help guide each celebrity with their activity choices. Will the celeb choose what they personally like or try to guess what their travel companions would prefer?At the end of the trip, the three celebrities will vote for who put together the most memorable day and one of them will be crowned The Greatest Escaper.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499832.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499832.jpg",
    "videos": [
      {
        "id": "tvmaze:3452509",
        "title": "Loose Women in Costa Brava",
        "season": 1,
        "episode": 4,
        "released": "2025-12-14",
        "overview": "Loose Women stars Katie Piper, Denise Welch and Sunetra Sarker head to Spain's Costa Brava, where they compete against one another to deliver the best holiday activities. With the construction of a human tower, a couple of surprises from Denise, an aerial yoga lesson that isn't a zen-like experience for everyone and a forage for flowers in store, which of the Loose Ladies will win the title of Greatest Escaper when the three of them meet to decide the winner?"
      }
    ]
  }
}