{
  "meta": {
    "id": "tvmaze:8934",
    "type": "series",
    "name": "Hollywood Christmas Parade",
    "description": "The Hollywood Christmas Parade (formerly the Hollywood Santa Parade or Santa Claus Lane Parade) is an annual parade that takes place on the Sunday after Thanksgiving in the Hollywood community in Los Angeles, California, United States. The parade follows a 3.5-mile route along Sunset Boulevard and features various celebrities among its participants. Beginning in 1928, Hollywood merchants transformed a one-mile stretch of Hollywood Boulevard into \"Santa Claus Lane\" to boost shopping. Part of the promotion was a daily parade featuring Santa Claus and a film star. Originally called the Santa Claus Lane Parade, the inaugural event featured only Santa Claus and the actress Jeanette Loff.The parade continued to grow in scale with the help of local businesses and the community. In 1931 Santa Claus rode a truck-pulled float instead of the reindeer-pulled carriage of previous years. American LegionPost 43 marched with a color guard, drum line and bugle corps. The Parade was suspended from 1942 to 1944 due to World War II, but reopened in 1945 with record attendance. In 1946 Gene Autry rode his horse in the parade and was inspired by the children yelling \"Here comes Santa Claus, Here comes Santa Claus,\" to write the song \"Here Comes Santa Claus\" along with Oakley Haldeman. Autry would become a perennial Grand Marshal of the parade.The parade continued to grow throughout the 1950s, '60s, and '70s, adding floats, animals, bands and celebrities. By 1978, the parade had been renamed the Hollywood Christmas Parade in order to attract more celebrities, and was broadcast locally on KTLA-TV with the help of Autry and Johnny Grant. This change also coincided with a shift in the parade's scheduling from Thanksgiving Eve to the Sunday after Thanksgiving.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505803.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505803.jpg",
    "videos": [
      {
        "id": "tvmaze:3461170",
        "title": "The 93rd Annual Hollywood Christmas Parade",
        "season": 2025,
        "episode": 1,
        "released": "2025-12-12",
        "overview": "Luke Wilson, the Emmy AwardÒ-winning actor known for his celebrated roles in the movies \"Legally Blonde,\" \"Old School,\" \"The Royal Tenenbaums\" and Kevin Costner's Western Epic \"Horizon\" has been named Grand Marshal. Anthony Anderson, the Emmy AwardÒ-nominated actor, producer, comedian and humanitarian, who most recently appeared in Amazon MGM's action thriller, \"G20,\" has been named Humanitarian of the Year of The 93rd Annual Hollywood Christmas Parade Supporting Marine Toys for Tots."
      }
    ]
  }
}