{
  "meta": {
    "id": "tvmaze:45501",
    "type": "series",
    "name": "Industry",
    "description": "Industry follows a group of young graduates competing for a limited set of permanent positions at a top investment bank in London—but the boundaries between colleague, friend, lover, and enemy soon blur as they immerse themselves in a company culture defined as much by sex, drugs, and ego as it is by deals and dividends. As members of the group rise and fall, they must decide whether life is about more than the bottom line.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/531/1327943.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/531/1327943.jpg",
    "videos": [
      {
        "id": "tvmaze:3450605",
        "title": "TBA",
        "season": 4,
        "episode": 1,
        "released": "2026-01-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3451918",
        "title": "TBA",
        "season": 4,
        "episode": 2,
        "released": "2026-01-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3451919",
        "title": "TBA",
        "season": 4,
        "episode": 3,
        "released": "2026-01-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3451920",
        "title": "TBA",
        "season": 4,
        "episode": 4,
        "released": "2026-02-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3451921",
        "title": "TBA",
        "season": 4,
        "episode": 5,
        "released": "2026-02-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3451922",
        "title": "TBA",
        "season": 4,
        "episode": 6,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3451923",
        "title": "TBA",
        "season": 4,
        "episode": 7,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3451924",
        "title": "TBA",
        "season": 4,
        "episode": 8,
        "released": "2026-03-01",
        "overview": ""
      },
      {
        "id": "tvmaze:1931334",
        "title": "Induction",
        "season": 1,
        "episode": 1,
        "released": "2020-11-09",
        "overview": "Five young graduates do whatever it takes to make themselves indispensable at preeminent London investment bank Pierpoint &amp; Co. As hungry outsider Harper grapples with a decision that will gravely affect her future at the bank, she and party-boy Robert take very different approaches to their first few weeks in the bank. Meanwhile, Yasmin braves the unchecked disrespect of her superiors and Hari's unhealthy work habits raise companywide red flags."
      },
      {
        "id": "tvmaze:1955324",
        "title": "Quiet and Nice",
        "season": 1,
        "episode": 2,
        "released": "2020-11-16",
        "overview": "With Harper struggling to find her feet in a new city, Pierpoint throws a morale-boosting appreciation dinner which sees her challenging a drunken, irate Kenny, while Gus alienates senior management by discussing his team's future. Meanwhile, Yasmin comes face to face with the culture of her new team and takes her flirtation with Robert to risky new heights."
      },
      {
        "id": "tvmaze:1956004",
        "title": "Notting Hill",
        "season": 1,
        "episode": 3,
        "released": "2020-11-23",
        "overview": "When Pierpoint loses a major client, the grads face their most challenging – and potentially rewarding – test to date: devising pitches to drive new business. After the dissolution of his team finds him reassigned to a disinterested new supervisor, a creative Gus partners with Robert to catch Clement's attention. Meanwhile, as she navigates a complicated living situation with Yasmin, Harper attempts to juggle conflicting requests from Eric and Daria."
      },
      {
        "id": "tvmaze:1956006",
        "title": "Sesh",
        "season": 1,
        "episode": 4,
        "released": "2020-11-27",
        "overview": "After a wild birthday celebration with Robert, Yasmin, and Greg, Harper's workday spirals out of control. As a discrepancy in one of her trades puts her team at risk for major losses, Harper seeks support from a surprising source, while unexpected trouble at a networking event brings Yasmin and Robert closer and Gus further alienates his coworkers."
      },
      {
        "id": "tvmaze:1956007",
        "title": "Learned Behaviour",
        "season": 1,
        "episode": 5,
        "released": "2020-11-27",
        "overview": "As Pierpoint is shaken by a former employee's scathing exposé, Eric goes offsite for the day, prompting an unauthorized Gus to cover trades from his desk, while Harper maneuvers her way into a meeting with one of Eric's coveted, disgruntled ex-clients. But when Gus and Harper both cross the line, they risk compromising their futures at the bank. Following Robert's successful first business trip, Clement treats him to a special outing, while Yasmin works her connections to land a major client meeting."
      },
      {
        "id": "tvmaze:1956008",
        "title": "Nutcracker",
        "season": 1,
        "episode": 6,
        "released": "2020-11-27",
        "overview": "Sex, drugs, and secrets light up Pierpoint's annual holiday party, where Maxim's unexpected arrival aggravates tensions between Yasmin and Kenny, and Greg finds himself in a painful predicament after partying a little too hard with Robert and Usman. After confiding in Daria, Harper is blindsided by a meeting with Sara, the president of the London office."
      },
      {
        "id": "tvmaze:1968448",
        "title": "Pre-Crisis Activity",
        "season": 1,
        "episode": 7,
        "released": "2020-11-27",
        "overview": "With Reduction in Force Day looming, the graduates do whatever it takes to secure final recommendations from their superiors and solidify vital client relationships. At a dinner party hosted by Yasmin and Sebastian, resentment and jealousy bubble to the surface, and Harper divulges confidential company business."
      },
      {
        "id": "tvmaze:1968449",
        "title": "Reduction in Force",
        "season": 1,
        "episode": 8,
        "released": "2020-11-27",
        "overview": "After a tumultuous few months at Pierpoint, the graduates take vastly different approaches as they stand before senior management to prove they're worthy of permanent positions. Following an unexpected meeting with a familiar face, Harper contends with a decision that could transform the culture of Pierpoint."
      },
      {
        "id": "tvmaze:2347942",
        "title": "Daddy",
        "season": 2,
        "episode": 1,
        "released": "2022-08-01",
        "overview": "Finally forced to return to the office, Harper confronts a rapidly intensifying atmosphere under Pierpoint's new U.S. leadership."
      },
      {
        "id": "tvmaze:2365408",
        "title": "The Giant Squid",
        "season": 2,
        "episode": 2,
        "released": "2022-08-08",
        "overview": "Harper's decision to pursue Bloom over Felim exposes larger issues between her and Eric – and the account. Meanwhile, Yasmin pitches herself for an exciting new opportunity just as her estranged father Charles suddenly reemerges, and Robert takes his pursuit of Nicole to another level."
      },
      {
        "id": "tvmaze:2365409",
        "title": "The Fool",
        "season": 2,
        "episode": 3,
        "released": "2022-08-15",
        "overview": "The high of landing Bloom soon wears off when Harper suddenly finds herself stuck between rivals at Rican Healthcare's investor event – and at the mercy of Eric's frustration. After attempting to lure her father's business, Yasmin is forced to curry favor with Celeste. Meanwhile, unexpected doors open for Gus while tutoring Bloom's son, Leo."
      },
      {
        "id": "tvmaze:2365410",
        "title": "There Are Some Women…",
        "season": 2,
        "episode": 4,
        "released": "2022-08-22",
        "overview": "Eric travels to New York. Harper continues to ride the high of landing Bloom. Yasmin learns startling truths about her family's money."
      },
      {
        "id": "tvmaze:2365411",
        "title": "Kitchen Season",
        "season": 2,
        "episode": 5,
        "released": "2022-08-29",
        "overview": "After learning of Yasmin and Jackie's impending trip to Berlin, Harper attempts to land an invite for more than just business reasons. Approached about a new government position, Aurore offers a conflicted Gus a spot on her team. Meanwhile, Danny asks Robert to pursue a recent grad for a position at Pierpoint."
      },
      {
        "id": "tvmaze:2365414",
        "title": "Short to the Point of Pain",
        "season": 2,
        "episode": 6,
        "released": "2022-09-05",
        "overview": "When a group of online traders attempts a short squeeze of FastAide, Bloom takes it personally, while a recently AWOL Harper suddenly fears the future of their working relationship. As Gus grows increasingly conflicted about Aurore's job offer, Yasmin navigates a major transition."
      },
      {
        "id": "tvmaze:2365416",
        "title": "Lone Wolf and Cub",
        "season": 2,
        "episode": 7,
        "released": "2022-09-12",
        "overview": "Now certain that New York will take over the London office, Harper, Eric, and Rishi join forces to pitch themselves to rival banks."
      },
      {
        "id": "tvmaze:2365418",
        "title": "Jerusalem",
        "season": 2,
        "episode": 8,
        "released": "2022-09-19",
        "overview": "As Harper, Eric, Danny, and Rishi chase a life-changing opportunity, Yasmin reconsiders the path she imagined for herself."
      },
      {
        "id": "tvmaze:2879688",
        "title": "Il Mattino ha L'Oro Bocca",
        "season": 3,
        "episode": 1,
        "released": "2024-08-11",
        "overview": "As Pierpoint gears up to take Lumi public, Eric gets a long-awaited promotion to partner, Yasmin tries to escape Harper's shadow at the desk, and Robert struggles to manage Lumi CEO Henry Muck. Meanwhile, Harper sees an opportunity to get back in the game at hedge fund FutureDawn."
      },
      {
        "id": "tvmaze:2918606",
        "title": "Smoke and Mirrors",
        "season": 3,
        "episode": 2,
        "released": "2024-08-18",
        "overview": "Following a bumpy IPO launch, Eric scrambles to maintain control over the floor. Meanwhile, Harper forms a new work alliance, Robert suffers a devastating loss, and Yasmin's ingenuity wins Henry's attention."
      },
      {
        "id": "tvmaze:2918607",
        "title": "It",
        "season": 3,
        "episode": 3,
        "released": "2024-08-25",
        "overview": "Eric, Yasmin, and Robert head to the COP Climate Conference in Switzerland to display Pierpoint's confidence in pivoting to ethical investing. But when Harper pulls a stunt that disrupts the status quo, market support for Lumi becomes threatened."
      },
      {
        "id": "tvmaze:2918608",
        "title": "White Mischief",
        "season": 3,
        "episode": 4,
        "released": "2024-09-01",
        "overview": "Deeply in debt with a new home and baby, Rishi takes a massive gamble after a surprise visit from an old friend. Later, with his luck running out both at home and work, Rishi engages in another high-risk, high-reward opportunity that could threaten his job at Pierpoint."
      },
      {
        "id": "tvmaze:2918609",
        "title": "Company Man",
        "season": 3,
        "episode": 5,
        "released": "2024-09-08",
        "overview": "After being summoned by a government select committee, Robert worries he's become a pawn in a much larger battle between very powerful entities. Meanwhile, during the company's annual charity day, Sweetpea shares a theory with Eric that could mark the beginning of the end for Pierpoint, and Yasmin wonders if being vulnerable in a relationship is worth it."
      },
      {
        "id": "tvmaze:2918610",
        "title": "Nikki Beach, or: So Many Ways to Lose",
        "season": 3,
        "episode": 6,
        "released": "2024-09-15",
        "overview": "Invigorated by LeviathanAlpha's success, Harper pitches an idea to Petra that finds them visiting London's top financial institutions – including Pierpoint. Later, Yasmin leans on Harper when her world is upended by catastrophic news."
      },
      {
        "id": "tvmaze:2918611",
        "title": "Useful Idiot",
        "season": 3,
        "episode": 7,
        "released": "2024-09-22",
        "overview": "When disaster strikes during Pierpoint's 150th anniversary celebration, Eric is summoned to the executive boardroom, while Rishi, Sweetpea, and Anraj try to save their own skins on the trading floor. Across town, Harper's risky moves jeopardize LeviathanAlpha, while Yasmin escapes on a road trip with Robert."
      },
      {
        "id": "tvmaze:2918612",
        "title": "Infinite Largesse",
        "season": 3,
        "episode": 8,
        "released": "2024-09-29",
        "overview": "After a long night, Eric and Pierpoint's executives find a solution that could bring new changes – and consequences – for the company. Meanwhile, Yasmin and Robert pay a fated visit to the countryside, and Harper's career ambitions lead her to a crossroads."
      }
    ]
  }
}