{
  "meta": {
    "id": "tvmaze:59",
    "type": "series",
    "name": "Chicago Fire",
    "description": "No job is more stressful, dangerous or exhilarating than those of the Firefighters, Rescue Squad and Paramedics of Chicago Firehouse 51. These are the courageous men and women who forge headfirst into danger when everyone else is running the other way and whose actions make the difference between life and death. These are their stories.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/590/1475640.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/590/1475640.jpg",
    "videos": [
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2229",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2012-10-10",
        "overview": "When a fire claims one of their own, there's plenty of guilt and blame to go around. Lt. Matthew Casey, in charge of the Truck, tries to carry on, but butts heads with the brash Lt. Kelly Severide of the Rescue Squad - and each blames the other for their fallen team member. Adding to the turmoil, Casey, unbeknownst to his colleagues, is in the midst of a separation from Hallie. The firehouse also includes: Battalion Chief Wallace Boden, a fireman's fireman who is confronted by important personal decisions; paramedics Gabriela Dawson and Leslie Shay, who share a close bond and team together to face some of the most harrowing situations imaginable; Peter Mills, an academy graduate who is the latest generation in a family of firefighters; and Christopher Herrmann, a seasoned veteran who loses his home to foreclosure and now must uproot his family to move in with his in-laws."
      },
      {
        "id": "tvmaze:2230",
        "title": "Mon Amour",
        "season": 1,
        "episode": 2,
        "released": "2012-10-17",
        "overview": "Severide is hiding a serious shoulder injury sustained in the fire that killed Andy Darden, and grapples with his guilt as he fights to rescue a construction worker trapped in a building collapse. Adding to the burden, Darden's wife Heather turns on Severide at the annual firefighters' barbecue, blaming him for her husband's death. A call is made to an accident site at Hancock Tower, where two teenagers are pinned in a vehicle trapped beneath the falling debris of a broken window washer's cart. Meanwhile, Casey and Hallie work to figure out their future together."
      },
      {
        "id": "tvmaze:2231",
        "title": "Professional Courtesy",
        "season": 1,
        "episode": 3,
        "released": "2012-10-24",
        "overview": "When the drunk driver who hits a car and paralyzes a 16-year-old boy turns out to be the son of a dirty cop, Lieutenant Casey must decide whether or not to turn him in. Facing pressure and subsequent threats from the powerful and well-connected Detective Voight, Casey decides to tell the truth, inviting a stand-off. Additionally, Severide, who's fighting off the advances of the Chief's new assistant, learns he has a fractured vertebra in his neck that may never heal if he doesn't get treated, but ignores the doctor's advice so he can continue working. Meanwhile, Mills is torn between helping his mother at her restaurant and devoting himself full-time to the fire department, like his father did."
      },
      {
        "id": "tvmaze:2232",
        "title": "One Minute",
        "season": 1,
        "episode": 4,
        "released": "2012-10-31",
        "overview": "Chief Boden is accused of leaving a homeless man to die in a warehouse fire after ordering his men to evacuate the scene, creating negative press and bad feeling within the department. Meanwhile, Lieutenant Severide helps an elderly woman facing some neighborhood problems. Detective Voight ramps up his intimidation tactics aimed at Casey in an attempt to discourage him from testifying against his son. Shay is forced to revisit her heartbreak over her ex-girlfriend Clarice, when she finds herself face-to-face with the ex and her husband during a call. Hermann's temper flares during a rescue call at a Halloween block party."
      },
      {
        "id": "tvmaze:2233",
        "title": "Hanging On",
        "season": 1,
        "episode": 5,
        "released": "2012-11-07",
        "overview": "Casey confronts Detective Voight about his harassing tactics, vowing never to back down, and ends up paying the price for his decision. Dawson faces disciplinary action for her on-the-job conduct. Meanwhile, Severide finds his arm failing him during a rescue at a construction accident, and reaches out to Anna, an old flame and pharmaceutical rep, hoping she might be able to help alleviate his injury problems."
      },
      {
        "id": "tvmaze:2234",
        "title": "Rear View Mirror",
        "season": 1,
        "episode": 6,
        "released": "2012-11-14",
        "overview": "Facing suspension, Dawson gets a hand from the same girl she saved through the procedures that landed her in front of the disciplinary board. Lieutenant Casey finds his fuse shortening as Detective Voight stops at nothing to get him to retract his statement. However, when Casey lays his life on the line during an apartment fire, he may have unknowingly caught the break he was needing."
      },
      {
        "id": "tvmaze:2235",
        "title": "Two Families",
        "season": 1,
        "episode": 7,
        "released": "2012-11-21",
        "overview": "Everyone in the firehouse is ordered to take a drug test after a call to a daycare center exposes them to a makeshift meth lab, and Severide stalls, not wanting his injury, or the painkillers he takes, to be discovered. Meanwhile, Truck and Squad find themselves pinned down by gunfire while trying to help the victim of a gang shooting, and a deep-fried turkey fire grows from small to explosive when a garage catches fire. Elsewhere, Dawson saves a bleeding man and Casey delivers a baby on the scene of a massive car pileup on the freeway."
      },
      {
        "id": "tvmaze:2236",
        "title": "Leaving the Station",
        "season": 1,
        "episode": 8,
        "released": "2012-12-05",
        "overview": "At the site of a train accident, Peter Mills becomes deeply upset when he observes the dead body of a young victim. Unable to shake his emotional distress about the event, he questions his future as a firefighter. Dawson and Shay save a 6-year-old girl whose mother is abusing her - but their confrontation leads the woman to resort to dire actions. Meanwhile, Severide aggravates his injury while rescuing a heart attack victim and Shay sends Clarice, her married, pregnant ex-girlfriend, back home to her husband."
      },
      {
        "id": "tvmaze:2237",
        "title": "It Ain't Easy",
        "season": 1,
        "episode": 9,
        "released": "2012-12-12",
        "overview": "After he's injured in a terrible fire at an auto machine shop, Jose Vargas is forced to go on disability and leave his life as a firefighter behind - a task he finds incredibly difficult. Chief Boden tries to help a suspected teenage firebug. Also, Severide receives an enticing invitation from Renee, a woman who he saved from a car crash incident involving live electrical wires. Meanwhile, Cruz tries to save his younger brother Leon from the gang he is involved with."
      },
      {
        "id": "tvmaze:2238",
        "title": "Merry Christmas, Etc.",
        "season": 1,
        "episode": 10,
        "released": "2012-12-19",
        "overview": "After putting out a kitchen fire in an upscale townhouse, Casey, Herrmann, Mouch, Cruz, Otis and Mills find themselves accused of stealing a $50,000 diamond necklace from the home, touching off an internal investigation. Cruz's brother Leon is caught in the middle of an escalating gang war, leaving Cruz to make a desperate choice to save him. Meanwhile, Dawson invites Casey to her cousin's fancy Christmas party, and a frustrated Shay has reached her limit with Severide."
      },
      {
        "id": "tvmaze:2239",
        "title": "God Has Spoken",
        "season": 1,
        "episode": 11,
        "released": "2013-01-02",
        "overview": "Eaten up by his guilt over Flaco's death in the fire, Cruz goes to Casey to confess. While Shay recovers from a head injury sustained in the ambulance crash, Severide asks Dawson for her help in dealing with his own injury. Casey is caught in the middle of a family conflict between his mother and sister. Elsewhere, Herrmann finds a business deal hard to stomach."
      },
      {
        "id": "tvmaze:2240",
        "title": "Under the Knife",
        "season": 1,
        "episode": 12,
        "released": "2013-01-09",
        "overview": "Severide finally addresses Chief Boden about his injury and makes some important personal decisions about his future. Meanwhile, Casey struggles with family matters and Dawson takes matters into her own hands when she discovers a young girl who is the sole survivor at the scene of a rescue call."
      },
      {
        "id": "tvmaze:2241",
        "title": "Warm and Dead",
        "season": 1,
        "episode": 13,
        "released": "2013-01-30",
        "overview": "Troubled Chief Boden goes to the police when a man dies in a hardware store fire set by Ernie, the troubled teenage firebug he's been trying to help, and his Uncle Ray. Meanwhile, Severide decides on his future and reaches out to his father. Elsewhere, Otis finds camaraderie when he fills in for a few shifts at the slowest firehouse in the city, and makes a decision of his own, while Dawson and Shay find themselves in a bad predicament during a call to a tenement apartment."
      },
      {
        "id": "tvmaze:2242",
        "title": "A Little Taste",
        "season": 1,
        "episode": 14,
        "released": "2013-02-06",
        "overview": "Severide finds that he shares a familiar past with Eric Whaley, the Lieutenant who was brought into the firehouse to help out. Dawson lets Shay in on her secret, while Casey deals with family issues. Meanwhile, a bad batch of heroin on the streets has Boden and the team scrambling, while Clarice and Shay find they have a new problem to overcome."
      },
      {
        "id": "tvmaze:2243",
        "title": "Nazdarovya!",
        "season": 1,
        "episode": 15,
        "released": "2013-02-13",
        "overview": "Dawson attempts to help her brother Antonio unravel the details of his drugs-and-gang investigation, and goes behind his back in turning to an unlikely source for assistance. Casey and his mother, Nancy struggle with their new relationship. Meanwhile, as a favor to Lieutenant Whaley, Severide visits someone important from his past, while Herrmann and Otis learn some hard truths about their \"silent partner\" in the bar."
      },
      {
        "id": "tvmaze:2244",
        "title": "Viral",
        "season": 1,
        "episode": 16,
        "released": "2013-02-20",
        "overview": "The anguish that haunts Cruz over his previous actions boils over, as he puts himself and his fellow firefighters in jeopardy. Casey and his sister Christie try to solve their issues with their mother and each other. Meanwhile, Severide reaches out again to an important person from his past as a favor to Lieutenant Whaley and the squad gains new perspective after assisting the bomb squad on an extremely dangerous call."
      },
      {
        "id": "tvmaze:2245",
        "title": "Better to Lie",
        "season": 1,
        "episode": 17,
        "released": "2013-02-27",
        "overview": "Old emotional wounds are opened when Lieutenant Severide's father Bennie comes to town and clashes with Chief Boden over the death of their former colleague. Mills helps a distraught driver who caused an accident and Shay makes a decision about her future with Clarice. Meanwhile, Herrmann, Otis and Dawson get to the bottom of a mystery about their bar."
      },
      {
        "id": "tvmaze:2246",
        "title": "Fireworks",
        "season": 1,
        "episode": 18,
        "released": "2013-03-20",
        "overview": "With tensions still running high between Chief Boden and Bennie Severide, things boil over when Mills confronts Bennie about the fire that killed his father. Meanwhile, Severide, Casey and Bennie uncover the truth behind two mysterious diner fires and Shay takes a new direction with her plan to have a baby."
      },
      {
        "id": "tvmaze:2247",
        "title": "A Coffin That Small",
        "season": 1,
        "episode": 19,
        "released": "2013-03-27",
        "overview": "Tragedy strikes when a rescue attempt at a tenement building proves unsuccessful, leaving the men and women of firehouse 51 affected by the loss of the victim. Severide's decision to put Mills on the fast track to move from Truck to Squad doesn't sit well with some of the others and tension mounts between Severide and Casey over Heather Darden. Shay and Dawson are forced to deal with a junkie's crazy behavior while on a call and Shay considers a different way to have a family. Meanwhile, the team draws the ire of local drug dealers who threaten the peace and safety of the neighborhood and firehouse."
      },
      {
        "id": "tvmaze:2248",
        "title": "Ambition",
        "season": 1,
        "episode": 20,
        "released": "2013-04-03",
        "overview": "Mills finds himself the target of resentment from some colleagues when Severide supports his desire to join Squad. Tara, a paramedic candidate, joins Dawson and Shay on the job for a few shifts. Meanwhile, Shay comes to the aid of Cindy Herrmann, who suffers from pregnancy complications while her husband Christopher is out of town. Elsewhere, Dawson and Casey draw closer as the grand opening of Molly's draws near, and Casey receives a surprise visit."
      },
      {
        "id": "tvmaze:2249",
        "title": "Retaliation Hit",
        "season": 1,
        "episode": 21,
        "released": "2013-05-01",
        "overview": "Detective Voight returns, looking to collect on the favor that Dawson owes him for helping her brother, Antonio. Casey falls back into old patterns in his personal life, while Dawson, Herrmann and Otis become the proud owners of a real neighborhood bar as Molly's prepares for its grand opening. Meanwhile, Severide's career is threatened."
      },
      {
        "id": "tvmaze:2250",
        "title": "Leaders Lead",
        "season": 1,
        "episode": 22,
        "released": "2013-05-08",
        "overview": "Frustrated Severide, turns to an unlikely ally to resolve his current dilemma. Casey begins to find satisfaction in his personal life, while Mills and Dawson face personal challenges. Meanwhile, the squad is called to the scene of a harrowing apartment building collapse."
      },
      {
        "id": "tvmaze:2251",
        "title": "Let Her Go",
        "season": 1,
        "episode": 23,
        "released": "2013-05-15",
        "overview": "Events force Lieutenant Casey to team up with the Intelligence Unit, now run by Voight, who doesn't appear to have changed his crooked ways after his stint in prison. Shay's excitement at the prospect of becoming a parent grows, while Mills and Dawson face some personal challenges. Meanwhile, the house comes together to support the opening of Molly's."
      },
      {
        "id": "tvmaze:2252",
        "title": "A Hell of a Ride",
        "season": 1,
        "episode": 24,
        "released": "2013-05-22",
        "overview": "When a call comes in from the Cook County jail, the squad steps into a volatile predicament and are tasked with trying to defuse an escalating situation. Shay remains hopeful about her baby dreams and Hermann's wife Cindy goes into labor with their fifth child. Meanwhile, Mills and Dawson face key decisions in their personal lives."
      },
      {
        "id": "tvmaze:2253",
        "title": "A Problem House",
        "season": 2,
        "episode": 1,
        "released": "2013-09-24",
        "overview": "Evidence recovered at a series of fires indicates that Lt. Severide is being targeted by an arsonist. Meanwhile, Battalion Chief Boden clashes with Gail McLeod, a high ranking consultant with the State Marshal's office who keeps a sharp eye on budgets and performance at the city's firehouses -- and has 51 under her microscope as one that could face the prospect of being closed. Elsewhere, Lt. Casey reflects on the year anniversary of Andy's death, Shay has suspicions about Severide's paternity and Mouch enjoys a visit from Mari, his Japanese girlfriend."
      },
      {
        "id": "tvmaze:2254",
        "title": "Prove It",
        "season": 2,
        "episode": 2,
        "released": "2013-10-01",
        "overview": "In the wake of Heather's incident, Lt. Casey is having a hard time handling his newfound responsibilities. Lt. Severide is on edge dreading the next attack from the firehouse's arsonist. Meanwhile, with Renee back from her mother's, Severide knows he has to confront her about his paternity suspicions. Elsewhere, Mouch begins his campaign for union president and Shay and Dawson feel that they need to get out more."
      },
      {
        "id": "tvmaze:2255",
        "title": "Defcon 1",
        "season": 2,
        "episode": 3,
        "released": "2013-10-08",
        "overview": "Lt. Severide has his strong ideas on who the serial arsonist is, but first needs to find proof to back up his suspicions. Meanwhile, Lt. Casey adjusts to his new lifestyle in the wake of recent events and Molly's bar is failing, much to the dismay of owners Hermann, Dawson and Otis. Elsewhere, Dawson goes out on a date with Jay Halstead, one of the bar regulars, and Mouch's campaign trail starts to get on track with the aid of Isabella, an old friend of Dawson's."
      },
      {
        "id": "tvmaze:2256",
        "title": "A Nuisance Call",
        "season": 2,
        "episode": 4,
        "released": "2013-10-15",
        "overview": "Lieutenant Severide is anxious to implicate the serial arsonist, while Dawson and Shay get a shock on a routine call. Meanwhile, suspicions continue to point to Clarke as the mole inside the firehouse and Molly's falls deeper into the red. Elsewhere, Mouch campaigns for union president, with the aid of Isabella, and Boden butts heads with Gail McLeod."
      },
      {
        "id": "tvmaze:2257",
        "title": "A Power Move",
        "season": 2,
        "episode": 5,
        "released": "2013-10-22",
        "overview": "Boden's future with Firehouse 51 is on the line and McLeod keeps on him about his past wrongdoings, pushing him toward an early retirement. With Boden considering his options, McLeod calls on an unlikely candidate to potentially replace him as Chief. Meanwhile, it becomes clearer who the mole inside the firehouse is and everyone takes measures to make their disdain for him known. Meanwhile, Shay's social life is in full bloom and Arthur continues to take money from the struggling Molly's."
      },
      {
        "id": "tvmaze:2258",
        "title": "Joyriding",
        "season": 2,
        "episode": 6,
        "released": "2013-11-12",
        "overview": "While out on a jog, Severide comes across a secluded and empty construction site and encounters a young boy who has been trapped in a backhoe loader and is in dire need of assistance. Boden and McLeod continue to butt heads about the future of the firehouse and Boden breaks news about his future to Casey. Meanwhile, it's election day for the union presidency and Mouch and Greg Sullivan have a debate on Otis' podcast. With rival bar Game Day's future in peril, the finger is being pointed at Molly's."
      },
      {
        "id": "tvmaze:2259",
        "title": "No Regrets",
        "season": 2,
        "episode": 7,
        "released": "2013-11-19",
        "overview": "When a tanker collides into a commuter train that subsequently crashes into a warehouse, the firehouse is called to the horrific scene that tests everyone to the limits as life and death hangs in the balance. With the ultimatum in place for him or the firehouse, Boden is tasked with making life-changing decisions regarding his future. Severide learns more about Katie, the young woman he saw with his father. Meanwhile, Shay and Dawson are still at odds and Casey's responsibility of being a surrogate father takes a sharp turn."
      },
      {
        "id": "tvmaze:2260",
        "title": "Rhymes with Shout",
        "season": 2,
        "episode": 8,
        "released": "2013-11-26",
        "overview": "When the shooting of a young girl happens in their neighborhood, Cruz and his brother, Leon are forced to think about the gang they have tried to escape. The battle between Chief Boden and McLeod continues to escalate and Isabella convinces Mills to dress up for a fancy gala. Meanwhile, Lt. Casey is sad Dawson won't be coming by as much now that his parental duties are over, Shay is fed up with the firehouse and digs in deeper with Devon and Zoya's visa is expiring, prompting her to come up with an idea."
      },
      {
        "id": "tvmaze:2261",
        "title": "You Will Hurt Him",
        "season": 2,
        "episode": 9,
        "released": "2013-12-03",
        "overview": "Battalion Chief Boden prepares to counterattack McLeod in a final effort to save the firehouse from closure and the romance between Dawson and Casey escalates. Leon is making progress in the gang murder investigation, but Cruz cannot stand being left in the dark by Voight, fearing for his brother's safety. Meanwhile, Severide and Katie bond to make up for lost time and Otis feels uncomfortable living with Severide and Shay after Devon's latest escapade."
      },
      {
        "id": "tvmaze:2262",
        "title": "Not Like This",
        "season": 2,
        "episode": 10,
        "released": "2013-12-10",
        "overview": "All seems lost with firehouse 51 on the verge of closing its' doors, thanks in no small part to Gail McLeod, but Chief Boden and the rest of the house refuse to allow themselves to sit by and let it happen. An emergency call to an apartment structure fire tests everyone's limits and puts the squad in harm's way. Meanwhile, Dawson receives some life-changing news and union president Greg Sullivan makes headlines, which has an immediate impact on Mouch."
      },
      {
        "id": "tvmaze:2263",
        "title": "Shoved in My Face",
        "season": 2,
        "episode": 11,
        "released": "2014-01-07",
        "overview": "Lt. Casey returns to work at Firehouse 51 after nearly being killed in a building collapse and Shay meets Allison Rafferty, her new partner, who is friendly to everyone except her. Dawson begins her rigorous training at the Chicago Fire Academy, while Lt. Severide prepares for his stint as instructor. Meanwhile, Clarke stubbornly does not speak with the police about the murder in which he is the prime suspect and the future of Molly's looks bleaker than ever."
      },
      {
        "id": "tvmaze:2264",
        "title": "Out with a Bang",
        "season": 2,
        "episode": 12,
        "released": "2014-01-14",
        "overview": "Lieutenant Casey tries to convince himself and everyone around him that he is one hundred percent healthy following his near-death incident in the line of duty. Shay, not wanting to delve into the emotionally traumatic incident, continues to elude a lawyer who wants to speak with her about Daryl's suicide. Meanwhile, Otis and Katie bond over board games, Boden helps out a woman with a negligent landlord and Dawson notices fellow recruit Rebecca Jones undertaking some interesting test-taking techniques at the Academy."
      },
      {
        "id": "tvmaze:2265",
        "title": "Tonight's the Night",
        "season": 2,
        "episode": 13,
        "released": "2014-01-21",
        "overview": "When a drunk driver knocks down a transformer, the entire neighborhood is left without power on a frigid Chicago night and members of Firehouse 51 step up to lend their much needed help. While many from the community ride out the night at the station, in the midst of such close quarters, romances speed up and tempers flare. Meanwhile, Casey continues to lie to both himself and Dawson about his condition and the stakeholders in Molly's bicker about the bar's direction."
      },
      {
        "id": "tvmaze:2266",
        "title": "Virgin Skin",
        "season": 2,
        "episode": 14,
        "released": "2014-02-25",
        "overview": "Severide feels sidelined as he leaves Detective Lindsay and the Intelligence Unit to do their job and locate his sister Katie. Shay gets an unusual tip from Chicago Blackhawk players Brent Seabrook and Duncan Keith, who makes friends with Clarke and stop by Molly's. Meanwhile, Casey learns more about his head injuries after another close call and Dawson pushes hard to pass the physical test at the Academy."
      },
      {
        "id": "tvmaze:2267",
        "title": "Keep Your Mouth Shut",
        "season": 2,
        "episode": 15,
        "released": "2014-03-04",
        "overview": "Severide is getting impatient with the police as Vince Keeler walks free. Meanwhile, the house pulls out all the stops to save a girl trapped inside a donation bin, Mouch learns that Boden's secretary Connie is not someone to mess with and the squad and truck are called to a serious high rise fire inside a 20-story downtown office building."
      },
      {
        "id": "tvmaze:2268",
        "title": "A Rocket Blasting Off",
        "season": 2,
        "episode": 16,
        "released": "2014-03-11",
        "overview": "Lt. Severide hits the top of the list as Det. Lindsay starts calling in suspects with the clearest motives to make the guy who kidnapped Katie disappear. Meanwhile, Jones is still having trouble fitting in as word of her disruptions reach the fire department's headquarters. Elsewhere, Herrmann celebrates his twentieth anniversary with his wife, but no one supports his idea on the gift he intends to give."
      },
      {
        "id": "tvmaze:2269",
        "title": "When Things Got Rough",
        "season": 2,
        "episode": 17,
        "released": "2014-03-18",
        "overview": "Lt. Severide is reminded of his own past by a man he saves from a car accident and feels compelled to help him. Elsewhere, Lt. Casey and Chief Boden grapple with how to dock Jones per her father's orders. Meanwhile, Mouch and Dawson have troubles with the opposite sex and an emotional call to duty creates ripples throughout Firehouse 51."
      },
      {
        "id": "tvmaze:2270",
        "title": "Until Your Feet Leave the Ground",
        "season": 2,
        "episode": 18,
        "released": "2014-04-08",
        "overview": "Lt. Severide sticks his neck out for Dave Bloom, a fellow firefighter from Denver who is troubled by addiction. Elsewhere, Dawson and Shay leave town for a \"girl's weekend\" at a cabin in the woods. Meanwhile Jones struggles with the knowledge that her father is pressuring Chief Boden about her career path and Mouch's internet dating profile gets an upgrade with the help of Mills and the guys."
      },
      {
        "id": "tvmaze:2271",
        "title": "A Heavy Weight",
        "season": 2,
        "episode": 19,
        "released": "2014-04-15",
        "overview": "Suicide note is delivered to a surprised Dawson and Lt. Severide digs deeper into Bloom's dark past. Elsewhere, Chief Boden learns shocking news, and with the help of Shay, Lt. Casey goes on the search for a life-changing item."
      },
      {
        "id": "tvmaze:2272",
        "title": "A Dark Day",
        "season": 2,
        "episode": 20,
        "released": "2014-04-29",
        "overview": "Lt. Casey and Dawson volunteer to help at a charity run at Chicago Medical when a massive explosion sends Chicago into chaos. With one of their own missing in the blast, the firehouse is tested like never before."
      },
      {
        "id": "tvmaze:2273",
        "title": "One More Shot",
        "season": 2,
        "episode": 21,
        "released": "2014-05-06",
        "overview": "With everyone's support, Dawson makes final preparations to retake the fireman's exam, but a call to the field may throw a major wrench into her plans. Elsewhere, Lt. Casey has an important matter to discuss with Antonio. Meanwhile, Lt. Severide and the firehouse welcome Rick Newhouse, the latest addition to the squad, Shay gets an uninvited surprise guest and Chief Boden makes a bold move."
      },
      {
        "id": "tvmaze:2274",
        "title": "Real Never Waits",
        "season": 2,
        "episode": 22,
        "released": "2014-05-13",
        "overview": "A fire at a boarding school leaves Lt. Severide shaken and wondering if he could have done more. Meanwhile, with the firehouse in full support of Dawson as she retakes the fireman's exam, Lt. Casey attempts some political maneuverings on her behalf. Elsewhere, Mills looks for answers about his father's mysterious past and Chief Boden's grand plans take a detour."
      },
      {
        "id": "tvmaze:2275",
        "title": "Always",
        "season": 3,
        "episode": 1,
        "released": "2014-09-23",
        "overview": "Boden forces members of Firehouse 51 to pull themselves back together in the aftermath of a harrowing fire explosion. While Severide goes missing for one week too many, Casey works to track down his whereabouts. Meanwhile, Newhouse brings some unexpected news regarding one of Mills' relatives while Herrmann and Otis make some new goals regarding Molly's."
      },
      {
        "id": "tvmaze:2276",
        "title": "Wow Me",
        "season": 3,
        "episode": 2,
        "released": "2014-09-30",
        "overview": "Lieutenant Severide returns to Firehouse 51, but he is clearly not his usual self and Dawson counts down the weeks until she gets started as a candidate at the Austin Firehouse. Meanwhile, Mills learns more about his father's family and Herrmann asks the rest of the Molly investors to come up with some new ideas to turn the business around."
      },
      {
        "id": "tvmaze:2277",
        "title": "Just Drive the Truck",
        "season": 3,
        "episode": 3,
        "released": "2014-10-07",
        "overview": "Fingers get pointed and tempers flare between members of Firehouse 51 and the Austin firehouse when fire trucks collide en route to a perilous call. Meanwhile, Boden has a plan to get Dawson her badge, but it comes at a cost. Elsewhere, Mills confronts his past and his future on the same day and the Molly's crew hits some hurdles starting up their new food truck."
      },
      {
        "id": "tvmaze:2278",
        "title": "Apologies Are Dangerous",
        "season": 3,
        "episode": 4,
        "released": "2014-10-14",
        "overview": "Dawson starts her first day as a candidate and looks to find a balance with Lieutenant Casey inside the firehouse. Mills must come to terms with a future that doesn't include the squad. Meanwhile, Severide confronts his demons in an unexpected way and the Molly's crew has a date with the city inspector to make sure their food truck is up to code."
      },
      {
        "id": "tvmaze:2279",
        "title": "The Nuclear Option",
        "season": 3,
        "episode": 5,
        "released": "2014-10-21",
        "overview": "Lieutenant Casey deals with the fallout of his sister Christie's impending divorce. Meanwhile, Dawson and Mills settle into their new roles at Station 51. Elsewhere, Brett can't decide if she wants to leave Chicago and the Molly's crew still can't figure out how to get the food truck started."
      },
      {
        "id": "tvmaze:12768",
        "title": "Madmen and Fools",
        "season": 3,
        "episode": 6,
        "released": "2014-10-28",
        "overview": "Casey comes to the aid of his sister Christie and faces down his corrupt brother-in-law, while Brett goes above and beyond for a mother in need. Elsewhere, Mills gets educated on the exciting world of unlicensed private investigation and Dawson begins training with Herrmann."
      },
      {
        "id": "tvmaze:12770",
        "title": "Nobody Touches Anything",
        "season": 3,
        "episode": 7,
        "released": "2014-11-11",
        "overview": "Members of Firehouse 51 are forced to contend with a house fire, but when the injured owner is rescued from his cellar clutching a suspicious box, Lt. Severide brings in Sergeant Voight and Detective Lindsay into the mix for further investigating. Elsewhere, Mills wonders if the dangers of Newhouses's off-duty gig are worth the cash returns, while Molly's II is in dire need of a good chef."
      },
      {
        "id": "tvmaze:22158",
        "title": "Chopper",
        "season": 3,
        "episode": 8,
        "released": "2014-11-18",
        "overview": "When a massive helicopter explosion in a densely populated area leaves a trail of debris scattered across a full city block, members of the firehouse spring into action as lives hang in the balance. Squad 3 finds itself in a precarious position, Brett is cornered by a dangerous man in the midst of the madness and Dawson is shocked to discover what actually brought the chopper down."
      },
      {
        "id": "tvmaze:39626",
        "title": "Arrest in Transit",
        "season": 3,
        "episode": 9,
        "released": "2014-11-25",
        "overview": "When the team responds to a semi-truck leaking hydrochloric acid in a busy intersection, Casey and Dawson find their relationship being put to the test. Meanwhile, Severide learns more about Brittany's past and Mouch has some difficulties in his dating life."
      },
      {
        "id": "tvmaze:39627",
        "title": "Santa Bites",
        "season": 3,
        "episode": 10,
        "released": "2014-12-02",
        "overview": "House fire leads members of the truck and squad to race to save the lives of the couple trapped inside, and then are faced with the perplexing aftermath. Meanwhile, Chief Boden prepares to start his new family, while the combination of life at work and home pushes Casey and Dawson apart. Elsewhere Molly's II has its chance to shine at the Chicago Holiday Fest."
      },
      {
        "id": "tvmaze:57567",
        "title": "Let Him Die",
        "season": 3,
        "episode": 11,
        "released": "2015-01-06",
        "overview": "The firehouse receives unsettling news when two of their own come up missing following a routine call, prompting members of Chicago P.D. to lead the search. Meanwhile, Casey and Dawson have a hard time figuring how to juggle their personal and professional lives. Elsewhere, Chief Boden and Donna struggle with news that their newborn has potential complications and they receive a surprise out-of-town visitor."
      },
      {
        "id": "tvmaze:57568",
        "title": "Ambush Predator",
        "season": 3,
        "episode": 12,
        "released": "2015-01-13",
        "overview": "Severide and Dawson discover startling evidence found at a storage unit fire that appears connected to the fire that took Shay's life. Meanwhile, the firehouse bands together when Chaplain Orlovsky is the victim of a bad car accident. Elsewhere, Chief Boden's father visits, but quickly wears out his welcome with his unsolicited parenting advice."
      },
      {
        "id": "tvmaze:96503",
        "title": "Three Bells",
        "season": 3,
        "episode": 13,
        "released": "2015-02-03",
        "overview": "More clues surface surrounding the fire that killed Shay, leading Severide to a most unexpected source who may be able to provide pertinent information. Meanwhile, Shay's sister Megan comes to town, prompting members of the firehouse to remember Shay's life. Elsewhere, Cruz is in for a surprise when Otis's grandmother moves into their apartment, while Boden finds a way to help his dying father make the most of his last few weeks."
      },
      {
        "id": "tvmaze:109550",
        "title": "Call It Paradise",
        "season": 3,
        "episode": 14,
        "released": "2015-02-10",
        "overview": "Mills and Brett race to recover a missing teenager and are left stranded in the unforgiving elements, while the rest of Firehouse 51 babysits an abandoned newborn. Meanwhile, Lt. Severide receives an interesting job proposal and Chief Boden finds himself at odds with his father over his treatment and the planning of a big party in his honor."
      },
      {
        "id": "tvmaze:117534",
        "title": "Headlong Toward Disaster",
        "season": 3,
        "episode": 15,
        "released": "2015-02-17",
        "overview": "Interim Chief Pat Pidgen is brought over to temporarily fill in for Boden, who is left to tend to his personal affairs. When tension is sparked as the result of his derisive leadership, the absence of Chief Boden becomes all too apparent. Meanwhile, Lieutenant Severide must deal with a most unwelcome addition to his squad, Brett gets closer to a girl she previously rescued and Casey starts seeing a new woman, Beth, but interesting complications quickly unfold."
      },
      {
        "id": "tvmaze:129553",
        "title": "Red Rag the Bull",
        "season": 3,
        "episode": 16,
        "released": "2015-03-03",
        "overview": "Chief Pridgen comes under fire after making a tactical error during an apartment fire for which he throws Lt. Casey under the bus, leading Lt. Severide to take it upon himself to clear the problem. In an effort to further cover himself from any wrongdoing, Pridgen enlists the help of Lt. Welch, who is faced with the choice of whether to fit in with the firehouse or follow his superiors self-serving orders. Elsewhere, Mouch is floored upon learning that his donation to a fertility clinic has resulted in a child who, now a young adult, wants to meet him. Meanwhile, Brett and a reluctant Cruz take Dawson out on a double date and Boden focuses his efforts on his duties at home as a father."
      },
      {
        "id": "tvmaze:129554",
        "title": "Forgive You Anything",
        "season": 3,
        "episode": 17,
        "released": "2015-03-10",
        "overview": "Lt. Severide lobbies Chief Boden for a favor for Scott Rice, an old friend needing a second chance with the CFD, but Casey and Otis have their doubts. Elsewhere, Mills works to regain his active squad status while Brett and Dawson decide they need a big night out."
      },
      {
        "id": "tvmaze:129555",
        "title": "Forgiving, Relentless, Unconditional",
        "season": 3,
        "episode": 18,
        "released": "2015-03-17",
        "overview": "During a harrowing call to a structure fire, Herrmann rescues a trapped toddler, but the questionable circumstances surrounding the event sends him on a personal mission to locate the father and get to the bottom of the situation. Severide makes up for lost time by retracing key friendships from his adolescence, while Mills discovers some surprising news. Elsewhere, Cruz and Brett's relationship comes to a crucial juncture, while Otis develops some unexpected feelings."
      },
      {
        "id": "tvmaze:129556",
        "title": "I Am the Apocalypse",
        "season": 3,
        "episode": 19,
        "released": "2015-04-07",
        "overview": "It's all hands on deck when Firehouse 51 races to the scene of a deadly chemical leak inside an industrial building. With squad and truck tested like never before, scores of workers are rescued but many are experiencing respiratory distress. This prompts truck 81, squad 3 and ambulance 61 to spring into action to transport the victims to nearby Chicago Med. The situation takes a turn from bad to worse in the midst of the chaos when a \"patient\" planted inside the hospital goes on a suicide mission armed with a grenade and claiming to be the carrier of a deadly airborne disease. Trying to stop the madman from engaging the explosive device, a member of the firehouse team is severely wounded in the blast and left to face life-threatening injuries. With no other choice, Chicago Med is forced into lockdown until doctors and the Hazmat team can determine the severity of the airborne virus."
      },
      {
        "id": "tvmaze:139556",
        "title": "You Know Where to Find Me",
        "season": 3,
        "episode": 20,
        "released": "2015-04-21",
        "overview": "Truck and squad are called to the scene of a car crash that has Mills desperately working to save the life of a driver seriously injured in the wreck. Meanwhile, Casey has some doubts about Jack Nesbitt, whose strip club he is remodeling on the side. Elsewhere, Hermann, Otis, Cruz and Chaplain Orlovsky help get their team ready for the peewee hockey championship, but Herrmann might prove more of an obstacle than the other team."
      },
      {
        "id": "tvmaze:153644",
        "title": "We Called Her Jellybean",
        "season": 3,
        "episode": 21,
        "released": "2015-04-28",
        "overview": "An apartment fire linked to a case of rape and attempted murder calls for members of the CPD to team with the Special Victims Unit, which had a similar unresolved case that has eluded them for more than 10 years. This prompts Sgt. Benson to come in from New York to assist with the investigation in which she is all too familiar. Meanwhile, doubts among the squad towards one of their own causes Severide to lay down the law and Dawson puts her life on the line during a call."
      },
      {
        "id": "tvmaze:152998",
        "title": "Category 5",
        "season": 3,
        "episode": 22,
        "released": "2015-05-05",
        "overview": "At Sgt. Voight's urging, a determined Lt. Casey agrees to go undercover in an effort to provide proof of Jack Nesbitt's shady dealings. Meanwhile, Otis and Severide continue to disagree about the integrity of Scott Rice, causing tensions to flare between members of truck and squad. Meanwhile, Herrmann helps out a fellow member of the firehouse."
      },
      {
        "id": "tvmaze:152999",
        "title": "Spartacus",
        "season": 3,
        "episode": 23,
        "released": "2015-05-12",
        "overview": "Lt. Casey puts his life on the line and digs deeper into the shady dealings of Jack Nesbitt. With members of truck and squad at odds over Rice's actions in the field, Chief Boden is left to figure out how to create unity in a divided house, while Severide comes to question his own judgment. A dangerous warehouse blaze quickly gets out of control and threatens members of firehouse 51, prompting Boden and Cruz to risk everything to save their own. Elsewhere, Dawson gets some life-changing news."
      },
      {
        "id": "tvmaze:181898",
        "title": "Let It Burn",
        "season": 4,
        "episode": 1,
        "released": "2015-10-13",
        "overview": "Lt. Casey, who is at the center of an undercover operation to bring down a trafficking ring run out of Nesbitt's strip club, finds himself in very dangerous territory. Meanwhile, as a result of the high turnover rate on squad, Severide gets a rude awakening when Capt. Dallas Patterson is brought in, much to Boden's dismay. Dawson confirms her suspicions that her life is about to change forever and Jimmy Borrelli, the new candidate, makes an unusual first impression. Elsewhere, citizens of Chicago band together to take charge of their neighborhood in protest of a drug den in their area, resulting in ramifications that severely hinder members of Firehouse 51, who are called to the scene to battle a blazing fire."
      },
      {
        "id": "tvmaze:182021",
        "title": "A Taste of Panama City",
        "season": 4,
        "episode": 2,
        "released": "2015-10-20",
        "overview": "Members of the firehouse are frustrated with their inability to help Chief Boden, whose job is on the line pending an internal investigation in the aftermath of a complicated call to a fire. Meanwhile, Lt. Severide struggles to accept his smaller role and adjusts to the presence of Capt. Patterson, his new commanding officer. Dawson shakes things up on the work front and Casey attempts to find a crucial piece of evidence in his ongoing investigation against Nesbitt. Elsewhere, Herrmann struggles to keep the peace with Molly's newest neighbors."
      },
      {
        "id": "tvmaze:182022",
        "title": "I Walk Away",
        "season": 4,
        "episode": 3,
        "released": "2015-10-27",
        "overview": "The pressure on Firehouse 51 is at an all-time high as the internal affairs investigation into the handling of a recent fire picks up steam. Just when it appears that game-changing evidence comes to light that would serve to bail out Chief Boden, new twists emerge that put his head right back on the chopping block. Brett and Chili respond to a routine call and quickly find themselves in a life and death situation to help aid a stabbing victim who is bleeding out. Meanwhile, a stuck elevator summons the house to a high-rise hotel that tests everyone's mettle and candidate Jimmy Borrelli is conflicted when his older brother Danny looks to get him transferred to a different house."
      },
      {
        "id": "tvmaze:182023",
        "title": "Your Day is Coming",
        "season": 4,
        "episode": 4,
        "released": "2015-11-03",
        "overview": "One of 51's own needs the support of the entire house to recover from a near disaster. Meanwhile, Herrmann has to figure out a way to reopen Molly's after it gets shut down and Severide digs deeper into the arson investigation, while struggling to cope with one of his toughest days yet."
      },
      {
        "id": "tvmaze:182024",
        "title": "Regarding This Wedding",
        "season": 4,
        "episode": 5,
        "released": "2015-11-10",
        "overview": "After a fire ruins a neighborhood wedding, Boden steps up to host the ceremony at the firehouse. That's much to the chagrin of his boss, Chief Riddle, whose political aspirations have caused friction from within the firehouse. Meanwhile, Dawson, who returns to the house, also butts heads with Riddle over her ability to perform and is forced to defend herself despite Boden's support. Severide finds himself fighting for his way back to his old position and Capt. Patterson is caught between loyalty towards leadership and loyalty to his colleagues."
      },
      {
        "id": "tvmaze:206510",
        "title": "2112",
        "season": 4,
        "episode": 6,
        "released": "2015-11-17",
        "overview": "Chief Boden meets his new neighbor, who asks him for a favor that leads to serious consequences. Severide takes offense to being treated like a candidate by Captain Patterson by undermining him during a call and the situation reaches a boiling point. Cruz receives a surprise visit from his past when Freddie, a gangbanger who knows Cruz's brother Leon, comes to visit and ask for a favor. Elsewhere, the team is called to a harrowing scene of an 18-wheeler and receive a thanks in the form of tickets to see the band Rush, much to Mouch and Herrmann's delight."
      },
      {
        "id": "tvmaze:404151",
        "title": "Sharp Elbows",
        "season": 4,
        "episode": 7,
        "released": "2015-11-24",
        "overview": "Chief Boden finds himself in the middle of a fiasco concerning a female neighbor, who he believes is setting him up. Severide, who is still on probation from his altercation with Captain Patterson, receives a surprise visit from his father and discovers some interesting information on Patterson that could be a game changer. Meanwhile, romance blossoms at the Chicago Fire Department gala."
      },
      {
        "id": "tvmaze:432941",
        "title": "When Tortoises Fly",
        "season": 4,
        "episode": 8,
        "released": "2015-12-01",
        "overview": "Chief Boden confronts Maddox, believing he is the hand behind Serena's accusations intended to skew Boden's credibility from the approaching trial. Severide reaches out to Jamie, Maddox's lawyer, in an effort to help out and Capt. Patterson questions Boden's ability to remain Chief. Meanwhile, Brett and Chili discover a man passed out in a garden that may have a connection to a call from a previous crash site and Otis looks to fill up his social calendar, but the situation hits a bump in the road."
      },
      {
        "id": "tvmaze:432942",
        "title": "Short and Fat",
        "season": 4,
        "episode": 9,
        "released": "2015-12-08",
        "overview": "Members of Firehouse 51 are less than thrilled when Captain Patterson steps in as replacement for Chief Boden while he deals with clearing his good name. When Severide learns of the potential whereabouts of Serena, Chicago P.D's Officer Atwater and Officer Ruzek head to Lake Carlyle to try and uncover additional clues on Boden's case. Meanwhile, Herrmann and Otis give Freddie a job that keeps him close by and Jimmy and Chili elicit more attention then either bargained for, causing some friction between them."
      },
      {
        "id": "tvmaze:510532",
        "title": "The Beating Heart",
        "season": 4,
        "episode": 10,
        "released": "2016-01-05",
        "overview": "Members of Firehouse 51 band together and anxiously await word at Chicago Med when one of their own falls victim to a life-threatening stabbing. Cruz urgently works with members of Chicago P.D. to track down Freddie's whereabouts when he goes missing. Dr. Choi and Dr. Halstead tend to an attempted suicide victim whose condition raises some eyebrows. Meanwhile, Mouch surprises Trudy and Chili's odd behavior has Brett and Jimmy worried."
      },
      {
        "id": "tvmaze:549808",
        "title": "The Path of Destruction",
        "season": 4,
        "episode": 11,
        "released": "2016-01-19",
        "overview": "A tornado threatens the city and Herrmann discovers the path may hit close to home. Chili and Brett lock heads when Chili makes a critical mistake that leaves a victim breathless, prompting Brett to report to Chief Boden regarding Chili's erratic behavior. Meanwhile, Otis pleads for Dawson to help him solve his women troubles and Severide is asked to lend assistance to agent Alex Ward from the Department of Homeland Security regarding a suspicious home."
      },
      {
        "id": "tvmaze:559094",
        "title": "Not Everyone Makes It",
        "season": 4,
        "episode": 12,
        "released": "2016-01-26",
        "overview": "Herrmann goes to court to testify against Freddie, but when the perpetrator's father reaches out to beg forgiveness for his son's malicious attack, a tormented Herrmann is left to figure out what to do. Following the aftermath of the recent tornado, Lt. Casey learns the makeshift shelter housing victims is on the brink of shutting down. At the request of Alderman Colin Becks, Casey attends a fundraiser and is thrown into the spotlight, only to quickly discover that his good intentions might not have the impact he was hoping for. Dawson and Brett feel the repercussions after telling Boden about Chili's recent erratic behavior. Meanwhile, Severide helps Agent Alex Ward solve a homemade explosives case and Otis receives a welcome surprise."
      },
      {
        "id": "tvmaze:567207",
        "title": "The Sky is Falling",
        "season": 4,
        "episode": 13,
        "released": "2016-02-02",
        "overview": "The firehouse is on high alert when mysterious threats begin to emerge throughout Chicago. The situation turns dire when news of a mass shooting brings members of squad and truck into the middle of a dangerous and harrowing scene. Lt. Casey works diligently to investigate the missing money from the fundraiser for the victims of the recent tornado. Meanwhile, Jimmy agrees to represent the firehouse in the first annual \"Battle of the Badges\" boxing match against the 21st district police department and Chili's erratic behavior continues to be a major issue for her ambulance partner, Brett."
      },
      {
        "id": "tvmaze:577003",
        "title": "All Hard Parts",
        "season": 4,
        "episode": 14,
        "released": "2016-02-09",
        "overview": "Lt. Severide confronts Chili about his suspicions regarding her erratic behavior, but she does not take too kindly to his intentions. Meanwhile, members of the firehouse rally around Lt. Casey, who they believe is a perfect candidate to run for the position as Alderman and Jimmy faces off against Antonio in the first annual \"Battle of the Badges\" boxing match."
      },
      {
        "id": "tvmaze:585207",
        "title": "Bad for the Soul",
        "season": 4,
        "episode": 15,
        "released": "2016-02-16",
        "overview": "Firehouse 51 responds to an odd call from a neighboring firehouse and the unusual circumstances prompt Severide and Cruz to take the investigation into their own hands to search out the real story. The truck welcomes new firefighter Stella Kidd, but her addition has repercussion inside the firehouse. Meanwhile, Casey moves forward in his run for alderman, but begins to realize that some voters have their own personal agendas for wanting him elected."
      },
      {
        "id": "tvmaze:596868",
        "title": "Two T's",
        "season": 4,
        "episode": 16,
        "released": "2016-02-23",
        "overview": "Casey continues his run for alderman, but a citywide propaganda attack against his campaign makes him reconsider his candidacy. The rescue squad is summoned to the scene of a man trapped inside of a burning car with suspicious evidence suggesting that the fire may have been intentionally set. Mouch's upcoming bachelor party looms, but with Trudy's nerdy brother Logan handling the details, everyone fears for the worst. Meanwhile, Jimmy and Brett take a kidnapping investigation into their own hands."
      },
      {
        "id": "tvmaze:628004",
        "title": "What Happened to Courtney",
        "season": 4,
        "episode": 17,
        "released": "2016-03-29",
        "overview": "While responding to a potential carbon monoxide leak inside a home, Lt. Severide and Cruz uncover the remains of a child inside the chimney. Subsequent information leads Severide to believe that the discovery may be linked to a case he had worked on years ago. Meanwhile, with election day nearing, Casey braces for the worst in his run for Alderman, prompting Dawson to enlist the firehouse team to lend a hand to the cause. Complicating his chances, Alderman Becks continues to bad mouth Casey to the press, but an incident in the field might prove beneficial"
      },
      {
        "id": "tvmaze:653151",
        "title": "On the Warpath",
        "season": 4,
        "episode": 18,
        "released": "2016-04-05",
        "overview": "While responding to a call involving a victim incapacitated with a leg wound, Sylvie Brett witnesses a murder and is threatened by the shooter not to go to the police. Unsure of what to do, she tries to track down Antonio from Chicago PD. Elsewhere, Firehouse 51 jumps into action when a fire breaks out inside a restaurant, trapping several people inside a vault. Meanwhile, with his wedding day to Trudy fast approaching, a nervous Mouch starts to get cold feet."
      },
      {
        "id": "tvmaze:655735",
        "title": "I Will Be Walking",
        "season": 4,
        "episode": 19,
        "released": "2016-04-19",
        "overview": "When a high school student becomes an innocent victim of a gang retribution incident, a very determined Lt. Casey tries all means necessary to resolve the issue. Severide lends a hand to Detective Holloway, who is working a dangerous undercover investigation, and watches over her 9-year-old son at the firehouse. Brett and Jimmie are called to aid a woman who takes a fond liking to Jimmy. Meanwhile, Otis makes a surprising discovery that leaves him very concerned and Herrmann goes toe-to-toe with Stella to claim bragging rights over who can best run a bar."
      },
      {
        "id": "tvmaze:657792",
        "title": "The Last One for Mom",
        "season": 4,
        "episode": 20,
        "released": "2016-04-26",
        "overview": "Detective Holloway continues to entrust Lt. Severide to watch over her young son at the firehouse while she testifies in court as part of an undercover operation. When the situation takes an unexpected turn, Severide is left to deal with the aftermath. The firehouse responds to a blaze at an art gallery that has a victim trapped inside and prompts Cruz to make a rash decision amid the chaos. Casey receives a suspicious package in the mail that casts suspicion on him from the Board of Ethics. Meanwhile, Brett discovers Otis isn't taking care of his own important issues and confronts him, but finds he is stubborn and more interested in rallying the troops to organize a trip to Las Vegas for the annual firefighting conference."
      },
      {
        "id": "tvmaze:657813",
        "title": "Kind of a Crazy Idea",
        "season": 4,
        "episode": 21,
        "released": "2016-05-03",
        "overview": "Dawson makes an attachment to a young boy she rescues in an apartment blaze while Kidd's big idea for Molly's turns into a disaster. Lt. Severide makes a pitch for the house to upgrade some of their fire masks but hits a wall in his efforts, prompting Lt. Casey to use his political influence to pull a few strings. Meanwhile, Cruz and a reluctant Brett bring in a secret weapon in their efforts to get Otis to see Dr. Halstead and take a blood test."
      },
      {
        "id": "tvmaze:657839",
        "title": "Where the Collapse Started",
        "season": 4,
        "episode": 22,
        "released": "2016-05-10",
        "overview": "Truck and squad are called to the scene of a building collapse that has trapped more than a dozen victims inside of the rubble. With the structure ready to give way and not much time to react, Chief Boden faces a difficult decision with life-and-death ramifications. In her quest to foster Louie, Dawson throws all her energies into the bureaucratic process necessary to make it happen, but it is the helping hand of a familiar face that gives her a fighting chance. Currently on medical leave, Otis swings by the firehouse and meets his temporary replacement, hoping it is just that but fearing the worst. Meanwhile, Severide and Kidd continue to see each other outside of the firehouse, and Casey and Antonio find themselves at odds and tensions flare."
      },
      {
        "id": "tvmaze:657861",
        "title": "Superhero",
        "season": 4,
        "episode": 23,
        "released": "2016-05-17",
        "overview": "Boden and Jimmy find themselves at odds in dealing with the aftermath of recent events while Kidd is forced to deal with her unstable and volatile ex, Grant. With the help of firehouse 51, Dawson tries to put her best foot forward in her pursuit for fostering Louie. At the urging of Susan Weller, his new political consultant, Casey tends to his Alderman duties and leaves town with her to attend a three-day summit. Much to his surprise, Casey embraces his new role while Susan urges him to consider grander aspirations. Meanwhile, the house responds to a dangerous structure fire that puts one of their own in a desperate situation."
      },
      {
        "id": "tvmaze:825382",
        "title": "The Hose or the Animal",
        "season": 5,
        "episode": 1,
        "released": "2016-10-11",
        "overview": "Severide and Stella are on the lookout for a very unstable Grant, who left Chicago Med without notice. Now that Dawson is responsible for Louie, she questions her dangerous career path as a firefighter. Casey continues his work as Alderman but his relationship with his political consultant, Susan Weller, cools. Problems continue for Borrelli, who still blames Chief Boden for the death of his brother, and the situation reaches a boiling point. Meanwhile, Mouch and Brett start off on a new venture together."
      },
      {
        "id": "tvmaze:906197",
        "title": "A Real Wake-Up Call",
        "season": 5,
        "episode": 2,
        "released": "2016-10-18",
        "overview": "Casey and Dawson find themselves unexpectedly caught in the middle of a potential political mess. Stella is left to make a serious decision about her ex-boyfriend. While responding to an auto accident, members of truck and squad find themselves in the middle of a dangerous situation. Elsewhere, Severide befriends a famous socialite that might distract him from his duties at 51, while Brett and Mouch set aside their writing differences for the greater good."
      },
      {
        "id": "tvmaze:911466",
        "title": "Scorched Earth",
        "season": 5,
        "episode": 3,
        "released": "2016-10-25",
        "overview": "Casey enlists Susan Weller to help with an urgent personal matter. Severide receives an offer to travel luxuriously with rich party guy Travis Brenner and Stella uses all her resources to help a sick street kid after saving him during a tunnel fire. Meanwhile, Otis and Herrmann discuss their concerns over Molly's lack of customers."
      },
      {
        "id": "tvmaze:911467",
        "title": "Nobody Else is Dying Today",
        "season": 5,
        "episode": 4,
        "released": "2016-11-01",
        "overview": "While checking out a warehouse as part of his Alderman's duties, Lt. Casey finds himself in a bad spot when a forklift accidentally pierces a tank storing acid causing an extremely hazardous spill. With a father and daughter in peril, Casey is forced to use extreme measures to remedy the situation. Dawson and Brett respond to an elderly woman who has a difficult senior advocate. Meanwhile, Mouch and Brett continue along with their secret project together and Otis shares some exciting news as he prepares himself for an unusual expedition."
      },
      {
        "id": "tvmaze:921561",
        "title": "I Held Her Hand",
        "season": 5,
        "episode": 5,
        "released": "2016-11-15",
        "overview": "Lt. Casey is unable to rescue a woman who becomes trapped inside her burning greystone, prompting him and Lt. Severide to butt heads over the husband's role in the tragedy. Herrmann is on a mission to catch a mystery tagger that keeps targeting their firehouse and Boden gets a surprise visitor. Meanwhile, Dawson and Brett respond to a 16-year-old boy who was injured during a romantic homecoming proposal."
      },
      {
        "id": "tvmaze:921562",
        "title": "That Day",
        "season": 5,
        "episode": 6,
        "released": "2016-11-22",
        "overview": "While responding to a call in the field, Dawson accidentally hits a pedestrian who stepped in front of the ambulance, and is left to deal with the repercussions. Lt. Casey and Lt. Severide disagree and continue to investigate an arson case while Chief Boden is left to decide whether to attend an important function in New York. Elsewhere, in hopes of preparing him for a possible promotion, Lt. Casey puts Herrmann at the helm for a shift so he can discover firsthand what his superiors deal with."
      },
      {
        "id": "tvmaze:921563",
        "title": "Lift Each Other",
        "season": 5,
        "episode": 7,
        "released": "2016-11-29",
        "overview": "It's a family reunion when Dawson and Antonio's mother and father come to Chicago for their big anniversary party, but things quickly turn south. When a deep secret comes to the surface involving his stepson James, Chief Boden decides to take matters into his own hands. Meanwhile, Casey tries to save a young boy during a harrowing call to a warehouse and Otis and Kidd become competitive at the mud-hundred race."
      },
      {
        "id": "tvmaze:921564",
        "title": "One Hundred",
        "season": 5,
        "episode": 8,
        "released": "2016-12-06",
        "overview": "Lt. Casey and Dawson apply for permanent adoption of Louie, but quickly discover a hurdle. Firefighter-turned-medical student Jeff Clarke approaches Lt. Severide with an interesting proposition. With hopes of reinvigorating business at the bar, Otis convinces a skeptical Herrmann to throw a bash in celebration of the milestone 100th anniversary of Molly's, but not without complications."
      },
      {
        "id": "tvmaze:1006519",
        "title": "Some Make It, Some Don't",
        "season": 5,
        "episode": 9,
        "released": "2017-01-03",
        "overview": "Dawson and Casey deal with legal matters in hopes of remaining Louie's legal guardians. Severide continues in his efforts for a bone marrow procedure to help Anna, but when things don't go as planned, he finds himself slipping back into old habits. Meanwhile, Brett opens up to Dawson and members of Firehouse 51 become competitive, much to the dismay of Chief Boden."
      },
      {
        "id": "tvmaze:981814",
        "title": "The People We Meet",
        "season": 5,
        "episode": 10,
        "released": "2017-01-17",
        "overview": "Severide agrees to a bone marrow donation but a work accident throws everything into flux. Casey and Dawson try to find harmony at home. Meanwhile, Otis and Mouch decide to film a PSA encouraging people to join the Chicago Fire Department but hit a creative wall in the process."
      },
      {
        "id": "tvmaze:981815",
        "title": "Who Lives and Who Dies",
        "season": 5,
        "episode": 11,
        "released": "2017-01-24",
        "overview": "Dawson finds it hard to keep her emotions in check during an ambo run involving a pregnant teen. Elsewhere, the firehouse is called to the site of a building fire and Casey is forced to make a split-second decision when two victims are each in need of life-saving assistance. In the aftermath, Casey is left to deal with the repercussions. Meanwhile, Severide shares a bond with Anna, as she makes her recovery."
      },
      {
        "id": "tvmaze:981817",
        "title": "An Agent of the Machine",
        "season": 5,
        "episode": 12,
        "released": "2017-02-07",
        "overview": "The team is on high alert when a previous incident during a fire call leaves a dangerous man on the loose with a vendetta to target Lt. Casey and Firehouse 51, and prompts CPD to step in. Dennis Mack, a buddy firefighter of Severide's father, comes to town to shadow the squad but may have ulterior motives. Meanwhile, Brett and Antonio's relationship hits some bumps in the road when his ex-wife Laura surfaces and Casey has a present for Dawson."
      },
      {
        "id": "tvmaze:1044220",
        "title": "Trading in Scuttlebutt",
        "season": 5,
        "episode": 13,
        "released": "2017-02-14",
        "overview": "When truck and squad are summoned to the scene of a dangerous accident, Chief Boden makes a split-second decision that overrides Chief Anderson, the incident commander whose house was the first to respond to the call. Feeling his authority was undercut and his reputation damaged, Anderson uses his power to make things miserable for Boden and all of House 51 feels the repercussions. Meanwhile, Severide contemplates a major life-changing decision, Herrmann does a good deed and Brett looks to make some personal changes to herself."
      },
      {
        "id": "tvmaze:1044221",
        "title": "Purgatory",
        "season": 5,
        "episode": 14,
        "released": "2017-02-21",
        "overview": "After exercising his disdain and authority over Chief Bode, Chief Anderson reassigns members of 51 to various houses around town, citing the need for improvement. The ramifications are felt by the crew, who are left to make the best of their respective situations in their new surroundings. Boden fights to repair the situation, but it just might be out of his control. Elsewhere, Severide toils over an important decision."
      },
      {
        "id": "tvmaze:1044222",
        "title": "Deathtrap",
        "season": 5,
        "episode": 15,
        "released": "2017-03-01",
        "overview": "Truck and squad are called to aid in a massive all-city response when an old, ill-equipped factory-turned live/work space quickly turns into a firestorm, trapping countless unsuspecting victims. The dire situation quickly turns personal when it is discovered that one of Chicago PD's own has a family member at the scene. With the rescued victims in need of serious medical attention, the doctors and nurses of Chicago Med are tested as the major influx of patients are brought through their doors. Meanwhile, in the aftermath, the building owner steps forward to cooperate with the ongoing investigation, but the situation takes a sudden and unexpected turn."
      },
      {
        "id": "tvmaze:1071372",
        "title": "Telling Her Goodbye",
        "season": 5,
        "episode": 16,
        "released": "2017-03-21",
        "overview": "When a turf war escalates, members of truck and squad find themselves caught in the middle as unsuspecting hostages when a group of armed gang members take cover and assume control over Firehouse 51. The situation turns even more dire when one of the infiltrators is wounded and in need of serious help."
      },
      {
        "id": "tvmaze:1071373",
        "title": "Babies and Fools",
        "season": 5,
        "episode": 17,
        "released": "2017-03-28",
        "overview": "When similar car accidents uncover the fact that someone may be targeting innocent people, a determined Dawson takes matters into her own hands to help push things along. Severide does everything he can to make Anna feel welcome in her new Chicago surroundings. Herrmann, Kidd and Dawson decide to have Molly's included as a stop in this year's pub crawl, despite strong concerns from Otis, who may have his own reasons for standing alone. Meanwhile, Casey tends to his Alderman's duties when a persistent constituent asks for his help in resolving an issue."
      },
      {
        "id": "tvmaze:1071374",
        "title": "Take a Knee",
        "season": 5,
        "episode": 18,
        "released": "2017-04-04",
        "overview": "Casey discovers a new crack house on the block that is harboring a female junkie and goes to extreme measures to remedy the situation. Dawson and Brett get assigned a new trainee for the shift and the newbie gets the two in trouble when he surprises them during a harrowing call. Meanwhile, Severide gets an unexpected visit from his father, Benny, and Herrmann deals with family issues when his son Lee Henry gets into trouble at school."
      },
      {
        "id": "tvmaze:1071375",
        "title": "Carry Their Legacy",
        "season": 5,
        "episode": 19,
        "released": "2017-04-25",
        "overview": "When the squad's rig breaks down in the field, Casey reunites with his old friend and colleague Jason Kannell from Squad 6, whose crew gets assigned a temporary change of quarters until the rig issue is resolved. Dawson and Brett serve their time in retraining, both tackling the class in unique ways. Severide tries to remedy what is going on with Anna and finds support from unlikely sources. As Connie returns from her family engagement, the crew lays bets on how long her temporary replacement Marcy will last."
      },
      {
        "id": "tvmaze:1071376",
        "title": "Carry Me",
        "season": 5,
        "episode": 20,
        "released": "2017-05-02",
        "overview": "Casey goes to drastic measures to help his friend Kannell. Lt. Severide helps an old widow come to terms with letting go, but realizes he may be the one needing help. Otis and Cruz deal with surprises when they find a new roommate to move in. Dawson and Brett get crafty to save a young girl."
      },
      {
        "id": "tvmaze:1071377",
        "title": "Sixty Days",
        "season": 5,
        "episode": 21,
        "released": "2017-05-09",
        "overview": "Cruz finds himself in a bad spot when an off-duty incident begins to unravel, prompting Mouch to step in and offer help in hopes of avoiding serious consequences from the CFD. Casey goes head to head with a big politician to get his measure for first responders passed. Lt. Severide makes life difficult for newest team member Jason Kannell and Dawson gets an unexpected visit from her father."
      },
      {
        "id": "tvmaze:1071378",
        "title": "My Miracle",
        "season": 5,
        "episode": 22,
        "released": "2017-05-16",
        "overview": "A dangerous warehouse fire puts truck and squad at risk. Tensions are high for Dawson and Casey when Dawson's father overstays his welcome at their home. Meanwhile, Casey continues to fight for his first responders bill, Mouch makes a serious decision regarding his future and Herrmann goes to tremendous lengths to make a young boy smile."
      },
      {
        "id": "tvmaze:1217078",
        "title": "It Wasn't Enough",
        "season": 6,
        "episode": 1,
        "released": "2017-09-28",
        "overview": "With most of the squad still trapped inside the burning warehouse fire, Chief Boden makes a risky last-minute decision in an effort to save his men. Dawson continues to deal with her father, who has new plans for himself. Brett's childhood friend Hope visits the Windy City and strikes the attention of someone within the firehouse, while Kidd goes head-to-head with her landlord. Meanwhile, a fire at a high school hits close to home for Boden."
      },
      {
        "id": "tvmaze:1231662",
        "title": "Ignite on Contact",
        "season": 6,
        "episode": 2,
        "released": "2017-10-05",
        "overview": "After learning the school fire wasn't an accident, Chief Boden turns up the pressure on Severide and Casey to investigate the cause of the fire that trapped his wife. Fueled by a competitive bet against Firehouse 87, Mouch pushes all of the wrong buttons in his need to win the competitive challenge known as the firefighter muster. Meanwhile, as Kidd settles into her new living arrangement, her unresolved feelings prompt her to question the intentions of newcomer Hope."
      },
      {
        "id": "tvmaze:1231663",
        "title": "An Even Bigger Surprise",
        "season": 6,
        "episode": 3,
        "released": "2017-10-12",
        "overview": "Lt. Casey gets off on the wrong foot with Sam Mullins, a temporary Chief who is filling in for Boden at House 51 for the morning. When Casey later makes a risky move in an attempt to save a distraught man from jumping off a building, Mullins has a surprise that Casey does not expect. Mouch flies in Cruz's brother Leon as a birthday surprise, but the rest of the squad struggles to keep it a secret. Meanwhile, Brett is caught off guard when she learns new information about her hometown friend Hope."
      },
      {
        "id": "tvmaze:1231664",
        "title": "A Breaking Point",
        "season": 6,
        "episode": 4,
        "released": "2017-10-19",
        "overview": "While running a secret errand, Dawson finds herself trapped in a collapsed parking structure. With all paths of exit blocked, she is forced to improvise and works double-duty to keep a number of injured individuals alive while trying to maintain peace among those trapped. Meanwhile, pressure is mounting on Casey as he begins to take on additional duties, Kidd grows increasingly skeptical of Hope after learning about rumors circulating and the firehouse receives a surprise visitor."
      },
      {
        "id": "tvmaze:1231665",
        "title": "Devil's Bargain",
        "season": 6,
        "episode": 5,
        "released": "2017-10-26",
        "overview": "Casey and Severide find themselves at odds after Casey argues with him over the best way to save a teenager entangled in barbed wire. When Casey looks to Boden for help smoothing out the situation, he comes to the realization that he will have to fix it himself. Elsewhere, Otis tries to convince Casey to participate in the beta test for an expensive piece of new firefighting equipment imported from Japan. Meanwhile, Kidd and Hope come to blows over a payroll issue and Brett goes on a date with a doctor she meets during an ambo call."
      },
      {
        "id": "tvmaze:1276928",
        "title": "Down is Better",
        "season": 6,
        "episode": 6,
        "released": "2017-11-02",
        "overview": "After heroically saving a mother and newborn baby from a rooftop fire, Kidd receives surprising news when she discovers she is being transferred out of the firehouse. Severide and Casey believe something is off about the turn of events, prompting them to investigate the situation. Otis and Herrmann discuss the possibilities of taking over a rundown bar and Dawson's frustration with her father, Ramon, reaches a boiling point."
      },
      {
        "id": "tvmaze:1344246",
        "title": "A Man's Legacy",
        "season": 6,
        "episode": 7,
        "released": "2018-01-04",
        "overview": "Brett attempts to make a lifesaving decision in the field to someone near and dear to the firehouse family. In an effort to impress Lily, Otis scrambles to get everything together for the grand opening of Molly's North. Meanwhile, Boden becomes emotional following the rescue of a famous blues player from a burning apartment building and Dawson struggles to come to terms with how she has been dealing with her father."
      },
      {
        "id": "tvmaze:1344247",
        "title": "The Whole Point of Being Roommates",
        "season": 6,
        "episode": 8,
        "released": "2018-01-11",
        "overview": "After saving a young girl, Dawson is forced to make a tough decision when she finds out the girl's father is addicted to painkillers. Herrmann loses his cool and gets into an altercation with a police officer after responding to a call. Otis and Cruz are on a mission to find out who Brett is dating. Meanwhile, Boden is skeptical when Donna's brother Julian unexpectedly comes to town."
      },
      {
        "id": "tvmaze:1344248",
        "title": "Foul is Fair",
        "season": 6,
        "episode": 9,
        "released": "2018-01-18",
        "overview": "After learning unsettling news, Dawson enlists Severide to help her out. Elsewhere, Casey and Dawson struggle with communication issues while Brett and Kidd compete to win the heart of Zach, a Hazmat officer. Meanwhile, Otis, Herrmann and Mouch are on a mission to locate the source of a horrible stench that is making life unpleasant at Firehouse 51."
      },
      {
        "id": "tvmaze:1344249",
        "title": "Slamigan",
        "season": 6,
        "episode": 10,
        "released": "2018-01-25",
        "overview": "Dawson and Casey do everything they can to locate Bria's whereabouts after discovering important new information. Lt. Severide reunites with Chief Grissom, an old family friend. Meanwhile, Cruz enlists the help of Brett and Mouch to create a new tool and Kidd and Zach go on a date."
      },
      {
        "id": "tvmaze:1344250",
        "title": "Law of the Jungle",
        "season": 6,
        "episode": 11,
        "released": "2018-02-01",
        "overview": "After responding to a time-sensitive rescue, Casey and Severide don't see eye to eye on the best course of action. Herrmann struggles to entertain his daughter on \"bring your child to work day.\" Brett is joined by a surprise guest during a spa getaway, courtesy of Dawson, while Kidd's social life gets a boost."
      },
      {
        "id": "tvmaze:1389426",
        "title": "The F is For",
        "season": 6,
        "episode": 12,
        "released": "2018-03-01",
        "overview": "After photos of Casey and Severide jumping off the roof during a heroic rescue make the front page of the newspaper, Boden unwillingly agrees for the photographer to chronicle a day-in-the-life story at the Firehouse. Dawson and Brett are on a mission to find out what keeps happening to Gerald, a frequent flier they know who lives on the streets. Meanwhile, Herrmann decides to take up life-coaching as a side job and Kidd makes a decision regarding her living arrangement with Severide."
      },
      {
        "id": "tvmaze:1410586",
        "title": "Hiding Not Seeking",
        "season": 6,
        "episode": 13,
        "released": "2018-03-08",
        "overview": "While working to track down a bombing suspect, Voight and Antonio meet with Chief Boden, who unwillingly agrees to let Dawson and Brett go undercover. As the investigation continues, Boden, Casey and Severide lend their skilled expertise in the investigation. Elsewhere, Kidd and Zach's relationship hits a bump and Cruz has a hard time expressing his true feelings for Brett. Meanwhile, Herrmann and Connie are forced to come up with an alternative solution when two birthday parties are booked on the same day at the firehouse."
      },
      {
        "id": "tvmaze:1414752",
        "title": "Looking for a Lifeline",
        "season": 6,
        "episode": 14,
        "released": "2018-03-22",
        "overview": "After responding to a car accident, Casey and Dawson become skeptical when a domineering husband continues to answer for his injured wife. Cruz becomes frustrated with Herrmann and Mouch when he discovers they have contacted people regarding his \"Slamigan\" invention without his knowledge. Kidd uncovers something meaningful and important to Severide while Brett discovers some potentially unsettling news."
      },
      {
        "id": "tvmaze:1418591",
        "title": "The Chance to Forgive",
        "season": 6,
        "episode": 15,
        "released": "2018-03-22",
        "overview": "In response to a call involving a residential fire, Otis and Kidd's lives are suddenly put in jeopardy when gunfire goes off inside the house. Dawson comforts Brett during an especially trying time. Meanwhile, Casey begins to notice that romance might be going on within the firehouse."
      },
      {
        "id": "tvmaze:1422133",
        "title": "The One That Matters Most",
        "season": 6,
        "episode": 16,
        "released": "2018-03-29",
        "overview": "Herrmann, along with members of house 51, struggle to come to terms with an injury to one of their own, and then must deal with the new temporary replacement. Boden ponders some interesting news while Kidd has a hard time keeping a secret."
      },
      {
        "id": "tvmaze:1422134",
        "title": "Put White on Me",
        "season": 6,
        "episode": 17,
        "released": "2018-04-05",
        "overview": "Boden has a lapse in judgment in the aftermath of rescuing a young boy. Kidd struggles to win the approval of Severide's mom after a surprise visit and Otis takes on new responsibilities at the firehouse."
      },
      {
        "id": "tvmaze:1422135",
        "title": "When They See Us Coming",
        "season": 6,
        "episode": 18,
        "released": "2018-04-12",
        "overview": "When the FBI takes over Firehouse 51 for an undercover mission, Casey and Severide volunteer to assist with the investigation. Kidd attempts to help Severide come to terms with recent developments he's been managing."
      },
      {
        "id": "tvmaze:1422136",
        "title": "Where I Want to Be",
        "season": 6,
        "episode": 19,
        "released": "2018-04-19",
        "overview": "After responding to a residential fire at a property belonging to a Mexican drug cartel, Casey is skeptical of Cordova after a hefty amount of money was found missing from the crime scene. Elsewhere, Kidd makes a big decision."
      },
      {
        "id": "tvmaze:1422137",
        "title": "The Strongest Among Us",
        "season": 6,
        "episode": 20,
        "released": "2018-04-26",
        "overview": "After saving a girl from a car accident, Chief Boden and Lt. Severide are taken aback when they receive a surprise package. Brett struggles to keep quiet about Cruz reacquainting with his now-married high school sweetheart and Otis tackles his next challenge. A crisis brings Bria back into Dawson's life."
      },
      {
        "id": "tvmaze:1422138",
        "title": "The Unrivaled Standard",
        "season": 6,
        "episode": 21,
        "released": "2018-05-03",
        "overview": "Lt. Severide is shocked when Rene Royce resurfaces at the firehouse. Casey comes up with a plan to help Chief Boden in his latest pursuit. Kidd regrets a decision she made regarding Severide. Herrmann doesn't see eye-to-eye with Lt. Colannino over coaching their son's basketball team."
      },
      {
        "id": "tvmaze:1422139",
        "title": "One for the Ages",
        "season": 6,
        "episode": 22,
        "released": "2018-05-10",
        "overview": "Boden takes a big step in the pursuit of a major career decision. Kidd becomes increasingly distrustful of Renee's motives with Severide. Herrmann has trouble bouncing back after a tragedy."
      },
      {
        "id": "tvmaze:1422140",
        "title": "The Grand Gesture",
        "season": 6,
        "episode": 23,
        "released": "2018-05-10",
        "overview": "Boden's chances for a promotion are met with potential complications, leading him to take matters into his own hands. Dawson and Casey don't see eye to eye on an important decision, while Kidd finds herself struggling to find time with Severide. Brett and Dawson respond to a tough call that quickly turns dangerous."
      },
      {
        "id": "tvmaze:1482235",
        "title": "A Closer Eye",
        "season": 7,
        "episode": 1,
        "released": "2018-09-26",
        "overview": "Casey tries to deal with his unsettled personal life and the firehouse welcomes a new member. Boden clashes with new Assistant Deputy Commissioner Jerry Gorsch."
      },
      {
        "id": "tvmaze:1511241",
        "title": "Going to War",
        "season": 7,
        "episode": 2,
        "released": "2018-10-03",
        "overview": "Firehouse 51 is faced with a daunting challenge when an out-of-control blaze consumes a 15-story apartment complex, trapping victims on the top floors. Complicating the rapidly escalating situation, members soon discover that someone close to home may be one of the trapped victims."
      },
      {
        "id": "tvmaze:1511242",
        "title": "Thirty Percent Sleight of Hand",
        "season": 7,
        "episode": 3,
        "released": "2018-10-10",
        "overview": "Chief Boden becomes increasingly skeptical of Assistant Deputy Commissioner Gorsch's motives, while Severide gets wrapped up in a difficult situation following the rescue of a child from a car wreck. Trying to fit in with the rest of the firehouse, Foster is tasked with doling out some personal advice to Cruz."
      },
      {
        "id": "tvmaze:1511243",
        "title": "This Isn't Charity",
        "season": 7,
        "episode": 4,
        "released": "2018-10-17",
        "overview": "Firehouse 51 is on high alert when a series of explosions rock the city. Herrmann adjusts to his new duties and Kidd gets a visit from an old friend."
      },
      {
        "id": "tvmaze:1519369",
        "title": "A Volatile Mixture",
        "season": 7,
        "episode": 5,
        "released": "2018-10-24",
        "overview": "Working alongside a journalist, Casey does some digging into the cause of a trailer park fire. Boden hits his breaking point while Mouch, Herrmann and Cruz work to figure out why Molly's isn't performing up to expectations."
      },
      {
        "id": "tvmaze:1543135",
        "title": "All the Proof",
        "season": 7,
        "episode": 6,
        "released": "2018-10-31",
        "overview": "Halloween is in full effect for Foster and Brett, who are summoned to a home where a prank has quickly turned serious. Gorsch continues his reign of terror on Firehouse 51."
      },
      {
        "id": "tvmaze:1544596",
        "title": "What Will Define You",
        "season": 7,
        "episode": 7,
        "released": "2018-11-07",
        "overview": "Severide faces some major adversity and Kidd is on a mission to help in any way she can. Following a car accident rescue involving a teenage girl and her young sister, a suspicious Brett has an unsettling feeling there is more to the story than what appears on the surface."
      },
      {
        "id": "tvmaze:1544597",
        "title": "The Solution to Everything",
        "season": 7,
        "episode": 8,
        "released": "2018-11-14",
        "overview": "Firehouse 51 is called in to battle a dangerous structure fire that places everyone in peril. Severide makes a big personal realization. Casey lends another helping hand to Naomi, the investigative reporter."
      },
      {
        "id": "tvmaze:1544862",
        "title": "Always a Catch",
        "season": 7,
        "episode": 9,
        "released": "2018-12-05",
        "overview": "Stakes are high when a massive car pile-up on the freeway impacts someone dear to the firehouse family. Brett and Foster encounter a harrowing call while Kidd and Severide find their relationship being tested."
      },
      {
        "id": "tvmaze:1575308",
        "title": "Inside These Walls",
        "season": 7,
        "episode": 10,
        "released": "2019-01-09",
        "overview": "A dangerous situation leaves Casey and Naomi in peril. Foster and Brett are in charge of planning a field trip visit to the station while Severide and Kidd go through tough times."
      },
      {
        "id": "tvmaze:1585294",
        "title": "You Choose",
        "season": 7,
        "episode": 11,
        "released": "2019-01-16",
        "overview": "Severide's side project of fixing the boat for a wealthy acquaintance turns complicated and personal. Meanwhile, his relationship with Kidd is at a crossroads. Brett helps Casey search for a new apartment and Firehouse 51 decides to enter Tuesday in a dog competition."
      },
      {
        "id": "tvmaze:1587001",
        "title": "Make This Right",
        "season": 7,
        "episode": 12,
        "released": "2019-01-23",
        "overview": "When the firehouse is called to a motorcycle crash, Casey and Severide sense that the details don't add up and work to determine exactly what transpired. A rift develops between Mouch and Otis. Brett, Foster and Kidd work to secretly fix a dent in the ambulance bumper they believe they unknowingly caused."
      },
      {
        "id": "tvmaze:1595363",
        "title": "The Plunge",
        "season": 7,
        "episode": 13,
        "released": "2019-02-06",
        "overview": "Cruz leads the charge in getting the firehouse to gear up for the Polar Plunge. Herrmann has a hard time bouncing back after dealing with a tough call. Foster's personal relationships begin to interfere with her job."
      },
      {
        "id": "tvmaze:1599129",
        "title": "It Wasn't About Hockey",
        "season": 7,
        "episode": 14,
        "released": "2019-02-13",
        "overview": "Brett, Foster and Kidd take a road trip to Indiana for a getaway and encounter a bus accident involving a boy's hockey team that will leave them scrambling and relying on their instincts to save those hurt in the accident. The rest of Firehouse 51 competes in the annual Chili Cook-Off."
      },
      {
        "id": "tvmaze:1604838",
        "title": "What I Saw",
        "season": 7,
        "episode": 15,
        "released": "2019-02-20",
        "overview": "A spate of robberies comes to light after a firehouse lockbox key goes missing. CPD's Voight has suspicions that a firefighter may be involved, and with Boden's support he recruits Cruz to go undercover and help sniff out any suspicious activity."
      },
      {
        "id": "tvmaze:1607951",
        "title": "Fault in Him",
        "season": 7,
        "episode": 16,
        "released": "2019-02-27",
        "overview": "During an emergency call, an unsuspecting Lt. Casey suddenly finds his life in peril. Grissom (guest star Gary Cole) warns the firehouse that they will need to gear up for a performance evaluation. Otis discovers he won a raffle prize at a recent fundraiser and Brett is met with challenges in her personal life."
      },
      {
        "id": "tvmaze:1616051",
        "title": "Move a Wall",
        "season": 7,
        "episode": 17,
        "released": "2019-03-27",
        "overview": "Tensions run high between Casey and Herrmann after the firehouse responds to an apartment complex fire. After discovering something extremely suspicious during the call, Kidd and Severide do some investigating and get CPD on the case. Brett struggles to deal with her emotions while Herrmann's wife, Cindy, hopes to get her interior design business on track by taking a stab at redoing the common room."
      },
      {
        "id": "tvmaze:1616052",
        "title": "No Such Thing as Bad Luck",
        "season": 7,
        "episode": 18,
        "released": "2019-04-03",
        "overview": "Severide gets angry at Cruz when he feels his orders were disobeyed in the field. Boden reconnects with an old high school friend during a call to a house fire. Herrmann has issues when one of his favorite knick-knacks from Molly's goes missing."
      },
      {
        "id": "tvmaze:1616053",
        "title": "Until the Weather Breaks",
        "season": 7,
        "episode": 19,
        "released": "2019-04-24",
        "overview": "A horrible storm wreaks havoc on Chicago and impacts Firehouse 51 when the power goes off. A little boy mysteriously shows up at the station and everyone works together to uncover who he belongs to and why he ended up there. Foster and Kidd argue about Severide."
      },
      {
        "id": "tvmaze:1628164",
        "title": "Try Like Hell",
        "season": 7,
        "episode": 20,
        "released": "2019-05-08",
        "overview": "Severide and Boden search to uncover whether arson was the cause of a fire at a hair salon. Mouch, Herrmann, Otis and Kidd make a startling discovery in tracking down the missing piercing nozzle from Engine 27."
      },
      {
        "id": "tvmaze:1629685",
        "title": "The White Whale",
        "season": 7,
        "episode": 21,
        "released": "2019-05-15",
        "overview": "A serial arsonist cold case is reopened when Lt. Severide finds a connection to a recent salon fire. Firehouse 51 celebrates a retirement party."
      },
      {
        "id": "tvmaze:1629686",
        "title": "I'm Not Leaving You",
        "season": 7,
        "episode": 22,
        "released": "2019-05-22",
        "overview": "Severide and Kidd continue to investigate Benny's old arson case, unexpected news leads Brett to ponder a big decision and all hell breaks loose."
      },
      {
        "id": "tvmaze:1671998",
        "title": "Sacred Ground",
        "season": 8,
        "episode": 1,
        "released": "2019-09-25",
        "overview": "The mattress factory fire spirals out of control. Truck and squad lay it on the line in hopes of getting the trapped victims out alive."
      },
      {
        "id": "tvmaze:1683176",
        "title": "A Real Shot in the Arm",
        "season": 8,
        "episode": 2,
        "released": "2019-10-02",
        "overview": "Captain Casey struggles to get Chief Boden to sign off on an energetic new recruit. Against her better judgment, Foster extends an olive branch to her irritating new medic. Otis inspires Herrmann to seek new partners at Molly's. Brett realizes life in Fowlerton will take some getting used to."
      },
      {
        "id": "tvmaze:1690698",
        "title": "Badlands",
        "season": 8,
        "episode": 3,
        "released": "2019-10-09",
        "overview": "Brett and Foster question the suspicious circumstances surrounding a brutal attack at a juvenile detention center, which leaves them searching for the truth. A convoluted new technology installed inside Firehouse 51 tests everybody's patience. Kidd gets chosen to represent the district at a leadership conference."
      },
      {
        "id": "tvmaze:1705985",
        "title": "Infection, Part I",
        "season": 8,
        "episode": 4,
        "released": "2019-10-16",
        "overview": "A rare but deadly bacteria takes its toll on numerous victims around the city, leaving Chicago's finest first responders to work together alongside the CDC to resolve the dangerous situation. Following a fire at a local university that ties into the outbreak, Severide has suspicions that something bigger is happening.Part II continues on Chicago Med, Part III on Chicago PD."
      },
      {
        "id": "tvmaze:1705986",
        "title": "Buckle Up",
        "season": 8,
        "episode": 5,
        "released": "2019-10-23",
        "overview": "Kidd must prove herself at the National Firefighter Leadership Conference while the rest of Firehouse 51 is called to two eerily similar car wrecks. Mouch tries to keep everyone in the firehouse informed by starting a newsletter, but things quickly get out of hand. Cruz deals with a heartbreak."
      },
      {
        "id": "tvmaze:1714423",
        "title": "What Went Wrong",
        "season": 8,
        "episode": 6,
        "released": "2019-10-30",
        "overview": "Cruz and Severide suspect foul play when a fire started by an elderly woman turns deadly. Kidd, Foster and Brett create a women's-only lounge. Firehouse 51 celebrates some good news."
      },
      {
        "id": "tvmaze:1714424",
        "title": "Welcome to Crazytown",
        "season": 8,
        "episode": 7,
        "released": "2019-11-06",
        "overview": "Severide must make a tough decision about the future of his career at Firehouse 51. Herrmann deals with the consequences of his temper after a run-in with a Chicago police officer. Cruz is excited to demonstrate the Slamigan at the Firefighting Expo. Commissioner Grissom returns."
      },
      {
        "id": "tvmaze:1743833",
        "title": "Seeing Is Believing",
        "season": 8,
        "episode": 8,
        "released": "2019-11-13",
        "overview": "Severide begins his assignment at the Office of Fire Investigation and gets off on the wrong foot when, despite his orders, he reopens an old case. When the cause of an apartment fire hits close to home, Herrmann is on a mission to get to the bottom of it. Kidd finds herself burning the candle at both ends."
      },
      {
        "id": "tvmaze:1745310",
        "title": "Best Friend Magic",
        "season": 8,
        "episode": 9,
        "released": "2019-11-20",
        "overview": "An unexpected visit throws Casey for a loop. Severide sets out to exonerate a wrongly convicted arsonist. Kidd pays the price for burning the candle at both ends. Cruz goes on a mission to fix one of Otis's old toys."
      },
      {
        "id": "tvmaze:1758512",
        "title": "Hold Our Ground",
        "season": 8,
        "episode": 10,
        "released": "2020-01-08",
        "overview": "Members of Firehouse 51 are dismayed to learn their boundaries have been redrawn to overlap with an adjacent station and problems quickly arise. Casey and Gallo hunt a missing piece of equipment. Brett and Foster find themselves at odds. Mouch tries the find the recipient of a mysterious letter he discovers."
      },
      {
        "id": "tvmaze:1779946",
        "title": "Where We End Up",
        "season": 8,
        "episode": 11,
        "released": "2020-01-15",
        "overview": "A pest control problem forces the 51 team to temporarily bunk with Firehouse 20. All under the same roof, Casey clashes with Capt. Delaney while Foster, Kidd and Brett fear Capt. Leone has it out for them. Boden mulls a procedural overhaul."
      },
      {
        "id": "tvmaze:1779947",
        "title": "Then Nick Porter Happened",
        "season": 8,
        "episode": 12,
        "released": "2020-01-22",
        "overview": "A series of false alarms at a private school hinders the firehouse's ability to respond to legitimate emergency calls. Kidd asks for ideas to surprise Severide on his birthday. Cruz and Brett rent out their extra room, but the new tenant is more than they bargained for."
      },
      {
        "id": "tvmaze:1779948",
        "title": "A Chicago Welcome",
        "season": 8,
        "episode": 13,
        "released": "2020-02-05",
        "overview": "The surprising arrival of a new fire truck brings both joy and chaos to members of Firehouse 51. Boden and Severide are asked to make peace with an old foe for the greater good. Brett receives family news while Foster plans a party with friends."
      },
      {
        "id": "tvmaze:1779949",
        "title": "Shut It Down",
        "season": 8,
        "episode": 14,
        "released": "2020-02-12",
        "overview": "A series of mysterious gas leaks has members of Firehouse 51 puzzled and spread thin. Brett's conflicted when her birth mother gets serious about tracking her down. Severide misunderstands his role as Cruz's best man. Mouch bites off more than he can chew."
      },
      {
        "id": "tvmaze:1791181",
        "title": "Off the Grid",
        "season": 8,
        "episode": 15,
        "released": "2020-02-26",
        "overview": "A series of teen opioid overdoses sees Severide partner with Sean Roman, but begins to suspect there's more to the story than his old friend is telling him. Casey tries to be there for Brett as she considers her birth mother's offer to meet.Part 1 of Crossover with Chicago P.D."
      },
      {
        "id": "tvmaze:1801984",
        "title": "The Tendency of a Drowning Victim",
        "season": 8,
        "episode": 16,
        "released": "2020-03-04",
        "overview": "Boden is on edge after starting a new fad diet. Casey and Severide disagree on a call. Brett's birth mother shares life-altering news. A familiar face has a proposition for Herrmann."
      },
      {
        "id": "tvmaze:1801985",
        "title": "Protect a Child",
        "season": 8,
        "episode": 17,
        "released": "2020-03-18",
        "overview": "Things get personal for Casey and Gallo in the aftermath of a suburban house fire involving a mother and her young son. Herrmann campaigns for more respect. Kidd has an idea for giving back to her community."
      },
      {
        "id": "tvmaze:1814616",
        "title": "I'll Cover You",
        "season": 8,
        "episode": 18,
        "released": "2020-03-25",
        "overview": "Lt. Severide teams up with Seager and the OFI when a motel structure fire turns suspicious. Firehouse 51 members become amateur sleuths following a Reddit post involving one of their own. Brett continues to get invested in her birth mother, Julie."
      },
      {
        "id": "tvmaze:1822322",
        "title": "Light Things Up",
        "season": 8,
        "episode": 19,
        "released": "2020-04-08",
        "overview": "Tension builds when a group of rabble-rousers attempt to lock down the firehouse. Brett is faced with a monumental decision. Cruz readies himself for a big day. Gallo and Ritter attempt to launch Firehouse 51 into the social media age."
      },
      {
        "id": "tvmaze:1824905",
        "title": "51's Original Bell",
        "season": 8,
        "episode": 20,
        "released": "2020-04-15",
        "overview": "When one of 51's own gets injured on a call, Lt. Severide becomes obsessed with helping out. Foster contemplates a big decision. Kidd is concerned for one of her high school trainees."
      },
      {
        "id": "tvmaze:1920535",
        "title": "Rattle Second City",
        "season": 9,
        "episode": 1,
        "released": "2020-11-11",
        "overview": "Firehouse 51 welcomes a new member to the team, whose presence could provide some complications. Brett's leadership shines during a scary call. Boden sees great potential in Kidd and proposes an idea that could have lasting repercussions."
      },
      {
        "id": "tvmaze:1963555",
        "title": "That Kind of Heat",
        "season": 9,
        "episode": 2,
        "released": "2020-11-18",
        "overview": "Brett and Mackey find their lives in peril. Casey and Brett tread in unfamiliar territory. Severide chases a memory while Kidd adeptly solves a firehouse problem. Ritter puts himself in harms way during a harrowing call."
      },
      {
        "id": "tvmaze:1972302",
        "title": "Smash Therapy",
        "season": 9,
        "episode": 3,
        "released": "2021-01-13",
        "overview": "A mishap on the aerial ladder in the midst of a fire rescue leaves Mouch shaken and questioning his abilities. Kidd looks for support from Severide while Casey and Brett discuss their future."
      },
      {
        "id": "tvmaze:1992721",
        "title": "Funny What Things Remind Us",
        "season": 9,
        "episode": 4,
        "released": "2021-01-27",
        "overview": "While completing a task assigned to him by headquarters, Boden makes an unforeseen connection. When the firehouse is called to the site of a construction explosion, Gallo is forced to make a surprise rescue to one of their own. Mouch reignites an old feud."
      },
      {
        "id": "tvmaze:1995727",
        "title": "My Lucky Day",
        "season": 9,
        "episode": 5,
        "released": "2021-02-03",
        "overview": "When Firehouse 51 is called to the scene of a dangerous blaze inside a 10-story storage unit, Herrmann and Cruz find themselves trapped inside a freight elevator with all communications cut off."
      },
      {
        "id": "tvmaze:1995728",
        "title": "Blow This Up Somehow",
        "season": 9,
        "episode": 6,
        "released": "2021-02-10",
        "overview": "Gallo makes a split-second decision during a dangerous fire rescue leaving Casey steaming that his direct orders were not obeyed. Kidd feels a strain in her relationship with Severide. Brett and Mackey find themselves searching for answers following a series of suspicious calls."
      },
      {
        "id": "tvmaze:1995729",
        "title": "Dead of Winter",
        "season": 9,
        "episode": 7,
        "released": "2021-02-17",
        "overview": "A fire at a homeless encampment leaves Severide and Casey searching for answers. Cruz is shaken up after a close call. Ritter lends a helping hand to a victim."
      },
      {
        "id": "tvmaze:1995730",
        "title": "Escape Route",
        "season": 9,
        "episode": 8,
        "released": "2021-03-10",
        "overview": "A call to a familiar location brings back mixed emotions for Severide. Herrmann heads out for a vacation. Casey is not thrilled with his replacement."
      },
      {
        "id": "tvmaze:1995731",
        "title": "Double Red",
        "season": 9,
        "episode": 9,
        "released": "2021-03-17",
        "overview": "Mouch, Gallo, Ritter and Mackey report for training. A nasty blow to the head brings Casey unimaginable pain."
      },
      {
        "id": "tvmaze:1995732",
        "title": "One Crazy Shift",
        "season": 9,
        "episode": 10,
        "released": "2021-03-31",
        "overview": "A series of suspicious fires sends 51 on a search for the cause. Casey continues down a troubling path. Mouch is looking to make his long-awaited dream come true."
      },
      {
        "id": "tvmaze:1995733",
        "title": "A Couple Hundred Degrees",
        "season": 9,
        "episode": 11,
        "released": "2021-04-07",
        "overview": "A new recruit with ties to the CFD tests Serveride's patience. Violet receives a mysterious note that sends her and Brett on a hunt for the person who wrote it."
      },
      {
        "id": "tvmaze:2043646",
        "title": "Natural Born Firefighter",
        "season": 9,
        "episode": 12,
        "released": "2021-04-21",
        "overview": "While Mouch makes an incredible save, all eyes are on a mystery man who helped save his neighbor. Casey worries about his future at the CFD."
      },
      {
        "id": "tvmaze:2043647",
        "title": "Don't Hang Up",
        "season": 9,
        "episode": 13,
        "released": "2021-05-05",
        "overview": "A mysterious caller who is in danger relies on Kidd to help save her and her brother. The firehouse helps Cruz get ready for fatherhood."
      },
      {
        "id": "tvmaze:2077034",
        "title": "What Comes Next",
        "season": 9,
        "episode": 14,
        "released": "2021-05-12",
        "overview": "A fire breaks out at a pet food factory and Casey and Severide help the owner, Pete, get to the bottom of it. The annual garage sale takes place at 51 and everyone is on edge."
      },
      {
        "id": "tvmaze:2083351",
        "title": "A White-Knuckle Panic",
        "season": 9,
        "episode": 15,
        "released": "2021-05-19",
        "overview": "Severide and Casey try to find the best fit for Kidd. Ritter, Gallo and Violet help plan an event for Mouch."
      },
      {
        "id": "tvmaze:2060968",
        "title": "No Survivors",
        "season": 9,
        "episode": 16,
        "released": "2021-05-26",
        "overview": "The firehouse reacts to some exciting news, a mysterious stranger arrives and a shocking call takes Severide's breath away."
      },
      {
        "id": "tvmaze:2131694",
        "title": "Mayday",
        "season": 10,
        "episode": 1,
        "released": "2021-09-22",
        "overview": "Firehouse 51 deals with the aftermath of the capsized boat rescue. Gallo, Ritter and Violet discuss plans for a side gig."
      },
      {
        "id": "tvmaze:2157196",
        "title": "Head Count",
        "season": 10,
        "episode": 2,
        "released": "2021-09-29",
        "overview": "A video of Casey from the roof rescue goes viral. Mouch sets up a Little Free Library at Firehouse 51. Herrmann breaks protocol."
      },
      {
        "id": "tvmaze:2157197",
        "title": "Counting Your Breaths",
        "season": 10,
        "episode": 3,
        "released": "2021-10-06",
        "overview": "Griffin learns the truth about his father's death and reveals why he really came to visit Casey. Gallo, Ritter and Violet take steps to expand their microbrewery business."
      },
      {
        "id": "tvmaze:2175392",
        "title": "The Right Thing",
        "season": 10,
        "episode": 4,
        "released": "2021-10-13",
        "overview": "Kidd spreads her wings as a lieutenant. Chief Hawkins rides with Ambulance 61 to learn more about Brett. Casey takes a trip out of town. A Ritter date night turns into an emergency situation."
      },
      {
        "id": "tvmaze:2175393",
        "title": "Two Hundred",
        "season": 10,
        "episode": 5,
        "released": "2021-10-20",
        "overview": "Casey makes a life-altering decision. Gallo, Ritter and Violet agree to an interview and photo shoot. Brett and Mouch launch the paramedicine program. Cruz comes closer to fatherhood."
      },
      {
        "id": "tvmaze:2175394",
        "title": "Dead Zone",
        "season": 10,
        "episode": 6,
        "released": "2021-10-27",
        "overview": "A major security breach in the city's computer networks forces Firehouse 51's senior leaders to take matters into their own hands. Severide gears up for an arson investigation."
      },
      {
        "id": "tvmaze:2196920",
        "title": "Whom Shall I Fear?",
        "season": 10,
        "episode": 7,
        "released": "2021-11-03",
        "overview": "Gallo clashes with the new lieutenant temporarily filling in for Casey. Severide closes in on a dangerous and deadly arsonist."
      },
      {
        "id": "tvmaze:2201960",
        "title": "What Happened at Whiskey Point?",
        "season": 10,
        "episode": 8,
        "released": "2021-11-10",
        "overview": "Severide and Herrmann clash over office space. Boden looks at Pelham's past as he considers making him permanent. Gallo's resentment of Pelham comes to a head. Brett and Ritter force Violet to confront her true feelings for Gallo."
      },
      {
        "id": "tvmaze:2210980",
        "title": "Winterfest",
        "season": 10,
        "episode": 9,
        "released": "2021-12-08",
        "overview": "Gallo, Violet and Ritter debut their microbrewery business at Winterfest. Brett prepares to present her paramedicine program to an oversight panel. Firehouse 51 gets in the holiday spirit."
      },
      {
        "id": "tvmaze:2212711",
        "title": "Back With a Bang",
        "season": 10,
        "episode": 10,
        "released": "2022-01-05",
        "overview": "Stella Kidd returns to Firehouse 51. The team must work together to put out a potassium fire in a tunnel. After that incident, Ritter begins to worry about a young cop who witnessed the fiery death of a truck driver."
      },
      {
        "id": "tvmaze:2243760",
        "title": "Fog of War",
        "season": 10,
        "episode": 11,
        "released": "2022-01-12",
        "overview": "On a call with Station 37, a firefighter is struck by a power line and decides to lash out after her injury. Brett is visited by Scott and Amelia. Violet gets a surprise envelope. The rest of 51 enters a contest."
      },
      {
        "id": "tvmaze:2243761",
        "title": "Show of Force",
        "season": 10,
        "episode": 12,
        "released": "2022-01-19",
        "overview": "Boden, Kidd and Severide work together to protect one of their own. At the Fire Academy, Herrmann meets an inspiring young man. Talk of the annual CFD Gala dominates the firehouse."
      },
      {
        "id": "tvmaze:2244519",
        "title": "Fire Cop",
        "season": 10,
        "episode": 13,
        "released": "2022-02-23",
        "overview": "Severide and Seager team up to investigate a fire at the home of a troubled young woman. Pelham moves into 51's rumored cursed office. Kylie assists Kidd with Girls on Fire."
      },
      {
        "id": "tvmaze:2244526",
        "title": "An Officer with Grit",
        "season": 10,
        "episode": 14,
        "released": "2022-03-02",
        "overview": "Chief Hawkins goes above and beyond to help Brett and Violet with a problem. Kidd pursues an open lieutenant position. A blast from the past asks Mouch and Herrmann for a favor."
      },
      {
        "id": "tvmaze:2244522",
        "title": "The Missing Piece",
        "season": 10,
        "episode": 15,
        "released": "2022-03-09",
        "overview": "Following an injury in the aftermath of an industrial fire, Severide and Seager work together to investigate an anonymous tip. Kidd searches for the right person to fill the open spot on Truck 81. A possible new recruit to 51 gets tested at a call."
      },
      {
        "id": "tvmaze:2264366",
        "title": "Hot and Fast",
        "season": 10,
        "episode": 16,
        "released": "2022-03-16",
        "overview": "Cruz forms a bond with a young immigrant boy he meets while fighting an apartment fire. Squad makes plans to prank the newest member of their team. Hawkins and Violet struggle to keep their relationship a secret."
      },
      {
        "id": "tvmaze:2264367",
        "title": "Keep You Safe",
        "season": 10,
        "episode": 17,
        "released": "2022-04-06",
        "overview": "Severide and Kidd work with CPD regarding a suspicious car wreck. Hawkins and Violet's relationship is in jeopardy. Chloe and Cruz adjust to a new family dynamic."
      },
      {
        "id": "tvmaze:2264368",
        "title": "What's Inside You",
        "season": 10,
        "episode": 18,
        "released": "2022-04-13",
        "overview": "Firehouse 51 must band together when one of their own is taken hostage."
      },
      {
        "id": "tvmaze:2301234",
        "title": "Finish What You Started",
        "season": 10,
        "episode": 19,
        "released": "2022-04-20",
        "overview": "Firehouse 51 tackles a fire caused by a dropped jet engine and one of their own is accused of a theft related to the incident. Kidd and Boden disapprove of Kylie's potential new love interest."
      },
      {
        "id": "tvmaze:2301235",
        "title": "Halfway to the Moon",
        "season": 10,
        "episode": 20,
        "released": "2022-05-11",
        "overview": "A family friend asks Herrmann for some advice on opening a bar. Tensions run high between Emma and Violet. Kidd struggles to keep her team together."
      },
      {
        "id": "tvmaze:2301236",
        "title": "Last Chance",
        "season": 10,
        "episode": 21,
        "released": "2022-05-18",
        "overview": "Mouch and Ritter work together to solve a murder mystery. Severide and Cruz tackle a food truck fire. Gallo goes to see Hawkins about Violet."
      },
      {
        "id": "tvmaze:2301237",
        "title": "The Magnificent City of Chicago",
        "season": 10,
        "episode": 22,
        "released": "2022-05-25",
        "overview": "The big wedding day arrives and Firehouse 51 welcomes Casey back to celebrate the joyous occasion. Emma's plans to replace Violet come to a shocking end."
      },
      {
        "id": "tvmaze:2355088",
        "title": "Hold on Tight",
        "season": 11,
        "episode": 1,
        "released": "2022-09-21",
        "overview": "Kidd and Severide's honeymoon is interrupted by a dangerous person from their past. Kidd's former academy classmate joins Firehouse 51. Brett and Violet reflect on their relationships."
      },
      {
        "id": "tvmaze:2373097",
        "title": "Every Scar Tells a Story",
        "season": 11,
        "episode": 2,
        "released": "2022-09-28",
        "overview": "Javi spends a couple of shifts at Firehouse 51. Kidd and Carver work together to help Carver's former boss. As Hawkins and Violet's relationship blossoms, Gallo turns his attention elsewhere."
      },
      {
        "id": "tvmaze:2390659",
        "title": "Completely Shattered",
        "season": 11,
        "episode": 3,
        "released": "2022-10-05",
        "overview": "Kidd recruits Carver, Capp and Tony to help prepare her new lieutenant's quarters. Severide and Det. Pryma reluctantly pair up to work a police investigation. Firehouse 51 comes together to fight a movie theater fire."
      },
      {
        "id": "tvmaze:2390660",
        "title": "The Center of the Universe",
        "season": 11,
        "episode": 4,
        "released": "2022-10-12",
        "overview": "Kidd gets a glimpse into Carver's chaotic personal life; Mouch and Herrmann receive an unexpected gift."
      },
      {
        "id": "tvmaze:2390661",
        "title": "Haunted House",
        "season": 11,
        "episode": 5,
        "released": "2022-10-19",
        "overview": "Firehouse 51 hosts a Halloween open house. Kidd and Severide help a young girl after she gets kicked out of her home."
      },
      {
        "id": "tvmaze:2390662",
        "title": "All-Out Mystery",
        "season": 11,
        "episode": 6,
        "released": "2022-11-02",
        "overview": "Severide and Kidd investigate an explosion at a jewelry store. Cruz and Chloe take steps to make Javi a permanent part of their family. Gallo, Ritter and Mouch try to bond with Carver."
      },
      {
        "id": "tvmaze:2420015",
        "title": "Angry Is Easier",
        "season": 11,
        "episode": 7,
        "released": "2022-11-09",
        "overview": "Herrmann is tasked with fulfilling a man's dying wish. Kidd reflects on her Girls on Fire program after one of her students graduates from the Fire Academy. A heckler harasses Firehouse 51."
      },
      {
        "id": "tvmaze:2424857",
        "title": "A Beautiful Life",
        "season": 11,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "Det. Pryma asks for Severide's help on a case involving explosives. Gallo and Carver clash after Gallo improvises on a call. Violet encourages Brett to start dating again."
      },
      {
        "id": "tvmaze:2427582",
        "title": "Nemesis",
        "season": 11,
        "episode": 9,
        "released": "2022-12-07",
        "overview": "Severide struggles with the cost of helping Det. Pryma with the Martucci case. Gallo campaigns for Herrmann to represent 51 at the National Firefighter's Association's Winter Conference. A familiar face makes a shocking return."
      },
      {
        "id": "tvmaze:2427583",
        "title": "Something for the Pain",
        "season": 11,
        "episode": 10,
        "released": "2023-01-04",
        "overview": "Det. Pryma's case comes to an explosive end with Kidd and Carver's lives in danger. Brett installs an infant Safe Surrender Box at 51. Violet is determined to take Emma down."
      },
      {
        "id": "tvmaze:2448451",
        "title": "A Guy I Used to Know",
        "season": 11,
        "episode": 11,
        "released": "2023-01-11",
        "overview": "Firehouse 51 prepares for their semi-annual firehouse inspection. Brett fights to save her paramedicine program. Commander Martin Pearce asks Severide for a favor."
      },
      {
        "id": "tvmaze:2458949",
        "title": "How Does It End?",
        "season": 11,
        "episode": 12,
        "released": "2023-01-18",
        "overview": "Truck and Squad clash after a tense call rescuing a doomsday prepper. Herrmann struggles with Cindy's diagnosis. Violet gives Brett and Gallo dating advice."
      },
      {
        "id": "tvmaze:2470830",
        "title": "The Man of the Moment",
        "season": 11,
        "episode": 13,
        "released": "2023-02-15",
        "overview": "Firehouse 51 helps Herrmann put on a school fundraiser. Carver's troubled brother comes to town. A grateful citizen is determined to thank Brett and Severide for saving his life."
      },
      {
        "id": "tvmaze:2478986",
        "title": "Run Like Hell",
        "season": 11,
        "episode": 14,
        "released": "2023-02-22",
        "overview": "An annoying floater takes a romantic interest in Violet. Ritter catches a local politician in a compromising position. Mouch and Severide help Trudy with an arson investigation."
      },
      {
        "id": "tvmaze:2488723",
        "title": "Damage Control",
        "season": 11,
        "episode": 15,
        "released": "2023-03-01",
        "overview": "Kidd, Seager and Carver investigate a fire at the city stables. Kylie clashes with some of the firefighters over changes due to budget cuts. Herrmann struggles to keep it together as Cindy's condition worsens."
      },
      {
        "id": "tvmaze:2495071",
        "title": "Acting Up",
        "season": 11,
        "episode": 16,
        "released": "2023-03-22",
        "overview": "Cruz feels the burden of his increased responsibilities. Kidd, Gallo and Carver get caught in the middle of a gang war on a call. Herrmann wrangles Trudy for help lifting Cindy's mood."
      },
      {
        "id": "tvmaze:2505434",
        "title": "The First Symptom",
        "season": 11,
        "episode": 17,
        "released": "2023-03-29",
        "overview": "Mouch builds a classic firetruck model for the Deputy District Chief, but quickly needs some assistance from Gallo and Ritter. Brett and Violet encounter multiple victims with a strange set of symptoms. The results of Cindy's chemotherapy loom over the Herrmann family."
      },
      {
        "id": "tvmaze:2509774",
        "title": "Danger Is All Around",
        "season": 11,
        "episode": 18,
        "released": "2023-04-05",
        "overview": "A familiar face returns to Firehouse 51 to serve with Kidd on a special task force. With Tony days away from breaking the CFD's perfect attendance record, Mouch and Capp work to keep him safe. Old memories and grudges resurface when Gallo reunites with a family member."
      },
      {
        "id": "tvmaze:2514054",
        "title": "Take a Shot at the King",
        "season": 11,
        "episode": 19,
        "released": "2023-05-03",
        "overview": "Boden, Ritter, Herrmann and Kidd work together to take down a local politician responsible for a chemical fire. After his aunt's accident, Gallo worries about their future. Brett steps in to perform Dylan's magic show when he's out of town."
      },
      {
        "id": "tvmaze:2514055",
        "title": "Never, Ever Make a Mistake",
        "season": 11,
        "episode": 20,
        "released": "2023-05-10",
        "overview": "Herrmann works on becoming a better man after Cindy's cancer journey. Kidd bonds with a homeless victim on a call. Kylie takes her firefighter exams. A harrowing call takes a toll on Brett."
      },
      {
        "id": "tvmaze:2514056",
        "title": "Change of Plans",
        "season": 11,
        "episode": 21,
        "released": "2023-05-17",
        "overview": "Carver deals with the fallout of his arrest. Brett searches for closure with the baby she rescued. Capp weasels his way into the Firehouse 51 group chat."
      },
      {
        "id": "tvmaze:2514057",
        "title": "Red Waterfall",
        "season": 11,
        "episode": 22,
        "released": "2023-05-24",
        "overview": "Brett waits for life-changing news. Herrmann encounters a psychic with a grave warning on a call. Kidd finds a new lead on the Homeland Security case."
      },
      {
        "id": "tvmaze:2691451",
        "title": "Barely Gone",
        "season": 12,
        "episode": 1,
        "released": "2024-01-17",
        "overview": "Firehouse 51 is forced to share its space with Firehouse 17. Kidd and Herrmann fight over Ritter. An arson case tests Kidd and Severide's relationship. Firehouse 51 says goodbye to one of its own."
      },
      {
        "id": "tvmaze:2696323",
        "title": "Call Me McHolland",
        "season": 12,
        "episode": 2,
        "released": "2024-01-24",
        "overview": "Mouch sets out to change his legacy and nickname; Ritter pushes Herrmann to see a doctor."
      },
      {
        "id": "tvmaze:2696324",
        "title": "Trapped",
        "season": 12,
        "episode": 3,
        "released": "2024-01-31",
        "overview": "After witnessing a domestic dispute, Brett and Violet decide to take the investigation into their own hands. Mouch vets Truck 81's new firefighter. Herrmann relies on something new to aid him on the job."
      },
      {
        "id": "tvmaze:2722890",
        "title": "The Little Things",
        "season": 12,
        "episode": 4,
        "released": "2024-02-07",
        "overview": "Julia spends a couple of days at 51. Boden's stepson, James, returns desperate for Boden to help his mother. After a little girl starts a fire in her backyard, Kidd and her team decide to dig deeper."
      },
      {
        "id": "tvmaze:2749693",
        "title": "On the Hook",
        "season": 12,
        "episode": 5,
        "released": "2024-02-21",
        "overview": "After their defibrillator malfunctions on a call, Brett and Violet search for answers. Herrmann tries to find the perfect home for his new recliner. A secret from Gibson's past comes to light."
      },
      {
        "id": "tvmaze:2749694",
        "title": "Port in the Storm",
        "season": 12,
        "episode": 6,
        "released": "2024-02-28",
        "overview": "Firehouse 51 welcomes back some familiar faces and says goodbye to Brett. Violet scrambles to decorate Brett's wedding venue. A call at the expo center takes a shocking turn."
      },
      {
        "id": "tvmaze:2783294",
        "title": "Red Flag",
        "season": 12,
        "episode": 7,
        "released": "2024-03-20",
        "overview": "Violet clashes with her new partner. Severide discovers a hidden stash of money on a call and squares off against the cops working the case. Mouch gets a parking ticket."
      },
      {
        "id": "tvmaze:2783677",
        "title": "All the Dark",
        "season": 12,
        "episode": 8,
        "released": "2024-03-27",
        "overview": "A hazmat call at a dialysis center leads to a shocking discovery. Boden clashes with Paramedic Chief Robinson. Carver notices a concerning change in Gibson's behavior."
      },
      {
        "id": "tvmaze:2800194",
        "title": "Something About Her",
        "season": 12,
        "episode": 9,
        "released": "2024-04-03",
        "overview": "Severide, Kidd and Van Meter investigate a fire at a recording studio. Kylie helps James keep a secret from Boden. Mouch struggles to maintain boundaries with a paramedicine client."
      },
      {
        "id": "tvmaze:2804959",
        "title": "The Wrong Guy",
        "season": 12,
        "episode": 10,
        "released": "2024-05-01",
        "overview": "Severide steps in as ranking officer at 51. Kidd fights to save her Girls on Fire program. Cruz's family is threatened when someone from Javi's past resurfaces."
      },
      {
        "id": "tvmaze:2828137",
        "title": "Inside Man",
        "season": 12,
        "episode": 11,
        "released": "2024-05-08",
        "overview": "Severide goes for an unexpected ride on Truck 81. Ritter's worlds collide when his secret cop boyfriend helps 51 track down Severide and the missing rig."
      },
      {
        "id": "tvmaze:2828138",
        "title": "Under Pressure",
        "season": 12,
        "episode": 12,
        "released": "2024-05-15",
        "overview": "Severide and Violet risk clashing with Paramedic Chief Robinson after Lennox makes a dangerous decision on a call. Capp and Tony attempt to break a world record. Cruz and Chloe's marriage problems come to a head."
      },
      {
        "id": "tvmaze:2830282",
        "title": "Never Say Goodbye",
        "season": 12,
        "episode": 13,
        "released": "2024-05-22",
        "overview": "Boden makes a decision that impacts the race for Deputy Commissioner. A tense call brings up painful memories for Carver and Damon. Mouch struggles to adjust to the new Truck."
      },
      {
        "id": "tvmaze:2939448",
        "title": "A Monster in the Field",
        "season": 13,
        "episode": 1,
        "released": "2024-09-25",
        "overview": "A new chief shakes things up at Firehouse 51; Violet and Novak work to uncover the truth behind a car crash; Cruz keeps a watchful eye on Severide and Damon's growing bond."
      },
      {
        "id": "tvmaze:3005570",
        "title": "Ride the Blade",
        "season": 13,
        "episode": 2,
        "released": "2024-10-02",
        "overview": "After Damon disobeys Kidd's orders on a call, he turns to Severide to protect him; Herrmann searches for the perfect scent to spice things up with Cindy."
      },
      {
        "id": "tvmaze:3005571",
        "title": "All Kinds of Crazy",
        "season": 13,
        "episode": 3,
        "released": "2024-10-09",
        "overview": "Severide and Van Meter investigate a fire at a family-owned restaurant. Pascal questions Kidd's leadership."
      },
      {
        "id": "tvmaze:3015744",
        "title": "Through the Skin",
        "season": 13,
        "episode": 4,
        "released": "2024-10-16",
        "overview": "Violet risks her job to deliver a baby on a tragic call. Mouch, Capp and Tony help Cruz track down Javi's stolen bike."
      },
      {
        "id": "tvmaze:3024006",
        "title": "Down the Rabbit Hole",
        "season": 13,
        "episode": 5,
        "released": "2024-10-23",
        "overview": "Kidd and Severide investigate a trucking company responsible for a string of accidents. Herrmann recruits Kylie to help get new radios. Firehouse 51 celebrates Violet's birthday. Carver's allegiances are torn."
      },
      {
        "id": "tvmaze:3032281",
        "title": "Birds of Prey",
        "season": 13,
        "episode": 6,
        "released": "2024-11-06",
        "overview": "Severide gets wrapped up in an Illinois State Police investigation after discovering illegal guns on a call. A bird harasses Mouch on the apparatus floor. Kidd keeps an eye on Carver as his attitude worsens."
      },
      {
        "id": "tvmaze:3032282",
        "title": "Untouchable",
        "season": 13,
        "episode": 7,
        "released": "2024-11-13",
        "overview": "Pascal and Severide revisit the storage facility fire in hopes of uncovering new evidence. Cruz helps Mouch take his studying to the next level. Novak prepares a proposal for Chief Robinson for a whole blood program."
      },
      {
        "id": "tvmaze:3032283",
        "title": "Quickstand",
        "season": 13,
        "episode": 8,
        "released": "2024-11-20",
        "overview": "Herrmann and Mouch prepare to take their officer exams. Cruz receives a chilling omen. Carver takes care of a dog after its owner is injured on a call."
      },
      {
        "id": "tvmaze:3058674",
        "title": "A Favor",
        "season": 13,
        "episode": 9,
        "released": "2025-01-08",
        "overview": "Cruz's past comes back to haunt him. Severide prepares to teach an arson class at the academy. Mouch searches for a victim's next of kin."
      },
      {
        "id": "tvmaze:3078388",
        "title": "Chaos Theory",
        "season": 13,
        "episode": 10,
        "released": "2025-01-22",
        "overview": "The team responds to a crisis at a community center. Severide is forced to investigate one of his own Squad members. Kidd helps a teacher going through a post-incident spin-out."
      },
      {
        "id": "tvmaze:3078390",
        "title": "In the Trenches: Part I",
        "season": 13,
        "episode": 11,
        "released": "2025-01-29",
        "overview": "Chicago's first responders unite in the wake of a catastrophic gas explosion and fire that threaten a city government building; Herrmann reluctantly shadows Pascal while Violet, Novak and Dr. Frost take charge of triage efforts on site."
      },
      {
        "id": "tvmaze:3114001",
        "title": "Relief Cut",
        "season": 13,
        "episode": 12,
        "released": "2025-02-05",
        "overview": "Herrmann investigates the rise in missing fire hydrants and teams up with Kylie to track them down. Kidd's cousin comes to town, revealing surprising family history. Violet and Novak treat the victim of a birthday cake smash gone awry."
      },
      {
        "id": "tvmaze:3133015",
        "title": "Born of Fire",
        "season": 13,
        "episode": 13,
        "released": "2025-02-19",
        "overview": "After a daring rescue at an adventure park, Kidd asks Severide to create a ropes course for Girls on Fire; Violet's former nemesis returns, pleading for her help; Herrmann creates a signature cocktail for Molly's."
      },
      {
        "id": "tvmaze:3133016",
        "title": "Bar Time",
        "season": 13,
        "episode": 14,
        "released": "2025-02-26",
        "overview": "A surprise visitor from Novak's past joins Ambo for a late-night ride-along. Herrmann faces a mountain of Chief-level training records and incident reports. Violet catches Carver in a lie."
      },
      {
        "id": "tvmaze:3149681",
        "title": "Too Close",
        "season": 13,
        "episode": 15,
        "released": "2025-03-05",
        "overview": "Kidd and Severide eagerly await big news. Pascal searches for the perfect anniversary gift."
      },
      {
        "id": "tvmaze:3163483",
        "title": "In the Rubble",
        "season": 13,
        "episode": 16,
        "released": "2025-03-26",
        "overview": "In the face of adversity, Pascal searches for justice. Violet struggles to write a letter to Carver. Damon returns to the floater pool hoping to secure a permanent spot at 51."
      },
      {
        "id": "tvmaze:3163484",
        "title": "A Beast Like This",
        "season": 13,
        "episode": 17,
        "released": "2025-04-02",
        "overview": "Kidd connects with a troubled teen interested in Girls on Fire. Cruz, Capp and Tony eagerly wait to try out Squad's new saw. Violet and Novak are stumped by a bodybuilder who passed out at the gym."
      },
      {
        "id": "tvmaze:3166758",
        "title": "Post-Mortem",
        "season": 13,
        "episode": 18,
        "released": "2025-04-16",
        "overview": "Boden returns on Grissom's orders to run a post-incident analysis after a house collapsed during a fire with a firefighter inside."
      },
      {
        "id": "tvmaze:3187166",
        "title": "Permanent Damage",
        "season": 13,
        "episode": 19,
        "released": "2025-04-23",
        "overview": "Severide investigates an old house fire from 10 years back in which Kidd had responded. Carver and Violet search for a mystery medic who abandoned a victim. Novak looks for a roommate."
      },
      {
        "id": "tvmaze:3190519",
        "title": "Cut Me Open",
        "season": 13,
        "episode": 20,
        "released": "2025-05-07",
        "overview": "With the crew stretched thin, a performance efficiency expert evaluates Firehouse 51. Kidd and Severide bond with the mother of the baby they hope to adopt."
      },
      {
        "id": "tvmaze:3190522",
        "title": "The Bad Guy",
        "season": 13,
        "episode": 21,
        "released": "2025-05-14",
        "overview": "Kidd strengthens her bond with Natalie during a road trip. Severide investigates a car fire and uncovers surprising evidence. Violet receives a career opportunity after being featured in a local newspaper."
      },
      {
        "id": "tvmaze:3190524",
        "title": "It Had to End This Way",
        "season": 13,
        "episode": 22,
        "released": "2025-05-21",
        "overview": "Severide puts his job on the line to help out one of their own. Kidd navigates Natalie's complicated relationship with her sister. Herrmann prepares to take the Chief test."
      },
      {
        "id": "tvmaze:3316804",
        "title": "Kicking Down Doors",
        "season": 14,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "A new face at Firehouse 51 causes tension, while rising chaos in the city brings new challenges to the team. Herrmann stalls on plans of relinquishing his office to Mouch."
      },
      {
        "id": "tvmaze:3339167",
        "title": "Primary Search",
        "season": 14,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "Vasquez fights to prove himself at 51. Violet and Novak pursue a troubling mystery. Herrmann is on a quest to keep Molly's profitable."
      },
      {
        "id": "tvmaze:3339166",
        "title": "In the Blood",
        "season": 14,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "When city budget cuts stretch crews thin, Pascal takes matters into his own hands. Vasquez looks to an old friend for help. An incident in the field hits close to home for Violet."
      },
      {
        "id": "tvmaze:3340583",
        "title": "Mercy",
        "season": 14,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "Firehouse 51 must band together after a devastating fire catches them off guard."
      },
      {
        "id": "tvmaze:3389066",
        "title": "Ghosts",
        "season": 14,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "Cruz hunts for the identity of an unknown ally; Mouch takes steps to help a friend; Vasquez must make a difficult choice."
      },
      {
        "id": "tvmaze:3389067",
        "title": "Broken Things",
        "season": 14,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "A traffic jam forces Violet and Novak to take drastic measures to save a patient. Severide shadows Pascal for a day. Kidd goes the extra mile for Isaiah."
      },
      {
        "id": "tvmaze:3423077",
        "title": "Pierce the Vein",
        "season": 14,
        "episode": 7,
        "released": "2025-11-12",
        "overview": "Severide investigates a suspicious high school fire. Novak gets an unexpected call. Violet brings a 51 firefighter onboard the ambulance for a shift."
      },
      {
        "id": "tvmaze:3439749",
        "title": "TBA",
        "season": 14,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      }
    ]
  }
}