{
  "meta": {
    "id": "tvmaze:73811",
    "type": "series",
    "name": "NCIS: Origins",
    "description": "In NCIS: Origins, young Leroy Jethro Gibbs starts his career as a newly minted special agent at the fledgling NCIS Camp Pendleton office where he forges his place on a gritty, ragtag team led by NCIS legend Mike Franks.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/591/1479858.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/591/1479858.jpg",
    "videos": [
      {
        "id": "tvmaze:3443455",
        "title": "TBA",
        "season": 2,
        "episode": 9,
        "released": "2026-02-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3449426",
        "title": "TBA",
        "season": 2,
        "episode": 10,
        "released": "2026-03-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3449427",
        "title": "TBA",
        "season": 2,
        "episode": 11,
        "released": "2026-03-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449428",
        "title": "TBA",
        "season": 2,
        "episode": 12,
        "released": "2026-03-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3449429",
        "title": "TBA",
        "season": 2,
        "episode": 13,
        "released": "2026-03-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3449430",
        "title": "TBA",
        "season": 2,
        "episode": 14,
        "released": "2026-03-31",
        "overview": ""
      },
      {
        "id": "tvmaze:3449431",
        "title": "TBA",
        "season": 2,
        "episode": 15,
        "released": "2026-04-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449432",
        "title": "TBA",
        "season": 2,
        "episode": 16,
        "released": "2026-04-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3449433",
        "title": "TBA",
        "season": 2,
        "episode": 17,
        "released": "2026-04-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3449434",
        "title": "TBA",
        "season": 2,
        "episode": 18,
        "released": "2026-04-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3429745",
        "title": "End of the Road",
        "season": 2,
        "episode": 8,
        "released": "2025-12-09",
        "overview": "When Lala's favorite CI is shot, the team joins forces with Oceanside PD to determine who was behind the attack. Also, Franks visits his brother Mason at the compound, and Gibbs' relationship with Diane is tested when she gets a job in Los Angeles."
      },
      {
        "id": "tvmaze:2918905",
        "title": "Enter Sandman",
        "season": 1,
        "episode": 1,
        "released": "2024-10-14",
        "overview": "Gibbs starts his career as a newly minted special agent at the fledgling NCIS Camp Pendleton office, where he forges his place on a gritty ragtag team."
      },
      {
        "id": "tvmaze:3009184",
        "title": "Enter Sandman, Part 2",
        "season": 1,
        "episode": 2,
        "released": "2024-10-14",
        "overview": "Gibbs and the team continue their investigation."
      },
      {
        "id": "tvmaze:2941428",
        "title": "Bend, Don't Break",
        "season": 1,
        "episode": 3,
        "released": "2024-10-21",
        "overview": "A murder near Camp Pendleton leads Gibbs and the team to a suburban mall in San Diego, where Gibbs takes matters into his own hands; Jackson Gibbs pays Franks an unexpected visit."
      },
      {
        "id": "tvmaze:3020427",
        "title": "All's Not Lost",
        "season": 1,
        "episode": 4,
        "released": "2024-10-28",
        "overview": "Still grieving the loss of his wife and daughter, Gibbs helps the team work a case involving a missing girl; the moment that irrevocably changed Gibbs' life is revealed."
      },
      {
        "id": "tvmaze:3025793",
        "title": "Last Rites",
        "season": 1,
        "episode": 5,
        "released": "2024-11-04",
        "overview": "With the countdown on to an execution, Franks races to extricate the location of a missing body from a death row inmate and honor a promise he made to the victim's sister before time runs out."
      },
      {
        "id": "tvmaze:3029706",
        "title": "Incognito",
        "season": 1,
        "episode": 6,
        "released": "2024-11-11",
        "overview": "Gibbs goes under cover for the first time with Lala as NIS works the case of a dead Navy seaman who may have been sharing top-secret intel that poses a threat to national security; Lala struggles with an unexpected development in her personal life."
      },
      {
        "id": "tvmaze:3034722",
        "title": "One Flew Over",
        "season": 1,
        "episode": 7,
        "released": "2024-11-25",
        "overview": "NIS investigates the murder of a dementia-afflicted Jane Doe; flashbacks reveal the first time Gibbs met Franks."
      },
      {
        "id": "tvmaze:3034723",
        "title": "Sick As Our Secrets",
        "season": 1,
        "episode": 8,
        "released": "2024-12-02",
        "overview": "Gibbs and the team investigate the case of a Navy priest who was killed in the confessional booth; Randy shows Gibbs the ropes of working a protective detail."
      },
      {
        "id": "tvmaze:3034724",
        "title": "Vivo o Muerto",
        "season": 1,
        "episode": 9,
        "released": "2024-12-09",
        "overview": "The case of a missing woman who disappeared after a night of clubbing with a Navy seaman takes the team to Mexico, where they learn of a possible connection to Gibbs' past."
      },
      {
        "id": "tvmaze:3034726",
        "title": "Blue Bayou",
        "season": 1,
        "episode": 10,
        "released": "2024-12-16",
        "overview": "As Leroy Jethro Gibbs prepares for his first Christmas without his wife and daughter, flashbacks reveal the unlikely journey that led to his first day on the job as a special agent."
      },
      {
        "id": "tvmaze:3052242",
        "title": "Flight of Icarus",
        "season": 1,
        "episode": 11,
        "released": "2025-01-27",
        "overview": "The team investigates the death of a famed Marine commander's son; a pivotal part of Frank's past involving his family is revealed."
      },
      {
        "id": "tvmaze:3112105",
        "title": "Touchstones",
        "season": 1,
        "episode": 12,
        "released": "2025-02-03",
        "overview": "When the evidence room is broken into and significant cash goes missing, the team looks into a connection to a recent case; Lala opens up to Gibbs; Kowalski struggles to move forward."
      },
      {
        "id": "tvmaze:3113335",
        "title": "Monsoon",
        "season": 1,
        "episode": 13,
        "released": "2025-02-10",
        "overview": "The team investigates the brutal murder of a veteran who fell on hard times after serving in Vietnam, leading Franks to reflect on his own struggles following the war; Gibbs considers a new path forward."
      },
      {
        "id": "tvmaze:3124428",
        "title": "To Have and To Hold",
        "season": 1,
        "episode": 14,
        "released": "2025-03-24",
        "overview": "The team works the case of an investment adviser found dead shortly after her release from prison; Mary Jo is left reeling by an unexpected development in her personal life."
      },
      {
        "id": "tvmaze:3124429",
        "title": "From the Ashes",
        "season": 1,
        "episode": 15,
        "released": "2025-03-31",
        "overview": "The team investigates the brutal murder of a military sergeant found burned in her car, a case Franks suspects could have a connection to the assault of his estranged wife."
      },
      {
        "id": "tvmaze:3170000",
        "title": "Bugs",
        "season": 1,
        "episode": 16,
        "released": "2025-04-14",
        "overview": "Vera receives an unexpected call from Bugs, who claims he's ready to answer more questions from prison after being identified as the sniper known as Sandman."
      },
      {
        "id": "tvmaze:3177100",
        "title": "Darlin', Don't Refrain",
        "season": 1,
        "episode": 17,
        "released": "2025-04-21",
        "overview": "After the shocking developments in the Sandman case, the team works with the FBI to investigate further; while Wheeler struggles to hold onto his job, his family reaches a crisis point."
      },
      {
        "id": "tvmaze:3177101",
        "title": "Cecilia",
        "season": 1,
        "episode": 18,
        "released": "2025-04-28",
        "overview": "When the murder of Pedro Hernandez is unearthed, Gibbs faces a reckoning; when he needs his team most, the loyalty of one is brought into question."
      },
      {
        "id": "tvmaze:3301117",
        "title": "The Funky Bunch",
        "season": 2,
        "episode": 1,
        "released": "2025-10-14",
        "overview": "Gibbs and Franks investigate the disappearance of a young Marine connected to a mysterious compound with a charismatic leader; Lala's fate is revealed."
      },
      {
        "id": "tvmaze:3343354",
        "title": "Who by Fire",
        "season": 2,
        "episode": 2,
        "released": "2025-10-21",
        "overview": "When the body of a college swimmer washes up on the beach, the team must determine if it was an accident or murder; Gibbs prepares for his first interrogation."
      },
      {
        "id": "tvmaze:3348684",
        "title": "The Edge",
        "season": 2,
        "episode": 3,
        "released": "2025-10-28",
        "overview": "When Dr. Donald \"Ducky\" Mallard, a liaison from D.C. headquarters and an old acquaintance of Gibbs', arrives to evaluate whether Pendleton needs an in-house medical examiner, not everyone trusts that's the real reason behind his visit."
      },
      {
        "id": "tvmaze:3393029",
        "title": "No Man Left Behind",
        "season": 2,
        "episode": 4,
        "released": "2025-11-04",
        "overview": "Tensions rise when Franks' estranged older brother, Mason, blows into town, desperate for help after hitting rock bottom; the team investigates the robbery of a Navy bank; Lala, still struggling after her accident, makes a decision about her future."
      },
      {
        "id": "tvmaze:3355646",
        "title": "Funny How Time Slips Away",
        "season": 2,
        "episode": 5,
        "released": "2025-11-11",
        "overview": "When a naval officer mysteriously dies in the ‘90s, Gibbs and the team travel to the small dust-blown town of Serenity, Calif., where they encounter secret-harboring residents, an uncooperative sheriff and an investigation that will reverberate for decades."
      },
      {
        "id": "tvmaze:3424210",
        "title": "Happy Birthday",
        "season": 2,
        "episode": 6,
        "released": "2025-11-18",
        "overview": "When an anonymous tip leads to the discovery of a young Marine's body at a chilling crime scene, Randy believes it could be connected to a previous case where a coin was left in the victim's throat."
      },
      {
        "id": "tvmaze:3429744",
        "title": "Crazy Little Thing Called Love",
        "season": 2,
        "episode": 7,
        "released": "2025-12-02",
        "overview": "The team investigates the murder of a Marine who had recently been picked for a classified mission; Wheeler's personal life is upended; Lala is thrown by unexpected news from Vera."
      }
    ]
  }
}