{
  "meta": {
    "id": "tvmaze:702",
    "type": "series",
    "name": "Gold Rush",
    "description": "Gold Rush follows six men who, in the face of an economic meltdown, risk everything - their families, their dignity, and in some cases, their lives - to strike it rich mining for gold in the wilds of Alaska. Inspired by his father Jack, Todd Hoffman of Sandy, Oregon, leads a group of greenhorn miners to forge a new frontier and save their families from dire straits. While leasing a gold claim in Alaska, Todd and his company of newbies face the grandeur of Alaska as well as its hardships, including an impending winter that will halt operations and the opportunity to strike gold. In an effort to keep the operation running, the team takes fate into their own hands with a make or break venture that will change their lives forever.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/597/1492601.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/597/1492601.jpg",
    "videos": [
      {
        "id": "tvmaze:3452562",
        "title": "The Weasel",
        "season": 16,
        "episode": 6,
        "released": "2025-12-12",
        "overview": "Tony hunts down an insubordinate crew member. Rick gets his first gold from Lightning Creek. Kevin's parents pressure him to get his new Pyramid Cut running."
      },
      {
        "id": "tvmaze:3465034",
        "title": "Surprise Fortunes",
        "season": 16,
        "episode": 7,
        "released": "2025-12-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3448082",
        "title": "Pick Me Someone to Fire",
        "season": 16,
        "episode": 5,
        "released": "2025-12-05",
        "overview": "Parker tasks Tyson with finding the weakest link in the crew. Tony approaches Parker to make a deal and raids his son Mike's operation. Rick fires up on Lightning Creek for the first time."
      },
      {
        "id": "tvmaze:61966",
        "title": "No Guts No Glory",
        "season": 1,
        "episode": 1,
        "released": "2010-12-03",
        "overview": "When the going gets tough, the tough seek new frontiers. Six recession-hit patriots from Oregon become greenhorn old miners and head north to Alaska to dig for gold and save themselves from financial ruin."
      },
      {
        "id": "tvmaze:61967",
        "title": "Gold, Guns, and Bears",
        "season": 1,
        "episode": 2,
        "released": "2010-12-10",
        "overview": "The greenhorn miners are at risk when a mechanical accident threatens to close mining season."
      },
      {
        "id": "tvmaze:61968",
        "title": "Running Dirt",
        "season": 1,
        "episode": 3,
        "released": "2010-12-17",
        "overview": "The crew races to set up the mining plant and start running dirt. When the families arrive from Oregon and question the lack of gold and the men's only mechanic becomes dangerously ill, the tension builds so high Dorsey and Todd come to blows."
      },
      {
        "id": "tvmaze:61969",
        "title": "The Ultimate Price",
        "season": 1,
        "episode": 4,
        "released": "2011-01-07",
        "overview": "The team attempts to finally run dirt through the wash plant. But a visit from the Department of Fish and Game reveals a violation, jeopardizing their vital water supply to the mine. Then disaster strikes asTodd's daughter fights for her life."
      },
      {
        "id": "tvmaze:61970",
        "title": "The Pain Barrier",
        "season": 1,
        "episode": 5,
        "released": "2011-01-14",
        "overview": "The miners continue to run dirt but an equipment malfunction brings the operation to a halt. Meanwhile, James Harness collapses and Jimmy Dorsey drives a wedge between himself and the crew when he takes on an extra job to earn cash."
      },
      {
        "id": "tvmaze:61971",
        "title": "Gold Fever",
        "season": 1,
        "episode": 6,
        "released": "2011-01-21",
        "overview": "After 80 days, the miners are behind schedule and out of money. They need to find $10,000 worth of gold within two days or the families will be sent home. Meanwhile, after Dorsey struggles with the wave table, tensions flare and fists fly."
      },
      {
        "id": "tvmaze:61972",
        "title": "Going for Broke",
        "season": 1,
        "episode": 7,
        "released": "2011-01-28",
        "overview": "With winter weather closing in, a gold recovery expert comes to help the rookies. Todd discovers a major design flaw in the equipment and is forced to make huge modifications. With the credit cards maxed out, he is forced to take desperate measures."
      },
      {
        "id": "tvmaze:61973",
        "title": "Bad Blood",
        "season": 1,
        "episode": 8,
        "released": "2011-02-04",
        "overview": "After a hundred days in Porcupine Creek, the miners have dug themselves into a deep financial hole. The claim's owner wants to be paid and brings in a veteran outsider to turn the operation around, leading to high tension around the claim."
      },
      {
        "id": "tvmaze:61974",
        "title": "Bedrock or Bust",
        "season": 1,
        "episode": 9,
        "released": "2011-02-11",
        "overview": "Desperate to get to bedrock and large quantities of gold, Todd and Jack throw caution to the wind and dig deeper than ever before. With the brutal Alaskan winter threatening, they battle floods, cave-ins and equipment breakdowns."
      },
      {
        "id": "tvmaze:61975",
        "title": "Never Say Die",
        "season": 1,
        "episode": 10,
        "released": "2011-02-18",
        "overview": "With the arctic winter looming, the crew races against the clock. Rain and thawing snow flood the mine and Jack puts his life on the line as the glory hole caves in around the massive 100,000 pound excavator."
      },
      {
        "id": "tvmaze:62042",
        "title": "Full Disclosure",
        "season": 1,
        "episode": 11,
        "released": "2011-02-25",
        "overview": "The Hoffman crew spent five months and over quarter of a million dollars in a desperate attempt to find gold in Alaska. This special episode reveals what went wrong and how the guys plan to hit the mother lode next season."
      },
      {
        "id": "tvmaze:61976",
        "title": "Twist of Fate",
        "season": 2,
        "episode": 1,
        "released": "2011-10-28",
        "overview": "The crew finds gold at the Porcupine Creek claim, and \"Dakota Fred\" returns with a bombshell to drop on the Hoffmans."
      },
      {
        "id": "tvmaze:61977",
        "title": "Virgin Ground",
        "season": 2,
        "episode": 2,
        "released": "2011-11-04",
        "overview": "The crew seeks a new claim in the Klondike to salvage the mining season; Parker Schnabel takes control of the Big Nugget Mine."
      },
      {
        "id": "tvmaze:61978",
        "title": "Family Feud",
        "season": 2,
        "episode": 3,
        "released": "2011-11-11",
        "overview": "Todd and Jack clash over how to set up their new claim; Dakota Fred finds gold at Porcupine Creek; Parker hits pay dirt at Big Nugget."
      },
      {
        "id": "tvmaze:61979",
        "title": "Slippery Slope",
        "season": 2,
        "episode": 4,
        "released": "2011-11-18",
        "overview": "The crew confronts permafrost; Dakota Fred pushes his son too far; Parker suffers a setback in the form of a breakdown."
      },
      {
        "id": "tvmaze:61980",
        "title": "Drill or Die",
        "season": 2,
        "episode": 5,
        "released": "2011-11-25",
        "overview": "A crew revolt prompts Todd to dig test holes on the claim; Dakota Fred abandons mining after floods destroy his home."
      },
      {
        "id": "tvmaze:61981",
        "title": "Lovestruck",
        "season": 2,
        "episode": 6,
        "released": "2011-12-02",
        "overview": "Parker bulldozes a road up the side of a mountain; Dakota Fred returns to the Porcupine Creek claim; the Hoffmans find gold but a mechanic's new love may impact the operation."
      },
      {
        "id": "tvmaze:61982",
        "title": "Gold at Last",
        "season": 2,
        "episode": 7,
        "released": "2011-12-09",
        "overview": "The Hoffmans must tear out and rebuild the wash plant after realizing they could be losing thousands of dollars of gold; Parker becomes a lumberjack at the Smith Creek site."
      },
      {
        "id": "tvmaze:61983",
        "title": "On the Gold",
        "season": 2,
        "episode": 8,
        "released": "2011-12-16",
        "overview": "A wash plant shutdown sets Parker off; the Hoffman crew members have their first clean-out of the season."
      },
      {
        "id": "tvmaze:887481",
        "title": "Dead in the Water",
        "season": 2,
        "episode": 9,
        "released": "2012-01-06",
        "overview": "Jack Hoffman's excavator gets stranded and requires emergency surgery. Also, the crew fine-tunes its wash plant, which doubles their efficiency at finding gold."
      },
      {
        "id": "tvmaze:61984",
        "title": "Twenty-Four Seven",
        "season": 2,
        "episode": 10,
        "released": "2012-01-13",
        "overview": "The Hoffman Crew run night and day to get to the gold, while a federal mining inspector visits both Fred and Parker. He finds safety violations and both operations face closure."
      },
      {
        "id": "tvmaze:61985",
        "title": "Rock Bottom",
        "season": 2,
        "episode": 11,
        "released": "2012-01-20",
        "overview": "The Hoffmans are held up by their broken excavator, Parker Schnabel totals his season's hold and hands the mine back to his grandpa, and the Dakota boys work to re-open their mine."
      },
      {
        "id": "tvmaze:61986",
        "title": "Bedrock Gold",
        "season": 2,
        "episode": 12,
        "released": "2012-01-27",
        "overview": "A crew member quits; Dakota Fred's derocker is damaged by a massive rock; Parker ponders his future."
      },
      {
        "id": "tvmaze:61987",
        "title": "Man Down",
        "season": 2,
        "episode": 13,
        "released": "2012-02-03",
        "overview": "John Schnabel suffers a heart attack; the Hoffmans find a game-changing gold nugget; Dakota Fred achieves something Jack Hoffman couldn't do at Porcupine Creek."
      },
      {
        "id": "tvmaze:61988",
        "title": "In the Black",
        "season": 2,
        "episode": 14,
        "released": "2012-02-10",
        "overview": "Fred's excavator gets stuck; John Schnabel makes a comeback at the Big Nugget Mine; the Hoffman crew works through the night in a bid to break even."
      },
      {
        "id": "tvmaze:61989",
        "title": "Frozen Out",
        "season": 2,
        "episode": 15,
        "released": "2012-02-17",
        "overview": "Frozen dirt and frozen pipes hamper progress for the Hoffman crew; a damaged wash plant impacts operations for the Dakota boys; Parker makes a final effort at Smith Creek Hill."
      },
      {
        "id": "tvmaze:61990",
        "title": "Judgment Day",
        "season": 2,
        "episode": 16,
        "released": "2012-02-24",
        "overview": "The Big Nugget mine faces closure unless Parker hits a pay streak; Todd decides to run the dozer on solid ice, with disastrous results; Dakota Fred thinks he found Jack Hoffman's glory hole."
      },
      {
        "id": "tvmaze:61992",
        "title": "Million Dollar Season",
        "season": 3,
        "episode": 1,
        "released": "2012-10-26",
        "overview": "This season someone hits the motherlode. Todd doubles down with two claims, twice the crew and twice the gear. Dakota Fred's glory hole is thought to contain millions in gold. Parker hires a new crew and sets his sights on new land."
      },
      {
        "id": "tvmaze:61993",
        "title": "The Wrong Claim",
        "season": 3,
        "episode": 2,
        "released": "2012-11-02",
        "overview": "Dave faces disaster when he finds his new claim is un-minable. Todd is thousands of dollars in the hole and the 1000 ounce goal looks impossible. The Dakota boys face the threat of historic floods and Parker desperately needs to secure new ground."
      },
      {
        "id": "tvmaze:61994",
        "title": "Secret Weapons",
        "season": 3,
        "episode": 3,
        "released": "2012-11-09",
        "overview": "Todd does a deal on a new gold-rich claim to get Dave's crew back in action. The Dakota boys hire new miners and one is quickly terminated. Todd junks his old washplant and Parker sets an unprecedented goal to get $40,000 worth of gold in his first week."
      },
      {
        "id": "tvmaze:61995",
        "title": "Battle of the Bridge",
        "season": 3,
        "episode": 4,
        "released": "2012-11-16",
        "overview": "Todd's chief investor arrives unannounced and threatens to pull the plug after he finds the mine at a standstill. Team Turin is plagued by melted permafrost and a broken dozer. Parker and the Dakota boys go to war over a bridge."
      },
      {
        "id": "tvmaze:61996",
        "title": "The Ultimatum",
        "season": 3,
        "episode": 5,
        "released": "2012-11-23",
        "overview": "Todd's chief investor demands to see 100 ounces of gold in the next three weeks. Parker's crew goes into meltdown when he forces them to replace a bridge and Fred attempts to make a precision part for his vital excavator from a pile of scrap metal."
      },
      {
        "id": "tvmaze:61997",
        "title": "Game Changer",
        "season": 3,
        "episode": 6,
        "released": "2012-11-30",
        "overview": "Todd finally takes delivery of the Turbo Trommel. Dave's mine at Indian River could close if they can't improve on their disastrous first clean up. The Dakota boys are forced to run second hand dirt and Parker sets a 50-ounce, $80,000 goal for the week."
      },
      {
        "id": "tvmaze:61998",
        "title": "Road to Gold",
        "season": 3,
        "episode": 7,
        "released": "2012-12-07",
        "overview": "Todd and his crew finally get to test the new Turbo Trommel. Dave pushes his crew to double their last clean out. The Dakota Boys receive a visit from an inspector with the power to shut down their mine and Parker brings in dynamite to blast a boulder."
      },
      {
        "id": "tvmaze:61999",
        "title": "Up Smith Creek",
        "season": 3,
        "episode": 8,
        "released": "2012-12-14",
        "overview": "Todd Hoffman faces closure if he fails to get 100 ounces of gold for his investor. The Dakota Boys believe they've finally found the elusive Glory Hole. Parker Schnabel uncovers the two-year mystery of Smith Creek just as his grandpa reveals bad news."
      },
      {
        "id": "tvmaze:62002",
        "title": "Leprechaun Gold",
        "season": 3,
        "episode": 9,
        "released": "2013-01-04",
        "overview": "Parker finds out about the fate of his Grandpa. Todd has to rebuild his turbo trammel,  Indian River faces a shutdown and the Dakota boys investigate whether the Glory Hole is truly an ancient waterfall."
      },
      {
        "id": "tvmaze:62003",
        "title": "Dozer Wars",
        "season": 3,
        "episode": 10,
        "released": "2013-01-11",
        "overview": "Todd and Dave go to war over the dozer they both need to keep mining and Todd banks on finding virgin ground beneath a pile of dredge tailings. Parker faces a crew rebellion and Dakota Fred attacks the Glory Hole with his secret weapon- the bedrock shark."
      },
      {
        "id": "tvmaze:62004",
        "title": "Pink Slip",
        "season": 3,
        "episode": 11,
        "released": "2013-01-18",
        "overview": "Todd calls it quits on his turbo trommel and shuts down his Quartz Creek operation. Dave's race to open a new cut leaves his dozer hanging over a cliff. Parker finally hits bedrock at Emerson Trench and two broken machines force Fred to go deeper in debt."
      },
      {
        "id": "tvmaze:62005",
        "title": "The Merger",
        "season": 3,
        "episode": 12,
        "released": "2013-01-25",
        "overview": "Todd forces his crew and Dave's crew to merge into one team. The Dakota Boys use their new equipment to get back down to the bottom of the Glory Hole. Parker risks his life to get paydirt from an abandoned mine site down a dangerous mountain road."
      },
      {
        "id": "tvmaze:62006",
        "title": "The Night Shift",
        "season": 3,
        "episode": 13,
        "released": "2013-02-01",
        "overview": "Tensions mount between the day shift and night shift as Todd pushes his men harder than ever. Parker battles his ancient washplant and the treacherous road from Discovery Claim while Dustin risks it all diving for hidden gold in the frozen glory hole water."
      },
      {
        "id": "tvmaze:62007",
        "title": "Bedrock Blowout",
        "season": 3,
        "episode": 14,
        "released": "2013-02-08",
        "overview": "Todd pushes the Big Red washplant to near breaking point on his best ground yet. Fred and Dustin battle to save a broken down excavator as water floods the glory hole and Parker faces his worst nightmare as the dangerous mine road claims its first victim."
      },
      {
        "id": "tvmaze:62008",
        "title": "Redemption Road",
        "season": 3,
        "episode": 15,
        "released": "2013-02-15",
        "overview": "Out of Indian River paydirt, Todd comes up with a risky plan to hit his 1,000 ounce goal. A bad fall puts Fred out the game, leaving Dustin to dig the glory hole. Parker worries his season is over but his grandpa is convinced he's near the motherlode."
      },
      {
        "id": "tvmaze:62009",
        "title": "The Motherlode",
        "season": 3,
        "episode": 16,
        "released": "2013-02-22",
        "overview": "Winter strikes and the miners wage the final battle for the mother lode. The Hoffmans pull out a secret weapon to thaw frozen gold-rich paydirt. Dustin plunges into the freezing waters of the Glory Hole and Parker mines the last ground at Big Nugget."
      },
      {
        "id": "tvmaze:62011",
        "title": "Queen of Diamonds",
        "season": 4,
        "episode": 1,
        "released": "2013-10-25",
        "overview": "The Hoffman crew moves their operation to the hostile Guyana jungle. The Dakota boys need to find a safe route over thin ice. Parker is out of cash and must find gold, but Tony Beets has bad news for him."
      },
      {
        "id": "tvmaze:62012",
        "title": "Learning Curve",
        "season": 4,
        "episode": 2,
        "released": "2013-11-01",
        "overview": "Todd faces disaster when he discovers his claim has been mined out. The Dakota Boys fight over rival mining plans with one plan high in the mountains and the other deep in the hole. Parker ignores Tony Beets, but still manages to hit his first paydirt."
      },
      {
        "id": "tvmaze:62013",
        "title": "In Too Deep",
        "season": 4,
        "episode": 3,
        "released": "2013-11-08",
        "overview": "The Hoffman Crew battles the hostile jungle to get vital mining equipment to the claim. The Dakota Boys drill to find out if the glory hole contains millions in gold. Parker is on the warpath when a new crewmember throws out his gold."
      },
      {
        "id": "tvmaze:62014",
        "title": "Road from Hell",
        "season": 4,
        "episode": 4,
        "released": "2013-11-15",
        "overview": "The Hoffman crew attempts to set up their washplant, but the jungle fights them every step of the way. The Dakota Boys find their first bedrock gold in the glory hole. In the Klondike, Parker gets more gold out of Little Blue than the Hoffmans ever did."
      },
      {
        "id": "tvmaze:62015",
        "title": "Garnets or Gold",
        "season": 4,
        "episode": 5,
        "released": "2013-11-22",
        "overview": "In Alaska, The Dakota Boys continue their hunt for millions in gold at the bottom of the glory hole. Meanwhile, Parker shuts down his operation in the Klondike."
      },
      {
        "id": "tvmaze:62016",
        "title": "Mutiny",
        "season": 4,
        "episode": 6,
        "released": "2013-11-29",
        "overview": "Todd returns to Guyana expecting 20 ounces of gold but gets a nasty shock. Parker faces a mutiny and seeks advice from his Grandpa. The Dakota Boys expect a huge pay out from the glory hole but get a crushing blow."
      },
      {
        "id": "tvmaze:62017",
        "title": "Paid in Full",
        "season": 4,
        "episode": 7,
        "released": "2013-12-06",
        "overview": "Todd makes an incredible discovery while searching for new gold rich ground. Parker needs his best clean up ever in order to stop Todd from repossessing his dozer. Just as Fred gives up on the Glory Hole, it suddenly pays out big."
      },
      {
        "id": "tvmaze:62018",
        "title": "Jungle Boogie",
        "season": 4,
        "episode": 8,
        "released": "2013-12-13",
        "overview": "Todd abandons gold and switches to diamond mining. In Alaska, Dustin gets stranded in the mountains during the worst electrical storm in twenty years. Parker's need for speed destroys his wash plant."
      },
      {
        "id": "tvmaze:62020",
        "title": "Hope Creek",
        "season": 4,
        "episode": 9,
        "released": "2014-01-03",
        "overview": "Dave returns to the Hoffman Crew and butts heads with Todd over their mining plan. The Dakota boys stake their future on a new cut and Parker gets a second chance at mining with one of the largest wash plants in the Klondike."
      },
      {
        "id": "tvmaze:62021",
        "title": "Blowout",
        "season": 4,
        "episode": 10,
        "released": "2014-01-10",
        "overview": "A tropical storm floods the Hoffman's operation and Dave is forced to dive deep into the pit. Parker is running one of the biggest washplants in the Klondike and needs to prove it will deliver. The Dakota boys get the biggest clean-up of their season."
      },
      {
        "id": "tvmaze:62022",
        "title": "Death of a Dream",
        "season": 4,
        "episode": 11,
        "released": "2014-01-17",
        "overview": "In the first of a two part episode, Parker hires yet another ex-Hoffman crew member while Todd grows more and more desperate. In the end, two crews get their biggest gold clean ups to date while the third faces an abrupt end to their season."
      },
      {
        "id": "tvmaze:62023",
        "title": "The Resurrection",
        "season": 4,
        "episode": 12,
        "released": "2014-01-20",
        "overview": "Todd's 150 days is up and with no gold and just a few diamonds he faces eviction. Despite a big clean out, Parker modifies his plant to hit a million dollar season. Dustin finally gets real mining equipment up to Cahoon Creek to see if it holds big gold."
      },
      {
        "id": "tvmaze:62024",
        "title": "Fantasy Land",
        "season": 4,
        "episode": 13,
        "released": "2014-01-24",
        "overview": "Todd's claim owner forces a change to the mining plan. Grandpa visits Parker and makes a radical suggestion that the crew believes to be pure fantasy. Dustin fights to reach his first mountain gold."
      },
      {
        "id": "tvmaze:62025",
        "title": "Medevac",
        "season": 4,
        "episode": 14,
        "released": "2014-01-31",
        "overview": "An emergency in the jungle forces Todd to airlift one of his men to safety. Tony Beets becomes furious when he finds that Parker has moved his whole operation over the creek. The Dakota boys may be forced to abandon their hole."
      },
      {
        "id": "tvmaze:62026",
        "title": "Man on Wire",
        "season": 4,
        "episode": 15,
        "released": "2014-02-14",
        "overview": "Jack destroys the washplant forcing Dave to find a new way to run their dirt. Frozen pay disrupts Parker's operation and threatens to end his season early. Dustin participates in a dangerous operation."
      },
      {
        "id": "tvmaze:62027",
        "title": "Day of Reckoning",
        "season": 4,
        "episode": 16,
        "released": "2014-02-21",
        "overview": "Todd's claim owner arrives unannounced to take stock of the Hoffman's operation. Dustin returns from the mountains just in time for the final clean up. Unwilling to admit defeat, Parker uses a new piece of equipment to thaw his frozen paydirt."
      },
      {
        "id": "tvmaze:62028",
        "title": "Go Big or Go Home",
        "season": 4,
        "episode": 17,
        "released": "2014-02-28",
        "overview": "Parker Schnabel refuses to give up. He's not satisfied with his gold total and is dead set on bringing home big gold to his beloved grandfather. Nothing is going to stop him, not even the Klondike winter."
      },
      {
        "id": "tvmaze:62029",
        "title": "Grandpa's Last Wish",
        "season": 4,
        "episode": 18,
        "released": "2014-03-07",
        "overview": "94 year old mining legend John Schnabel convinces his grandsons Parker and Payson to return to Big Nugget to work together deep into the winter to prove, once and for all, that there is big gold buried deep under Smith Creek."
      },
      {
        "id": "tvmaze:62030",
        "title": "Unearthed",
        "season": 4,
        "episode": 19,
        "released": "2014-03-14",
        "overview": "This no-holds-barred show reveals how Fred coped with a dying wife, why a fateful choice cost Todd a huge amount of gold and how he coped with a murder in the jungle. A look forward reveals where the miners will be next season and who will return."
      },
      {
        "id": "tvmaze:62033",
        "title": "New Blood",
        "season": 5,
        "episode": 1,
        "released": "2014-10-17",
        "overview": "Young Parker sets an outrageous season goal of 2,000 ounces. Tony Beets, The Viking, buys a 75-year-old gold catching dredge. And Todd Hoffman is left a broken man without a crew and with no plans to mine."
      },
      {
        "id": "tvmaze:62034",
        "title": "From the Ashes",
        "season": 5,
        "episode": 2,
        "released": "2014-10-24",
        "overview": "Todd gets his washplant stuck in a river, Tony nearly crushes his son beneath a conveyor, and Parker is forced to mine a swamp."
      },
      {
        "id": "tvmaze:62035",
        "title": "Golden Boy",
        "season": 5,
        "episode": 3,
        "released": "2014-10-31",
        "overview": "Parker fights with his crew over running at night. Tony twists a vital steel frame on the dredge. Todd, Jack and Thurber tackle their first clean up."
      },
      {
        "id": "tvmaze:62036",
        "title": "Viking Ship",
        "season": 5,
        "episode": 4,
        "released": "2014-11-07",
        "overview": "Todd is forced to sell his gold to get the mining equipment he needs, Parker hauls his washplant across the claim and Tony takes to the skies to get from his claim to the gold dredge."
      },
      {
        "id": "tvmaze:62037",
        "title": "Hard Bargain",
        "season": 5,
        "episode": 5,
        "released": "2014-11-14",
        "overview": "Dave agrees to work with the Hoffman crew under a new agreement. Tony has a near miss while removing the heaviest part of the dredge and Parker fights with Rick when he opens up untested ground."
      },
      {
        "id": "tvmaze:62038",
        "title": "Cursed Cut",
        "season": 5,
        "episode": 6,
        "released": "2014-11-21",
        "overview": "Dave and Todd clash over how to mine frozen ground. Tony's daughter Monica gets stuck in a bad situation. Parker's hopes are drowned by multiple issues including a flooded cut."
      },
      {
        "id": "tvmaze:62039",
        "title": "Goldzilla",
        "season": 5,
        "episode": 7,
        "released": "2014-11-28",
        "overview": "Todd needs to find a 100 ounce down payment to make a big purchase. Parker spends a quarter of a million dollars on new equipment. Tony attempts to remove the wheelhouse from his 75 year old gold dredge."
      },
      {
        "id": "tvmaze:62040",
        "title": "Gold Blooded",
        "season": 5,
        "episode": 8,
        "released": "2014-12-05",
        "overview": "Parker goes for his best clean up so far this season, Tony attempts to rip the trommel out of his 75 year old gold dredge and the Hoffman crew is stunned by the death of an old crew member."
      },
      {
        "id": "tvmaze:62041",
        "title": "Colossal Clean Up",
        "season": 5,
        "episode": 9,
        "released": "2014-12-12",
        "overview": "The Hoffmans overcome a lack of water to get a monster clean up. Tony finally gets his dredge on the way to its new home in Eureka Creek. Parker gets the biggest gold clean up in Gold Rush history."
      },
      {
        "id": "tvmaze:109533",
        "title": "Parker's Accident",
        "season": 5,
        "episode": 10,
        "released": "2015-01-02",
        "overview": "Parker Schnabel totals his car in a head on collision. The Hoffman crew rock trucks go head to head on a dangerous haul road and Tony Beets finally starts to rebuild his 75 year old gold mining dredge."
      },
      {
        "id": "tvmaze:109583",
        "title": "Ship of Fools",
        "season": 5,
        "episode": 11,
        "released": "2015-01-09",
        "overview": "Parker and his grandpa go hunting for a new Klondike Claim. Tony's operation grinds to a halt when his dredge crew runs out of bolts. Todd's crew discards paydirt which causes a major financial loss."
      },
      {
        "id": "tvmaze:120629",
        "title": "Piles of Gold",
        "season": 5,
        "episode": 12,
        "released": "2015-01-16",
        "overview": "Todd and Dave butt heads over how to mine, but end up with the biggest reward they've seen all season. Tony and Parker go to war over bedrock gold and Minnie Beets steals Tony's dredge crew to work their family mine."
      },
      {
        "id": "tvmaze:123638",
        "title": "Gold Road",
        "season": 5,
        "episode": 13,
        "released": "2015-01-23",
        "overview": "Logan has an accident with the rock truck as the Hoffman crew aims for their biggest gold weigh in of the season. Parker faces disaster when he discovers his new cut is frozen solid and Tony struggles to install the heaviest part of his dredge."
      },
      {
        "id": "tvmaze:123639",
        "title": "Rogue Miner",
        "season": 5,
        "episode": 14,
        "released": "2015-01-30",
        "overview": "Todd and Dave get a pair of dozers stuck in deep mud while trying to open a new cut. Parker breaks an excavator as his crew struggles with frozen ground and Tony's mad rush to get his dredge finished ends up costing him big time."
      },
      {
        "id": "tvmaze:123640",
        "title": "The Monster Lives",
        "season": 5,
        "episode": 15,
        "released": "2015-02-06",
        "overview": "Parker mines an island of paydirt, the Hoffman crew puts two rock trucks out of commission and Tony discovers a major electrical problem."
      },
      {
        "id": "tvmaze:128843",
        "title": "Rivers of Gold",
        "season": 5,
        "episode": 16,
        "released": "2015-02-13",
        "overview": "Parker diverts a creek to mine a pile of gold in the riverbed and Tony's crew has a meltdown over fitting the tailings conveyor. Jack is accused of sabotaging the washplant."
      },
      {
        "id": "tvmaze:128844",
        "title": "Frozen Gold",
        "season": 5,
        "episode": 17,
        "released": "2015-02-20",
        "overview": "The Klondike winter freezes the Hoffman's sluicebox. Tony's attempt to run his dredge is derailed when he discovers he has lost part of his bucket line. Equipment breakdowns stand between Parker and the best gold of the season."
      },
      {
        "id": "tvmaze:128845",
        "title": "Hundreds of Ounces",
        "season": 5,
        "episode": 18,
        "released": "2015-02-27",
        "overview": "The Hoffman crew makes a desperate bid to hit their season goal. Tony's attempt to run his million dollar gold dredge ends in a shipwreck. Parker fights the big freeze as he pushes to hit his 2.4 million dollar goal."
      },
      {
        "id": "tvmaze:142294",
        "title": "Freddy Dodge Returns",
        "season": 5,
        "episode": 19,
        "released": "2015-02-27",
        "overview": "Gold guru Freddy Dodge and his brother, mining legend Derek Dodge, hunt for gold in the Yukon wilderness. Despite early setbacks, Freddy is convinced that there could be a hot spot with a monster pile of gold nuggets."
      },
      {
        "id": "tvmaze:142295",
        "title": "Millions in Gold",
        "season": 5,
        "episode": 20,
        "released": "2015-03-06",
        "overview": "Parker faces mutiny, the Hoffmans get the largest dozer in the Klondike and Tony takes one last shot at getting his dredge mining for gold. Then, in a Gold Rush first, Parker, Tony and Todd appear together to discuss the epic season finale."
      },
      {
        "id": "tvmaze:144472",
        "title": "The Whole Truth",
        "season": 5,
        "episode": 21,
        "released": "2015-03-13",
        "overview": "The miners reveal the highs and lows, conflicts and behind the scenes drama from the season. Todd, Parker and Tony unveil their plans for next season and one key crew-member shocks everyone when he decides to call it quits."
      },
      {
        "id": "tvmaze:337425",
        "title": "Blood, Sweat and Gold",
        "season": 6,
        "episode": 1,
        "released": "2015-10-16",
        "overview": "As a new mining season begins, Parker gets off to a disastrous start when he loses key crew and Tony orders him off his claim. Todd sets a massive goal for the season and Tony reveals big plans to expand his operation."
      },
      {
        "id": "tvmaze:365199",
        "title": "Gold Ship",
        "season": 6,
        "episode": 2,
        "released": "2015-10-23",
        "overview": "Tony finally gets his 75 year old dredge mining for Klondike gold but a major issue brings the operation to a halt. Grandpa John is rushed to the hospital."
      },
      {
        "id": "tvmaze:376835",
        "title": "Moving the Monster",
        "season": 6,
        "episode": 3,
        "released": "2015-10-30",
        "overview": "Todd encounters big issues as he attempts to move his 50-ton washplant; Tony's dredge finally starts producing gold; Parker piles on the pressure and it proves to be too much for one of his young crew members."
      },
      {
        "id": "tvmaze:376836",
        "title": "Grandpa's Golden Advice",
        "season": 6,
        "episode": 4,
        "released": "2015-11-06",
        "overview": "Todd's attempt to deal with a mountain of tailings pits him against his son Hunter. Tony's dredge takes a hit as he puts a rookie winchman in the hot seat. Parker seeks advice from his Grandpa as he struggles to save his season."
      },
      {
        "id": "tvmaze:376837",
        "title": "Jack's Gold Shack",
        "season": 6,
        "episode": 5,
        "released": "2015-11-13",
        "overview": "Parker takes his frustration out on his crew until his Grandpa gives him a much needed wake up call. Tony's crew battles over how to fix the bucket line on the dredge and Todd calls upon Freddy Dodge for help."
      },
      {
        "id": "tvmaze:378145",
        "title": "Treasure Island",
        "season": 6,
        "episode": 6,
        "released": "2015-11-20",
        "overview": "Parker and his foreman Rick take a chance on a new cut. Todd searches for a fix so he can stop losing gold out of the sluicebox. Tony's crew hits a huge snag with the dredge."
      },
      {
        "id": "tvmaze:395224",
        "title": "ElDorado Dream",
        "season": 6,
        "episode": 7,
        "released": "2015-11-27",
        "overview": "Jack gets to chase his dream at ElDorado, the richest documented creek in North America. Parker's crew pushes hard in attempt to have Treasure Island live up to its name. Tony discovers his dredge is pouring gold out of its sluices."
      },
      {
        "id": "tvmaze:395757",
        "title": "Mammoth Channel",
        "season": 6,
        "episode": 8,
        "released": "2015-12-04",
        "overview": "The Hoffman crew uncovers a unique potential sign of good gold. Parker refuses to give up on Treasure Island and a fight between Tony and his crew spells the end for some of his crew."
      },
      {
        "id": "tvmaze:466115",
        "title": "Mammoth Gold",
        "season": 6,
        "episode": 9,
        "released": "2015-12-11",
        "overview": "Todd's crew discovers that finding prehistoric mammoth tusks brings good luck; Tony rebuild his wash plant; Parker opens the biggest cut of his life in an attempt to get more gold than his rival."
      },
      {
        "id": "tvmaze:395759",
        "title": "Parker's 21st",
        "season": 6,
        "episode": 10,
        "released": "2015-12-18",
        "overview": "Parker celebrates his 21st birthday with a big new toy; Tony looks into making an investment; and Todd gets a wakeup call."
      },
      {
        "id": "tvmaze:497602",
        "title": "Captain Monica",
        "season": 6,
        "episode": 11,
        "released": "2016-01-01",
        "overview": "Monica takes over as captain of Tony's 350 ton dredge. Parker struggles to haul in his monster new washplant and the Hoffman crew is plagued by tailings."
      },
      {
        "id": "tvmaze:506850",
        "title": "Crew War",
        "season": 6,
        "episode": 12,
        "released": "2016-01-08",
        "overview": "Parker's new mechanic sparks a mutiny; a drought shuts down Todd's operation; and Tony faces a major issue that could put him out of business."
      },
      {
        "id": "tvmaze:532025",
        "title": "Goldzilla Gold",
        "season": 6,
        "episode": 13,
        "released": "2016-01-15",
        "overview": "A series of breakdowns pits the Hoffman's day crew against the night shift. Parker's washplant continues to produce pay but his crew starts falling apart. Tony and Gene go head to head over how to run the dredge."
      },
      {
        "id": "tvmaze:538538",
        "title": "Million Dollar Mountain",
        "season": 6,
        "episode": 14,
        "released": "2016-01-22",
        "overview": "Tony makes a big purchase; Parker and Todd wager on who will get the most gold, leading to big changes on the claims."
      },
      {
        "id": "tvmaze:542758",
        "title": "Dead Even",
        "season": 6,
        "episode": 15,
        "released": "2016-01-29",
        "overview": "Parker runs bedrock in an all out bid to overtake his rival in the gold count. Todd opens a risky new cut and things go south when Monica and Kevin are left in charge of the dredge."
      },
      {
        "id": "tvmaze:571891",
        "title": "Golden Bombshell",
        "season": 6,
        "episode": 16,
        "released": "2016-02-05",
        "overview": "Parker takes a huge risk as he abandons the Boundary Cut for a shot at big gold. Gene pushes the dredge faster than it was ever designed to run and Todd's best clean up of the season is overshadowed when his landlord drops a devastating bombshell."
      },
      {
        "id": "tvmaze:613900",
        "title": "Klondike Legend",
        "season": 6,
        "episode": 17,
        "released": "2016-02-12",
        "overview": "Tony Beets travels back to his roots in the Netherlands where he reveals details about his transformation from a farm boy to a Klondike mining legend. Cameras also follow him in his offseason home in the desert."
      },
      {
        "id": "tvmaze:571892",
        "title": "Oregon Gold",
        "season": 6,
        "episode": 18,
        "released": "2016-02-19",
        "overview": "Faced with losing McKinnon Creek, Todd goes prospecting for nuggets and a new claim. Tony steers the dredge in a radical new direction and Parker pushes his crew to the limit when he orders them to move the washplant in 12 hours."
      },
      {
        "id": "tvmaze:581589",
        "title": "Frozen Pay",
        "season": 6,
        "episode": 19,
        "released": "2016-02-26",
        "overview": "A frozen cut forces Parker to divert a creek and mine the thawed pay gravel beneath. Tony faces disaster when he breaks his dredge buckets and Todd doubles down with a second monster washplant."
      },
      {
        "id": "tvmaze:594144",
        "title": "King of the Klondike",
        "season": 6,
        "episode": 20,
        "released": "2016-03-04",
        "overview": "Todd runs two massive washplants, Tony pushes to get his dredge out of the water before it freezes and Grandpa John comes to see if Parker has beaten his rival Todd. Then, Parker, Todd and Tony appear together to discuss the epic season finale."
      },
      {
        "id": "tvmaze:650279",
        "title": "Gold Hard Truth",
        "season": 6,
        "episode": 21,
        "released": "2016-03-11",
        "overview": "A crew romance is revealed; Tony is accused of not honoring a deal; Parker's crew lets him have it; Todd reveals a secret talent; a sneak peek of plans for next season."
      },
      {
        "id": "tvmaze:893889",
        "title": "Miracle on the Mountain",
        "season": 7,
        "episode": 1,
        "released": "2016-10-14",
        "overview": "In the epic 2-hr premiere Todd Hoffman takes the biggest gamble and turns his back on guaranteed gold in the Klondike. Tony Beets expands his empire, buying a huge second dredge. Parker Schnabel starts his new season without his grandfather &amp; mentor."
      },
      {
        "id": "tvmaze:938331",
        "title": "Eye in the Sky",
        "season": 7,
        "episode": 2,
        "released": "2016-10-21",
        "overview": "Todd Hoffman has his back against the wall when his new Oregon mine fails to deliver. Parker Schnabel's new $600,000 washplant breaks down on its first start-up and Tony Beets takes to the sky to check up on his children."
      },
      {
        "id": "tvmaze:938332",
        "title": "Frankenstein Machinery",
        "season": 7,
        "episode": 3,
        "released": "2016-10-28",
        "overview": "Todd returns to the Klondike to collect Monster Red while Parker confronts tough negotiator Tony over royalties and receives a shock offer which will change his season."
      },
      {
        "id": "tvmaze:946019",
        "title": "Mutiny",
        "season": 7,
        "episode": 4,
        "released": "2016-11-04",
        "overview": "Todd finally finds good gold at his new High Bar mine; Parker gives his foreman Rick his own operation and when Tony and Minnie decide to cut the dredge crew's pay, a key crew member calls it quits."
      },
      {
        "id": "tvmaze:961547",
        "title": "Misery on the Mountain",
        "season": 7,
        "episode": 5,
        "released": "2016-11-11",
        "overview": "Todd battles to get the 50oz of gold he needs to keep his High Bar mine open. Tony brings all his children together to get his Paradise Hill claim up and running. Parker is furious at a series of human errors which cost him thousands of dollars."
      },
      {
        "id": "tvmaze:961548",
        "title": "No Crane, No Gain",
        "season": 7,
        "episode": 6,
        "released": "2016-11-18",
        "overview": "Todd Hoffman moves his entire operation and starts to run paydirt at a new mine. Parker Schnabel is flooded out and Tony Beets' ancient dredge hits a record gold."
      },
      {
        "id": "tvmaze:967335",
        "title": "Watery Grave",
        "season": 7,
        "episode": 7,
        "released": "2016-11-25",
        "overview": "Tony arrives to find his million-dollar dredge in disaster. While Rick is at his grandpa's funeral, Parker shuts him down by taking his equipment, and the Hoffmans discover that their wash-plant doesn't work in their new mine."
      },
      {
        "id": "tvmaze:976094",
        "title": "Mega Barge & Kid Commando",
        "season": 7,
        "episode": 8,
        "released": "2016-12-02",
        "overview": "Todd Hoffman digs deeper than ever in a desperate search for gold. Tony Beets hauls a monster down the Yukon River. Parker Schnabel's $600,000 wash-plant starts to shake itself apart."
      },
      {
        "id": "tvmaze:979247",
        "title": "Record Gold",
        "season": 7,
        "episode": 9,
        "released": "2016-12-09",
        "overview": "In this mega-packed episode, Tony Beets breaks records with the biggest gold haul in Gold Rush history. Parker Schnabel battles to save his dream washplant, and after seven weeks at the Buckland, Todd Hoffman's finally on the gold."
      },
      {
        "id": "tvmaze:1008444",
        "title": "Go Down Fighting",
        "season": 7,
        "episode": 10,
        "released": "2016-12-16",
        "overview": "Todd Hoffman hits rock bottom when, after seven seasons, a key crew member quits. Tony Beets transforms some rusty relics into a monster power barge, and a troubled Parker Schnabel misses his own birthday party."
      },
      {
        "id": "tvmaze:1008445",
        "title": "Game Over",
        "season": 7,
        "episode": 11,
        "released": "2016-12-30",
        "overview": "With no paycheck for five weeks, Todd Hoffman's close-knit team turn on each other. Parker's gamble to run his washplant without protection from rocks proves costly. Tony builds a $10,000 mega-trailer to move his barge – but gets his measurements wrong."
      },
      {
        "id": "tvmaze:1026474",
        "title": "Abandonment",
        "season": 7,
        "episode": 12,
        "released": "2017-01-06",
        "overview": "Todd Hoffman's crew has quit, and he desperately tries to keep mining with a skeleton team. Parker carelessly breaks his truck's air hoses while transporting his washplant, and Tony Beets discovers his dredge is blowing gold out of the sluice"
      },
      {
        "id": "tvmaze:1026477",
        "title": "Lifeline",
        "season": 7,
        "episode": 13,
        "released": "2017-01-13",
        "overview": "The remnants of the Hoffman crew are at their lowest, but someone brings Todd good news. Tony Beets fires his barge captain, then runs aground up the mighty Yukon River. Rick Ness finally gets Parker Schnabel's second operation up and running"
      },
      {
        "id": "tvmaze:1026478",
        "title": "Parker vs. Rick",
        "season": 7,
        "episode": 14,
        "released": "2017-01-20",
        "overview": "Rick outperforms Parker on his new Indian River claim. Tony's dredge suffers a catastrophic failure, threatening his season. Todd Hoffman's skeleton crew finally sees good gold at their new mine in Colorado."
      },
      {
        "id": "tvmaze:1046704",
        "title": "Excavator Down",
        "season": 7,
        "episode": 15,
        "released": "2017-01-27",
        "overview": "Todd Hoffman eats humble pie when he begs his old crew to return, Parker loses an excavator in a swamp and Tony Beets gives daughter Monica her own operation."
      },
      {
        "id": "tvmaze:1046705",
        "title": "Double Trouble",
        "season": 7,
        "episode": 16,
        "released": "2017-02-03",
        "overview": "The Hoffman crew opens a second mine in Colorado, Parker Schnabel tries out a new mechanic who fails to get approval from Mitch. Tony Beets sets sail in a power-barge up the mighty Yukon river."
      },
      {
        "id": "tvmaze:1046706",
        "title": "Cruelest Cut",
        "season": 7,
        "episode": 17,
        "released": "2017-02-10",
        "overview": "Parker Schnabel is forced to call his dad in to help his struggling operation; Todd Hoffman has the best clean-up of the season; and Tony Beets' daughter, Monica, starts bringing home the gold."
      },
      {
        "id": "tvmaze:1046707",
        "title": "Miners vs. Beavers",
        "season": 7,
        "episode": 18,
        "released": "2017-02-17",
        "overview": "Todd whole operation is brought to a halt when a beaver dams his water supply, Parker's plant move turns into an excavator nightmare and a massive fix means Tony can finally get his broken dredge up and running."
      },
      {
        "id": "tvmaze:1046708",
        "title": "Dredge vs. Washplant",
        "season": 7,
        "episode": 19,
        "released": "2017-02-24",
        "overview": "Todd finds monster nuggets on the top of a mountain, Parker and Rick struggle with a conveyor and Tony pits Monica against Kevin to see if the dredge is more efficient than a modern washplant."
      },
      {
        "id": "tvmaze:1070930",
        "title": "Viking Voyage",
        "season": 7,
        "episode": 20,
        "released": "2017-03-03",
        "overview": "Todd uses dynamite to blast monster boulders and get to the gold, Parker has to overcome a flood to get to a record gold count and Tony heads up the freezing Yukon River in his massive power barge."
      },
      {
        "id": "tvmaze:1070931",
        "title": "Final Fury",
        "season": 7,
        "episode": 21,
        "released": "2017-03-10",
        "overview": "As all three crews attempt to hit their final goals, a bare knuckle fight on the Hoffman claim ends in recriminations, &amp; resignations. Tony's plan to relocate his dredge hits a brick wall &amp; Parker Schnabel records the biggest gold weigh of his life."
      },
      {
        "id": "tvmaze:1317727",
        "title": "Wagers and Wars",
        "season": 8,
        "episode": 1,
        "released": "2017-10-13",
        "overview": "Parker and Todd go head to head as they lay down the exact same gold-weight goal for their season, whilst Tony Beets fires up his second ancient dredge."
      },
      {
        "id": "tvmaze:1317728",
        "title": "Blizzards and Bullets",
        "season": 8,
        "episode": 2,
        "released": "2017-10-20",
        "overview": "A rogue gunman fires shots at the Hoffman crew. Frozen ground destroys Parker Schnabel's dozers. Tony Beets starts to tear apart his 500 ton dredge."
      },
      {
        "id": "tvmaze:1317729",
        "title": "The Viking vs. the Mechanic",
        "season": 8,
        "episode": 3,
        "released": "2017-10-27",
        "overview": "Todd interferes with son Hunter's wash-plant, pushing their relationship to a breaking point. Parker battles to maneuver a 150 foot super conveyor. Tony desperately needs dredge number 1 to deliver gold, but frozen ice may derail his plans."
      },
      {
        "id": "tvmaze:1317730",
        "title": "The Curse of the Fairplay Mountains",
        "season": 8,
        "episode": 4,
        "released": "2017-11-03",
        "overview": "When Todd Hoffman's water supply is ruled illegal, Freddy comes up with a plan to save the day. Tony undertakes a $600,000 upgrade of dredge #1."
      },
      {
        "id": "tvmaze:1317731",
        "title": "Son Dethrones Father",
        "season": 8,
        "episode": 5,
        "released": "2017-11-10",
        "overview": "While Parker Schnabel fights rising floodwaters to save his cut, Hunter Hoffman makes a bold decision shut down his operation and his father's."
      },
      {
        "id": "tvmaze:1317732",
        "title": "Colorado Strikes Back",
        "season": 8,
        "episode": 6,
        "released": "2017-11-17",
        "overview": "Todd shuts down his operations to support Freddy Dodge as he pleads with the county commissioners to allow him to mine his claim. Plus, Kevin has bad news."
      },
      {
        "id": "tvmaze:1317733",
        "title": "Inferno",
        "season": 8,
        "episode": 7,
        "released": "2017-11-24",
        "overview": "A massive forest fire tears through the Klondike towards Parker's claim threatening to end his season. Tony's desperately needs his barge to run, but can Sheamus deliver?"
      },
      {
        "id": "tvmaze:1356992",
        "title": "The Mighty Uppercut",
        "season": 8,
        "episode": 8,
        "released": "2017-12-01",
        "overview": "Todd is falling way short of his target and with his business struggling, he faces a tough ultimatum. Plus, Parker must move Sluicifer but is short on crew."
      },
      {
        "id": "tvmaze:1356993",
        "title": "Gold Bars and Hail Marys",
        "season": 8,
        "episode": 9,
        "released": "2017-12-08",
        "overview": "In Colorado, Todd's only hope for the season rests on a new claim, 'the jewellery box' - but has it already been mined out? And, Freddy drops a bombshell."
      },
      {
        "id": "tvmaze:1356994",
        "title": "The Devil's Finger",
        "season": 8,
        "episode": 10,
        "released": "2017-12-15",
        "overview": "Parker Schnabel is halfway through the season, but nowhere near halfway his goal. Plus, Tony Beets is ready to barge the bucket line down the Yukon River."
      },
      {
        "id": "tvmaze:1356995",
        "title": "The Holy Grail",
        "season": 8,
        "episode": 11,
        "released": "2017-12-22",
        "overview": "Todd discovers a historic mine that could turn his season around and battles monster boulders to get to gold. Tony mounts a massive operation to replace a 24-ton bucket line and Parker's parents arrive for his birthday bearing extraordinary gifts."
      },
      {
        "id": "tvmaze:1374820",
        "title": "Eclipsed",
        "season": 8,
        "episode": 12,
        "released": "2018-01-05",
        "overview": "Todd's Colorado mine is in the path of a rare solar eclipse, but he's in trouble with less than 800 ounces this season. Meanwhile, Rick has bad news for Parker."
      },
      {
        "id": "tvmaze:1381275",
        "title": "Lost Gold",
        "season": 8,
        "episode": 13,
        "released": "2018-01-12",
        "overview": "Hunter Hoffman makes a rookie mistake that causes dysfunction in the team. Tony Beets has to improvise to tear down his second dredge. Parker Schnabel risks damaging his washplant as he races to finish his last cut at Scribner Creek."
      },
      {
        "id": "tvmaze:1374821",
        "title": "The Father, the Son & the Holy Roller",
        "season": 8,
        "episode": 14,
        "released": "2018-01-19",
        "overview": "Parker Schnabel's opens a brand-new cut, but his crew gets stuck in the mud. Todd tries to get Hunter back on the team to assemble a new wash-plant and Tony's stuck up the creek without a barge."
      },
      {
        "id": "tvmaze:1374822",
        "title": "Broken",
        "season": 8,
        "episode": 15,
        "released": "2018-01-26",
        "overview": "Parker Schnabel takes on a massive wash-plant move on his own. Todd Hoffman races to set up new trommel and faces a medical emergency, while Tony Beets' daughter Monica makes a $200,000 mistake."
      },
      {
        "id": "tvmaze:1393737",
        "title": "Of Monsters and Men",
        "season": 8,
        "episode": 16,
        "released": "2018-02-02",
        "overview": "Parker threatens to shut down Rick's Indian River operation after production drops. Disaster strikes for Tony and Todd gives his crew a shock ultimatum."
      },
      {
        "id": "tvmaze:1398341",
        "title": "Planes, Cranes, and Virgin Claims",
        "season": 8,
        "episode": 17,
        "released": "2018-02-16",
        "overview": "Parker suspects Tony of sabotage on his new ground and confronts him. Todd's new washplant hits the noise limits for local regulations and they must find a bush fix to solve the problem. Tony Beets takes on his biggest challenge yet in tearing down his second dredge."
      },
      {
        "id": "tvmaze:1409384",
        "title": "King Kong",
        "season": 8,
        "episode": 18,
        "released": "2018-02-23",
        "overview": "Parker fulfils a life time ambition when he buys his first Klondike claim. Plus, Todd attempts to use chemical integrity to break a monster boulder that's in his path."
      },
      {
        "id": "tvmaze:1413025",
        "title": "Independence Day",
        "season": 8,
        "episode": 19,
        "released": "2018-03-02",
        "overview": "Tony's dredge teardown hits a wall when they attempt to remove the heaviest piece yet. Todd's son, Hunter demands a change of mine site if they're going to have a future. Parker makes a bid for independence on his own claim, but Tony stands in his way."
      },
      {
        "id": "tvmaze:1416775",
        "title": "The Spoils of War",
        "season": 8,
        "episode": 20,
        "released": "2018-03-09",
        "overview": "It's judgement day on Parker and Todd's 100-ounce bet. Parker chases a record breaking 7.2 million dollar season total. Todd desperately tries to stop his crew from falling apart. Tony struggles to get his dredge to Dawson before the Yukon River freezes."
      },
      {
        "id": "tvmaze:1520397",
        "title": "Declaration of Independence",
        "season": 9,
        "episode": 1,
        "released": "2018-10-12",
        "overview": "New mine boss Rick gathers together his crew of greenhorns and arrives in the Yukon ready to start his season. Parker and Tony face off over royalties and land access in a confrontation that threatens to end one of their seasons before it's even begun."
      },
      {
        "id": "tvmaze:1536444",
        "title": "Smoked Out",
        "season": 9,
        "episode": 2,
        "released": "2018-10-19",
        "overview": "Rick faces mutiny from his crew of greenhorns. Parker visits his parents for advice and makes a decision that affects the rest of his season. Tony's barge hits trouble on its way back to Dawson to finally begin the rebuild of his second monster dredge."
      },
      {
        "id": "tvmaze:1537475",
        "title": "Gods and Monsters",
        "season": 9,
        "episode": 3,
        "released": "2018-10-26",
        "overview": "Rick hunts for a new washplant with his crew. With Parker's ground frozen he must find a way to mine the gold to pay his deposit to Tony. Tony orders son Kevin to train up a new dredgemaster, but a vital piece gets damaged and brings them to a halt."
      },
      {
        "id": "tvmaze:1539491",
        "title": "Durt Reynolds",
        "season": 9,
        "episode": 4,
        "released": "2018-11-02",
        "overview": "Disaster strikes when Rick fires up his washplant for the first time. Parker tries a risky plan to keep the gold coming in and must decide on a new foreman to replace Rick. Tony must transport his tug Kid Commando to the dock for a crucial stability test."
      },
      {
        "id": "tvmaze:1539492",
        "title": "The Return of Freddy Dodge",
        "season": 9,
        "episode": 5,
        "released": "2018-11-09",
        "overview": "To save his season, Rick drafts a Gold Rush vet and former member of team Hoffman. Chasing a record-breaking goal, Parker orders an unachievable goal. Tony and Monica fire up their wash plant as they battle to beat Parker to the gold."
      },
      {
        "id": "tvmaze:1543165",
        "title": "Hoffman's Ghosts",
        "season": 9,
        "episode": 6,
        "released": "2018-11-16",
        "overview": "New mine boss Rick is buckling under debt, if he's going to prove himself to his crew he needs to get his first gold weigh. Parker attempts a treacherous river crossing and Tony Beets hits a snag removing a massive piece of his million-dollar dredge."
      },
      {
        "id": "tvmaze:1545596",
        "title": "Hazard Pay",
        "season": 9,
        "episode": 7,
        "released": "2018-11-23",
        "overview": "Rick needs a quick fix from Freddy Dodge to keep his season on track. Parker races to get his second wash plant running, but struggles. Tony needs to re-float his sunken dredge and turns to a familiar face from the Hoffman crew for a solution."
      },
      {
        "id": "tvmaze:1555734",
        "title": "Stormageddon",
        "season": 9,
        "episode": 8,
        "released": "2018-11-30",
        "overview": "Torrential rains hit the Klondike and Parker and Rick battle to save their mining operations from being flooded out. Tony sends son Mike on his first voyage as Captain on his tug the Kid Commando."
      },
      {
        "id": "tvmaze:1555735",
        "title": "Megamorphosis",
        "season": 9,
        "episode": 9,
        "released": "2018-12-05",
        "overview": "Parker battles to save his season when his biggest wash plant collapses. Rick makes a shocking discovery about his gold mining claim and turns to his dad for help. Tony races to finish dismantling his dredge but a crucial piece comes crashing down."
      },
      {
        "id": "tvmaze:1573412",
        "title": "Father's Day",
        "season": 9,
        "episode": 10,
        "released": "2018-12-14",
        "overview": "Rick Ness and his Dad, Rick Senior, battle together to open a new cut. Parker is struggling with mechanical breakdowns and one of his crew suffers a terrible injury. Tony races to dismantle the final sections of his million-dollar Dredge."
      },
      {
        "id": "tvmaze:1575648",
        "title": "The Resurrection",
        "season": 9,
        "episode": 11,
        "released": "2018-12-21",
        "overview": "The flu brings Parker's operation to its knees, and it's up to foreman Dean to keep the claim running. Rick's mechanic, Carl, behaves strangely and reveals shocking news. Tony hits rock bottom as his entire operation grinds to a halt."
      },
      {
        "id": "tvmaze:1580103",
        "title": "The Devil's Deadline",
        "season": 9,
        "episode": 12,
        "released": "2019-01-04",
        "overview": "Rick is forced to ask Tony for help. Parker runs a 24-hour test of his ground and suffers another washplant failure. Tony hauls the final piece of his million-dollar second dredge from Thistle Creek and prepares to rebuild it."
      },
      {
        "id": "tvmaze:1584453",
        "title": "Sucker Punch",
        "season": 9,
        "episode": 13,
        "released": "2019-01-11",
        "overview": "Rick Ness and Freddy Dodge discover an issue with the wash plant, potentially losing thousands in gold. Parker must risk using a dozer to move his biggest wash plant and Tony's daughter Monica tries to keep their dream of a 6,000-ounce season alive."
      },
      {
        "id": "tvmaze:1586321",
        "title": "Old School Heroes",
        "season": 9,
        "episode": 14,
        "released": "2019-01-18",
        "overview": "Rick makes a disastrous mistake that shuts down his claim. Parker threatens a long time member of the crew with demotion and Tony resurrects an ancient wash plant in an attempt to get back in the game."
      },
      {
        "id": "tvmaze:1593829",
        "title": "Wedding Bells & Emergency Operations",
        "season": 9,
        "episode": 15,
        "released": "2019-01-25",
        "overview": "Parker tasks Brennan with moving wash plant Big Red in just 24 hours. Rick's crew struggles when someone falls prey to a life threatening illness. Wedding bells ring in the Yukon as the Beets family readies for the marriage of Tony's daughter Monica."
      },
      {
        "id": "tvmaze:1595558",
        "title": "Broken Bones",
        "season": 9,
        "episode": 16,
        "released": "2019-02-01",
        "overview": "Parker crashes a jet boat resulting in a terrible injury. Frozen ground and machinery breakdowns threaten Rick's season. Its all hands on deck as Tony and family finally start to rebuild his million-dollar second dredge."
      },
      {
        "id": "tvmaze:1604954",
        "title": "Make It Rain",
        "season": 9,
        "episode": 17,
        "released": "2019-02-15",
        "overview": "Tony and his family attempt a dangerous crane operation. Rick fights frozen ground to keep his season alive and Parker, in a desperate bid to get every last ounce of gold from his ground, pushes wash plant Sluicifer beyond the limit."
      },
      {
        "id": "tvmaze:1608846",
        "title": "Big Red Is Dead",
        "season": 9,
        "episode": 18,
        "released": "2019-02-22",
        "overview": "Parker is closing in on his colossal $7.2 million target, but wash plant Big Red is running out of pay dirt. After weeks of plummeting gold totals Rick needs to run 24/7 to stand any chance of reaching his goal and Tony makes a desperate play."
      },
      {
        "id": "tvmaze:1610795",
        "title": "Cold War",
        "season": 9,
        "episode": 19,
        "released": "2019-03-01",
        "overview": "Parker's parents visit and offer help. Rick battles to reach 1000 oz before the weather freezes him out and shocking news forces Tony to make a drastic decision about his season."
      },
      {
        "id": "tvmaze:1613868",
        "title": "Brace for Impact",
        "season": 9,
        "episode": 20,
        "released": "2019-03-08",
        "overview": "Rick and crew fight to get as much gold as possible before they're shut down. Tony races to finish his second dredge and Parker makes the riskiest move of the season."
      },
      {
        "id": "tvmaze:1616778",
        "title": "Fire and Ice",
        "season": 9,
        "episode": 21,
        "released": "2019-03-15",
        "overview": "While on target for an $8.4-million-dollar season, Parker's wash plant catches fire. Rick and crew finish their first mining season strong. Tony heads into the wilderness to find lost equipment and attempts to get his ancient dredge up and running."
      },
      {
        "id": "tvmaze:1730774",
        "title": "Crisis in the Klondike",
        "season": 10,
        "episode": 1,
        "released": "2019-10-11",
        "overview": "A crisis in the Klondike forces Parker, Rick &amp; Tony to take massive gambles to strike it rich and hunt for gold on new grounds. The setback hits just as the price of gold spikes, sparking a new gold rush to the area."
      },
      {
        "id": "tvmaze:1730776",
        "title": "A New Rush Begins",
        "season": 10,
        "episode": 2,
        "released": "2019-10-18",
        "overview": "Parker bets millions on his crew sluicing in record time and is forced to make a decision when things don't go as planned. Rick rushes to fire up his washplant and find big nuggets. A showdown on the Indian River sends a Klondike legend scrambling."
      },
      {
        "id": "tvmaze:1735459",
        "title": "The Nugget Hunter",
        "season": 10,
        "episode": 3,
        "released": "2019-10-25",
        "overview": "Rick and his dad fly high into Keno mountains on a treasure hunt for massive nuggets. Tony and Monica investigate a gold hot spot the old dredges may have missed. Parker makes a big decision about his crew that could determine the fate of his season."
      },
      {
        "id": "tvmaze:1741545",
        "title": "Leave No Gold Behind",
        "season": 10,
        "episode": 4,
        "released": "2019-11-01",
        "overview": "Parker second guesses the ground he's mining and questions his new foremen. Tony Beets makes a big decision to move the family's entire operation. Rick's mechanic arrives at a critical moment."
      },
      {
        "id": "tvmaze:1747974",
        "title": "We're Gonna Need a Bigger Bucket",
        "season": 10,
        "episode": 5,
        "released": "2019-11-08",
        "overview": "Parker throws down a huge engineering challenge to his team. Rick decides to make a major upgrade to his operation. Mike and Monica team-up to open more ground."
      },
      {
        "id": "tvmaze:1751494",
        "title": "Monster Red Lives",
        "season": 10,
        "episode": 6,
        "released": "2019-11-15",
        "overview": "In search of big nuggets, Rick buys a monster washplant. A flood puts Tony Beets new claim into jeopardy. Parker needs to move Big Red in record time to get back on the gold."
      },
      {
        "id": "tvmaze:1754734",
        "title": "Motherlode Mountain",
        "season": 10,
        "episode": 7,
        "released": "2019-11-22",
        "overview": "The Beets discover what could be the motherlode. Rick faces an impossible decision: mine gold or put together his new washplant. Parker tests his new co-foreman with the claims most important machine."
      },
      {
        "id": "tvmaze:1757293",
        "title": "Washplant Wars",
        "season": 10,
        "episode": 8,
        "released": "2019-11-29",
        "overview": "Rick races to get Monster Red running after losing his only way to mine gold. A dangerous storm shuts down Parker's operation. The Beets family push to get Monica's potentially gold-rich cut up and running."
      },
      {
        "id": "tvmaze:1761224",
        "title": "No Time for Redemption",
        "season": 10,
        "episode": 9,
        "released": "2019-12-06",
        "overview": "Tensions rise when Parker introduces a new crewmember and a radical plan. The Beets family runs an important test on daughter Monica's Hunker Creek claim that could make or break their season. Rick calls on Freddy Dodge to fix Monster Red."
      },
      {
        "id": "tvmaze:1766869",
        "title": "When the Levee Breaks",
        "season": 10,
        "episode": 10,
        "released": "2019-12-13",
        "overview": "Rick's season hangs in the balance when an engineering disaster shuts him down. Parker sinks a ton of money into a new claim. Tony gets a third operation running."
      },
      {
        "id": "tvmaze:1771294",
        "title": "Rise of the Machines",
        "season": 10,
        "episode": 11,
        "released": "2019-12-20",
        "overview": "Rick tries to outsmart a vital piece of equipment that has a mind of its own. Parker splurges on a brand new toy to get more gold. The Beets bring in a hired gun to turn around the season."
      },
      {
        "id": "tvmaze:1782929",
        "title": "Million-Dollar Pay Day",
        "season": 10,
        "episode": 12,
        "released": "2020-01-03",
        "overview": "Parker gambles big and splits his crew in search of a massive score. Rick calls in a mining legend to save his season. The Beets move heaven and earth to get all three kids bringing in gold."
      },
      {
        "id": "tvmaze:1782872",
        "title": "Nuggets or Bust",
        "season": 10,
        "episode": 13,
        "released": "2020-01-10",
        "overview": "Rick brings in a secret weapon in his hunt for big nuggets. Tony's confronted with a catastrophic issue at his settling pond. Parker makes a risky decision when he hires a friend with no mining experience to help the crew get ahead."
      },
      {
        "id": "tvmaze:1781946",
        "title": "Cornered",
        "season": 10,
        "episode": 14,
        "released": "2020-01-17",
        "overview": "After pulling the plug on his operation, Rick is thrown a lifeline that will determine the rest of his mining season. Parker and Tony battle frozen paydirt."
      },
      {
        "id": "tvmaze:1791363",
        "title": "And Then There Was One",
        "season": 10,
        "episode": 15,
        "released": "2020-01-24",
        "overview": "Tony's back down to one operation running and threatens his entire season. Parker's crew must move washplant Big Red to meet his goal of mining his entire ground this season. Rick runs his washplant at maximum speed and has surprising results."
      },
      {
        "id": "tvmaze:1794130",
        "title": "Parker Doubles Down",
        "season": 10,
        "episode": 16,
        "released": "2020-01-31",
        "overview": "Parker makes a big move to double his output and bring in more gold. The Beets' face catastrophe when their only remaining operation grinds to a halt. Just as Rick gets Monster Red dialed in, huge rocks threaten to shut him down for good."
      },
      {
        "id": "tvmaze:1796519",
        "title": "Rebellion at Duncan Creek",
        "season": 10,
        "episode": 17,
        "released": "2020-02-07",
        "overview": "A machine failure leads to an explosive uprising on Rick's claim. Parkers crew races to build a mountain of pay dirt. Tony decides to run 24/7 to increase his gold total."
      },
      {
        "id": "tvmaze:1796616",
        "title": "Frozen Treasure",
        "season": 10,
        "episode": 18,
        "released": "2020-02-14",
        "overview": "Monica races to run newly thawed paydirt that could save the season. Parker constructs a mega pond to keep his operation running. Rick troubleshoots a problem with his wash plant and gears up to end his season strong."
      },
      {
        "id": "tvmaze:1799741",
        "title": "Bring in the Big Guns",
        "season": 10,
        "episode": 19,
        "released": "2020-02-21",
        "overview": "Rick confronts his landowners. Tony makes a massive purchase. Parker searches for new ground."
      },
      {
        "id": "tvmaze:1801989",
        "title": "Rally in the Valley",
        "season": 10,
        "episode": 20,
        "released": "2020-02-28",
        "overview": "Rick hits a gold layer that may save his season. Parker's crew take big risks in Death Valley. Tony turns a corner."
      },
      {
        "id": "tvmaze:1801990",
        "title": "Last Gold",
        "season": 10,
        "episode": 21,
        "released": "2020-03-06",
        "overview": "At the end of his season Parker closes in on a record gold total. Rick rolls the dice on a new piece of ground. Tony turns to Hunker Creek for a final score."
      },
      {
        "id": "tvmaze:1931520",
        "title": "The Perfect Storm",
        "season": 11,
        "episode": 1,
        "released": "2020-10-23",
        "overview": "As gold prices spike to record highs and the cost of fuel plummets, Parker, Rick and Tony race to take advantage of the perfect conditions. But after the worldwide lockdown delayed the start of the season, there's less time than ever to cash in."
      },
      {
        "id": "tvmaze:1947801",
        "title": "Promised Land",
        "season": 11,
        "episode": 2,
        "released": "2020-10-30",
        "overview": "Parker expands to a second cut and puts his trust in a rookie foreman. Tony battles the cursed cut. Rick fires up his plant on rich ground. Greenhorn Fred Lewis calls in a mining legend."
      },
      {
        "id": "tvmaze:1956560",
        "title": "The Fast and the Furious",
        "season": 11,
        "episode": 3,
        "released": "2020-11-06",
        "overview": "Parker's new strategy to build a war chest creates an engineering challenge, igniting a flare up with his foremen. Rick pulls in his first gold of the season. Fred calls in reinforcements."
      },
      {
        "id": "tvmaze:1957614",
        "title": "Breaking the Piggy Bank",
        "season": 11,
        "episode": 4,
        "released": "2020-11-13",
        "overview": "Parker's crew works double-time hoping for a big payoff while Tony gambles on a hidden strip of paydirt. Later, Rick struggles to keep his small crew working."
      },
      {
        "id": "tvmaze:1965495",
        "title": "It's Alive",
        "season": 11,
        "episode": 5,
        "released": "2020-11-20",
        "overview": "Rick bets nearly all his gold on a new machine that could transform his operation. Tony resurrects an abandoned secret weapon. Parker hires new crew members to make up for lost time."
      },
      {
        "id": "tvmaze:1971216",
        "title": "Big Red vs. Sluicifer",
        "season": 11,
        "episode": 6,
        "released": "2020-11-27",
        "overview": "A competition erupts between Parker's two wash plant teams. Tony discovers a pile of lost gold. Fred Lewis' and veteran crew fire up The Colonel and face an unexpected setback."
      },
      {
        "id": "tvmaze:1973042",
        "title": "Rick's Sixth Sense",
        "season": 11,
        "episode": 7,
        "released": "2020-12-04",
        "overview": "Rick risks his season on a hunch that he's discovered a new hot spot. Tony mobilises an arsenal to cash in on lost gold. Fred's veteran crew fight old equipment."
      },
      {
        "id": "tvmaze:1976691",
        "title": "Lost Gold of Paradise Hill",
        "season": 11,
        "episode": 8,
        "released": "2020-12-11",
        "overview": "Tony fires up a second plant to haul in gold left behind by the old-timers. Tensions rise when Parker departs for Alaska, leaving Mitch in charge. Rick faces disaster when he his sluice box springs a leak."
      },
      {
        "id": "tvmaze:1979795",
        "title": "Back to Alaska",
        "season": 11,
        "episode": 9,
        "released": "2020-12-18",
        "overview": "Parker returns to Alaska to prospect new ground and expand his empire. Rick digs deep for big gold in a cut he hopes will deliver the biggest weigh in of the season. Fred's crew member Johnny comes up with unique fix to their water problem."
      },
      {
        "id": "tvmaze:1988280",
        "title": "Record Breaker",
        "season": 11,
        "episode": 10,
        "released": "2021-01-01",
        "overview": "Parker returns to the Klondike and records the biggest gold haul of his career. Tony travels deep into the wilderness to resurrect of a gold-catching monster. Rick's forced to find better ground. Fred makes a big change to get on the gold."
      },
      {
        "id": "tvmaze:1993108",
        "title": "Frenemies",
        "season": 11,
        "episode": 11,
        "released": "2021-01-08",
        "overview": "Parker makes a deal with Tony to open a new cut on the Indian River and Tony's new trommel build gets derailed. Later, Fred's greenhorns step up to keep the Colonel running."
      },
      {
        "id": "tvmaze:1997751",
        "title": "Resurrecting Monsters",
        "season": 11,
        "episode": 12,
        "released": "2021-01-15",
        "overview": "Parker risks losing sluicifer during a move to new ground while the Beets try to supercharge their season with a massive new trommel. Rick brings back Monster Red for help with a record season."
      },
      {
        "id": "tvmaze:2004315",
        "title": "Got Your Six",
        "season": 11,
        "episode": 13,
        "released": "2021-01-22",
        "overview": "Tony cleans up big with the old timer's lost gold. On the brink of ending his season, Fred Lewis' team begins to crack, forcing him to make a big a decision. Rick cashes in his gold to fund his season, leaving his crew to keep the season on track."
      },
      {
        "id": "tvmaze:2009393",
        "title": "Freddy to the Rescue",
        "season": 11,
        "episode": 14,
        "released": "2021-01-29",
        "overview": "Parker's crew tallies up all the gold from the Last Cut and rushes to mine out the Airstrip Cut. Freddy and Juan answer an SOS call from Fred Lewis. Tony drains a massive holding pond to get his operation back up and running."
      },
      {
        "id": "tvmaze:2014176",
        "title": "The Viking Detective",
        "season": 11,
        "episode": 15,
        "released": "2021-02-05",
        "overview": "Parker and crew face a potentially catastrophic flood at the Airstrip Cut. Tony uncovers a secret patch of gold-rich ground at Paradise Hill and logs his biggest gold weigh of the year. Rick throttles up his operation with a new water system."
      },
      {
        "id": "tvmaze:2018080",
        "title": "No Questions Asked",
        "season": 11,
        "episode": 16,
        "released": "2021-02-12",
        "overview": "Fred discovers a promising new section of ground under the old Mayor's house. Parker's co-foreman Mitch is confronted with a family crisis. Rick turns to the King of Klondike to keep his operation running."
      },
      {
        "id": "tvmaze:2024797",
        "title": "Growing Pains",
        "season": 11,
        "episode": 17,
        "released": "2021-02-19",
        "overview": "When mechanic Carl is forced to leave the claim for an emergency surgery, Rick's team bands together to stay on the gold. Fred's crew step up after their loader dies. Tony pays the price for ignoring a long overdue upgrade."
      },
      {
        "id": "tvmaze:2024798",
        "title": "The $6 Million Cut",
        "season": 11,
        "episode": 18,
        "released": "2021-02-26",
        "overview": "Parker's record-setting pace rests in the hands of mechanic Shane Smith. Tony taps out the Megacut and pivots to open more ground. Fred calls on Mitch to help fine tune his operation."
      },
      {
        "id": "tvmaze:2024799",
        "title": "Clear Eyes, Full Pans",
        "season": 11,
        "episode": 19,
        "released": "2021-03-05",
        "overview": "Rick bets on a new stretch of ground that pays out with a monster nugget. Parker confronts Brennan over a missed opportunity. Tony digs up a relic that could lead him to virgin ground."
      },
      {
        "id": "tvmaze:2024800",
        "title": "Attack or Retreat",
        "season": 11,
        "episode": 20,
        "released": "2021-03-12",
        "overview": "After a key piece of equipment dies, Fred decides if it's time to pull the plug. Parker's crew struggle to keep up their breakneck pace when a conveyor belt goes down. Rick prospects some of the richest ground he's ever mined."
      },
      {
        "id": "tvmaze:2029641",
        "title": "Endgame",
        "season": 11,
        "episode": 21,
        "released": "2021-03-19",
        "overview": "In the final days of the season, Parker's record-breaking season rides on an unproven wash plant. Rick redirects a river to hit big gold. Tony returns to the old timer's honey hole. Fred scrambles for a future."
      },
      {
        "id": "tvmaze:2161669",
        "title": "Ground War",
        "season": 12,
        "episode": 1,
        "released": "2021-09-24",
        "overview": "Parker bets on a risky claim and loses a key team member. Tony storms a new cut with a fleet of new mega machines. Rick's skeleton crew pulls off a miracle. Fred heads to Klondike seeking an alliance."
      },
      {
        "id": "tvmaze:2174625",
        "title": "Battle of the Greenhorns",
        "season": 12,
        "episode": 2,
        "released": "2021-10-01",
        "overview": "Parker pivots to a new cut, hoping to reverse his cash flow. Rick's season rests in the hands of a green mechanic. Tony taps a favorite honey hole and welcomes a new addition. Fred finds gold in the wilderness."
      },
      {
        "id": "tvmaze:2184447",
        "title": "Crash and Berm",
        "season": 12,
        "episode": 3,
        "released": "2021-10-08",
        "overview": "Rick's crew races to rescue a greenhorn and her rock truck. In a rush to get on the gold, Parker's team sends water flooding into their claim. Tony's team attempts a Stone Age fix to keep his operation running."
      },
      {
        "id": "tvmaze:2184448",
        "title": "$9 Million Mistake",
        "season": 12,
        "episode": 4,
        "released": "2021-10-15",
        "overview": "Tony's confronted with news that throws him into a tailspin. Fred banks his first gold of the season. Parker's crew stalls out at the Airstrip."
      },
      {
        "id": "tvmaze:2198367",
        "title": "Crank It Up",
        "season": 12,
        "episode": 5,
        "released": "2021-10-22",
        "overview": "Parker cranks up Sluicifer to fuel his big gamble while Fred faces shutdown after a surprise inspection. Brennan sinks Rick's 475 bulldozer hunting for new ground."
      },
      {
        "id": "tvmaze:2199576",
        "title": "The Hunker Creek Curse",
        "season": 12,
        "episode": 6,
        "released": "2021-10-29",
        "overview": "Tony returns to defeat the Hunker Creek curse and bank some quick gold. Rick puts Brennan in charge of finding new ground. Fred bets big on a new wash plant."
      },
      {
        "id": "tvmaze:2204797",
        "title": "Family Matters",
        "season": 12,
        "episode": 7,
        "released": "2021-11-05",
        "overview": "Parker returns to Promised Land but the claim owner's grandson threatens to derail a big pay day. Tony calls in his secret weapon to get down to pay at the new 80 pup cut. Fred risks destroying the new wash plant when hauling down a steep road."
      },
      {
        "id": "tvmaze:2209983",
        "title": "The King's Gambit",
        "season": 12,
        "episode": 8,
        "released": "2021-11-12",
        "overview": "Parker hatches a cunning move to limit the royalties he pays Tony at the Airstrip. Tony's sons fight frozen pay at 80 Pup and a sluice box disaster. Rick gets helps from an unexpected person."
      },
      {
        "id": "tvmaze:2215805",
        "title": "Saving Rick's Bacon",
        "season": 12,
        "episode": 9,
        "released": "2021-11-19",
        "overview": "Parker breaks out Big Red to double his gold. Rick's wash plant disintegrates in front of his own eyes. Freddy Dodge spots a flaw in Fred's set up."
      },
      {
        "id": "tvmaze:2219018",
        "title": "The Vindication",
        "season": 12,
        "episode": 10,
        "released": "2021-11-26",
        "overview": "Fred's team gather for the critical first weigh-in post-sluicing. Tony faces unexpected repairs while Freddy and Juan soup up a massive trommel."
      },
      {
        "id": "tvmaze:2219021",
        "title": "Glory Hole on the Hill",
        "season": 12,
        "episode": 11,
        "released": "2021-12-03",
        "overview": "Parker clocks his first double-gold weigh of the year. Tony discovers a new glory hole. Rick calls Freddy and Juan to keep Rocky alive."
      },
      {
        "id": "tvmaze:2229910",
        "title": "Robbing Parker to Pay Parker",
        "season": 12,
        "episode": 12,
        "released": "2021-12-10",
        "overview": "Parker does the unthinkable to get down to gold. Fred Lewis sends his son-in-law packing."
      },
      {
        "id": "tvmaze:2235295",
        "title": "Balls on the Table",
        "season": 12,
        "episode": 13,
        "released": "2021-12-17",
        "overview": "Rick pivots to chase a vein of gold-rich paydirt that's bankrupted other Keno miners. Parker heads to Alaska to prospect, leaving Mitch with a difficult decision to make at the Airstrip. Tony targets white channel paydirt to turn his season around."
      },
      {
        "id": "tvmaze:2238873",
        "title": "Little Eldorado",
        "season": 12,
        "episode": 14,
        "released": "2022-01-07",
        "overview": "Parker gambles 100 ounces to prospect Little Eldorado Creek in Alaska. Fred confronts a crew member with a secret. Rick launches a risky mission to rescue Monster Red. Tony's crew sink the new D11 chasing gold rich white channel pay."
      },
      {
        "id": "tvmaze:2246198",
        "title": "The Secret Pay Layer",
        "season": 12,
        "episode": 15,
        "released": "2022-01-14",
        "overview": "Parker gets a lead on virgin ground at Cleary Creek in Alaska. Rick puts Brennan to the test as the night foreman in the Rally Valley. A quick fix on Tony's trommel feeder balloons into a major headache."
      },
      {
        "id": "tvmaze:2250515",
        "title": "The $4 Million Question",
        "season": 12,
        "episode": 16,
        "released": "2022-01-21",
        "overview": "Parker finally runs paydirt and weighs his first gold from Mud Mountain. Fred scrambles to locate a better way to clean his increasing gold hauls. Tony invents a faster way to move excavators and stay on the white channel gold."
      },
      {
        "id": "tvmaze:2256124",
        "title": "Bonus Gold",
        "season": 12,
        "episode": 17,
        "released": "2022-01-28",
        "overview": "Rick strikes a pay layer in a sea of Rally Valley overburden. Fred speeds up the team's gold production at California Creek, resulting in a devastating setback. Tony's determined to put an end to his wet paydirt problems at 80 Pup."
      },
      {
        "id": "tvmaze:2267101",
        "title": "Rebirth of Monster Red",
        "season": 12,
        "episode": 18,
        "released": "2022-02-11",
        "overview": "Rick soups up Monster Red to battle the rocky and increasingly rich Rally Valley pay. Parker tasks Tyson with running Bad Cut on a skeleton crew. Fred fights a flood to stay on the gold."
      },
      {
        "id": "tvmaze:2270236",
        "title": "Gold at Last",
        "season": 12,
        "episode": 19,
        "released": "2022-02-18",
        "overview": "Parker risks destroying Big Red to finally find Mud Mountain's big gold. Rick's forced to slow down his operation when massive rocks threaten to destroy Monster Red. Tony heads to the Yukon River for a quick cash infusion."
      },
      {
        "id": "tvmaze:2274686",
        "title": "The Alliance",
        "season": 12,
        "episode": 20,
        "released": "2022-02-25",
        "overview": "As gold from Mud Mountain rolls in Parker's crew builds a massive pad to get through the Ugly Cut in record time. Fred forms an unexpected partnership to double his gold. Tony revives his Indian River plans."
      },
      {
        "id": "tvmaze:2280007",
        "title": "Whatever It Takes",
        "season": 12,
        "episode": 21,
        "released": "2022-03-04",
        "overview": "Rick calls in his secret weapon to get down to the Rally Valley pay layer. Parker splurges big to keep his operation running. Fred's new alliance with the Claytons is tested when their cut is flooded."
      },
      {
        "id": "tvmaze:2288995",
        "title": "Rally Valley Bonanza",
        "season": 12,
        "episode": 22,
        "released": "2022-03-11",
        "overview": "Rick hits it big in Rally Valley while Tony prospects new ground in Keno. Tensions rise in California Creek when Fred and Clayton get shut down."
      },
      {
        "id": "tvmaze:2288996",
        "title": "Seeing Red",
        "season": 12,
        "episode": 23,
        "released": "2022-03-18",
        "overview": "Parker's team missteps and cripples Big Red. Tony heads back to Hunker, determined to reverse the curse."
      },
      {
        "id": "tvmaze:2288997",
        "title": "Buckets Full of Gold",
        "season": 12,
        "episode": 24,
        "released": "2022-03-25",
        "overview": "Parker gambles on another record and Rick shoots for another personal best."
      },
      {
        "id": "tvmaze:2388586",
        "title": "A Seismic Shift",
        "season": 13,
        "episode": 1,
        "released": "2022-09-30",
        "overview": "Parker bites off more than he can chew when he brokers a big deal. Tony digs deep to chase a record-breaking gold haul. Fred Lewis cashes out all his savings but disaster strikes when he reaches his claim. Rick Ness is missing in action."
      },
      {
        "id": "tvmaze:2390522",
        "title": "Searching for Rick Ness",
        "season": 13,
        "episode": 2,
        "released": "2022-10-07",
        "overview": "Parker gets devastating news and faces off with the biggest landowner in Alaska. Rick Ness surfaces. Tony pressures the kids to deliver the first gold of the season. Fred battles the glacier blocking his gold. The Clayton brothers seek redemption."
      },
      {
        "id": "tvmaze:2404971",
        "title": "Golden Acres",
        "season": 13,
        "episode": 3,
        "released": "2022-10-14",
        "overview": "Parker gambles on shutting down his operation to bank big gold. The Claytons uncover rich ground at Golden Acres and need a quick payday to fund their move. The Mikes tag team opening a new cut at Tony's Paradise Hill."
      },
      {
        "id": "tvmaze:2411342",
        "title": "Trench Warfare",
        "season": 13,
        "episode": 4,
        "released": "2022-10-21",
        "overview": "Tony battles to save his cuts and millions of dollars in gold when snow melt swamps Paradise Hill. Parker brings in a novice miner from Australia to supercharge his operation. Fred's head is nearly taken off when sourcing a new wash plant."
      },
      {
        "id": "tvmaze:2414693",
        "title": "Cheat Codes",
        "season": 13,
        "episode": 5,
        "released": "2022-10-28",
        "overview": "Fred engineers an ice dam and makes a surprising gold discovery. Parker's crew pivots to the Easy Street cut but a washed-out road stops them dead. Tony uses an excavator cheat code to bust through permafrost."
      },
      {
        "id": "tvmaze:2419539",
        "title": "Fight Iron with Iron",
        "season": 13,
        "episode": 6,
        "released": "2022-11-04",
        "overview": "Parker fights muddy ground as he opens his biggest cut of the season and churns through Easy Street pay. Fred discovers a new paystreak that changes the course of his season. Tony gets two dozers stuck stripping to pay at the Blue and Cold Cut."
      },
      {
        "id": "tvmaze:2425690",
        "title": "Valley of Prayers",
        "season": 13,
        "episode": 7,
        "released": "2022-11-11",
        "overview": "Parker fires up Sluicifer to tackle the massive Bear Cut. Fred faces financial ruin when the dozer he desperately needs gets held up in Dawson City. The Clayton brothers go on a treasure hunt to save their season."
      },
      {
        "id": "tvmaze:2425691",
        "title": "50,000 Ounces",
        "season": 13,
        "episode": 8,
        "released": "2022-11-18",
        "overview": "Parker hauls Big Red into the massive Bear Cut as the team chases an epic milestone. Tony taps out a honey hole when he hits even more permafrost on the hill. Fred boots up Sergeant Sluice for the first time."
      },
      {
        "id": "tvmaze:2425694",
        "title": "Cursed",
        "season": 13,
        "episode": 9,
        "released": "2022-11-25",
        "overview": "Parker tasks Mitch with mining out an old road built on virgin ground but problems jeopardize access to both of his washplants. Fred finally gets his monster dozer delivered, only to have it break down. Tony welcomes a new crew into the \"Cursed Cut.\""
      },
      {
        "id": "tvmaze:2434858",
        "title": "Little Red Rocket",
        "season": 13,
        "episode": 10,
        "released": "2022-12-02",
        "overview": "Parker heads to Alaska on a mission to find a wash plant and kickstart the Alaska operation. The Claytons face a major setback on the road to Golden Acres. Tony's trommel falters at the worst possible time."
      },
      {
        "id": "tvmaze:2438670",
        "title": "Tony's Golden Knights",
        "season": 13,
        "episode": 11,
        "released": "2022-12-09",
        "overview": "Tony attempts to double his gold with greenhorns on the night shift and Fred's crewmember is involved in a freak accident. The Claytons resurrect a beaten-up conveyor."
      },
      {
        "id": "tvmaze:2442032",
        "title": "FUBAR",
        "season": 13,
        "episode": 12,
        "released": "2022-12-16",
        "overview": "Parker is joined by a ragtag group of miners recruited from social media to tackle his first Alaskan claim. Tony faces an engineering problem while Fred's rock truck issues force him to change his approach."
      },
      {
        "id": "tvmaze:2445715",
        "title": "Parker's Big Payday",
        "season": 13,
        "episode": 13,
        "released": "2022-12-30",
        "overview": "Parker's crew breaks new ground and takes on a new runway project. Fred and his son battle it out over a broken excavator and Tony loses his two biggest dozers."
      },
      {
        "id": "tvmaze:2458706",
        "title": "Who's the Boss",
        "season": 13,
        "episode": 14,
        "released": "2023-01-06",
        "overview": "With Parker in Alaska, Tyson risks bringing in new recruits to get Slucifer back on the gold. Tony's Westchester crew calls in a favor that pays off big. The Claytons face a family emergency."
      },
      {
        "id": "tvmaze:2463757",
        "title": "The Last Frontier",
        "season": 13,
        "episode": 15,
        "released": "2023-01-13",
        "overview": "Parker battles for his first Alaska gold and a triple clean out. Dave Turin returns with a shocking proposal at Glacier Creek. Tony moves mountains to drain the gold-rich 80 Pup Cut. Fred calls up a combat buddy for help."
      },
      {
        "id": "tvmaze:2458707",
        "title": "Gremlins",
        "season": 13,
        "episode": 16,
        "released": "2023-01-20",
        "overview": "Parker experiences a mysterious breakdown at the Airstrip and Fred's mechanic decodes a washplant belt issue at the Freedom Cut. Dave digs into virgin ground on Glacier Creek."
      },
      {
        "id": "tvmaze:2476171",
        "title": "Mammoth Mess",
        "season": 13,
        "episode": 17,
        "released": "2023-01-27",
        "overview": "Parker barrels towards his first Alaska gold weigh but a flood in the Wolf Cut could derail everything. Tony makes a mammoth discovery. The Clayton Brothers finally reach Golden Acres and start stripping."
      },
      {
        "id": "tvmaze:2476172",
        "title": "Buzzified",
        "season": 13,
        "episode": 18,
        "released": "2023-02-03",
        "overview": "Tensions rise between Fred and the Clayton Brothers when a borrowed machine comes back broken. Parker's wash plant Big Red turns into a problem child. Dave's crew struggles to get through the rocky Three Amigos paydirt."
      },
      {
        "id": "tvmaze:2479728",
        "title": "Big Toys, Big Problems",
        "season": 13,
        "episode": 19,
        "released": "2023-02-10",
        "overview": "Tony pivots his crew to the 80 Pup cut but a water pump failure stops them cold. Fred levels up his operation with a big piece of iron. A flood threatens to derail the Clayton Brothers season and prevent them from reaching Golden Acres."
      },
      {
        "id": "tvmaze:2479729",
        "title": "Washed Out",
        "season": 13,
        "episode": 20,
        "released": "2023-02-17",
        "overview": "Parker gets down to paydirt at the Wolf Cut in Alaska but disaster strikes when the crew hits an old mine shaft. Dave goes deeper in search of his last gold. A mistake on Tony's crew sends a $500,000 wash plant crashing to the ground."
      },
      {
        "id": "tvmaze:2488725",
        "title": "Trial by Parker",
        "season": 13,
        "episode": 21,
        "released": "2023-02-24",
        "overview": "Parker visits Fred's claim and delivers a devastating verdict that brings the operation to a screeching halt. A truck accident on Parker's claim leads to a harrowing rescue attempt. Tony's crew at the Hunker Cut face a monster flood."
      },
      {
        "id": "tvmaze:2493681",
        "title": "The Alaska Verdict",
        "season": 13,
        "episode": 22,
        "released": "2023-03-03",
        "overview": "Parker battles a massive flood and weighs his first gold from virgin ground in Alaska. The Clayton brothers pray for a bonanza as they finally start mining Golden Acres. Tony brings in a secret weapon to open new ground."
      },
      {
        "id": "tvmaze:2495719",
        "title": "Here's Johnny!",
        "season": 13,
        "episode": 23,
        "released": "2023-03-10",
        "overview": "Tony mounts a major rescue to save a sinking excavator. Tensions rise when Fred brings in an old friend. The Clayton brothers risk training two young greenhorn miners to work the night shift."
      },
      {
        "id": "tvmaze:2495720",
        "title": "Runway to Redemption",
        "season": 13,
        "episode": 24,
        "released": "2023-03-17",
        "overview": "Parker returns to the Klondike and drops a bombshell on his crew to make up for the Alaska debacle. Fred and son Christopher face off over the nightshift. Tony's Winchester Crew cash out for the season."
      },
      {
        "id": "tvmaze:2496472",
        "title": "Panama Canal Jackpot",
        "season": 13,
        "episode": 25,
        "released": "2023-03-24",
        "overview": "Parker's push for a record season could cost him a wash plant. Tony gambles on resurrecting a 30-year-old beast to finish the season. The Claytons must make a big move to reach the ground under their wash plant."
      },
      {
        "id": "tvmaze:2508058",
        "title": "Klondike Climax",
        "season": 13,
        "episode": 26,
        "released": "2023-03-31",
        "overview": "Parker pivots to the Panama Canal cut as he guns to clean out his Indian River claims. The Beets crew discover a glory hole that could put them over the top. Fred throws a Hail Mary in the Freedom Cut. The Clayton brothers get an ultimatum from their dad."
      },
      {
        "id": "tvmaze:2634234",
        "title": "The $160 Million Gamble",
        "season": 14,
        "episode": 1,
        "released": "2023-09-29",
        "overview": "Parker weighs betting everything on a new claim that could pay out upwards of $160 million. Rick Ness reemerges after going MIA. One family member's decision rattles the Beets, and Tony gets long-awaited news."
      },
      {
        "id": "tvmaze:2650535",
        "title": "Call of the Indian River",
        "season": 14,
        "episode": 2,
        "released": "2023-10-06",
        "overview": "Tony considers moving the entire family operation to the Indian River. Parker opens the first cut at his new claim at Dominion Creek. Rick Ness brings on a new crew member, hoping to get on the gold first."
      },
      {
        "id": "tvmaze:2650536",
        "title": "Hey Parker, It's Rick",
        "season": 14,
        "episode": 3,
        "released": "2023-10-13",
        "overview": "After years of not speaking, Rick visits Parker for a favor. Parker's crew unearths a pile of gold in an unlikely location. Tony pressures his son Mike to spearhead the move to Indian River."
      },
      {
        "id": "tvmaze:2650537",
        "title": "Free Agent",
        "season": 14,
        "episode": 4,
        "released": "2023-10-20",
        "overview": "On the brink of going bankrupt, Parker tries to tap an old honey hole to turn the tide. Rick tries out a new miner with a misfit past. Tony battles flooded creeks at the Indian River to access the gold."
      },
      {
        "id": "tvmaze:2664793",
        "title": "Up in Smoke",
        "season": 14,
        "episode": 5,
        "released": "2023-10-27",
        "overview": "Floodwaters halt Tony's race to get Indian River gold. Rick's comeback stalls when a water pump goes up in smoke. Parker pressures the crew to open the Unforgiven cut to keep them afloat."
      },
      {
        "id": "tvmaze:2669408",
        "title": "Down, but Not Out",
        "season": 14,
        "episode": 6,
        "released": "2023-11-03",
        "overview": "Parker banks his first gold of the season from the Unforgiven cut. One of Rick's rock trucks slides down a ravine, and he tries to broker a season-saving deal with Tony. Fred Lewis makes a big decision."
      },
      {
        "id": "tvmaze:2675343",
        "title": "50 Ounce Ultimatum",
        "season": 14,
        "episode": 7,
        "released": "2023-11-10",
        "overview": "Rick's landlord demands 50 ounces of gold by the end of the week. An unexpected visit to Tony's Indian River claim brings devastating news, and Parker's crew battles a busted excavator and spotty ground at the Unforgiven cut."
      },
      {
        "id": "tvmaze:2675348",
        "title": "Last Ditch Gold",
        "season": 14,
        "episode": 8,
        "released": "2023-11-17",
        "overview": "Desperate for cash, Parker goes ditch digging on his Dominion Creek claim. Tony finally gets his first gold of the year. Rick prospects for a new cut to keep his season alive."
      },
      {
        "id": "tvmaze:2680400",
        "title": "Pivot!",
        "season": 14,
        "episode": 9,
        "released": "2023-11-24",
        "overview": "Rick's season is all riding on a move to the new Bacon Strip cut. As Parker tries to dig out of his financial hole, the team must deal with a loader crash. Monica Beets takes charge of the Indian River."
      },
      {
        "id": "tvmaze:2680401",
        "title": "Parker's Runaway Claim",
        "season": 14,
        "episode": 10,
        "released": "2023-12-01",
        "overview": "Parker's thirst for gold pushes him to open a third claim, stretching his crew and machines to their breaking points. Rick supercharges wash plant Rocky to bring in more gold."
      },
      {
        "id": "tvmaze:2694182",
        "title": "Frankendozer",
        "season": 14,
        "episode": 11,
        "released": "2023-12-08",
        "overview": "To get Australia Creek's gold, Parker cannibalizes multiple machines to build a \"Frankendozer.\" The Beets battle a flash flood on the Indian River. Running out of options, Rick heads to higher ground to hunt for gold but is stopped dead in his tracks."
      },
      {
        "id": "tvmaze:2694183",
        "title": "Money Pit Payday",
        "season": 14,
        "episode": 12,
        "released": "2023-12-15",
        "overview": "Parker battles to bring in his first Money Pit gold at Dominion Creek. Rick auditions Buzz as his foreman, and tensions ignite when the wash plant doesn't fire up. The Beets face mounting mechanical issues at the Indian River."
      },
      {
        "id": "tvmaze:2694184",
        "title": "Parker Comes Alive",
        "season": 14,
        "episode": 13,
        "released": "2023-12-22",
        "overview": "Parker gains momentum at Dominion Creek, but a mysterious gold loss could set him back. Tony moves everyone back to Paradise Hill, and tensions boil over. Rick bets on a mechanic who's never been in a gold mine."
      },
      {
        "id": "tvmaze:2706329",
        "title": "Desperate Cry for Help",
        "season": 14,
        "episode": 14,
        "released": "2023-12-29",
        "overview": "Tony's son Kevin returns to help save the family business. Parker scrambles to fix a burst dam and keep the big Dominion Creek gold weighs going. Wildfires threaten to shut Rick down before he can bring in his first Bench Cut gold."
      },
      {
        "id": "tvmaze:2719908",
        "title": "Succession",
        "season": 14,
        "episode": 15,
        "released": "2024-01-05",
        "overview": "The Beets family implodes trying to get the Paradise Hill trommel running. Parker starts sluicing Australia Creek and finds a big surprise. Rick makes an all-or-nothing decision to return to Rally Valley."
      },
      {
        "id": "tvmaze:2719909",
        "title": "Ring of Fire",
        "season": 14,
        "episode": 16,
        "released": "2024-01-12",
        "overview": "Tony resurrects an old machine to get the Paradise Hill trommel washing rocks. One of Parker's crew melts down while trying to match the breakneck pace. The McCaughans set their trommel on fire to stay on the gold."
      },
      {
        "id": "tvmaze:2719910",
        "title": "Moneyball",
        "season": 14,
        "episode": 17,
        "released": "2024-01-19",
        "overview": "Parker closes in on his season goal, but an emergency leaves a novice crew in charge and threatens his momentum. Minnie forces Tony to consult a mining expert. Dangerous conditions at Rally Valley could destroy Rick's fleet."
      },
      {
        "id": "tvmaze:2719911",
        "title": "Parker's New Toy",
        "season": 14,
        "episode": 18,
        "released": "2024-01-26",
        "overview": "Parker brings in a brand-new wash plant to push him past 5,000 ounces. Buzz stands up to Rick and puts his reputation on the line with a gamble he may come to regret. Disaster strikes on the McCaughans' night shift."
      },
      {
        "id": "tvmaze:2719912",
        "title": "Off the Rails",
        "season": 14,
        "episode": 19,
        "released": "2024-02-02",
        "overview": "Rick's crew sends a rock truck careening off the road. Tony goes rogue and buys a new wash plant to get his Indian River operation back up and running. Parker increases his gold target, pushing Rocksand to the limit."
      },
      {
        "id": "tvmaze:2751669",
        "title": "Waking the Beast",
        "season": 14,
        "episode": 20,
        "released": "2024-02-09",
        "overview": "Tony tries to resurrect his infamous Dredge #1. Parker brings in his last gold from Australia Creek and focuses the team on finishing the Money Pit. The McCaughans hunt for a new hotspot."
      },
      {
        "id": "tvmaze:2761664",
        "title": "Rally Valley or Bust",
        "season": 14,
        "episode": 21,
        "released": "2024-02-16",
        "overview": "Rick bets his season on firing up Monster Red, hoping Rally Valley will save his season, Tony's dredge suffers a major setback, chasing a final payday and the McCaughans break out a crazy contraption."
      },
      {
        "id": "tvmaze:2767251",
        "title": "The Money Pit Fights Back",
        "season": 14,
        "episode": 22,
        "released": "2024-02-23",
        "overview": "Parker's crew accidentally unleashes a flood of water that wreaks havoc. Rick runs his first full week at Rally Valley, hoping for a big score. Tony revives an old wash plant to bring in more gold."
      },
      {
        "id": "tvmaze:2770709",
        "title": "Winter's Reckoning",
        "season": 14,
        "episode": 23,
        "released": "2024-03-01",
        "overview": "Tony calls his son Kevin to help fire up nearly every plant he can, including Dredge #1. Parker squeezes every ounce of gold out of his Dominion Creek claim. Rick battles freezing equipment in his final bid for a comeback."
      },
      {
        "id": "tvmaze:3020190",
        "title": "Greed is Good",
        "season": 15,
        "episode": 1,
        "released": "2024-11-08",
        "overview": "Parker chases a record-breaking 10,000-ounce season. Rick pursues his dream of buying his own claim. The fate of the Beets family dynasty shifts when the eldest son, Kevin, strikes out on his own."
      },
      {
        "id": "tvmaze:3035613",
        "title": "My Father's Frenemy",
        "season": 15,
        "episode": 2,
        "released": "2024-11-15",
        "overview": "Rick Ness considers whether to keep mining after devastating news. Parker's crew split an excavator in half attempting a risky fix. Kevin Beets turns to one of dad Tony's rivals for help."
      },
      {
        "id": "tvmaze:3046172",
        "title": "Quicksand",
        "season": 15,
        "episode": 3,
        "released": "2024-11-22",
        "overview": "Rick sinks an excavator trying to get down to Rally Valley pay. Parker's crew risks destroying a million-dollar wash plant to get on the gold. Tony puts pressure on Cousin Mike to perform on the Indian River."
      },
      {
        "id": "tvmaze:3046173",
        "title": "The Disappearing Pay Layer",
        "season": 15,
        "episode": 4,
        "released": "2024-11-29",
        "overview": "Parker unexpectedly loses the pay layer in the long cut. Tony Beets tasks the Mikes with ramping up his operation in the Indian River. Kevin struggles to keep his equipment running."
      },
      {
        "id": "tvmaze:3053852",
        "title": "On Thick Ice",
        "season": 15,
        "episode": 5,
        "released": "2024-12-06",
        "overview": "Parker makes a big call on Dominion Creek's ice-filled ground. Rick buys a new pump to fire up Monster Red. Kevin's cut floods, sending him scrambling to find a critical piece of equipment."
      },
      {
        "id": "tvmaze:3053853",
        "title": "Come Nuggets or High Water",
        "season": 15,
        "episode": 6,
        "released": "2024-12-13",
        "overview": "Rick risks flooding Rally Valley to haul in big gold nuggets. Tony's protégé, Cousin Mike, attempts a risky plant move. Kevin's biggest machine goes down while another lights on fire."
      },
      {
        "id": "tvmaze:3069447",
        "title": "Brother vs. Cousin",
        "season": 15,
        "episode": 7,
        "released": "2024-12-20",
        "overview": "Sparks fly when Tony leaves his son Mike with \"Cousin Mike,\" who's in charge of the operation. Desperate to get the gold flowing, Parker opens another cut and digs out a mega ditch to fire up again on Dominion Creek."
      },
      {
        "id": "tvmaze:3069448",
        "title": "Flood of Emotions",
        "season": 15,
        "episode": 8,
        "released": "2025-01-03",
        "overview": "Tensions escalate when two crewmembers get into a fight on Kevin's claim. Parker prays that the Bridge Cut paydirt will turn his fortunes. When Rally Valley floods, Rick is forced to change plans."
      },
      {
        "id": "tvmaze:3087221",
        "title": "Rally Valley's Last Bounty",
        "season": 15,
        "episode": 9,
        "released": "2025-01-03",
        "overview": "Hoping for a record score, Rick runs the last of Rally Valley's pay dirt. Tony's son Mike battles an old water pump to get on Paradise Hill's gold. Parker's crew races to rescue a rock truck hanging off a berm."
      },
      {
        "id": "tvmaze:3092294",
        "title": "Parker's Three Plant Blitz",
        "season": 15,
        "episode": 10,
        "released": "2025-01-10",
        "overview": "Parker levels up and runs a third wash plant for the first time ever. Tony surprises Kevin with a new toy to supercharge his son's claim. Cousin Mike makes a big misstep when one of his plants goes down."
      },
      {
        "id": "tvmaze:3099091",
        "title": "Big Cat Fight",
        "season": 15,
        "episode": 11,
        "released": "2025-01-17",
        "overview": "Brennan reaches a breaking point and confronts one of Kevin's crew members about their performance. Doumitt threatens to walk out on Parker. Rick becomes a claim owner and bets on the new Crew Cut payout."
      },
      {
        "id": "tvmaze:3106121",
        "title": "Kevin Fires Up",
        "season": 15,
        "episode": 12,
        "released": "2025-01-24",
        "overview": "Kevin fires up his wash plant for the first time. Tony assigns his son Mike to run the trommel at Paradise Hill 24/7, but a sunk excavator stands in his way. Rick pivots at the Crew Cut and searches for gold in a new spot."
      },
      {
        "id": "tvmaze:3114865",
        "title": "The King's Mistake",
        "season": 15,
        "episode": 13,
        "released": "2025-01-31",
        "overview": "Tony hits an unexpected roadblock at his Indian River claim. With time running out on his season, Rick searches for a new spot to mine. Parker's crew makes a big move in the Long Cut in the hopes of a large payday."
      },
      {
        "id": "tvmaze:3114866",
        "title": "Parker's Bombshell",
        "season": 15,
        "episode": 14,
        "released": "2025-02-07",
        "overview": "Parker makes a purchase that shocks the entire team. Tony clamps down on his son Mike's operation. Kevin starts his first full week of sluicing."
      },
      {
        "id": "tvmaze:3114867",
        "title": "Vegas, Baby!",
        "season": 15,
        "episode": 15,
        "released": "2025-02-14",
        "overview": "Rick gambles all his profits on a risky Duncan Creek cut. Parker's team leans on the new Sulphur Creek claim to keep their hot streak alive. Monica steps in with a solution to Tony's Indian River problems."
      },
      {
        "id": "tvmaze:3138975",
        "title": "The Thin Red Pay Layer",
        "season": 15,
        "episode": 16,
        "released": "2025-02-21",
        "overview": "Parker chases a new red pay layer to keep his hot streak alive. Kevin Beets tries to run 24/7 with a green crew to get more gold. Rick's crew suffers an equipment meltdown while digging deep for Vegas Valley gold."
      },
      {
        "id": "tvmaze:3146749",
        "title": "Rogue Foreman",
        "season": 15,
        "episode": 17,
        "released": "2025-02-28",
        "overview": "Brennan confronts Kevin about a lack of equipment. Tony comes down hard on Mike when a side dumper crashes in a ditch. Parker brings in monster dirt haulers, hoping to get 1,000 ounces of gold weekly."
      },
      {
        "id": "tvmaze:3154313",
        "title": "Rick vs. Buzz",
        "season": 15,
        "episode": 18,
        "released": "2025-03-07",
        "overview": "Rick confronts foreman Buzz, throwing down an ultimatum. Hoping for a big score, Parker fires back up on Sulphur Creek. Tony and Monica go on a treasure hunt at the Hester Cut."
      },
      {
        "id": "tvmaze:3160848",
        "title": "Another Man's Treasure",
        "season": 15,
        "episode": 19,
        "released": "2025-03-14",
        "overview": "Parker investigates a forgotten section of Dominion Creek, Rick expands his ambitions at Vegas Valley, and Kevin loses an excavator just as his pay pile runs out."
      },
      {
        "id": "tvmaze:3181163",
        "title": "Dredge, Baby, Dredge!",
        "season": 15,
        "episode": 20,
        "released": "2025-04-04",
        "overview": "Tony unleashes his floating wash plant to supercharge his season. Rick moves Monster Red to Vegas Valley, hoping to sluice the paydirt. Kevin's nightshift crew could bring in his biggest haul of the year."
      },
      {
        "id": "tvmaze:3181164",
        "title": "Vegas Valley Verdict",
        "season": 15,
        "episode": 21,
        "released": "2025-04-04",
        "overview": "Rick's season rides on his first week of sluicing at Vegas Valley. Parker confronts his bad decisions and targets a trusted honey hole. Tony tasks Cousin Mike with firing up a new plant on thawed Indian River ground."
      },
      {
        "id": "tvmaze:3187343",
        "title": "Parker Heats Up",
        "season": 15,
        "episode": 22,
        "released": "2025-04-11",
        "overview": "Parker tries to keep his hot streak going by tapping into a fresh pay layer on Dominion Creek. Rick departs for urgent business, leaving his struggling crew in charge. Tony makes a surprise purchase for the Hester Cut."
      },
      {
        "id": "tvmaze:3196039",
        "title": "The Last Dance",
        "season": 15,
        "episode": 23,
        "released": "2025-04-18",
        "overview": "Rick digs up his last gold of the season from Vegas Valley. Parker opens yet another cut, hoping to hit his season goal before winter strikes. Tony fires up at the Hester Cut, and his son Kevin's judgment day arrives."
      },
      {
        "id": "tvmaze:3387778",
        "title": "Records Will Be Broken",
        "season": 16,
        "episode": 1,
        "released": "2025-11-07",
        "overview": "Parker launches a cutthroat plan for a 10,000-ounce season -- and he poaches a rival's crew member. Tony cashes in early with a big score. Rick scrambles to find new ground."
      },
      {
        "id": "tvmaze:3429855",
        "title": "Eager Beavers",
        "season": 16,
        "episode": 2,
        "released": "2025-11-14",
        "overview": "Tony battles a big beaver to get at the gold. Parker poaches more crew, doubling gold production. Rick tries to strike a deal for a new claim."
      },
      {
        "id": "tvmaze:3433480",
        "title": "Rick's Bold Call",
        "season": 16,
        "episode": 3,
        "released": "2025-11-21",
        "overview": "Rick balks at the terms for his new claim and makes a bold move. Parker's foreman, Tyson, battles a flooded cut and a batch of new recruits. Tony explodes on a batch of rookies flipping over trucks."
      },
      {
        "id": "tvmaze:3440534",
        "title": "Buzz in the Hills",
        "season": 16,
        "episode": 4,
        "released": "2025-11-28",
        "overview": "Parker pushes Mitch to deliver Sulphur Creek gold and records a big score. Buzz lands on an unlikely claim. Tony's pressure tests a new foreman."
      }
    ]
  }
}