{
  "meta": {
    "id": "tvmaze:42491",
    "type": "series",
    "name": "Celebrity Gogglebox",
    "description": "A rolling cast of famous faces, some of Britain's best loved personalities, turn their hand to being the country's most opinionated viewers, sharing their opinions on what they have been watching during the week.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/572/1431168.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/572/1431168.jpg",
    "videos": [
      {
        "id": "tvmaze:3464731",
        "title": "Celebrity Gogglebox for SU2C",
        "season": 7,
        "episode": null,
        "released": "2025-12-12",
        "overview": "Celebrities join Gogglebox regulars to react to the week's television, in this special episode for Stand Up To Cancer."
      },
      {
        "id": "tvmaze:3464751",
        "title": "Best of Series 7",
        "season": 7,
        "episode": null,
        "released": "2025-12-19",
        "overview": "The best moments of Series 7, as a rolling cast of Britain's favourite famous facestune in for the best TV on the box."
      },
      {
        "id": "tvmaze:1666532",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2019-06-14",
        "overview": "From Killing Eve to Countdown, what do Rylan Clark-Neal, Denise van Outen, Kelly Osbourne, Laurence and Emilia Fox, Nicole Appleton, Mel Blatt, Little Mix and other famous faces think of our top TV?"
      },
      {
        "id": "tvmaze:1666533",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2019-06-21",
        "overview": "Rylan Clark-Neal and his mother Linda, Oti Mabuse and her sisters Motsi and Phemelo, Chris Eubank Sr and Chris Eubank Jr, Gyles Brandreth and Sheila Hancock, and Nick Grimshaw and his niece Liv critique the week's TV."
      },
      {
        "id": "tvmaze:1671451",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2019-06-28",
        "overview": "From The Chase to Fatal Attraction, what do Westlife, Emily Atack, Kelly Osbourne, Laurence and Emilia Fox, Oti Mabuse, Rylan Clark-Neal, Nick Grimshaw and other famous faces think of our top telly?"
      },
      {
        "id": "tvmaze:1671452",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2019-07-05",
        "overview": "From First Dates to Serengeti, what do Jessie J, Jamal Edwards, Chris Eubank Sr, Chris Eubank Jr, Martin and Roman Kemp, Nick Grimshaw, Emily Atack and other famous faces think of our top telly?"
      },
      {
        "id": "tvmaze:1671453",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2019-07-12",
        "overview": "From This Morning to 8 Days: To the Moon and Back, what do Loyle Carner, Shaun Ryder, Bez, Chris Kamara, Rylan Clark-Neal, Gyles Brandreth, Sheila Hancock and other celebrities think of our top telly?"
      },
      {
        "id": "tvmaze:1671454",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2019-07-19",
        "overview": "From The Silence of the Lambs to The £100k Drop, what do Nicole Appleton, Mel Blatt, Chris Eubank Sr, Chris Eubank Jr, Loyle Carner, Example, Professor Green and other celebs think of our top telly?"
      },
      {
        "id": "tvmaze:1869871",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2020-06-05",
        "overview": "A rolling cast of famous faces, some of Britain's best loved personalities, turn their hand to being the country's most opinionated viewers, sharing their opinions on what they have been watching during the week."
      },
      {
        "id": "tvmaze:1875041",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2020-06-12",
        "overview": "Denise Van Outen and her partner Eddie, Nick Grimshaw and his niece Liv, Joe Swash and Stacey Solomon, Zoe Ball and her son Woody Cook, Nicola Adams and her partner Ella, and Harry Redknapp and his wife Sandra offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:1880504",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2020-06-19",
        "overview": "Denise Van Outen and her partner Eddie, Nick Grimshaw and his niece Liv, Joe Swash and Stacey Solomon, Zoe Ball and her son Woody Cook, Nicola Adams and her partner Ella, and Harry Redknapp and his wife Sandra offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:1883105",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2020-06-26",
        "overview": "Denise Van Outen and her partner Eddie, Mo Gilligan and Babatunde Aleshe, Nick Grimshawand his niece Liv, Joe Swash and Stacey Solomon, Zoe Ball and her son Woody Cook, Martin Kemp and son Roman Kemp, Maureen Lipman and Gyles Brandreth, Johnny Vegasand his PA Bev, Shaun Ryder and Bez, Emilia Fox and Joanna David, Eamonn Holmes and Ruth Langsford, and Laura Whitmore and Iain Stirling offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:1888253",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2020-07-03",
        "overview": "Denise Van Outen and her partner Eddie, Mo Gilligan and Babatunde Aleshe, Nick Grimshawand his niece Liv, Joe Swash and Stacey Solomon, Zoe Ball and her son Woody Cook, Martin Kemp and son Roman Kemp, Maureen Lipman and Gyles Brandreth, Johnny Vegasand his PA Bev, Shaun Ryder and Bez, Emilia Fox and Joanna David, Eamonn Holmes and Ruth Langsford, and Laura Whitmore and Iain Stirling offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:1891957",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2020-07-10",
        "overview": "Denise Van Outen and her partner Eddie, Nick Grimshaw and his niece Liv, Zoe Ball and her son Woody Cook, Martin Kemp and son Roman Kemp, Maureen Lipman and Gyles Brandreth, Johnny Vegas and his PA Bev, Emilia Fox and Joanna David, Eamonn Holmesand Ruth Langsford and Laura Whitmore and Iain Stirling offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:1899025",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2020-07-17",
        "overview": "Denise Van Outen and her partner Eddie, Mo Gilligan and Babatunde Aleshe, Nick Grimshawand his niece Liv, Zoe Ball and her son Woody Cook, Martin Kemp and son Roman, Maureen Lipman and Gyles Brandreth, Johnny Vegas and his PA Bev, Shaun Ryder and Bez, Emilia Fox and Joanna David, Eamonn Holmes and Ruth Langsford, Laura Whitmore and Iain Stirling, Rylan Clark-Neal and Linda Clark, Georgia Taylor and Sunetra Sarker and Susanna Reid and Rob Rinder offer sharp, insightful, funny and sometimes emotional critiques of popular and topical TV shows, sparking debate and giving viewers the chance to share those `we said that\" moments."
      },
      {
        "id": "tvmaze:2095051",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2021-06-04",
        "overview": "Nick Grimshaw, Denise Van Outen, Mo Gilligan, Shaun Ryder, Bez, Martin and Roman Kemp, Gyles Brandreth, Maureen Lipman, Iain Stirling, Laura Whitmore, Sunetra Sarker, Georgia Taylor, Lorraine Kelly, Tom Jones, Anne-Marie, Micah Richards, Jamie Carragher, Clara Amfo, Clare Balding and Melanie C appraise the week's best - and worst television shows. This week, programmes under their gaze include Friends: The Reunion, The Masked Dancer, Supervet Special: Saving my Dog, Jurassic Park, Secret Crush, Bake Off: The Professionals, Hometown Horror and This Morning."
      },
      {
        "id": "tvmaze:2104594",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2021-06-11",
        "overview": "A rolling cast of famous faces critiques shows including The Masked Dancer, Dirty Dancing, Best of Top Gear, Naked Attraction, Tom Allen's Quizness, Ramsay's 24 Hours to Hell and Back, and The Bad Skin Clinic. Participants include Nick Grimshaw, Denise van Outen, Mo Gilligan, Shaun Ryder, Bez, Martin and Roman Kemp, Gyles Brandreth, Maureen Lipman, Iain Stirling, Laura Whitmore, Lorraine Kelly, Tom Jones, Anne-Marie, Jamie Carragher and Clara Amfo."
      },
      {
        "id": "tvmaze:2104595",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2021-06-18",
        "overview": "Nick and Liv Grimshaw, Denise van Outen and Eddie Boxshall, Mo Gilligan and Babatunde Aleshe, Shaun Ryder and Bez, Martin and Roman Kemp, Gyles Brandreth and Maureen Lipman, Iain Stirling and Laura Whitmore, Sunetra Sarker and Georgia Taylor, Lorraine Kelly and Rosie Smith, Melanie C and her brother Paul, Clare Balding and Alice Arnold, Chris Eubank Sr and Chris Eubank Jr, and Eamonn Holmes and Ruth Langsford appraise shows including Clarkson's Farm, Snakes on a Plane, Fresh, Fried and Crispy, Lupin, 10 Years Younger in 10 Days and Tiny World. Plus, news coverage of the G7 summit and a story about a man swallowed by a whale."
      },
      {
        "id": "tvmaze:2104596",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2021-06-25",
        "overview": "Well-known faces including Nick Grimshaw, Denise van Outen, Mo Gilligan, Shaun Ryder, Martin and Roman Kemp, Gyles Brandreth, Maureen Lipman, Lorraine Kelly, Chris Eubank Sr, Eamonn Holmes, Melanie C, Zoe Ball, Jools Holland and Vic Reeves assess programmes including Too Hot to Handle, Dragons' Den, The Woman in the Window, Extreme Sisters, First Dates, Don't Tell the Bride, Gok Wan's Easy Asian and The Yorkshire Vet."
      },
      {
        "id": "tvmaze:2104597",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2021-07-02",
        "overview": "Famous faces including Nick Grimshaw, Denise van Outen, Eddie Boxshall, Mo Gilligan, Babatunde Aleshe, Shaun Ryder, Bez, Martin and Roman Kemp, Gyles Brandreth, Maureen Lipman, Chris Eubank Sr and Chris Eubank Jr appraise shows including The Handmaid's Tale, Back to the Future, Countdown, Dickinson's Real Deal, Bake Off: The Professionals and Tiny World. They also assess politician Matt Hancock's apology - and subsequent resignation as Health Scecretary."
      },
      {
        "id": "tvmaze:2127398",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2021-07-09",
        "overview": "Celebs including Ed Sheeran, KSI and Roman Kemp have been watching Love Island, America's Got Talent, Sex/Life, Clarkson's Farm, BBC News (England Football), and other top shows."
      },
      {
        "id": "tvmaze:2129651",
        "title": "Episode 7",
        "season": 3,
        "episode": 7,
        "released": "2021-07-16",
        "overview": "Celebs including Roman Kemp, Nigel Havers, Bez and Clare Balding, have been watching Cooking with the Stars, Too Hot to Handle, Jaws, BBC News - England defeat, and lots of other top TV"
      },
      {
        "id": "tvmaze:2130384",
        "title": "Episode 8",
        "season": 3,
        "episode": 8,
        "released": "2021-07-23",
        "overview": "Celebs including Joel Dommett, Lorraine Kelly, Jeremy Vine and Snoochie Shy, have been watching Sexy Beasts, Naked and Afraid, Schmigadoon!, Crawl and other top TV shows."
      },
      {
        "id": "tvmaze:2165766",
        "title": "Episode 9",
        "season": 3,
        "episode": 9,
        "released": "2021-09-10",
        "overview": "Gogglebox families and famous friends, including Mo Gilligan, Jourdan Dunn and Ashley Banjo, have been watching Changing Rooms, Married at First Sight UK, and BBC News on football racism."
      },
      {
        "id": "tvmaze:2337252",
        "title": "Episode 1",
        "season": 4,
        "episode": 1,
        "released": "2022-06-10",
        "overview": "Shaun Ryder, Rylan, Joanna Lumley, Judi Love, Micah Richards, Oti Mabuse, Bill Bailey and others have been watching Stranger Things, Hunted and the Platinum Party at the Palace."
      },
      {
        "id": "tvmaze:2341101",
        "title": "Episode 2",
        "season": 4,
        "episode": 2,
        "released": "2022-06-17",
        "overview": "Gyles Brandreth, Joanna Lumley, Judi Love and Micah Richards are just some of the celebs watching Stranger Things, This Is MY House, Million Pound Pawn, and lots of other great TV."
      },
      {
        "id": "tvmaze:2342774",
        "title": "Episode 3",
        "season": 4,
        "episode": 3,
        "released": "2022-06-24",
        "overview": "A rolling cast of famous faces, including Nick and Liv Grimshaw, Rylan and his mum Linda, Shaun Ryder and Bez, Micah Richards and Jamie Carragher, Martin and Roman Kemp, Mo Gilligan and Babatunde Aléshé and Mel C and her brother Paul, appraise shows including appraise Love Island, Alan Carr's Epic Gameshow: Celebrity Special, Fifty Shades of Grey, The Bridge: Race to a Fortune and Spooked Scotland."
      },
      {
        "id": "tvmaze:2351747",
        "title": "Episode 4",
        "season": 4,
        "episode": 4,
        "released": "2022-07-08",
        "overview": "This time, many of Britain's best-loved personalities watched The Baby, One Question, Million Pound Pawn, CODA, America the Beautiful, The Laundry Guy, and The One That Got Away."
      },
      {
        "id": "tvmaze:2355957",
        "title": "Episode 5",
        "season": 4,
        "episode": 5,
        "released": "2022-07-15",
        "overview": "This time, the celebs watched Stranger Things, Love Island, Paul Hollywood Eats... Mexico, How to Build a Sex Room, Long Lost Family, Countdown, and BBC News (PM resigns)."
      },
      {
        "id": "tvmaze:2571137",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2023-06-16",
        "overview": "Some of the nation's top personalities turn their hand to being the country's most opinionated viewers as they critique the week's TV. Giving their view on the most talked about television of the week are Davina McCall with her partner Michael Douglas, Katherine Ryan and her husband Bobby, Jane McDonald and friend Sue, Rob Beckett and Tom Allen, Tom Grennan and his dad Martin, Munroe Bergdorf and Leomie Anderson, Stephen Mangan with his sister Anita, Chris Packham CBE with his step-daughter Megan, Big Zuu, Hyder and Tubsey, Paul Sinha and husband Olly, Nick Grimshaw and his niece Liv, Shaun Ryder and Bez, Martin and Roman Kemp, and Clare Balding and Alice Arnold. This time, they share their opinions on The 1% Club, Spy in The Ocean, Fake Profile, Five Star Kitchen: Britain's Next Great Chef and The Yorkshire Vet."
      },
      {
        "id": "tvmaze:2574594",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2023-06-23",
        "overview": "A rolling cast of famous faces appraise The Greatest Auction, Our Planet, Countdown, M3GAN, Siren: Survive the Island, Gino's Italian masterclass on This Morning, and Trooping the Colour on the News. Among those offering their thoughts are Ricky Tomlinson, Sue Johnston, Adam Lambert, Beverley Knight, Denise van Outen, Melanie C and Shaun Ryder."
      },
      {
        "id": "tvmaze:2574601",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2023-06-30",
        "overview": "Miquita and Andi Oliver, Mo Gilligan, Jamie Carragher, Nick Grimshaw, Clare Balding, Shaun Ryder, Bez and loads more celebs hit the sofa for the best TV this week."
      },
      {
        "id": "tvmaze:2580830",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2023-07-07",
        "overview": "A rolling cast of famous faces reviews shows including Is It Cake, Too?, Hijack, Five Star Kitchen: Britain's Next Great Chef, Saving Giraffes: The Long Journey Home, Steph's Packed Lunch, Dr Pimple Popper, Magic Numbers: Hannah Fry's Mysterious World of Maths, and the ITV News."
      },
      {
        "id": "tvmaze:2589704",
        "title": "Episode 5",
        "season": 5,
        "episode": 5,
        "released": "2023-07-14",
        "overview": "Some of the celebrities watching the most talked about TV this week are Rylan Clark, Jamali Maddix, Martin Kemp, Judi Love, Zoe Ball, Deborah Meaden, Peter Jones and Bez."
      },
      {
        "id": "tvmaze:2594983",
        "title": "Episode 6",
        "season": 5,
        "episode": 6,
        "released": "2023-07-21",
        "overview": "A hatful of celebrities hit the sofa for some top telly, including Denise van Outen and Duncan James, Paul Sinha, Scott Mills, Judi Love, Stephen Mangan and Lucy Beaumont."
      },
      {
        "id": "tvmaze:2712768",
        "title": "Episode 7",
        "season": 5,
        "episode": 7,
        "released": "2023-12-15",
        "overview": "A collection of the best bits as the celebs hit the sofa for top TV including Five Star Kitchen: Britain's Next Great Chef, The 1% Club, Hijack, Antiques Roadshow and The Yorkshire Vet."
      },
      {
        "id": "tvmaze:2896536",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2024-06-07",
        "overview": "Some of Britain's best-loved personalities - including Danny Dyer, Chris Packham, Jennifer Saunders and Mo Gilligan - hit the couch for a new series and the week's top TV."
      },
      {
        "id": "tvmaze:2903745",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2024-06-14",
        "overview": "Ashley Banjo, Mel B, Clare Balding, Kadeena Cox, Mo Gilligan and Ellie Simmonds are some of the many household names hitting the sofa for this week's best TV."
      },
      {
        "id": "tvmaze:2915472",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2024-06-21",
        "overview": "This time the celeb Goggleboxers include Miquita and Andi Oliver, Rylan Clark, Chris Packham, Shaun Ryder and Bez, Annie Mac, Stephen Mangan, Gyles Brandreth and Lulu."
      },
      {
        "id": "tvmaze:2921903",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2024-06-28",
        "overview": "Stacey Solomon, Joe Swash, Denise Van Outen and Johnny Vaughan hit the sofa for the week's top telly. Also on the 'Box are Danny and Dani Dyer, Ashley Banjo, Sara Cox and more."
      },
      {
        "id": "tvmaze:2931386",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2024-07-05",
        "overview": "The celebrity Goggleboxers are all set for this week's top TV. Including Martin and Roman Kemp, Chris McCausland and Donna Preston. And Bobby, Jeff and Freddie Brazier."
      },
      {
        "id": "tvmaze:2936777",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2024-07-12",
        "overview": "Once again, some of Britain's best-loved personalities turn their hand to being the country's most opinionated viewers as they hit the couch for this week's top TV."
      },
      {
        "id": "tvmaze:3268022",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2025-06-06",
        "overview": "Denise van Outen, Johnny Vaughan, Jordan Banjo, Perri Kiely, Vicky Pattison, Pete Wicks and so many more celebs watch Race Across the World, Faking It, Celebrity Bridge of Lies and Canal Boat Diaries."
      },
      {
        "id": "tvmaze:3268023",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2025-06-13",
        "overview": "This time the celebs watched Casualty, The 1% Club for Soccer Aid, Clarkson's Farm, Heretic, The Yorkshire Vet: At Home with the Greens, This Morning and ITV News (Trump v Musk)."
      },
      {
        "id": "tvmaze:3268024",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2025-06-20",
        "overview": "This time on the 'Box: Coronation Street, Love Island, Countdown, Clarkson's Farm, Gary Barlow's Food and Wine Tour: Australia and Tom Kerridge Secrets of the Pub Kitchen."
      },
      {
        "id": "tvmaze:3280611",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2025-06-27",
        "overview": "What do Britain's favourite famous faces think of Bake Off: The Professionals, Noel Edmonds' Kiwi Adventure, Celebrity Puzzling and Olivia Attwood: The Price of Perfection?"
      },
      {
        "id": "tvmaze:3288952",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2025-07-04",
        "overview": "This time the celebs watched Squid Game, Glastonbury, Open House: The Great Sex Experiment, Celebrity Bridge of Lies, Trainwreck: Poop Cruise and Millionaire Hoarders."
      },
      {
        "id": "tvmaze:3293322",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2025-07-11",
        "overview": "On the Gogglebox this time: First Dates, Squid Game, Olivia Attwood: The Price of Perfection, Match Me Abroad, Building the Band and BBC News (bingo and Oasis)."
      }
    ]
  }
}