{
  "meta": {
    "id": "tvmaze:45911",
    "type": "series",
    "name": "Words + Music",
    "description": "Words + Music will feature iconic artists sharing stories about songs pivotal to their careers, followed by all-new performances of those songs either solo or with a band. The innovative visual adaptation will be shot on Amazon MGM Studio's volume stage, an immersive video environment, allowing the creation of dynamic visual narratives that complement each artist's storytelling.  As the artists' stories unfold, the environment around them will transform to reflect each anecdote and song, creating an intimate yet visually stunning experience.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/599/1498648.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/599/1498648.jpg",
    "videos": [
      {
        "id": "tvmaze:3453523",
        "title": "Elvis Costello",
        "season": 1,
        "episode": 3,
        "released": "2025-12-14",
        "overview": "Elvis Costello shares his musical heritage with family photos and paintings projected on immersive screens; backed by the Imposters with guests Elena Whitmore and John McCuen, he performs classics and debuts a new song, \"John Went Walking.\""
      },
      {
        "id": "tvmaze:3453524",
        "title": "Alanis Morissette",
        "season": 1,
        "episode": 4,
        "released": "2025-12-21",
        "overview": "Alanis Morissette performs songs from \"Jagged Little Pill\" and more, sharing the stories behind them and exploring art's power to heal; with Amazon MGM's immersive screens, she blends music, memory, and imagery in an intimate performance."
      },
      {
        "id": "tvmaze:3453522",
        "title": "Sheryl Crow",
        "season": 1,
        "episode": 2,
        "released": "2025-12-07",
        "overview": "Sheryl Crow performs before an intimate audience, sharing her journey from small-town Missouri to global stardom; with guitar, piano, and Amazon MGM's immersive screens, she blends songs and stories."
      }
    ]
  }
}