{
  "meta": {
    "id": "tvmaze:40208",
    "type": "series",
    "name": "Ready to Love",
    "description": "Ready to Love explores the real-life dating interactions of sexy, successful and grown black men and women in their 30s and 40s who are each looking for lasting love and an authentic relationship. A unique twist on a typical dating show, Ready to Love highlights the men's observations and experiences in the search for true love in Atlanta.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/499/1249186.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/499/1249186.jpg",
    "videos": [
      {
        "id": "tvmaze:3452566",
        "title": "Diddy Pose",
        "season": 11,
        "episode": 6,
        "released": "2025-12-12",
        "overview": ""
      },
      {
        "id": "tvmaze:3452567",
        "title": "Meet the Detroit Exes",
        "season": 11,
        "episode": 7,
        "released": "2025-12-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3452568",
        "title": "Meet the Detroit Friends",
        "season": 11,
        "episode": 8,
        "released": "2025-12-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3452565",
        "title": "Soul Train & Soul Mates",
        "season": 11,
        "episode": 5,
        "released": "2025-12-05",
        "overview": ""
      },
      {
        "id": "tvmaze:1584479",
        "title": "First Impressions",
        "season": 1,
        "episode": 1,
        "released": "2018-10-23",
        "overview": "Tired of the superficial Atlanta dating scene, 20 high-caliber singles meet up to begin their search for real love. By the end of the first night, the women will have to decide which men show the most promise and which three aren't yet ready to love."
      },
      {
        "id": "tvmaze:1584480",
        "title": "First Dates",
        "season": 1,
        "episode": 2,
        "released": "2018-10-27",
        "overview": "The five remaining men choose which of the 12 remaining women to ask on dates, with some going better than others. At the end of the week, two more men will be sent packing by the ladies, who still hold all the power for now."
      },
      {
        "id": "tvmaze:1584481",
        "title": "Then There Were Three",
        "season": 1,
        "episode": 3,
        "released": "2018-11-03",
        "overview": "Now that the ladies have chosen the final three men, the power shifts in favor of the men. After a series of single, double and group dates, the guys must decide which two ladies to send home."
      },
      {
        "id": "tvmaze:1584482",
        "title": "Hot and Bothered",
        "season": 1,
        "episode": 4,
        "released": "2018-11-10",
        "overview": "As one couple takes their relationship to the next level, another couple has a falling-out. Meanwhile, a red flag is uncovered about one of the singles."
      },
      {
        "id": "tvmaze:1584483",
        "title": "Deal Breakers",
        "season": 1,
        "episode": 5,
        "released": "2018-11-17",
        "overview": "The ladies' frustration with Aaron leads to a heated confrontation, while Mike and Shea hit a snag over a crucial deal breaker. Alexx and Tiffany continue to date, but a spark may be igniting between Alexx and one of the other women."
      },
      {
        "id": "tvmaze:1584484",
        "title": "Friends and Lovers",
        "season": 1,
        "episode": 6,
        "released": "2018-11-24",
        "overview": "The singles take a big leap forward as the ladies introduce the men to their friends, who bring some tough questions. A shocking answer from one of the men may put a budding relationship in jeopardy."
      },
      {
        "id": "tvmaze:1584485",
        "title": "Trouble in Paradise",
        "season": 1,
        "episode": 7,
        "released": "2018-12-01",
        "overview": "When Alexx begins to gravitate toward Ashlee, Tiffany decides to open herself up to another man. Shea disapproves when Mike lets loose at a mixer. Aaron struggles to decide which woman he's into, but quickly gets served a dose of reality."
      },
      {
        "id": "tvmaze:1584486",
        "title": "Cabin Fever",
        "season": 1,
        "episode": 8,
        "released": "2018-12-08",
        "overview": "Tommy sends the remaining men and women on a romantic weekend getaway at a lake house. Things start to get out of hand when Tiffany decides she still has an axe to grind with Alexx, and Shea finds Mike locked in one of the bedrooms with another woman."
      },
      {
        "id": "tvmaze:1584487",
        "title": "Ultimatums",
        "season": 1,
        "episode": 9,
        "released": "2018-12-15",
        "overview": "Tension mounts during the weekend getaway; knowing that the men need to narrow the women down to the final three, some of the ladies get anxious and decide to take matters into their own hands."
      },
      {
        "id": "tvmaze:1584488",
        "title": "Commit or Quit",
        "season": 1,
        "episode": 10,
        "released": "2018-12-22",
        "overview": "As Tommy tasks the couples with meeting each others' families, Aaron must make a crucial decision; after ten emotional weeks, each couple must decide if they're truly ready to commit to their relationship."
      },
      {
        "id": "tvmaze:1585408",
        "title": "Reunion Special",
        "season": 1,
        "episode": 11,
        "released": "2018-12-29",
        "overview": "Host Tommy \"Nephew Tommy\" Miles and cast members reunite to spill the tea and to answer burning questions about who has unfinished business, who is still together and who got engaged."
      },
      {
        "id": "tvmaze:1717286",
        "title": "Casting Special",
        "season": 1,
        "episode": 12,
        "released": "2019-10-05",
        "overview": "Catch a sneak peek of an all new season of \"Ready to Love!\" Tommy Miles and Will Packer bring you a new set of singles searching for their match. Meet them all and find out who's ready to love."
      },
      {
        "id": "tvmaze:1717287",
        "title": "Ready, Set, Mingle",
        "season": 1,
        "episode": 13,
        "released": "2019-10-12",
        "overview": "Tommy welcomes the 10 eligible men and 10 single women to an exclusive mixer in Atlanta. By the end of the night, they must decide together which man and woman they cannot see a future with and send them home before the dating begins."
      },
      {
        "id": "tvmaze:1717288",
        "title": "Let the Sparks Fly",
        "season": 1,
        "episode": 14,
        "released": "2019-10-19",
        "overview": "The journey kicks into gear for the singles as group dates and special one-on-ones begin. Secret hearts are revealed, some new love interests develop, and one man and woman with both lose their cool. Two singles are sent home."
      },
      {
        "id": "tvmaze:1717289",
        "title": "Ladies First",
        "season": 1,
        "episode": 15,
        "released": "2019-10-26",
        "overview": "With eight men and eight women left, Tommy sets up group dates and the singles begin to let their guards down. A couple of guys get in hot water for their questionable texting and club etiquette; the women get to decide if they should stay or go."
      },
      {
        "id": "tvmaze:1737630",
        "title": "Wet and Wild",
        "season": 1,
        "episode": 16,
        "released": "2019-11-02",
        "overview": "When Tommy sets the singles up with a sexy pool party and BBQ, the women start to see which ones know how to have fun, and which ones just want to be in control. But this week the men have the power, because one woman will have to go home."
      },
      {
        "id": "tvmaze:1737631",
        "title": "Love on the Rocks",
        "season": 1,
        "episode": 17,
        "released": "2019-11-09",
        "overview": "As several of the men start to vie for the same women, love triangles start to develop, and the luckiest ladies get more confident and more demanding. This week, the women will decide which man is no longer ready to love."
      },
      {
        "id": "tvmaze:1737632",
        "title": "The Friend Patrol",
        "season": 1,
        "episode": 18,
        "released": "2019-11-16",
        "overview": "When Tommy instructs the women to bring their best friends along on dates in order to help size up the guys properly, they'd better hope their friends play nice, because this week it's the guys that get to send someone home."
      },
      {
        "id": "tvmaze:1737633",
        "title": "Meet My Ex-Girlfriend",
        "season": 1,
        "episode": 19,
        "released": "2019-11-23",
        "overview": "Tommy surprises the guys by sending their ex-girlfriends out on dates with them and their new love interests. The women learn more about the men than they were ready for. Will they be able to handle the scrutiny? Or the attitude? One man goes home."
      },
      {
        "id": "tvmaze:1737634",
        "title": "Ready to Retreat",
        "season": 1,
        "episode": 20,
        "released": "2019-11-30",
        "overview": "The remaining nine singles head to a weekend getaway in the mountains. But with everyone all together, the competition for attention leads to both romantic and tense moments. And things finally come to a head for the love triangle."
      },
      {
        "id": "tvmaze:1758931",
        "title": "All's Fair in Love",
        "season": 1,
        "episode": 21,
        "released": "2019-12-07",
        "overview": "Tommy gathers the remaining eight men and women together for dinner to discuss where they all stand after the getaway. Tensions grow as a love square emerges (two women after the same two men!), and the women have a dramatic confrontation."
      },
      {
        "id": "tvmaze:1758932",
        "title": "Will You Be Mine?",
        "season": 1,
        "episode": 22,
        "released": "2019-12-14",
        "overview": "The men and women prepare to make their final choices, but first they must pass one last test by meeting each other's families. Now that the journey is almost over, will they find that they have found someone that they are truly ready to love?"
      },
      {
        "id": "tvmaze:1758933",
        "title": "Reunion, Part 1",
        "season": 1,
        "episode": 23,
        "released": "2019-12-21",
        "overview": "Two months after the finale, Tommy gathers the cast for a shocking and surprise-filled Reunion Special, where viewers learn which couples have stayed together, which have broken up, and which ones have already found new love!"
      },
      {
        "id": "tvmaze:1758934",
        "title": "Reunion, Part 2",
        "season": 1,
        "episode": 24,
        "released": "2019-12-28",
        "overview": "The reunion special continues! Tondy, Mario and Reva continue to hash out their dramatic love triangle. Jimmy and Kimber explore the possibility of a rekindled romance. Alexis and London clash over what really happened between them."
      },
      {
        "id": "tvmaze:1931639",
        "title": "Casting Special",
        "season": 2,
        "episode": 1,
        "released": "2020-10-23",
        "overview": "Twenty hopeful singles hail from the lone star state of Texas, and they are excited to take a break from the city to focus solely on finding love. Host Tommy Miles and Will Packer introduce each person from the cast using footage from the casting process."
      },
      {
        "id": "tvmaze:1963241",
        "title": "Welcome to the Last Resort",
        "season": 2,
        "episode": 2,
        "released": "2020-10-30",
        "overview": "Twenty hopeful singles hail from the lone star state of Texas, and they are excited to take a break from the city to focus solely on finding love. Host Tommy Miles and Will Packer introduce each person from the cast using footage from the casting process."
      },
      {
        "id": "tvmaze:1963242",
        "title": "Watch What You Say",
        "season": 2,
        "episode": 3,
        "released": "2020-11-06",
        "overview": "True colors reveal themselves as the18 remaining Houston, TX, singles begin dating each other while living under one roof. First dates lead to first kisses, and, at the end of the week, the ladies must send two men home."
      },
      {
        "id": "tvmaze:1967781",
        "title": "Boss Moves",
        "season": 2,
        "episode": 4,
        "released": "2020-11-13",
        "overview": "As tensions rise, one man gets himself into a sticky situation."
      },
      {
        "id": "tvmaze:1967782",
        "title": "The Tea Is Getting Good",
        "season": 2,
        "episode": 5,
        "released": "2020-11-20",
        "overview": "After a week filled with drama, bad behavior is confronted at every turn. When the dust finally settles, the men must send two women home."
      },
      {
        "id": "tvmaze:1977862",
        "title": "Friends with Benefits",
        "season": 2,
        "episode": 6,
        "released": "2020-11-27",
        "overview": "The ladies each have a girlfriend in town to grill the men and help them decide if their feelings are real or just infatuation. After they leave, there's a whole lot of clarity and more than a few surprises before one man is sent home."
      },
      {
        "id": "tvmaze:1979361",
        "title": "Sticky Situations",
        "season": 2,
        "episode": 7,
        "released": "2020-12-04",
        "overview": "A rap battle, tantric yoga and a sunset cruise cause things to heat up as new connections spark and old ones are called into question. The men must send one woman home this week, and it's a reaction nobody sees coming."
      },
      {
        "id": "tvmaze:1986328",
        "title": "Fanning the Flames of Love",
        "season": 2,
        "episode": 8,
        "released": "2020-12-11",
        "overview": "Things heat up when Tommy throws the remaining singles an H-town BBQ. Overlapping love triangles make things complicated as the power is evenly divided this week, when one man and one woman must be eliminated."
      },
      {
        "id": "tvmaze:1986329",
        "title": "Second Choices, Second Chances",
        "season": 2,
        "episode": 9,
        "released": "2020-12-18",
        "overview": "Tommy pushes the men to be more vulnerable with the women, and it changes the course of some relationships. It's down to the wire, and one of the five remaining women must be let go."
      },
      {
        "id": "tvmaze:1990706",
        "title": "Love and Loss",
        "season": 2,
        "episode": 10,
        "released": "2021-01-01",
        "overview": "Tragic news casts a heavy shadow on everyone and getting through it will take a lot of love, compassion and self-reflection. Meanwhile, love triangles start to crumble."
      },
      {
        "id": "tvmaze:1990707",
        "title": "Love Is Calling",
        "season": 2,
        "episode": 11,
        "released": "2021-01-08",
        "overview": "In this season finale, while ultimate decisions must be made, family members arrive at the resort to give their input. Romance, tension, fear and nerves all come into play as the remaining singles figure out if they will leave with love or leave alone."
      },
      {
        "id": "tvmaze:1990708",
        "title": "Reunion, Part 1",
        "season": 2,
        "episode": 12,
        "released": "2021-01-15",
        "overview": "After a dramatic season, all 20 Houston, TX, singles reunite to spill the tea about everything they've been holding on to since they left the resort. Tommy hosts Part 1 of a reunion filled with drama, love, unseen footage and ... pregnancy?"
      },
      {
        "id": "tvmaze:1990709",
        "title": "Reunion, Part 2",
        "season": 2,
        "episode": 13,
        "released": "2021-01-22",
        "overview": "Tommy hosts Part 2 of the reunion as the Houston, TX, cast continues dishing about all the drama this season, and unseen moments are exposed. The status of relationships formed at the resort will be revealed, and even some formed afterward!"
      },
      {
        "id": "tvmaze:2063055",
        "title": "Meet the Singles",
        "season": 3,
        "episode": 1,
        "released": "2021-04-02",
        "overview": "Host Tommy Miles and his superfan wife, Jackie, introduce viewers to the men and women putting it all on the line to make a love connection this season in Houston, TX. Before the fireworks begin, these two bring all the tea and a few new twists."
      },
      {
        "id": "tvmaze:2070101",
        "title": "Mix-er & Mingle",
        "season": 3,
        "episode": 2,
        "released": "2021-04-09",
        "overview": "RTL returns, this time in Tommy's hometown of Houston, TX! Romance blossoms early as he hits the singles with the first of many curveballs, bringing back a past gentleman for another chance at love. Early missteps send two suitors home on their first day."
      },
      {
        "id": "tvmaze:2074244",
        "title": "Tables Are Turned",
        "season": 3,
        "episode": 3,
        "released": "2021-04-16",
        "overview": "With two men gone, the power shifts, putting the ladies on the chopping block. Tommy throws a journey-ending curveball before the dates begin, as Alexis heats things up in a candle shop, Troy kisses more ladies, and Tressa runs the risk of being a homie."
      },
      {
        "id": "tvmaze:2077211",
        "title": "Sipping Wine, Spilling Tea",
        "season": 3,
        "episode": 4,
        "released": "2021-04-23",
        "overview": "Our singles dig deeper as the women are in control. Sparks fly for several couples, and relationships deepen. David's transparency may prove too much, but could Troy's free trips get him a one-way ticket home? By the end, one man just isn't ready to love."
      },
      {
        "id": "tvmaze:2077212",
        "title": "Eyes Wide Open",
        "season": 3,
        "episode": 5,
        "released": "2021-04-30",
        "overview": "Tommy throws the first ever Masquerade Ball, and everyone comes dressed to impress. When the masks come off, new connections develop and multiple triangles form, and a shocking elimination will leave jaws dropped."
      },
      {
        "id": "tvmaze:2076105",
        "title": "Opposites Attract",
        "season": 3,
        "episode": 6,
        "released": "2021-05-14",
        "overview": "It's time to start eliminating backups, so Tommy challenges the ladies to step outside their comfort zones and date someone who isn't their top choice. Love triangles smoldering since the start are revealed, igniting jealousy among the women and the men."
      },
      {
        "id": "tvmaze:2087172",
        "title": "The Friends Zone",
        "season": 3,
        "episode": 7,
        "released": "2021-05-21",
        "overview": "To help the gentlemen dig deeper, Tommy brings in tough reinforcements: their friends. The grilling gets intense. Is Verneashia too territorial? Chrisantheium, too self-absorbed? Liz, too stiff? By the end, one woman is sent to the friend zone."
      },
      {
        "id": "tvmaze:2093227",
        "title": "The Ex Factor",
        "season": 3,
        "episode": 8,
        "released": "2021-05-28",
        "overview": "Tommy throws another curveball that's headed straight for the ladies: introducing the men to their exes! Old flames bring out new insecurities. Love triangles shift. One kiss could change it all! At least one more man will get the axe and become an ex."
      },
      {
        "id": "tvmaze:2098835",
        "title": "Secrets & Betrayals",
        "season": 3,
        "episode": 9,
        "released": "2021-06-04",
        "overview": "Sparks fly when two men find out they are not ready to love, and Tommy sends the remaining nine singles to a weekend at a luxury ranch, where betrayals and secrets are exposed for all to see."
      },
      {
        "id": "tvmaze:2098836",
        "title": "Getting Clarity",
        "season": 3,
        "episode": 10,
        "released": "2021-06-11",
        "overview": "As the singles' ranch getaway continues, Amber explains her kiss with Ron to both Alexis and Kris; Joel and Verneashia spend the night together; Liz basks in her and Jason's connection; Kyra runs down the clock, and AJ is forced to make a tough decision."
      },
      {
        "id": "tvmaze:2098837",
        "title": "Unfinished Business",
        "season": 3,
        "episode": 11,
        "released": "2021-06-18",
        "overview": "AJ has a stunning change of heart, and Kyra's feelings towards AJ build."
      },
      {
        "id": "tvmaze:2119752",
        "title": "I Choose You",
        "season": 3,
        "episode": 12,
        "released": "2021-06-25",
        "overview": "Our final four couples prepare to make one last decision: Will they choose to continue their journey together or go their separate ways? Family members bring new insight to help these individuals decide for the last time: Are they really ready to love?"
      },
      {
        "id": "tvmaze:2119753",
        "title": "Houston: Reunion Part 1",
        "season": 3,
        "episode": 13,
        "released": "2021-07-02",
        "overview": "Tommy reconnects our 20 singles to revisit the season's highlights and lowlights, as well as reveal some unseen gems. New make-ups, break-ups and secret relationships are revealed in Part 1 of the Ready to Love Houston Reunion Special."
      },
      {
        "id": "tvmaze:2119754",
        "title": "Houston: Reunion Part 2",
        "season": 3,
        "episode": 14,
        "released": "2021-07-09",
        "overview": "In Part 2 of the reunion, we uncover more unseen moments, reveal an unexpected relationship in tatters, dive deep into password-gate and Andrea's cat, find resolution in the AJ-Kyra-Alexis triangle, and send two couples into the sunset. Who will it be?"
      },
      {
        "id": "tvmaze:2178060",
        "title": "Pre-Show Casting Special",
        "season": 4,
        "episode": 1,
        "released": "2021-10-15",
        "overview": "Host Tommy Miles and Season 3 super-couple Jason and Liz introduce viewers to the men and women hoping to make a love connection this season. Before the romance begins, Tommy and his co-hosts go deep to find out what drives these sexy singles."
      },
      {
        "id": "tvmaze:2178061",
        "title": "Welcome to Chocolate City",
        "season": 4,
        "episode": 2,
        "released": "2021-10-15",
        "overview": "RTL returns for its fourth season, this time in our nation's capital, Washington, DC. Heeding Tommy's advice to put themselves out there, romance blossoms early for many singles. However, disconnections send two people home and anger a third."
      },
      {
        "id": "tvmaze:2192823",
        "title": "All Roads Lead to Love",
        "season": 4,
        "episode": 3,
        "released": "2021-10-22",
        "overview": "In Week 2, the men are on the chopping block as the ladies look to peel back more layers. Connections are strengthened and challenged. Corey has his hero moment, but some women aren't feeling his game. Is Carrington too slick for his own good?"
      },
      {
        "id": "tvmaze:2196727",
        "title": "Out of Your Comfort Zone",
        "season": 4,
        "episode": 4,
        "released": "2021-10-29",
        "overview": "The power has now shifted to the men this week, and Tommy challenges them to get out of their comfort zone with their dates. Corey redeems himself yet again. Phil starts to ignite a love story. Tyrone and Kheri address their issues so they can move on."
      },
      {
        "id": "tvmaze:2196728",
        "title": "Sink or Swim",
        "season": 4,
        "episode": 5,
        "released": "2021-11-05",
        "overview": "It's sink or swim for the daters as the ladies reclaim elimination power and suit up for a pool party. Tommy's curveball tosses everyone into the deep end as Kamil treads water with Cornelius, Aisha uncovers a hidden gem, and Corey overplays his hand."
      },
      {
        "id": "tvmaze:2196729",
        "title": "Second Shot at Love",
        "season": 4,
        "episode": 6,
        "released": "2021-11-12",
        "overview": "Midway through the process, the power shifts back to the men as Tommy calls upon them to step outside the box and date women they haven't connected with yet. The assignment helps expose unexpected romances, dying sparks and fresh jealousies."
      },
      {
        "id": "tvmaze:2196730",
        "title": "That's What Friends Are For",
        "season": 4,
        "episode": 7,
        "released": "2021-11-26",
        "overview": "The women aren't just in power, they're bringing their friends! Shawn faces a firing squad, Kamil's pals worry she will crush Cornelius, and Phil goes on three dates. At the ladies' lounge, Zadia's on 100 and Tisia threatens to go on \"100 and two.\""
      },
      {
        "id": "tvmaze:2217740",
        "title": "Ex Marks the Spot",
        "season": 4,
        "episode": 8,
        "released": "2021-12-03",
        "overview": "Tommy throws his best curveball yet. It's time for the guys to introduce their \"next\" to their ex. Some of the ladies are also in for an extra surprise when they realize they aren't the only connection to be invited out to meet their interest's ex."
      },
      {
        "id": "tvmaze:2217743",
        "title": "Out of Town and Out of Bounds",
        "season": 4,
        "episode": 9,
        "released": "2021-12-10",
        "overview": "Tommy surprises the remaining singles with a weekend at a bayside mansion, but he's packed a major curveball in his luggage. Connections are made and broken, and tension reaches a boiling point as the couples deal with the fallout."
      },
      {
        "id": "tvmaze:2240572",
        "title": "True Colors",
        "season": 4,
        "episode": 10,
        "released": "2021-12-17",
        "overview": "After a shocking elimination at the retreat, the singles return to DC, and it's the men who have the power to eliminate. Mumen heavily pursues Frank; Walter contends with Sabrina's past; Phil falls deeper for Sidney; and Zadia confronts Dontá on Aisha."
      },
      {
        "id": "tvmaze:2217744",
        "title": "A Reason, a Season or a Lifetime",
        "season": 4,
        "episode": 11,
        "released": "2021-12-31",
        "overview": "It's meet-the-family time! Sidney's mom embarrasses her daughter. Mumen's dad has a problem with Frank. Aisha's brother delivers a warning to Donta. Sabrina's relationship with Walt zooms along. Shiloh and Phil face an unexpected test."
      },
      {
        "id": "tvmaze:2238991",
        "title": "One Last Assignment",
        "season": 4,
        "episode": 12,
        "released": "2022-01-07",
        "overview": "It all comes down to this. As couples begin to solidify, those involved in love triangles still have a tough decision to make. The men's families are called in as one last assignment to help the final eight daters determine who is Ready to Love."
      },
      {
        "id": "tvmaze:2254488",
        "title": "RTL DC Reunion, Part 1",
        "season": 4,
        "episode": 13,
        "released": "2022-01-14",
        "overview": "Our 20 singles reunite in Chocolate City, where twists, tears and truths are revealed -- with the help of a special guest host, DC native Tanika Ray -- in part one of an explosive two-hour Ready to Love reunion special."
      },
      {
        "id": "tvmaze:2254489",
        "title": "RTL DC Reunion, Part 2",
        "season": 4,
        "episode": 14,
        "released": "2022-01-21",
        "overview": "Part 2 of the Ready to Love DC Reunion Special picks up the pieces of the retreat, patches up a love triangle, reveals a love square and shows that actions speak louder than intentions. Who of our remaining couples has set off on their road to forever?"
      },
      {
        "id": "tvmaze:2259565",
        "title": "Quality Over Quantity",
        "season": 5,
        "episode": 1,
        "released": "2022-01-28",
        "overview": "Ready to Love returns for its fifth season in the historic town of Potomac, MD. With just 14 singles, these romantic hopefuls must focus on \"quality over quantity.\" While some heed Tommy's advice to dig deep, two singles are sent home by the night's end."
      },
      {
        "id": "tvmaze:2261613",
        "title": "Blind Dates",
        "season": 5,
        "episode": 2,
        "released": "2022-02-04",
        "overview": "Week 2 starts with a brunch curveball: Tommy sets up blind dates to bring in a new man and a new woman! Joi gets closer to Clifton, and Tiffani tries to get closer to Wiley. Ace is aloof on a group date, and later, the men send one incredulous woman home."
      },
      {
        "id": "tvmaze:2269213",
        "title": "Sparks Will Fly...or Fizzle",
        "season": 5,
        "episode": 3,
        "released": "2022-02-11",
        "overview": "With the ladies in the driver's seat, two more blind dates arrive: Eric and Dakiya click while AP feels Clifton looks familiar. Sabrina dismisses Paul. Joi and Clifton get closer. The ladies decide one man is not ready to love and send him packing."
      },
      {
        "id": "tvmaze:2272564",
        "title": "Party Crashers",
        "season": 5,
        "episode": 4,
        "released": "2022-02-18",
        "overview": "Two new blind dates arrive. Sabrina is conflicted between Tory and Demetrius; Precious' wild ways cause ripples that threaten her chances at love; Carmen and DaKiya vie for Eric's attention; AP's revelations about her past may send her home."
      },
      {
        "id": "tvmaze:2284745",
        "title": "Truth or Dare?",
        "season": 5,
        "episode": 5,
        "released": "2022-02-25",
        "overview": "Sabrina shocks everyone by kissing someone other than Tory during truth or dare. Joi tries to get Wiley to make a move on a sky-high group date. Tina gets to know Laverne, but he nearly bores her to tears with small talk. One of the men is sent home."
      },
      {
        "id": "tvmaze:2284746",
        "title": "The Backup Plan",
        "season": 5,
        "episode": 6,
        "released": "2022-03-04",
        "overview": "This week, Tommy challenges the men to test their strongest connections by taking out their \"backup plans.\" New romances blossom, old friendships solidify, connections get confusing, and an unexpected allegation threatens the process."
      },
      {
        "id": "tvmaze:2284747",
        "title": "The Ex Files",
        "season": 5,
        "episode": 7,
        "released": "2022-03-18",
        "overview": "This week, Tommy challenges the men to test their strongest connections by taking out their \"backup plans.\" New romances blossom, old friendships solidify, connections get confusing, and an unexpected allegation threatens the process."
      },
      {
        "id": "tvmaze:2284748",
        "title": "Operation Meet the Homie",
        "season": 5,
        "episode": 8,
        "released": "2022-03-25",
        "overview": "Best friends visit and size up the guys' top choices. Much to the chagrin of Joi and Carmen, DaKiya finds herself to be a solid contender for both Clifton and Paul's hearts. When she is a no-show, Tory seeks answers from Ace and gets a shocking admission."
      },
      {
        "id": "tvmaze:2299053",
        "title": "The Getaway Shuffle",
        "season": 5,
        "episode": 9,
        "released": "2022-04-01",
        "overview": "At a weekend getaway, Sabrina labors to decide between two suitors while closing things off with a third. Clifton struggles to manage connections with Joi and DaKiya. When Tina fails to show, Paul and Donovan deepen previous connections with others."
      },
      {
        "id": "tvmaze:2300117",
        "title": "Better Late Than Never",
        "season": 5,
        "episode": 10,
        "released": "2022-04-08",
        "overview": "A man goes home, and Clifton leaves DaKiya in tears. Tina finally shows up, leaving Donovan confused. Tommy gathers the group post getaway and tensions emerge between Paul and Carmen, Carmen and DaKiya, and Sabrina and her two D's."
      },
      {
        "id": "tvmaze:2311811",
        "title": "All in the Family",
        "season": 5,
        "episode": 11,
        "released": "2022-04-15",
        "overview": "Concerns arise when the men introduce the women to their families. Can Joi and Clifton survive a career that takes her to Mexico for six months? Can Paul and DaKiya transcend the friend zone? Sabrina weighs her options about moving forward with Demetrius."
      },
      {
        "id": "tvmaze:2320113",
        "title": "Decisions, Decisions",
        "season": 5,
        "episode": 12,
        "released": "2022-04-22",
        "overview": "The three final men meet the ladies' families. Will distance destroy Joi and Clifton's relationship? Will a revelation from Donovan's past drive Carmen away? Has DaKiya found the spark she needs from Paul? Three couples enter, but only two couples leave."
      },
      {
        "id": "tvmaze:2300118",
        "title": "RTL Potomac Reunion, Part 1",
        "season": 5,
        "episode": 13,
        "released": "2022-04-29",
        "overview": "Tommy gathers the Ready to Love Potomac cast back together to answer fans' burning questions and reveal what they've been up to since leaving the journey. The tea is hot and about to be spilled. Unexpected drama and love await!"
      },
      {
        "id": "tvmaze:2317869",
        "title": "RTL Potomac Reunion, Part 2",
        "season": 5,
        "episode": 14,
        "released": "2022-05-06",
        "overview": "On the thrilling conclusion of the Ready to Love Potomac Reunion Special, Tina finally explains her side of the story, Precious gets loud, and Clifton gets down on a knee! Get ready for tea to spill and drama to flow in a finale you won't soon forget!"
      },
      {
        "id": "tvmaze:2354419",
        "title": "Miami Mixer",
        "season": 6,
        "episode": 1,
        "released": "2022-07-29",
        "overview": "Ready to Love heads to the Magic City: Miami. When 20 sexy singles arrive for a pool mixer, Tommy advises them to seek \"love over lust.\" But curveballs fly as one single leaves in an emergency, another is eliminated, and two more face the chopping block."
      },
      {
        "id": "tvmaze:2365610",
        "title": "First Kiss",
        "season": 6,
        "episode": 2,
        "released": "2022-08-05",
        "overview": "What's for brunch? Shareese orders up beef with Kayla. And for one woman, it's a serving of \"go home\" salad. When the power shifts, the men need to impress. Sweaty Devin is literally feeling the heat, Mike's magic wears thin, and one man's journey ends."
      },
      {
        "id": "tvmaze:2365611",
        "title": "Opposites Don't Always Attract",
        "season": 6,
        "episode": 3,
        "released": "2022-08-12",
        "overview": "The power shifts to the fellas' hands this week, and Tommy encourages our guys to get creative and go for someone who isn't their normal type. While Sampson hits it off with an unlikely suitor, Mike realizes that not everybody is meant to be a connection."
      },
      {
        "id": "tvmaze:2365612",
        "title": "Miami White Party",
        "season": 6,
        "episode": 4,
        "released": "2022-08-19",
        "overview": "The ladies have the power this week, and Tommy pulls out all the stops to throw a classic White Party. New connections are explored, and old ones are strengthened. Jealousy and betrayal crash the party, and someone sneaks out before the night is over."
      },
      {
        "id": "tvmaze:2375088",
        "title": "It's Barbecue Time",
        "season": 6,
        "episode": 5,
        "released": "2022-08-26",
        "overview": "In the aftermath of the White Party, three of the men have one last chance to dig deeper and step up their game. A group date at go-karts goes way left while romance blooms at a group picnic. Someone stands up their date and ruins a relationship forever."
      },
      {
        "id": "tvmaze:2376874",
        "title": "Real-er Than You've Ever Been",
        "season": 6,
        "episode": 6,
        "released": "2022-09-02",
        "overview": "Fearing some singles aren't taking the process seriously, Tommy asks the men to set up romantic dates before opening the floor at a group dinner. Randall and Mike are torn over their respective connections. Shakyra and Kadian argue about a past exchange."
      },
      {
        "id": "tvmaze:2376875",
        "title": "A Little Help From My Friends",
        "season": 6,
        "episode": 7,
        "released": "2022-09-09",
        "overview": "Not everything is friendly when the men meet the ladies' friends. While Kayla ends up in tears, Kadian's BFF offends Swasey so much their entire relationship is in jeopardy, and Justice gets served when Tranika's friends compare him to animal excrement."
      },
      {
        "id": "tvmaze:2376876",
        "title": "The Truth Will Set You Free",
        "season": 6,
        "episode": 8,
        "released": "2022-09-16",
        "overview": "The guys put the ladies on the hot seat and introduce their strongest connections to a Truth Teller. Swasey and Kadian try to get back on track. Sampson gets the confirmation he's been seeking. LJ learns the hard way that the truth will always come out."
      },
      {
        "id": "tvmaze:2376877",
        "title": "Ready to Getaway",
        "season": 6,
        "episode": 9,
        "released": "2022-09-23",
        "overview": "At a weekend getaway, Randall feels pressure from Jamala to cut off his other connections. Mike lets Brandi and Kayla know where he's leaning. Tommy throws the group a curveball, and when LJ is MIA, it leaves Tranika alone to fight for time with Randall."
      },
      {
        "id": "tvmaze:2376878",
        "title": "The Dating Game",
        "season": 6,
        "episode": 10,
        "released": "2022-09-30",
        "overview": "After a painful elimination, Tommy lightens the mood with a dating game. Randall and Tranika share an experience that has him question everything. Kayla feels ignored by her strongest connections. After Shareese and Sampson get close, he pulls back."
      },
      {
        "id": "tvmaze:2406505",
        "title": "Call in the Reinforcements",
        "season": 6,
        "episode": 11,
        "released": "2022-10-07",
        "overview": "With final decisions looming, the women set up dates for the men to meet their families; Kayla's parents interrogate both Mike and Randall; Kadian struggles to get Swasey to discuss their relationship goals; an early relationship comes to a turbulent end."
      },
      {
        "id": "tvmaze:2413139",
        "title": "The Finale",
        "season": 6,
        "episode": 12,
        "released": "2022-10-14",
        "overview": "The final brunch starts off with mimosas but ends with one couple self-eliminating in a shocking implosion. Five people remain, but only four will find love here. The men introduce their dates to their brothers. The two final couples are revealed."
      },
      {
        "id": "tvmaze:2417111",
        "title": "RTL Miami Reunion, Part 1",
        "season": 6,
        "episode": 13,
        "released": "2022-10-21",
        "overview": "Gathering together after the finale, the Ready to Love cast spills all the tea on their journey and catches us up on new connections. Things turn dramatic, and Shareese and Zo find themselves clashing with each other and beefing with Swasey and Kadian."
      },
      {
        "id": "tvmaze:2422197",
        "title": "RTL Miami Reunion, Part 2",
        "season": 6,
        "episode": 14,
        "released": "2022-10-28",
        "overview": "The exciting conclusion of the RTL Miami Reunion is an inside look at the many loves of Randall, the on-again, off-again romance of Kadian and Swasey, the true love story of Mike and Brandi, and never before seen footage and hilarious outtakes."
      },
      {
        "id": "tvmaze:2455514",
        "title": "16 Sexy Singles",
        "season": 7,
        "episode": 1,
        "released": "2023-01-06",
        "overview": "Sixteen sexy singles arrive for the traditional mansion mixer; Tommy brings in Rashid and Symone from \"Last Resort\" to advise the daters on what it takes to find love; by evening's end, two singles go home."
      },
      {
        "id": "tvmaze:2458144",
        "title": "Tickle My Pickle",
        "season": 7,
        "episode": 2,
        "released": "2023-01-13",
        "overview": "New daters arrive. Fashionista Fabrice's first impression flops. Blake and Zee fail to connect. Corvaya scares Mark Anthony. Cynthia drives a wedge between Jeffri and Andre. Tony and Marcia pray together, but will they stay together? One woman goes home."
      },
      {
        "id": "tvmaze:2458145",
        "title": "I'm a Smoocher",
        "season": 7,
        "episode": 3,
        "released": "2023-01-20",
        "overview": "Tommy challenges the ladies to take the guys on dates and reveal something about themselves that they wouldn't normally; Jeffri reveals something about Blake that has some of the ladies questioning his real intentions."
      },
      {
        "id": "tvmaze:2458146",
        "title": "Advocate Sue",
        "season": 7,
        "episode": 4,
        "released": "2023-01-27",
        "overview": "Tommy throws a hot Miami yacht party; someone drops out of the process; a kiss sparks jealousy; connections are questioned, formed and fortified."
      },
      {
        "id": "tvmaze:2458147",
        "title": "The Math Ain't Mathin'",
        "season": 7,
        "episode": 5,
        "released": "2023-02-03",
        "overview": "In the aftermath of the yacht party, the men and women go dancing at the Hard Rock Miami. DeMario shames Jeffri for kissing someone else. Blake and Jonique suffer through a miserable date, while Morgan and Tony can't keep their hands off one another."
      },
      {
        "id": "tvmaze:2458148",
        "title": "Do You Like Me?",
        "season": 7,
        "episode": 6,
        "released": "2023-02-10",
        "overview": "Tommy tasks the men with focusing on promising connections and asking hard questions, saying he'll judge their compatibility at a group dinner; Blake and SueAnn seal their connection with a kiss; Lyndon asks where he stands with Mercedes and Morgan."
      },
      {
        "id": "tvmaze:2458149",
        "title": "Queens Don't Chase",
        "season": 7,
        "episode": 7,
        "released": "2023-02-17",
        "overview": "A group dinner ends in anger; love triangles shift as Andre's return reignites old feelings; one man and one woman go home; Tommy wants people to follow up on what they've learned, leading to kisses, tears and a blowup between Morgan and Blake."
      },
      {
        "id": "tvmaze:2458150",
        "title": "Celebrating 100 Episodes",
        "season": 7,
        "episode": 8,
        "released": "2023-02-24",
        "overview": "Celebrate the 100th episode of OWN's hit dating show, Ready to Love. Join host Tommy Miles as he catches up with your favorite cast members from every season. Oprah and show creator Will Packer pop in, and fans get a sneak peek at next week's episode."
      },
      {
        "id": "tvmaze:2493682",
        "title": "Nair in the Hair",
        "season": 7,
        "episode": 9,
        "released": "2023-03-03",
        "overview": "It's time for the ladies to introduce their exes; tempers rise when Andre and Anthony meet the father of Cynthia's children; Morgan shows why she isn't a woman to play with; Jeffri's situation with her exes is complicated."
      },
      {
        "id": "tvmaze:2494884",
        "title": "Wife Me, Please",
        "season": 7,
        "episode": 10,
        "released": "2023-03-10",
        "overview": "Tommy tasks the guys to seek love advice about their top connections from trusted friends; some find themselves conflicted over their friends' advice, and tensions rise as their relationships are threatened."
      },
      {
        "id": "tvmaze:2494885",
        "title": "Bro Code Broken",
        "season": 7,
        "episode": 11,
        "released": "2023-03-17",
        "overview": "Tommy leads an adventure on a gator boat through the Everglades to a luxurious getaway; Tony and Lyndon compete for Morgan's affections; Jeffri faces a tough decision; Sue Ann and Mercedes find their connections dwindling."
      },
      {
        "id": "tvmaze:2494886",
        "title": "Two Truths and a Lie",
        "season": 7,
        "episode": 12,
        "released": "2023-03-24",
        "overview": "Following the elimination, the power shifts back to the women; Tommy tasks the singles with a candlemaking assignment; Blake questions his fate; a conflicted Morgan must choose between Lyndon and Tony."
      },
      {
        "id": "tvmaze:2494887",
        "title": "Too Much Baggage",
        "season": 7,
        "episode": 13,
        "released": "2023-03-31",
        "overview": "The men turn to their families for help; Tony's sister is against Morgan's wish for counseling; Andre's sister isn't a fan of Cynthia or Jeffri; Mark has a choice made for him; Anthony takes a woman on a date; Morgan drops a bombshell about Tony."
      },
      {
        "id": "tvmaze:2514963",
        "title": "The Finale",
        "season": 7,
        "episode": 14,
        "released": "2023-04-07",
        "overview": "In one last test before final decisions are made, the ladies introduce their connections to their families. While half of the final couples are formed, Andre and Cynthia wait until the last minute to decide who they'll end their journeys with."
      },
      {
        "id": "tvmaze:2525301",
        "title": "Reunion Special, Part 1",
        "season": 7,
        "episode": 15,
        "released": "2023-04-14",
        "overview": "As the Ready to Love cast reunites, a surprise relationship gets revealed, Jeffri and Andre make peace and the Lyndon/Tony/Morgan triangle erupts."
      },
      {
        "id": "tvmaze:2529540",
        "title": "Reunion Special, Part 2",
        "season": 7,
        "episode": 16,
        "released": "2023-04-21",
        "overview": "The RTL reunion concludes as Morgan and Marcia clash, Tony drops a bomb regarding Natasha, and the current state of the unions are revealed."
      },
      {
        "id": "tvmaze:2566671",
        "title": "Bigger in Texas",
        "season": 8,
        "episode": 1,
        "released": "2023-07-07",
        "overview": "RTL comes to the \"Big D,\" Dallas, where 18 eligible singles arrive for Tommy's classic mansion mixer. Throughout the day, the romantic hopefuls heed his advice and make connections until four face elimination, and two go home at the end of the night."
      },
      {
        "id": "tvmaze:2586047",
        "title": "It's Getting Thot in Here",
        "season": 8,
        "episode": 2,
        "released": "2023-07-14",
        "overview": "After a cast brunch, the ladies are in power. Some women want to send BDSM practitioner Marvin home, while others are intrigued. Eunik still views Red as a thot. Habibi's antics prove divisive. The ladies' lounge erupts into mayhem."
      },
      {
        "id": "tvmaze:2593598",
        "title": "Tommy's Choice",
        "season": 8,
        "episode": 3,
        "released": "2023-07-21",
        "overview": "Tommy sets the men and women up on blind dates. When looking for love, no stone should be left unturned, so some unlikely pairings are made. And in true Tommy fashion, a few curveballs are thrown."
      },
      {
        "id": "tvmaze:2598903",
        "title": "Black and Beautiful Hoedown",
        "season": 8,
        "episode": 4,
        "released": "2023-07-28",
        "overview": "The women have the power this week when Tommy throws a Texas hoedown at a Black-owned ranch. Two men are in jeopardy of being sent home when one dips out early, and another overshares his kinks."
      },
      {
        "id": "tvmaze:2614065",
        "title": "Navigating Non-Negotiables",
        "season": 8,
        "episode": 5,
        "released": "2023-08-04",
        "overview": "The men have the power this week as Tommy advises everyone to discuss their non-negotiables. Marvin gets a kiss, but will he get more kids? An improv class improves some connections but hurts others. Two of the ladies miss the mark, and one is sent home."
      },
      {
        "id": "tvmaze:2610284",
        "title": "Dates and Doubts",
        "season": 8,
        "episode": 6,
        "released": "2023-08-11",
        "overview": "Tommy tells the ladies to discuss their dating doubts, Aries and Phillip share a kiss, and Keyra tries to get her \"Black card\" back. Marvin's sexcapades might catch up to him, and Christopher questions Sierra's highbrow taste."
      },
      {
        "id": "tvmaze:2616635",
        "title": "Meet the Exes",
        "season": 8,
        "episode": 7,
        "released": "2023-08-18",
        "overview": "The ladies meet the men's exes. Maurier's ex horrifies Janelle with tarot cards. Phil's ex says he's not big on physical touch, but his hand on Aries' leg says otherwise. Chris finds Jessica too loud, Quinton finds Lee too quiet, and one woman goes home."
      },
      {
        "id": "tvmaze:2624095",
        "title": "Ride or Die",
        "season": 8,
        "episode": 8,
        "released": "2023-08-25",
        "overview": "The men meet the ladies' friends; tension arises between Kat's friend and Herbert; Aries' friends cast doubt on her future with Phil; some connections become clearer; others are turned upside down; one man makes a bad impression and is sent home."
      },
      {
        "id": "tvmaze:2627844",
        "title": "Blink If You Need Help",
        "season": 8,
        "episode": 9,
        "released": "2023-09-01",
        "overview": "The remaining six women and four men go on a weekend getaway to solidify their connections; Janelle claims Quinton, and things get heated; Katarina and Lee compete for the same man, while one woman finds her connection is too little too late."
      },
      {
        "id": "tvmaze:2631751",
        "title": "The Getaway, Part 2",
        "season": 8,
        "episode": 10,
        "released": "2023-09-08",
        "overview": "The getaway weekend resumes; one woman dodges elimination, but the men's feedback cuts deep; Quinton takes Janelle's bait, Lee gets a gift, and Kat and Maurier continue bonding; the ladies eliminate one man, resulting in an explosive exit."
      },
      {
        "id": "tvmaze:2636997",
        "title": "Meet the Family",
        "season": 8,
        "episode": 11,
        "released": "2023-09-15",
        "overview": "Tommy has the men introduce the women to their families; Maurier is stuck in a triangle between Katarina and Jessica; Aries reiterates concerns about Phil's career stability; Quinton remains undecided between Lee and Janelle."
      },
      {
        "id": "tvmaze:2643469",
        "title": "The Finale",
        "season": 8,
        "episode": 12,
        "released": "2023-09-22",
        "overview": "The women introduce the men to their families. Maurier needs to choose between Jessica and Kat. Aries' family grills Phil. Janelle and her cousin are blindsided by Quinton's desire for three kids. The final choices are made."
      },
      {
        "id": "tvmaze:2652996",
        "title": "Reunion Special - Part 1",
        "season": 8,
        "episode": 13,
        "released": "2023-09-29",
        "overview": "Don't mess with the Dallas Ready to Love cast. This reunion comes with big love, big laughs and big drama. Habibi is in hot water, the Janelle and Taquilla divide erupts, and Marvin can't whip them back into shape."
      },
      {
        "id": "tvmaze:2660947",
        "title": "Reunion Special - Part 2",
        "season": 8,
        "episode": 14,
        "released": "2023-10-06",
        "overview": "In the dramatic ending to the Dallas reunion, there's an aura around the stage that is felt. Kat and Janelle can't get away from each other, Chris and Jessica get combative, and Quinton shares his heart. Lines are drawn, and love interests are revealed."
      },
      {
        "id": "tvmaze:2735482",
        "title": "Hot and Bothered",
        "season": 9,
        "episode": 1,
        "released": "2024-01-12",
        "overview": "RTL shows up in Fort Worth -- but Glen is having doubts about showing up at all! With the women in power, the men have to get their mingle on. A game of \"hot and bothered\" grants one man immunity, but one man is going home."
      },
      {
        "id": "tvmaze:2739476",
        "title": "The Good, Bad and Freaky",
        "season": 9,
        "episode": 2,
        "released": "2024-01-19",
        "overview": "For the first time ever, Tommy hosts a second mansion mixer for 10 additional Fort Worth singles. Some of the men's kinks are exposed, and the women play a game to win immunity before the men vote on which of the ladies will be sent home."
      },
      {
        "id": "tvmaze:2742773",
        "title": "Finger Lickin' Good",
        "season": 9,
        "episode": 3,
        "released": "2024-01-26",
        "overview": "The two groups of singles merge at Tommy's brunch. Some old connections are reinforced, while other singles are ready to love someone new. With the men in power, one woman's dismissive demeanor lands her on the chopping block, and another gets dismissed."
      },
      {
        "id": "tvmaze:2747069",
        "title": "Getting Intimate",
        "season": 9,
        "episode": 4,
        "released": "2024-02-02",
        "overview": "The cast gets intimate sharing their homes and lives, but Lamar wants to share more. The women have the power, and a new guy joins the process. Connections become clearer, but Will and Alexis may have forgotten the first rule of the lounge."
      },
      {
        "id": "tvmaze:2756026",
        "title": "Pajama Jam",
        "season": 9,
        "episode": 5,
        "released": "2024-02-09",
        "overview": "The power shifts over to the men as Tommy throws a Pajama Jam for everyone to explore their intimacy &amp; chemistry. Laron is upset with mixed signals he's receiving from Koshiea. Jonathan confuses chemistry with intimacy &amp; takes it too far with Alexis."
      },
      {
        "id": "tvmaze:2761614",
        "title": "Closed Mouths Don't Get Fed",
        "season": 9,
        "episode": 6,
        "released": "2024-02-16",
        "overview": "The women have the power as they set up dates to discuss non-negotiables; Rasheena and Justin heat things up with salsa dancing, while Alonzo and William fight for Patrice's affection on a group date; Tommy throws a curveball at deliberations."
      },
      {
        "id": "tvmaze:2761615",
        "title": "Meet The Friends",
        "season": 9,
        "episode": 7,
        "released": "2024-02-23",
        "overview": "The men bring in their friends. Laron harbors a grudge against Alexis but tries to keep his party going with Mieka and Mya. Justin juggles his options. Chaz and Dom vie for Vanessa. The William/Alonzo/Patrice triangle gets trickier. One woman goes home."
      },
      {
        "id": "tvmaze:2765988",
        "title": "Exes Meet The Nexes",
        "season": 9,
        "episode": 8,
        "released": "2024-03-01",
        "overview": "The ladies bring in their exes; Mieka shocks Laron and Justin, but she's not playing games; Rasheena argues for more communication from Chaz, while he and Dom vie for Vanessa; Mya's standards scare a suitor; Alonzo has something to prove."
      },
      {
        "id": "tvmaze:2778541",
        "title": "Tommy's Getaway Pt. 1",
        "season": 9,
        "episode": 9,
        "released": "2024-03-08",
        "overview": "The remaining five women and five men set off on a weekend getaway that brings both old and new connections together; Chaz struggles to juggle his attachments, Vanessa shows some jealousy, Mya learns a lot and sparks fly off the jet ski for Mieka."
      },
      {
        "id": "tvmaze:2788945",
        "title": "Tommy's Getaway Pt. 2",
        "season": 9,
        "episode": 10,
        "released": "2024-03-15",
        "overview": "An elimination sends shockwaves through the rest of the getaway; newer connections strengthen, as older ones fizzle; juggling four women proves to be too much for Chaz to handle, and others use his absence to strengthen their own connections."
      },
      {
        "id": "tvmaze:2789576",
        "title": "Family Ties",
        "season": 9,
        "episode": 11,
        "released": "2024-03-22",
        "overview": "The men meet the women's families; Patrice is conflicted over two guys; Vanessa feels Chaz is manipulative; Mya is concerned about Laron's' actions."
      },
      {
        "id": "tvmaze:2797686",
        "title": "The Finale",
        "season": 9,
        "episode": 12,
        "released": "2024-03-29",
        "overview": "The Fort Worth Finale begins in flame-broiled fury as Laron and Mya fight in front of a backdrop of BBQ brisket. Will Patrice pick Alonzo or Chaz? Will Chaz pick Vanessa? And will Justin float away in a gondola with Mieka?"
      },
      {
        "id": "tvmaze:2804797",
        "title": "Fort Worth Reunion: Part 1",
        "season": 9,
        "episode": 13,
        "released": "2024-04-05",
        "overview": "The Fort Worth cast reunites for a special that is hotter than the Texas sun; Patrice and Alonzo's relationship skates into bumpy territory; a single missing since the mixer finally shows; a seemingly harmless game erupts into an all-out brouhaha."
      },
      {
        "id": "tvmaze:2804920",
        "title": "Fort Worth Reunion: Part 2",
        "season": 9,
        "episode": 14,
        "released": "2024-04-12",
        "overview": "In the thrilling conclusion to the RTL Fort Worth reunion, Vanessa and Chaz argue the meaning behind his parting gift, and some of the cast's kinks are explored. Plus, we catch up with the final couple Mieka and Justin, and new love connections are revealed."
      },
      {
        "id": "tvmaze:3085049",
        "title": "The First RTL Wedding",
        "season": 10,
        "episode": 1,
        "released": "2025-02-07",
        "overview": "To kick off the new season, the singles are introduced to the first Ready to Love Wedding with a union from the Washington D.C. season that gives everyone a glimpse into a hopeful future of forever. But as half of the eligible singles attend the first of two mixers, one man's nonstop joking and one woman's quirky ways could send them home the first night."
      },
      {
        "id": "tvmaze:3085050",
        "title": "We Got Some Chocolate, Y'all!",
        "season": 10,
        "episode": 2,
        "released": "2025-02-14",
        "overview": "A fresh set of 10 singles meet at the second mixer, joined by two familiar faces. A love potion fills the air as one cast member wows with travel tales, and a Philly fireman keeps it hot."
      },
      {
        "id": "tvmaze:3085051",
        "title": "All Together Now",
        "season": 10,
        "episode": 3,
        "released": "2025-02-21",
        "overview": "Nineteen eligible singles are ready to mingle and meet for the first time when Tommy sends the survivors of Mixers one and two to a comedy club. New connections are made, old connections are tested, and with the women in power, one man is sent home."
      },
      {
        "id": "tvmaze:3085053",
        "title": "Poly Pool Party",
        "season": 10,
        "episode": 4,
        "released": "2025-02-28",
        "overview": "Tommy encourages the guys to let the ladies see a more personal side of them by inviting them into their homes or place of business."
      },
      {
        "id": "tvmaze:3085058",
        "title": "Tommy's Philly Block Party",
        "season": 10,
        "episode": 5,
        "released": "2025-03-07",
        "overview": "Tommy invites the singles to turn up at a Philly block party. New revelations jeopardize a relationship, some are making bold moves, and pressures and tensions rise when motivations are questioned."
      },
      {
        "id": "tvmaze:3085059",
        "title": "The Nudist",
        "season": 10,
        "episode": 6,
        "released": "2025-03-14",
        "overview": "The women return to power and are tasked with dating their secondary connections."
      },
      {
        "id": "tvmaze:3304102",
        "title": "Meet the Exes",
        "season": 10,
        "episode": 7,
        "released": "2025-08-01",
        "overview": "Drama ensues as Cam feels slighted by Angie, and Husieen questions her need to lead. Cisco's praise for Tae is a red flag for Shanice, while Kiara's ex tries to woo Kiara back ... right in front of Jay!"
      },
      {
        "id": "tvmaze:3303849",
        "title": "My Man, My Man, My Man's BFF",
        "season": 10,
        "episode": 8,
        "released": "2025-08-08",
        "overview": "The women dig deeper for info when they meet their men's BFFs."
      },
      {
        "id": "tvmaze:3303850",
        "title": "Tommy's Getaway",
        "season": 10,
        "episode": 9,
        "released": "2025-08-15",
        "overview": "The men and women look to deepen their connections on the RTL Getaway!"
      },
      {
        "id": "tvmaze:3303851",
        "title": "Getaway Part 2",
        "season": 10,
        "episode": 10,
        "released": "2025-08-22",
        "overview": "After a woman is sent home from the getaway, the remaining singles must figure out where they stand with one another."
      },
      {
        "id": "tvmaze:3303852",
        "title": "Convict Curveball",
        "season": 10,
        "episode": 11,
        "released": "2025-09-05",
        "overview": "Tommy has the men introduce the women to their loved ones. Cam continues to be torn between three connections. Jay's mom raises concerns over Kiara's communication. Cisco's sister questions if Tae is a runner. Rose drops a bomb from her past on Husieen."
      },
      {
        "id": "tvmaze:3304106",
        "title": "The Finale",
        "season": 10,
        "episode": 12,
        "released": "2025-09-12",
        "overview": "The cast gathers for the final brunch, and Tae and Cisco are a hot topic. The men meet the women's families. Tae's Aunt Goldie keeps it old school. Angie's brother still fears her dark side. Jay flirts with Kiara's cousin. The final decisions are made."
      },
      {
        "id": "tvmaze:3303853",
        "title": "Reunion Part I",
        "season": 10,
        "episode": 13,
        "released": "2025-09-19",
        "overview": "The Philadelphia singles come together for an unforgettable reunion special. Angie reveals her new beau, while Fritz addresses the poly accusations once and for all. Rose spills the tea on what went down after the journey, leaving everyone in shock."
      },
      {
        "id": "tvmaze:3303854",
        "title": "Reunion Part II",
        "season": 10,
        "episode": 14,
        "released": "2025-09-26",
        "overview": "The Philly reunion continues with Cam in the hot seat and Rose demanding answers. Deona and Shanice share insight into their experience on the journey. Jay and Kiara, as well as Tae and Cisco, reveal how their connections have fared since the finale."
      },
      {
        "id": "tvmaze:3392616",
        "title": "Detroit Is Lit!",
        "season": 11,
        "episode": 1,
        "released": "2025-11-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3429847",
        "title": "Second Chance Mixer",
        "season": 11,
        "episode": 2,
        "released": "2025-11-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3429848",
        "title": "Tommy's Skate Jam",
        "season": 11,
        "episode": 3,
        "released": "2025-11-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3429849",
        "title": "Up Close and Personal",
        "season": 11,
        "episode": 4,
        "released": "2025-11-28",
        "overview": ""
      }
    ]
  }
}