{
  "meta": {
    "id": "tvmaze:40834",
    "type": "series",
    "name": "Love & Marriage: Huntsville",
    "description": "Love &amp; Marriage: Huntsville centers around the lives of three high-powered African-American couples who come together to help the thriving city of Huntsville, Alabama, continue to grow through their joint real estate venture, the Comeback Group. These couples are longtime friends and avid socialites with strong personalities and points of view. As they strive to make this huge undertaking a success, they face the realities of love and marriage. Will they succeed at mixing business with pleasure? Or will their personal quarrels make foes of these longtime friends?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373600.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373600.jpg",
    "videos": [
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436547",
        "title": "Destiny's Men-ifesto",
        "season": 10,
        "episode": 12,
        "released": "2025-12-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      },
      {
        "id": "tvmaze:1603801",
        "title": "Rocket City Revival",
        "season": 1,
        "episode": 1,
        "released": "2019-01-12",
        "overview": "Melody and Martell reach out to fellow power-couples LaTisha, Marsau, Kimmi and Maurice to reunite the Comeback Group in hopes of revitalizing Huntsville, Alabama. At dinner, things get uncomfortable when Melody brings up the topic of respectful cheating."
      },
      {
        "id": "tvmaze:1603802",
        "title": "Respectful Cheating?",
        "season": 1,
        "episode": 2,
        "released": "2019-01-19",
        "overview": "Following their awkward dinner, the group questions whether or not Martell cheated on Melody. Kimmi celebrates her bridal shower but is upset when Melody is a no-show. Maurice and Marsau wonder if doing business with the Holts is a smart idea."
      },
      {
        "id": "tvmaze:1603803",
        "title": "Bougie and the Beast",
        "season": 1,
        "episode": 3,
        "released": "2019-01-26",
        "overview": "The Comeback Group meets to discuss details, but things go awry when Kimmi calls out Melody's no-show to her bridal shower. Marsau gets stuck babysitting while Tisha begins networking. The girls get into it when Melody's accused of being \"bougie.\""
      },
      {
        "id": "tvmaze:1603804",
        "title": "10th Anniversary or Bust",
        "season": 1,
        "episode": 4,
        "released": "2019-02-02",
        "overview": "The Comeback Group holds a meeting to draw a line in the sand, and Kimmi prepares for her wedding day at the sex shop. The Scotts surprise the Holts with a 10th anniversary dinner, but things get awkward when Martell's infidelity is brought up yet again."
      },
      {
        "id": "tvmaze:1603805",
        "title": "Miami Vices",
        "season": 1,
        "episode": 5,
        "released": "2019-02-09",
        "overview": "It's Maurice and Kimmi's wedding weekend in Miami, which opens old wounds for Melody and Martell; while the women attend Kimmi's bachelorette party, the guys toast Maurice at a strip club, where Martell seems forget whose bachelor party it is."
      },
      {
        "id": "tvmaze:1603806",
        "title": "The Love Boat",
        "season": 1,
        "episode": 6,
        "released": "2019-02-16",
        "overview": "It's Kimmi and Maurice's wedding day; while the guys spin their stories following their reckless bachelor party, Tisha's mother calls out Marsau for not wearing his wedding ring; Melody grills Martell about his infidelity during the reception."
      },
      {
        "id": "tvmaze:1607834",
        "title": "Going for Broker",
        "season": 1,
        "episode": 7,
        "released": "2019-02-23",
        "overview": "The Comeback Group is reunited and ready to move forward, but a problem with the loan threatens to derail everything, including friendships; when Martell suffers a serious injury, Melody is forced to pick up the slack for her unfaithful husband."
      },
      {
        "id": "tvmaze:1610186",
        "title": "Melody's Last Stand",
        "season": 1,
        "episode": 8,
        "released": "2019-03-02",
        "overview": "Before Martell heads into surgery, Melody drops the bomb that things will be changing once he is fully recovered; the Comeback Group is on the brink of collapse; Tisha's quest to become a working mother may finally upend her marriage."
      },
      {
        "id": "tvmaze:1713807",
        "title": "Old Dog, Old Tricks",
        "season": 1,
        "episode": 9,
        "released": "2019-09-07",
        "overview": "Melody decides to meet with a divorce attorney. Martell seeks counseling to figure out why he's been unfaithful. Kimmi and Maurice try to reunite the Comeback Group. And Latisha bristles over comments the Holts have been making about her family."
      },
      {
        "id": "tvmaze:1718079",
        "title": "Martell It Like It Is",
        "season": 1,
        "episode": 10,
        "released": "2019-09-14",
        "overview": "Martell moves upstairs in an effort to save his marriage. Melody keeps up appearances at a photo shoot. Maurice makes plans to move his son to Huntsville. And Marsau tells Latisha about the rumor Martell is spreading about him having 20 girlfriends."
      },
      {
        "id": "tvmaze:1718080",
        "title": "Don't Call It a Comeback",
        "season": 1,
        "episode": 11,
        "released": "2019-09-21",
        "overview": "The Holts and the Scotts are at odds with the future of the Comeback Group as Melody wishes to dissolve it. Latisha tells her mom that Martell is spreading a rumor that Marsau has 20 girlfriends. Tensions escalate as Latisha tries to defend her husband."
      },
      {
        "id": "tvmaze:1726573",
        "title": "Don't Mess With Exes",
        "season": 1,
        "episode": 12,
        "released": "2019-09-28",
        "overview": "The Comeback Group prepares to take a cabin trip to mend their broken friendship. Unbeknownst to Kimmi, Maurice invites his ex-wife and her husband to move to Huntsville. Tisha buys sex toys and Melody seeks more advice about divorce."
      },
      {
        "id": "tvmaze:1729790",
        "title": "Cabin Fever",
        "season": 1,
        "episode": 13,
        "released": "2019-10-05",
        "overview": "During their annual cabin trip, tension escalates with a game gone wrong. Marsau and Martell lay their issues on the table. Maurice shocks Kimmi when he tells her he invited his ex-wife to move to Huntsville. Melody blames the men for Martell's cheating."
      },
      {
        "id": "tvmaze:1741044",
        "title": "Rage Cation",
        "season": 1,
        "episode": 14,
        "released": "2019-10-12",
        "overview": "Melody reveals to Martell that she is pregnant. Latisha fights with Melody over perpetuating the rumor that Marsau cheats. Maurice tries to appease Kimmi, but is determined to get his son to Huntsville."
      },
      {
        "id": "tvmaze:1747134",
        "title": "Babies, Birthdays and Unfinished Business",
        "season": 1,
        "episode": 15,
        "released": "2019-10-19",
        "overview": "Maurice continues his plans to move Kiuwha and Monster to Huntsville despite Kimmi's concerns. Melody contemplates divorce amidst her pregnancy. Latisha struggles to juggle her family dynamics with her mother and husband."
      },
      {
        "id": "tvmaze:1747135",
        "title": "Thera-Pissed",
        "season": 1,
        "episode": 16,
        "released": "2019-10-26",
        "overview": "With a new baby on the way, Mel and Martell attend couples' therapy. Kimmi, frustrated with the Comeback Group's lack of activity, decides to set up her own charity event. As the Holts host a game night, Tisha finds her friendship with Kimmi tested."
      },
      {
        "id": "tvmaze:1752591",
        "title": "Marsau and Ms. Wanda Have It Out",
        "season": 1,
        "episode": 17,
        "released": "2019-11-02",
        "overview": "While Melody tries to reinvent her look, Martell reconnects with his father. Marsau and his mother-in-law, Wanda, lock horns. And Kimmi hosts a charity event without the Comeback Group, which is becoming derailed by Martell and Melody's marital problems."
      },
      {
        "id": "tvmaze:1755027",
        "title": "Mixed Messages & Social Media",
        "season": 1,
        "episode": 18,
        "released": "2019-11-09",
        "overview": "Martell makes a social media post that pushes Melody to file for divorce. Marsau, Maurice and Ceddaric get vasectomies. Post-surgery, Kimmi surprises Maurice with a sexy nurse's uniform. Tisha complains to Marsau that she feels abandoned."
      },
      {
        "id": "tvmaze:1763145",
        "title": "Melody Bolts",
        "season": 1,
        "episode": 19,
        "released": "2019-11-16",
        "overview": "Despite their marriage being on the rocks, the Holts hold a party to reveal the baby's gender. Marsau is shocked to learn that LaTisha has a secret bank account. Kimmi continues to be annoyed with Maurice for leaving her out of important decisions."
      },
      {
        "id": "tvmaze:1763146",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 20,
        "released": "2019-11-23",
        "overview": "The Holts and the Scotts face each other for the first time since the cameras stopped rolling; Egypt Sherrod gets to the heart of some of their juiciest secrets."
      },
      {
        "id": "tvmaze:1763147",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 21,
        "released": "2019-11-30",
        "overview": "The Holts and the Scotts go toe-to-toe about the jaw-dropping season; as Martell's mom, Melody's mom and Tisha's mom hit the stage, viewers find out if the Holts will throw their marriage away or renew their love with a new baby in tow."
      },
      {
        "id": "tvmaze:1887248",
        "title": "Melody's Special Delivery - Part 1",
        "season": 2,
        "episode": 1,
        "released": "2020-07-11",
        "overview": "Days away from giving birth, Melody throws a baby shower that doesn't include LaTisha or Marsau, but does include a horse drawn carriage and plenty of shade thrown at Kimmi. Plus, Martell's therapist tries to reconnect him with someone from his past."
      },
      {
        "id": "tvmaze:1887249",
        "title": "Melody's Special Delivery - Part 2",
        "season": 2,
        "episode": 2,
        "released": "2020-07-18",
        "overview": "Martell tries to make amends with Melody's brother but still holds a grudge about the infidelity; the whole family rushes to the ER when Melody's doctor decides to induce labor; Tisha crashes Melody's launch party with shocking results."
      },
      {
        "id": "tvmaze:1887250",
        "title": "The Gift of Escortion",
        "season": 2,
        "episode": 3,
        "released": "2020-07-25",
        "overview": "The couples start to have their own issues: Melody defends her name, marriage and brand. Tisha puts herself as a priority, much to Marsau's dismay. And, as Kimmi settles into married life, Maurice begins to campaign for her to make a big change."
      },
      {
        "id": "tvmaze:1906073",
        "title": "Threats, Lies and Videotape",
        "season": 2,
        "episode": 4,
        "released": "2020-08-01",
        "overview": "The feud between the Holts and the Scotts heats up, as Martell and Marsau have a face-to-face confrontation. Kiuwha wants to get together with Maurice and Kimmi, and during Tisha's speech at a women's empowerment event a surprise guest pops up."
      },
      {
        "id": "tvmaze:1910384",
        "title": "Kimmi in the Middle",
        "season": 2,
        "episode": 5,
        "released": "2020-08-08",
        "overview": "Melody confronts Marsau about spreading rumors. Then, even though tensions are still high with the Holts and the Scotts, Melody invites Tisha's daughter to a birthday party. Martell finally meets up with his father while Wanda questions Kimmi's loyalty."
      },
      {
        "id": "tvmaze:1912412",
        "title": "It's My Party and You'll Cry if I Make You",
        "season": 2,
        "episode": 6,
        "released": "2020-08-15",
        "overview": "Melody embarks on a new business venture that puts her marriage on the front lines. Meanwhile, Kimmi's loyalty is questioned. Later, Tisha finally confronts Melody at her kids' birthday party about being escorted out of her launch party by security."
      },
      {
        "id": "tvmaze:1915918",
        "title": "Soft Open Hard Shade",
        "season": 2,
        "episode": 7,
        "released": "2020-08-22",
        "overview": "Marsau receives an offer he may refuse as Melody's ambitions frustrate an overworked Martell. Meanwhile, Maurice consults Kiuwha about a decision that could affect his marriage to Kimmi, and, at Destiny's soft opening, the attitudes rival the attire."
      },
      {
        "id": "tvmaze:1915919",
        "title": "Mama Gonna Cuss You Out",
        "season": 2,
        "episode": 8,
        "released": "2020-08-29",
        "overview": "Melody juggles her passion projects while Martell juggles the kids. Fractured friendships find an opportunity to mend, while Wanda seeks to keep those wounds wide open. LaTisha's live podcast event brings (almost) everyone together for a panel discussion"
      },
      {
        "id": "tvmaze:1919145",
        "title": "Boss Chick vs Wife Chick",
        "season": 2,
        "episode": 9,
        "released": "2020-09-05",
        "overview": "Kimmi gets the group together to get out the vote, but someone is a no-show. Melody visits Dr. Francis to talk about how Martell thinks she's putting career before their children. And, while Marsau is out of town, Tisha worries her marriage is in trouble."
      },
      {
        "id": "tvmaze:1922900",
        "title": "Whats Love Scott to Do with It?",
        "season": 2,
        "episode": 10,
        "released": "2020-09-12",
        "overview": "Kimmi throws Maurice a surprise party, but the real surprise is the shade that gets thrown between the Scotts and Melody. Meanwhile, Melody accuses Martell of being too friendly with a certain female, and Marsau makes a comment to Tisha that hits a new low."
      },
      {
        "id": "tvmaze:1990710",
        "title": "A Holt Lot of Drama",
        "season": 2,
        "episode": 11,
        "released": "2021-01-30",
        "overview": "Maurice holds a Black Business Town Hall in hopes of enacting change in Huntsville. Martell goes on an apology tour with his final stop to see a shocked Marsau and Tisha. After filing for divorce, Melody returns home, and things get heated with Martell."
      },
      {
        "id": "tvmaze:2014796",
        "title": "Martelling It Like It Is",
        "season": 2,
        "episode": 12,
        "released": "2021-02-06",
        "overview": "Kimmi's refusal to move to Scott Manor leaves LaTisha and Maurice equally frustrated. The Holts' divorce gains steam as Melody packs up her things and moves into a new house, but their public separation may have scared off business for Martell."
      },
      {
        "id": "tvmaze:2014797",
        "title": "A Not-So Wanda-ful Surprise",
        "season": 2,
        "episode": 13,
        "released": "2021-02-13",
        "overview": "Marsau is approached to be the general contractor of the 47 acres, but LaTisha is cautious. The Holts have another confrontation, but this one is about business. Kimmi throws Jaylin a graduation dinner only to have it ruined by an unexpected guest."
      },
      {
        "id": "tvmaze:2014798",
        "title": "Sanctioned!",
        "season": 2,
        "episode": 14,
        "released": "2021-02-20",
        "overview": "Marsau tells Tisha that Kimmi has sanctioned Wanda from future events. Melody is over all the drama and Martell's bad behavior. Tisha confronts Kimmi over banning her mom. Things get heated between Martell and Marcus over things the kids have said."
      },
      {
        "id": "tvmaze:2014799",
        "title": "To Martell the Truth",
        "season": 2,
        "episode": 15,
        "released": "2021-02-27",
        "overview": "Marsau lets Wanda know that her recent behavior has been unacceptable. Melody turns her heartbreak into song and brings someone in to talk to the kids about the divorce. The guys go camping, and after an accident, Martell reveals a shocking secret."
      },
      {
        "id": "tvmaze:2034892",
        "title": "Something's Scott to Give",
        "season": 2,
        "episode": 16,
        "released": "2021-03-06",
        "overview": "LaTisha throws an event aimed at empowering young Black girls, and Destiny sets up a retreat for the women. Wanda brings the drama when she questions Marsau about his accident, and Martell loses a business deal and feels like he's hitting rock bottom."
      },
      {
        "id": "tvmaze:2034893",
        "title": "Iama: Fix My Life",
        "season": 2,
        "episode": 17,
        "released": "2021-03-13",
        "overview": "While Marlene stirs up Melody's emotions by revealing the sex of Martell's child, Maurice and Kimmi confront Jaylin about career ambitions, and LaTisha surprises Marsau with a bit of romance. Later, Mel, Kimmi and LaTisha join Destiny on a girls' retreat."
      },
      {
        "id": "tvmaze:2034894",
        "title": "Checked Out",
        "season": 2,
        "episode": 18,
        "released": "2021-03-20",
        "overview": "While Marsau forces LaTisha to take a hard look at herself when it comes to her friendship with Melody, Martell seeks advice from Maurice on saving his failing marriage. Later, Melody is tricked into a surprise intervention with Martell."
      },
      {
        "id": "tvmaze:2034895",
        "title": "Blaque in Business!",
        "season": 2,
        "episode": 19,
        "released": "2021-03-27",
        "overview": "After Martell gets help from Dr. Francis, Marsau and LaTisha hold the soft opening of their cigar lounge, Blaque. Personalities collide, for better or worse, when Martell takes issue with Marcus' sexuality, leading to a volatile confrontation with Melody."
      },
      {
        "id": "tvmaze:2111756",
        "title": "Behind the Scenes",
        "season": 2,
        "episode": 20,
        "released": "2021-04-03",
        "overview": "Go behind-the-scenes of Love &amp; Marriage: Huntsville with never-before-seen footage, as the cast and producers reveal the juicy details behind some of the most legendary cast conflicts and expose the untold story of how the series began."
      },
      {
        "id": "tvmaze:2119748",
        "title": "Sisters-in-Brawl",
        "season": 3,
        "episode": 1,
        "released": "2021-07-17",
        "overview": "Marsau throws a surprise party for LaTisha's graduation, where both Kimmi and Marsau are confronted by Tisha's family. Destiny reveals a big secret she's been hiding from Melody and clashes with a button-pushing Martell. Melody gets an unexpected offer."
      },
      {
        "id": "tvmaze:2119749",
        "title": "47 Problems But This Land Ain't One",
        "season": 3,
        "episode": 2,
        "released": "2021-07-24",
        "overview": "Melody and Martell meet with a specialist to help with co-parenting. Maurice and Kimmi agree to try sitting down with Kiuwha again. LaTisha warns Marsau that if the baby rumors are true, their marriage is over. Martell and Vanessa have a tense exchange."
      },
      {
        "id": "tvmaze:2119750",
        "title": "Here Comes the Tea-Fanny",
        "season": 3,
        "episode": 3,
        "released": "2021-07-31",
        "overview": "Tisha and Marsau head for Cigar Week in Texas, leaving behind a frustrated Jaylin to run Blaque alone. Martell meets up with Melody's mom to talk about their issues. Melody brings Tiffany, who puts everyone in their feelings at Destiny's birthday party."
      },
      {
        "id": "tvmaze:2135297",
        "title": "Kimpossible Endeavor",
        "season": 3,
        "episode": 4,
        "released": "2021-08-07",
        "overview": "Tiffany tells Destiny she saw her ex out with another woman. Kimmi confronts Maurice about a rumor. Jaylin vents to Kimmi about his new career. Marsau and Tisha promote their new champagne in Houston, and Melody juggles a major business decision."
      },
      {
        "id": "tvmaze:2135298",
        "title": "Tacos with Beef",
        "season": 3,
        "episode": 5,
        "released": "2021-08-14",
        "overview": "Kimmi meets with Kiuwha and her husband to discuss co-parenting Monster. Destiny downloads Tisha on Tiffany being messy. Tisha surprises Marsau with couples counseling. Melody hosts a ladies' night where tensions rise between Destiny and Tiffany."
      },
      {
        "id": "tvmaze:2135299",
        "title": "Mar-Tale Signs",
        "season": 3,
        "episode": 6,
        "released": "2021-08-21",
        "overview": "Tension continues at Taco Tuesday between Melody and Destiny. Tisha wants to continue therapy, but Marsau refuses. Tiffany tries to apologize about bringing up Monster vaping, but no one will let it go. Wanda tries to get Melody and Martell back together."
      },
      {
        "id": "tvmaze:2152161",
        "title": "W.A.P. - Wanda Ain't Playing",
        "season": 3,
        "episode": 7,
        "released": "2021-09-04",
        "overview": "Chaos continues at Blaque, as Wanda has it out with Melody and Kimmi. Mel tells Destiny that her aggressive behavior is becoming a problem. Martell holds out hope on a property deal. Wanda presents a rumor that puts a wedge between Marsau and LaTisha."
      },
      {
        "id": "tvmaze:2152162",
        "title": "Sin City Showdown",
        "season": 3,
        "episode": 8,
        "released": "2021-09-11",
        "overview": "Melody shoots a music video for her song \"Tell Tale Signs.\" Tisha suggests they go to Las Vegas for their anniversary, and Maurice invites Louis and Tiffany to join them. In Vegas, tensions rise with Kimmi and Tisha over what Kimmi said to Wanda."
      },
      {
        "id": "tvmaze:2152163",
        "title": "Trouble in Paradise",
        "season": 3,
        "episode": 9,
        "released": "2021-09-18",
        "overview": "Melody and Martell are surprised to see each other in Vegas. Tiffany and Louis argue about their kids. Destiny arrives for adventure. Tisha confides in Maurice about the fallout from her surprise therapy session. Mel and Martell have it out in the desert."
      },
      {
        "id": "tvmaze:2152164",
        "title": "The Transparent Trap",
        "season": 3,
        "episode": 10,
        "released": "2021-09-25",
        "overview": "Melody and Martell continue to fight. Marsau tells the guys that LaTisha has lost her confidence. The Whitlows host a salacious drinking game. The ladies spend a night away from the guys, but the fun comes to a halt when Tiffany pushes Destiny's buttons."
      },
      {
        "id": "tvmaze:2177264",
        "title": "I Now Pronounce You Depressed",
        "season": 3,
        "episode": 11,
        "released": "2021-10-02",
        "overview": "Melody and Martell continue to fight. Marsau tells the guys that LaTisha has lost her confidence. The Whitlows host a salacious drinking game. The ladies spend a night away from the guys, but the fun comes to a halt when Tiffany pushes Destiny's buttons."
      },
      {
        "id": "tvmaze:2178057",
        "title": "BDE -- Big Depression Energy",
        "season": 3,
        "episode": 12,
        "released": "2021-10-09",
        "overview": "Martell and Maurice wonder if they're depressed. Tisha and Kimmi agree to leave their beef behind in Vegas. Martell tells Louis he should get full custody of the kids since Melody is so busy. Marsau doesn't want to address his depression, worrying Tisha."
      },
      {
        "id": "tvmaze:2178058",
        "title": "A Date With Destiny",
        "season": 3,
        "episode": 13,
        "released": "2021-10-16",
        "overview": "Martell and Marsau want to build on the 47 acres, causing Melody's ire to rise when she finds out that she's not the only Holt vying to build on the property. Destiny and Tiffany attempt to settle their differences. Tisha seeks more help from Dr. Francis."
      },
      {
        "id": "tvmaze:2200456",
        "title": "Softball Hard Shade",
        "season": 3,
        "episode": 14,
        "released": "2021-10-23",
        "overview": "Melody and Martell tackle co-parenting homework with the kids, then get derailed over an argument about who wanted the divorce. Tiffany and Louis celebrate their anniversary at the ballpark where they got married. Kimmi and Tisha squabble over a text."
      },
      {
        "id": "tvmaze:2200457",
        "title": "Wrecking Ball Wanda",
        "season": 3,
        "episode": 15,
        "released": "2021-10-30",
        "overview": "Martell takes his kids to visit his mom and doesn't like what she has to say. Maurice and Martell see Dr. Francis to discuss the stresses of work-life balance. LaTisha and Marsau host a charity race, and Wanda and Vanessa get into a verbal smackdown."
      },
      {
        "id": "tvmaze:2196744",
        "title": "No Holting Back",
        "season": 3,
        "episode": 16,
        "released": "2021-11-06",
        "overview": "Wanda and Vanessa continue their beef. The Comeback Group attempts to reconcile their differences but hits some turbulence when the Holts lose their cool. Marsau questions working with Martell. Melody confronts Martell about crashing her date."
      },
      {
        "id": "tvmaze:2196746",
        "title": "Melody and Martell of It All",
        "season": 3,
        "episode": 17,
        "released": "2021-11-13",
        "overview": "Gear up for the rest of Love &amp; Marriage: Huntsville Season 3 with this mid-season special, featuring Melody and Martell Holt. Now fully divorced, catch up on the Holts' latest heated arguments, touching family discussions, and solo business prospects."
      },
      {
        "id": "tvmaze:2196745",
        "title": "Pot Calling the Kettle Blaque",
        "season": 3,
        "episode": 18,
        "released": "2021-11-20",
        "overview": "Melody and Martell continue to argue over boundaries. Kimmi meets an old friend to address rumors she was a \"side chick.\" Marsau surprises Tisha with two strangers in their living room. Destiny and Maurice both surprise Kimmi with an indecent proposal."
      },
      {
        "id": "tvmaze:2217752",
        "title": "Lo-And-Be-Holt!",
        "season": 3,
        "episode": 19,
        "released": "2021-11-27",
        "overview": "At Melody's video premiere party, the ladies discuss their frustrations on how transparent Tiffany actually is, while Vanessa tries to avoid Wanda. Destiny pulls Melody aside for an unwelcome conversation, and Martell shows up uninvited and determined."
      },
      {
        "id": "tvmaze:2217753",
        "title": "Reunion: Part 1",
        "season": 3,
        "episode": 20,
        "released": "2021-12-04",
        "overview": "The cast reunites and is nervous to learn who's hosting since he \"knows where the bodies are buried.\" His shovel comes out quickly, but the silence is deafening as Melody is questioned about her past and Martell fesses up when asked about the other woman."
      },
      {
        "id": "tvmaze:2217754",
        "title": "Reunion: Part 2",
        "season": 3,
        "episode": 21,
        "released": "2021-12-11",
        "overview": "Martell is questioned about whether he would have chosen Melody or the other woman. Destiny talks divorce. Kimmi and Maurice disagree about a friend's role in infidelity. The Whitlows face the firing squad, and Marsau challenges their marriage expertise."
      },
      {
        "id": "tvmaze:2217755",
        "title": "Reunion: Part 3",
        "season": 3,
        "episode": 22,
        "released": "2021-12-18",
        "overview": "The ladies take center stage with Destiny and Melody addressing their fractured relationship. Kimmi and Tisha accuse each other of misgivings, putting their friendship in jeopardy. Vanessa and Wanda get into a heated exchange over sex tape allegations."
      },
      {
        "id": "tvmaze:2276767",
        "title": "Social Mania, Part 1",
        "season": 3,
        "episode": 23,
        "released": "2022-02-26",
        "overview": "From shocking secrets revealed to clapping back, we're exposing the biggest relationship breakdowns and fractured friendships that this unfiltered cast has put online for the world to see, as top experts explore how social media shapes the show."
      },
      {
        "id": "tvmaze:2277710",
        "title": "Social Mania, Part 2",
        "season": 3,
        "episode": 24,
        "released": "2022-03-05",
        "overview": "Top experts reveal who's flooding their inboxes with the latest rumors and what they know about all the infidelity allegations, as we continue to break down how the cast uses the internet to make the series one of the most unique in reality television."
      },
      {
        "id": "tvmaze:2277711",
        "title": "Reunion: The Director's Cut",
        "season": 3,
        "episode": 25,
        "released": "2022-03-12",
        "overview": "Executive producer Carlos King gives viewers a behind the scenes look at the making of the Love and Marriage Reunion. Carlos brings insight to the most explosive moments that happened at the reunion while revealing never-before-seen footage to fans."
      },
      {
        "id": "tvmaze:2284744",
        "title": "Mar-so Messy",
        "season": 4,
        "episode": 1,
        "released": "2022-03-19",
        "overview": "Marsau's social media post has everyone talking, putting Maurice on the defensive as Kimmi confronts the cheating rumors. Melody confides in Kimmi about issues with Destiny and LaTisha. The Scotts gather for a family dinner to discuss Marsau's actions."
      },
      {
        "id": "tvmaze:2295824",
        "title": "You Scotts to Be Lying",
        "season": 4,
        "episode": 2,
        "released": "2022-03-26",
        "overview": "People are continuing to talk about Marsau's messy social media post. Melody hosts her pajama party where Tisha's cousin, KeKe, offers surprising information. Tiffany and Stormi clash."
      },
      {
        "id": "tvmaze:2299892",
        "title": "Read It and Weep",
        "season": 4,
        "episode": 3,
        "released": "2022-04-02",
        "overview": "The fallout from Marsau's post, Melody's party and the reunion have many in the group hoping to clear the air. Martell samples his new wine and hosts a book signing, where he navigates a disappointing setback. Tisha, Marsau and Mel bond with their kids."
      },
      {
        "id": "tvmaze:2299893",
        "title": "KeKe, Do You Love Me?",
        "season": 4,
        "episode": 4,
        "released": "2022-04-09",
        "overview": "The fallout from Marsau's post, Melody's party and the reunion have many in the group hoping to clear the air. Martell samples his new wine and hosts a book signing, where he navigates a disappointing setback. Tisha, Marsau and Mel bond with their kids."
      },
      {
        "id": "tvmaze:2299894",
        "title": "Coins2Make, Not Friends2Fake",
        "season": 4,
        "episode": 5,
        "released": "2022-04-16",
        "overview": "LaTisha and KeKe leave things unresolved. Martell asks Marsau to go back into business. Destiny discloses her financial situation to Maurice. Tisha tells Wanda about what happened with KeKe. Melody and Destiny meet to hash out their issues."
      },
      {
        "id": "tvmaze:2299895",
        "title": "I Wanda Have a KeKe",
        "season": 4,
        "episode": 6,
        "released": "2022-04-23",
        "overview": "Destiny visits Martell's bachelor pad and tells him about her sit-down with Melody, while Melody downloads Kimmi and Stormi over lunch. Tisha lets Wanda know that KeKe talked behind her back, which causes Wanda to take matters into her own hands."
      },
      {
        "id": "tvmaze:2318856",
        "title": "My Bloody Galentine's",
        "season": 4,
        "episode": 7,
        "released": "2022-05-07",
        "overview": "Kimmi gets Destiny's side of the story after learning that Tisha is Melody's \"frenemy.\" Marsau tells Maurice that Martell wants back into Scholt. Kimmi feels how fractured the group is and puts together a Galentine's event, and it goes left."
      },
      {
        "id": "tvmaze:2317867",
        "title": "You Reap What You (Mar)Sau",
        "season": 4,
        "episode": 8,
        "released": "2022-05-14",
        "overview": "The Galentine's day melee continues. Martell is upset he is not invited to Jaylin's housewarming. Wanda asks Marsau about new social media rumors and then reports to Tisha. Martell invites Louis to a guys' trip to Atlanta. Tisha confronts Marsau."
      },
      {
        "id": "tvmaze:2317868",
        "title": "Housewarming, Cold Shoulder",
        "season": 4,
        "episode": 9,
        "released": "2022-05-21",
        "overview": "The Galentine's day melee continues. Martell is upset he is not invited to Jaylin's housewarming. Wanda asks Marsau about new social media rumors and then reports to Tisha. Martell invites Louis to a guys' trip to Atlanta. Tisha confronts Marsau."
      },
      {
        "id": "tvmaze:2329548",
        "title": "Destined for a Storm",
        "season": 4,
        "episode": 10,
        "released": "2022-05-28",
        "overview": "Wanda's behavior at Jaylin's housewarming has Maurice questioning Marsau. Melody hosts an event for her new skincare line where KeKe pulls Kimmi aside to hash things out. The Scott couples go on a double date and discuss the issues with Wanda and KeKe."
      },
      {
        "id": "tvmaze:2331216",
        "title": "Mission Impossible - Road to Eutaw",
        "season": 4,
        "episode": 11,
        "released": "2022-06-04",
        "overview": "Tiffany wants to find her biological dad and heads to Eutaw, AL, with Melody looking for answers. Marsau and Tisha head to Bessemer to check out Wanda's food truck and menu. Wanda's family grills Marsau about the latest infidelity rumors."
      },
      {
        "id": "tvmaze:2331217",
        "title": "What You Wanda Do About It?",
        "season": 4,
        "episode": 12,
        "released": "2022-06-11",
        "overview": "At Wanda's food tasting, LaTisha and KeKe get into it about Marsau's cheating rumors. Kimmi tries to get to the bottom of Destiny and Melody's issue. Tiffany tells Louis about what happened in Eutaw. The fellas head to Atlanta for a Guys' Trip 2.0."
      },
      {
        "id": "tvmaze:2348981",
        "title": "Wine and Grind",
        "season": 4,
        "episode": 13,
        "released": "2022-06-18",
        "overview": "Martell brings the guys to Atlanta for his wine event, and they hit the strip club. Back home, Tisha and Kimmi question his intentions, and Tiffany complains to Melody that Louis is needy. The guys go to a rage room where Louis admits sexual frustrations."
      },
      {
        "id": "tvmaze:2353639",
        "title": "Old Atlanta, New Tricks",
        "season": 4,
        "episode": 14,
        "released": "2022-06-25",
        "overview": "Martell's wine launch ends in a family fight. Kimmi, LaTisha and Tiffany react to what happened on the guys' trip to Atlanta. Tisha has a session with Dr. Francis. Marlene doesn't choose Martell's side, and Kimmi fills Melody in on all things Martell."
      },
      {
        "id": "tvmaze:2354415",
        "title": "Trick or Re-Treat",
        "season": 4,
        "episode": 15,
        "released": "2022-07-02",
        "overview": "Tisha invites Kimmi and Tiffany on a couples' retreat. While Maurice becomes upset about the idea, Louis hopes Dr. Francis will help with their issues, and Tisha tricks Marsau into going. Martell and Melody are face to face for the first time in months."
      },
      {
        "id": "tvmaze:2376810",
        "title": "Whit-low Priorities",
        "season": 5,
        "episode": 1,
        "released": "2022-09-10",
        "overview": "Martell and Melody reconnect. She admits to Stormi that she is cautiously moving forward with him, while Martell discusses things with his mom. Scotts 1.0, 2.0 and the Whitlows go on a couples' retreat where the Whitlows are called out by Dr. Francis."
      },
      {
        "id": "tvmaze:2376811",
        "title": "\"Mar\" Say It Ain't \"Sau\"",
        "season": 5,
        "episode": 2,
        "released": "2022-09-17",
        "overview": "Dr. Francis dives deep into the issues the individual couples have in their marriages, and the Whitlows are unhappy with his analysis of their marriage. Melody confronts Martell's mom about past remarks. Louis and Tisha open up about recent losses."
      },
      {
        "id": "tvmaze:2376812",
        "title": "Wanda Be Startin' Something",
        "season": 5,
        "episode": 3,
        "released": "2022-09-24",
        "overview": "The Whitlows flee the couples' retreat before it ends. Back in Huntsville, the guys blow off steam at the pool hall. Later, Destiny's secret boyfriend pops up, and she tells Martell the rumors about him and Melneka. Melody is fed up with Ms. Wanda."
      },
      {
        "id": "tvmaze:2406404",
        "title": "A Lowdown Dirty Shade",
        "season": 5,
        "episode": 4,
        "released": "2022-10-01",
        "overview": "Tisha meets with a supposedly \"changed\" Martell about working for her at Scholt. Vanessa questions Martell's motives in defending the Scotts. Melneka is shocked by rumors of an affair. Destiny's store relaunches with an unwelcome guest in attendance."
      },
      {
        "id": "tvmaze:2401625",
        "title": "Holt 'Em Back!",
        "season": 5,
        "episode": 5,
        "released": "2022-10-08",
        "overview": "Stormi and Melody are unwelcome as they make a grand entrance at Destiny's relaunch event. Tisha tries to break things up as Melody confronts Wanda about her behavior. Martell and Marsau have a heated exchange."
      },
      {
        "id": "tvmaze:2409251",
        "title": "We Need a Resolution",
        "season": 5,
        "episode": 6,
        "released": "2022-10-15",
        "overview": "Tisha and Marsau are at odds after the melee at Madonni, as they disagree about how to handle Wanda and Martell. Stormi and Destiny attempt to squash their beef. Martell meets with Mel about getting the Comeback Group back together. Funky Dineva visits."
      },
      {
        "id": "tvmaze:2421180",
        "title": "Don't Call It a Comeback",
        "season": 5,
        "episode": 7,
        "released": "2022-10-22",
        "overview": "The Comeback Group discusses Wanda and moving forward without drama."
      },
      {
        "id": "tvmaze:2420029",
        "title": "We Wanda Mark the Boundaries",
        "season": 5,
        "episode": 8,
        "released": "2022-10-29",
        "overview": "Scotts 2.0 discuss what to do about Mark and Wanda. Keke opens up about her past to Melody. Marsau and Maurice attempt to talk sense into Mark. Destiny talks to Tisha about her love life and Madonni fallout. Wanda faces the heat."
      },
      {
        "id": "tvmaze:2464614",
        "title": "To Be or Not to Be...at Peace",
        "season": 5,
        "episode": 9,
        "released": "2022-11-05",
        "overview": "The guys bury the hatchet over basketball. Stormi wants to host a \"Peace Party,\" but Melody is apprehensive. Marsau talks to Courtney about commercial real estate. Kimmi makes a shocking health discovery. Destiny feels targeted at Stormi's event."
      },
      {
        "id": "tvmaze:2424007",
        "title": "Preaching to the Liar",
        "season": 5,
        "episode": 10,
        "released": "2022-11-12",
        "overview": "Melody and Destiny hash it out for better or worse. Marsau surprises Tisha with a romantic gesture and lays out his criteria for a new therapist. Tisha throws a Period Party for their daughters. Kimmi and Maurice stop by to reveal Kimmi's health issue."
      },
      {
        "id": "tvmaze:2425081",
        "title": "DESTINed for Better",
        "season": 5,
        "episode": 11,
        "released": "2022-11-19",
        "overview": "Melody sets boundaries with Destiny and Martell. Kimmi discusses her prognosis with her family. Melody and Martell take a family trip to Destin, FL, with the kids and struggle to stay on the same page when it comes to expectations."
      },
      {
        "id": "tvmaze:2432718",
        "title": "99 Problems, a Beach Ain't One",
        "season": 5,
        "episode": 12,
        "released": "2022-11-26",
        "overview": "The Holts enjoy a fun day on the beach in Destin. Melody is surprised when Martell invites the Scotts to join them. Martell opens up to Marsau about his regrets. Melody and Tisha discuss healing. Kimmi's diagnosis forces her to make a difficult decision."
      },
      {
        "id": "tvmaze:2442160",
        "title": "To Be or Yacht to Be",
        "season": 5,
        "episode": 13,
        "released": "2022-12-03",
        "overview": "In Florida, a rain delay might ruin more than Melody's planned family fun on the water. Melody triggers Martell, and he reciprocates by testing her boundaries, while Mama Holt gives insight into Martell's upbringing. Back home, Maurice confides in Marsau."
      },
      {
        "id": "tvmaze:2442161",
        "title": "Sau Much Disrespect",
        "season": 5,
        "episode": 14,
        "released": "2022-12-10",
        "overview": "Marsau's meeting with Melody backfires. Martell scouts a location for his Huntsville Inest Wine event with Chris Fletcher. Chris reveals details about the Atlanta trip with Marsau. The Comeback Group gathers, and Kimmi reveals her cancer diagnosis."
      },
      {
        "id": "tvmaze:2451021",
        "title": "The Cold and the Beautiful!",
        "season": 5,
        "episode": 15,
        "released": "2022-12-17",
        "overview": "After Melody confides in Stormi, Martell's love life becomes the hot topic as he hosts his Inest Wine event in Huntsville. Kimmi stuns her friends as she reveals her cancer diagnosis. Melody attempts to set boundaries with an irate Martell."
      },
      {
        "id": "tvmaze:2446090",
        "title": "Reunion, Part 1",
        "season": 5,
        "episode": 16,
        "released": "2022-12-31",
        "overview": "The cast gathers for their third reunion, with everyone on guard and a few ready to throw shade. No one is spared from the hot seat, but the spotlight shines bright on Marsau and LaTisha as they navigate questions about infidelity in their marriage."
      },
      {
        "id": "tvmaze:2446091",
        "title": "Reunion, Part 2",
        "season": 5,
        "episode": 17,
        "released": "2023-01-07",
        "overview": "The Scotts talk cheating allegations. Keke discusses addiction, Melody's Christmas party and Tisha. The group weighs in on Wanda and Melody's feud. Destiny and Stormi address their relationship and fan criticism. Destiny and Kimmi have a tense moment."
      },
      {
        "id": "tvmaze:2446092",
        "title": "Reunion, Part 3",
        "season": 5,
        "episode": 18,
        "released": "2023-01-14",
        "overview": "Emotions run high and tears flow as Melody and Destiny debate the demise of their friendship, Melody and Martell discuss regrets, a shocking pregnancy is revealed, and Kimmi shares updates on her cancer journey."
      },
      {
        "id": "tvmaze:2502533",
        "title": "A Holt and a Prayer",
        "season": 6,
        "episode": 1,
        "released": "2023-04-08",
        "overview": "In the premiere episode, \"A Holt and a Prayer,\" Melody comes out of seclusion to help Kimmi celebrate a milestone in her cancer journey. Stormi and her husband, Courtney, have an emotional disagreement. Martell reveals a new love interest but still wants Melody to pray about their relationship."
      },
      {
        "id": "tvmaze:2502663",
        "title": "You've Scotts to Chill",
        "season": 6,
        "episode": 2,
        "released": "2023-04-15",
        "overview": "Stormi confronts Melody at Kimmi's party. LaTisha presents her cousin with a business offer. Kimmi prepares for surgery. Martell and Melody address questions about their dating lives and custody case. Keke and LaTisha meet one-on-one and box it out."
      },
      {
        "id": "tvmaze:2502664",
        "title": "Hasta La Tisha, Baby!",
        "season": 6,
        "episode": 3,
        "released": "2023-04-22",
        "overview": "Tisha questions if there's a future in her relationship with Keke. Marsau's business move and communication misstep cause marital discord. Papa Scott comes to town. Tisha hosts a girls' spa night where Keke is called on the carpet for her past actions."
      },
      {
        "id": "tvmaze:2532312",
        "title": "Blaque-xploitation",
        "season": 6,
        "episode": 4,
        "released": "2023-04-29",
        "overview": "Melody bails when the ladies exchange loaded words at spa night. Martell enjoys a day out with the Scott brothers. Marsau's new business partner provides words of wisdom. Kimmi offers LaTisha a workspace. LaTisha pitches an initiative to the Core Six."
      },
      {
        "id": "tvmaze:2531168",
        "title": "Speak Now, or Forever Holt Your Peace",
        "season": 6,
        "episode": 5,
        "released": "2023-05-06",
        "overview": "Stormi and Courtney tighten the reins at Canvas Beauty. The Scotts host a pop-up at Blaque. Marsau and Martell study and recap the Core Six meeting. Melody throws a birthday party for her daughters. Martell and Melody experience a co-parenting setback."
      },
      {
        "id": "tvmaze:2531169",
        "title": "Being Lay-Tea-Like",
        "season": 6,
        "episode": 6,
        "released": "2023-05-13",
        "overview": "Kimmi requests Maurice's support with enforcing household rules and disciplining Monster. Stormi and Keke meet up one-on-one and work on their energy. Maurice and Martell trade words of advice about parenting. The ladies learn about etiquette at high tea."
      },
      {
        "id": "tvmaze:2531170",
        "title": "My Shere Amour",
        "season": 6,
        "episode": 7,
        "released": "2023-05-20",
        "overview": "Melody tries to calm the tension between Keke and Tiffany. Stormi, Kimmi and Tisha discuss the tea party and Tiffany's hypocritical behavior. The collective steps out to celebrate Martell's Upscale Magazine cover with his girlfriend, Shere Whitfield."
      },
      {
        "id": "tvmaze:2555864",
        "title": "Selec-Tiff Memory",
        "season": 6,
        "episode": 8,
        "released": "2023-05-27",
        "overview": "Tiffany addresses Stormi about stirring the pot and recaps her talk with Sheree. The Whitlows have an ultrasound. Maurice and Kimmi hit a co-parenting hurdle with Monster. LaTisha and Keke discuss Tiffany's shady behavior. Martell confronts Tiffany."
      },
      {
        "id": "tvmaze:2555866",
        "title": "Ready to Pop (Off)",
        "season": 6,
        "episode": 9,
        "released": "2023-06-03",
        "overview": "Marsau and Tisha prep for a move. Tiffany downloads Louis on her standoff with Martell and Marsau. Kimmi and Maurice navigate a tough side effect from her cancer treatment. Louis confronts the guys at the Whitlows' baby shower. Tiffany has a health scare."
      },
      {
        "id": "tvmaze:2558823",
        "title": "Unpaid in Full",
        "season": 6,
        "episode": 10,
        "released": "2023-06-10",
        "overview": "Tiffany's baby shower ends when she is rushed to the hospital. The Scholt team breaks ground on a new project. Martell explores a business venture in the world of fashion. The Core Six continue to bump heads during a planning meeting for the Blaque Expo."
      },
      {
        "id": "tvmaze:2572576",
        "title": "Bettie Blues",
        "season": 6,
        "episode": 11,
        "released": "2023-06-17",
        "overview": "Courtney talks to Marsau about working with family amid the Junior drama; Melody tells Nail about her new boo and reveals her final thoughts on the expo to Tisha; Stormi's aunt erupts over her son's firing and sister Bettie's sharp tongue."
      },
      {
        "id": "tvmaze:2569900",
        "title": "We Scott a Monster Issue",
        "season": 6,
        "episode": 12,
        "released": "2023-06-24",
        "overview": "Stormi tries to resolve family conflict; therapy prompts Martell to have a heart-to-heart with his younger brother; The Scotts have a date night and discuss Maurice and Kimmi's co-parenting issues; Maurice holds a family meeting."
      },
      {
        "id": "tvmaze:2574237",
        "title": "Holt-ing Court",
        "season": 6,
        "episode": 13,
        "released": "2023-07-01",
        "overview": "Kimmi and Maurice have a disagreement over past issues with Kiuwha; Tisha is hurt by Keke's lack of support and broken promises; Melody and Martell recap their court battle in a he said/she said; Kimmi expresses her true feelings to Kiuwha."
      },
      {
        "id": "tvmaze:2593594",
        "title": "Kiuwhaaaaat?",
        "season": 6,
        "episode": 14,
        "released": "2023-07-08",
        "overview": "Kimmi reaches a level of understanding with Kiuwha; Stormi and Melody discuss the state of their friendship; Maurice and Monster have a heart-to-heart; Courtney confides in his mom; Marsau and Stormi butt heads before the Blaque Business Expo."
      },
      {
        "id": "tvmaze:2587044",
        "title": "Give Blaque to the Community",
        "season": 6,
        "episode": 15,
        "released": "2023-07-15",
        "overview": "The collective hosts a Blaque Business Expo for the community of Huntsville, Ala.; Courtney finally opens up to Stormi and shares his reservations about having more children; heated words are exchanged when Tiffany invites the ladies out for lunch."
      },
      {
        "id": "tvmaze:2629258",
        "title": "Innocent Until Proven Keke",
        "season": 7,
        "episode": 1,
        "released": "2023-09-16",
        "overview": "Keke appears on Crimestoppers, sparking rumors and speculations. Tiffany plans a baby reveal party. Martell struggles with life after divorce. Kimmi has difficulty with her sex life post-cancer treatments, annoying Maurice. The Blaque Expo faces backlash."
      },
      {
        "id": "tvmaze:2643431",
        "title": "Sau Lady Like?",
        "season": 7,
        "episode": 2,
        "released": "2023-09-23",
        "overview": "Melody tries to convince KeKe to cut Tisha some slack. Stormi and Tiffany have a heart to heart. The Fletchers \"check\" the Scotts over dinner. The baby reveal party runs into some obstacles. Melody has reached her limit with Marsau's mouth."
      },
      {
        "id": "tvmaze:2647191",
        "title": "Melody vs. Marsau: Round 5",
        "season": 7,
        "episode": 3,
        "released": "2023-09-30",
        "overview": "Tisha is unreceptive to feedback at the baby reveal. Kimmi and Maurice discuss misinformation spreading around the group. Mel and Nell question the Scotts' business practices. KeKe talks health issues with Ameen. Melody's meeting with Marsau takes a turn."
      },
      {
        "id": "tvmaze:2651217",
        "title": "Town Hall Downfall",
        "season": 7,
        "episode": 4,
        "released": "2023-10-07",
        "overview": "Kimmi hosts a town hall for the group to air out their grievances. Marsau's shady comments leave many feeling disrespected. Tiffany spends quality time with Louis and opens up about her postpartum struggles. Martell breaks ground on a new project."
      },
      {
        "id": "tvmaze:2656818",
        "title": "Sex, Lies and Videotape",
        "season": 7,
        "episode": 5,
        "released": "2023-10-14",
        "overview": "Martell is offended by Marsau's lack of respect. Tisha helps her mini moguls with their business. Kimmi gets sound advice from a friend. The Scotts shoot a promo video for their \"Bet on Blaque\" fundraiser. KeKe spills the tea over lunch, shocking Melody."
      },
      {
        "id": "tvmaze:2663351",
        "title": "Where There's Smoke There's Marsau",
        "season": 7,
        "episode": 6,
        "released": "2023-10-21",
        "overview": "Melody is shocked by Marsau's alleged affair. LaTisha's business website faces controversy. Maurice just wants his sex life back. The Scotts' plan for Bet on Blaque is a bust. KeKe and LaTisha's relationship reaches a point of no return."
      },
      {
        "id": "tvmaze:2667084",
        "title": "Not About to KeKe and Haha",
        "season": 7,
        "episode": 7,
        "released": "2023-10-28",
        "overview": "KeKe's assault on Tisha takes everyone by surprise. Marsau and Stormi hash out their differences. Kimmi receives a surprise. Martell, Chris and Courtney meet up for a workout. Melody pops up on KeKe and makes a shocking proposal."
      },
      {
        "id": "tvmaze:2670228",
        "title": "Holt Her Accountable",
        "season": 7,
        "episode": 8,
        "released": "2023-11-04",
        "overview": "Melody seeks vindication for KeKe. LaTisha walks out on a girls' date. Stormi and KeKe discuss Tiffany's offensive comments. Melody receives a long-awaited answer and plans an intimate ceremony. Martell feels slighted when Nell decides to support Melody."
      },
      {
        "id": "tvmaze:2677863",
        "title": "Rodger That!",
        "season": 7,
        "episode": 9,
        "released": "2023-11-11",
        "overview": "The Fletchers have a dancing date and discuss Martell getting loud with Nell. Stormi calls out Tiffany for shading KeKe in a recent interview. Melody hosts an intimate name change ceremony. The Fletchers' family dinner gets off to a rocky start."
      },
      {
        "id": "tvmaze:2683650",
        "title": "A Stormi Is Brewing",
        "season": 7,
        "episode": 10,
        "released": "2023-11-18",
        "overview": "The Fletcher family dinner ends in chaos; while Martell moves into a new home, Melody recruits her cousin to find a new love; Stormi brings together KeKe and Tiffany to put their beef on the table, but someone brings a plus one."
      },
      {
        "id": "tvmaze:2687694",
        "title": "Whitlows Stay or Whitlows Go",
        "season": 7,
        "episode": 11,
        "released": "2023-11-25",
        "overview": "KeKe and Tiffany clear the air; Martell accuses the Fletchers of picking sides; Tisha tells Kimmi she might be pregnant; Chris is concerned when he sees a different side of his son; the Whitlows contemplate their new reality."
      },
      {
        "id": "tvmaze:2691656",
        "title": "Peace Before the Storm",
        "season": 7,
        "episode": 12,
        "released": "2023-12-02",
        "overview": "Kimmi puts pressure on the Scott brothers to finish construction; Stormi seeks an apology from LaTisha; Chris informs Nell that their son needs help; Kimmi, LaTisha and Melody clear up misunderstandings."
      },
      {
        "id": "tvmaze:2697051",
        "title": "Houston, Here Comes the Problem",
        "season": 7,
        "episode": 13,
        "released": "2023-12-09",
        "overview": "The Scotts and Beasleys try to settle their differences on a double date. Kimmi hires some extra help for her sex life. The Fletchers invite everyone out for a big announcement. Melody isn't having it with Martell. Marsau and Maurice upset their wives."
      },
      {
        "id": "tvmaze:2701687",
        "title": "Feeling Protected and Using Protection",
        "season": 7,
        "episode": 14,
        "released": "2023-12-16",
        "overview": "Before they can get through their first meal in Houston, Maurice is in the hot seat for his recent behavior online; Marsau can't get past Tisha taking a pregnancy test; Nell shocks Chris with news that she invited KeKe to join their trip."
      },
      {
        "id": "tvmaze:2707793",
        "title": "Houston, We Have a Keke!",
        "season": 7,
        "episode": 15,
        "released": "2023-12-23",
        "overview": "The Fletchers host a day of Team Building, but things take an unexpected turn when KeKe surprises the group; Martell finally addresses the Melody Rodgers Fans, and Tisha and Mel get on the same page; KeKe refuses to leave."
      },
      {
        "id": "tvmaze:2717893",
        "title": "Family, Fidelity & Fish Fries",
        "season": 7,
        "episode": 16,
        "released": "2023-12-30",
        "overview": "Stormi brings her family together in Mississippi for a fish fry; Martell extends an olive branch to Melody in hopes of peace; Kimmi has a big surprise for Maurice; Marsau searches for answers as he continues to doubt Tisha's fidelity."
      },
      {
        "id": "tvmaze:2717894",
        "title": "Reunion Part 1",
        "season": 7,
        "episode": 17,
        "released": "2024-01-06",
        "overview": "Carlos King hosts part one of the reunion; LaTisha and Stormi trade jabs over business practices; the gang discusses Kimmi's lack of libido and Maurice's lack of tact; everybody confronts KeKe about the threesome accusations before bombs are dropped."
      },
      {
        "id": "tvmaze:2717895",
        "title": "Reunion Part 2",
        "season": 7,
        "episode": 18,
        "released": "2024-01-13",
        "overview": "LaTisha and KeKe trade accusations of infidelity; Carlos confronts Martell about his dating life and lingering feelings for Melody; Tiffany and Lou discuss their future on the show; Stormi's mother confronts Melody."
      },
      {
        "id": "tvmaze:2717896",
        "title": "Reunion Part 3",
        "season": 7,
        "episode": 19,
        "released": "2024-01-20",
        "overview": "Martell is forced to explain his mystery guest in Houston and doubles down on his accusations against Melody. Stormi's mother and Melody hash out their beef. Marsau and Tisha discuss the pregnancy test. Marsau claims KeKe has one more thing she's hiding."
      },
      {
        "id": "tvmaze:2833206",
        "title": "Arrested Redevelopment",
        "season": 8,
        "episode": 1,
        "released": "2024-05-04",
        "overview": "The fallout from Martell's arrest begins, with Melody increasing security around her home after hearing the news; Tisha finds out Destiny was betrayed by someone in their inner circle; Melody's event gets crashed by unexpected guests."
      },
      {
        "id": "tvmaze:2837693",
        "title": "Mar-Tell-All Interview",
        "season": 8,
        "episode": 2,
        "released": "2024-05-11",
        "overview": "Sunni and Moses try to defend their relationship. The Scott brothers pop up on Martell for an intervention. Sunni crashes Kimmi and Tisha's lunch date. KeKe goes on the defensive when she's confronted by Stormi and then Melody for telling tales."
      },
      {
        "id": "tvmaze:2837694",
        "title": "New Beefcakes on the Block",
        "season": 8,
        "episode": 3,
        "released": "2024-05-18",
        "overview": "Melody talks through Martell's arrest with Nell; Courtney and Stormi look to add a new baby and a classic car to the family; an old friend of the Beasleys pops up with a new man; Melody gathers Kimmi and Tisha together before confronting them."
      },
      {
        "id": "tvmaze:2837695",
        "title": "Keep My Wife's Name Out Your Mouth",
        "season": 8,
        "episode": 4,
        "released": "2024-05-25",
        "overview": "Kimmi and Tisha inform Destiny about their meeting with Sunni. The Scott Brothers warn Moses that a social media storm is on the way. The Beasleys discover that someone is secretly still married. Christopher confronts Martell. Moses has a date with Destiny."
      },
      {
        "id": "tvmaze:2879282",
        "title": "Waiting to ExWife",
        "season": 8,
        "episode": 5,
        "released": "2024-06-01",
        "overview": "Moses and Destiny have a heated argument; Tisha gets into it at the gym with Tricia. Melody hangs out with her single friends; Ken is ready to move to the next step in his relationship."
      },
      {
        "id": "tvmaze:2881796",
        "title": "No More Nice Tish",
        "season": 8,
        "episode": 6,
        "released": "2024-06-08",
        "overview": "Ken pushes Tricia to finalize her divorce, then hits up Courtney for advice. Everyone celebrates Nell's birthday. Tricia reveals that she is still married, and they have questions. Tisha has one too many drinks and starts arguments with Nell and Stormi."
      },
      {
        "id": "tvmaze:2881797",
        "title": "Love & Lockup",
        "season": 8,
        "episode": 7,
        "released": "2024-06-15",
        "overview": "Tisha's liquid courage makes an appearance at Nell's birthday party. Latricia breaks a sweat with Martell and finds out why he was acting so weird towards her. Marsau and Tisha are at odds. Melody confronts Marsau about his comments on Martell's arrest."
      },
      {
        "id": "tvmaze:2881798",
        "title": "Sunni's Destiny Has Arrived",
        "season": 8,
        "episode": 8,
        "released": "2024-06-22",
        "overview": "Melody confronts Marsau about his comments on Martell's arrest; Stormi hosts her long-awaited Lovers and Friends event; Sunni finally confronts Destiny; Stormi learns there are multiple warrants out for her arrest."
      },
      {
        "id": "tvmaze:2881799",
        "title": "Beyond Scared Stormi",
        "season": 8,
        "episode": 9,
        "released": "2024-06-29",
        "overview": "Stormi turns herslf into the police; Destiny recounts her encounter with Sunni at the Lovers and Friends gala; Latricia comes clean about her relationship with Ken to her sister; Ken finally confronts Martell; Stormi stands up to her mom."
      },
      {
        "id": "tvmaze:2923152",
        "title": "New Kids on the Cell Block",
        "season": 8,
        "episode": 10,
        "released": "2024-07-06",
        "overview": "Stormi learns startling information regarding Martell and Latricia's past. Chris and Martell attempt to sell Sunni and Moses a home in Huntsville. Maurice and Kimmi had a double date with Sunni and Moses. The Fletchers confront their children during a family supper."
      },
      {
        "id": "tvmaze:2926061",
        "title": "Nell-raiser",
        "season": 8,
        "episode": 11,
        "released": "2024-07-13",
        "overview": "Melody mentors her mentor; against Nell's wishes, the Fletcher family meets with Dr. Francis to work on some of their family dysfunction; Marsau gives unwanted advice to an old friend; Tricia meets with her ex to discuss divorce."
      },
      {
        "id": "tvmaze:2926062",
        "title": "Martelling Tales",
        "season": 8,
        "episode": 12,
        "released": "2024-07-20",
        "overview": "Destiny reacts to the news that Sunni and Moses may be moving to Huntsville. Stormi and Destiny press Tricia about conflicting stories. Tisha and Marsau face issues with Blaque. Tricia admits to Ken that she went to Martell's house."
      },
      {
        "id": "tvmaze:2960277",
        "title": "Forecast Sunni or Shady?",
        "season": 8,
        "episode": 13,
        "released": "2024-08-17",
        "overview": "Kimmi and Maurice host a tasting; Tricia finds herself in the hot seat as Marsau recounts meeting with her husband; Melody announces a girls' trip; Tisha insists Destiny join the vacation; Melody and Sunni meet up and discuss girl code in the group."
      },
      {
        "id": "tvmaze:2960278",
        "title": "Girls Getaway... From Me",
        "season": 8,
        "episode": 14,
        "released": "2024-08-24",
        "overview": "The ladies arrive in St. Thomas for their girl's trip and are surprised to see that Melody invited Sunni to join them; once at the villa, Nell confronts Melody about a perceived slight; Kimmi and Tisha complain to Melody."
      },
      {
        "id": "tvmaze:2979992",
        "title": "Head Beach in Charge",
        "season": 8,
        "episode": 15,
        "released": "2024-09-07",
        "overview": "Melody and Martell's feud comes to a head after Martell's arrest, and everyone struggles to remain neutral; an unexpected love triangle emerges as Stormi reconnects with an old friend; Destiny returns with a splash."
      },
      {
        "id": "tvmaze:3027937",
        "title": "Tropical Stormi",
        "season": 9,
        "episode": 1,
        "released": "2024-11-02",
        "overview": "Destiny and Melody's showdown continues as they discuss respectful cheating. LaTisha and Chanita's friction comes to a head. Maurice and Monster have father-son time. Stormi confronts Melody about her fans' behavior, awakening the Scorpio in her."
      },
      {
        "id": "tvmaze:3035287",
        "title": "Throuple in Paradise",
        "season": 9,
        "episode": 2,
        "released": "2024-11-09",
        "overview": "The ladies connect and clash on their trip to paradise. Stormi's arrest is discussed. Latricia leaves vacation early amidst talk that she's a liar. Sunni opens up about trying for a baby. The guys hang and discuss past hookups and current marriages."
      },
      {
        "id": "tvmaze:3035288",
        "title": "Signed, Sealed, Divorced: I'm Yours",
        "season": 9,
        "episode": 3,
        "released": "2024-11-16",
        "overview": "The ladies' St. Thomas adventure wraps up with continued tension for Destiny and Sunni, but also with apologies and resolutions for the other women. Tricia finally meets with her husband Marques to discuss divorce, with her boyfriend Ken in tow."
      },
      {
        "id": "tvmaze:3035289",
        "title": "Steering into Scandal",
        "season": 9,
        "episode": 4,
        "released": "2024-11-23",
        "overview": "When Nell confronts Melody about how she was treated on the girls' trip, Melody turns the tables. Ken and Tricia vent about Marques dragging out the divorce. As the gang speculates about his DUI arrest, Maurice faces an icy Kimmi."
      },
      {
        "id": "tvmaze:3035290",
        "title": "Big Diss Energy",
        "season": 9,
        "episode": 5,
        "released": "2024-11-30",
        "overview": "Martell vents to Destiny about a recent Marsau interview and lack of support since his arrest. Melody questions Kimmi about Maurice's DUI arrest, while Tisha pushes Marsau to check on his brother. Tempers flare as Martell and Marsau face off at the park."
      },
      {
        "id": "tvmaze:3058444",
        "title": "These Lips Don't Lie",
        "season": 9,
        "episode": 6,
        "released": "2024-12-07",
        "overview": "Marsau and Martell continue hurling insults at each other. Melody asks Tisha about red lipstick on Maurice's mugshot. Destiny and Chris try to talk sense into Marsau and Martell. Melody finally asks Tricia tough questions about her meet-up with Martell."
      },
      {
        "id": "tvmaze:3058445",
        "title": "Game a' Thrown",
        "season": 9,
        "episode": 7,
        "released": "2024-12-14",
        "overview": "Martell refuses to apologize to Marsau and Tisha. Tricia notarizes her divorce papers but doesn't want to marry Ken just yet. Melody confronts Marsau and Tisha about what they said about her at field day. Marques is awkward and acts strange at the BBQ."
      },
      {
        "id": "tvmaze:3064383",
        "title": "Stirring the Pot Over Drinks",
        "season": 9,
        "episode": 8,
        "released": "2024-12-21",
        "overview": "Ken and Tricia argue with Marques at a family party, while Melody confronts Maurice about his DUI. Chris insists that Nell continue with their vow renewal. Kimmi confronts Melody about her insinuations over Maurice's arrest and the lipstick on his mouth."
      },
      {
        "id": "tvmaze:3064384",
        "title": "Open House, Closed Mouths",
        "season": 9,
        "episode": 9,
        "released": "2024-12-28",
        "overview": "Tricia and Ken discuss their future. Maurice thinks Melody and Martell are lashing out due to unresolved trauma. Martell visits a therapist. Tricia attends Martell's open house and wants to know why Chris told Martell to DM her -- and so does Nell."
      },
      {
        "id": "tvmaze:3077409",
        "title": "A Marsoldier vs a Melometer",
        "season": 9,
        "episode": 10,
        "released": "2025-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3077410",
        "title": "It Don't Make Scents",
        "season": 9,
        "episode": 11,
        "released": "2025-01-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3077411",
        "title": "Shady Now, Sunni Later",
        "season": 9,
        "episode": 12,
        "released": "2025-01-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3077412",
        "title": "Vow or Never",
        "season": 9,
        "episode": 13,
        "released": "2025-01-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3122807",
        "title": "Reunion Part I: \"Ar-rest and Relaxation\"",
        "season": 9,
        "episode": 14,
        "released": "2025-02-01",
        "overview": "The cast gathers in LA for the reunion. Destiny has a wardrobe emergency. Martell faces off with Melody and the Scotts over the revenge porn allegations. Carlos interrogates Maurice about his DUI. Kimmi confronts Melody over her infidelity insinuations."
      },
      {
        "id": "tvmaze:3122808",
        "title": "Reunion Part II: \"Tricia Finally Mar-tells the Truth\"",
        "season": 9,
        "episode": 15,
        "released": "2025-02-08",
        "overview": "Kimmi and Melody argue over Melody's double standards. Destiny claims Martell and Melody groomed her for a threesome. Sunni joins the cast on stage to hash out her issues with Destiny. Ken and Tricia set the record straight about her history with Martell."
      },
      {
        "id": "tvmaze:3122809",
        "title": "Reunion Part III: \"Out with a Bang\"",
        "season": 9,
        "episode": 16,
        "released": "2025-02-15",
        "overview": "Ken sets boundaries for Martell and Tricia. The ladies address the Girls Trip. Tricia's ex, Marques, literally gives Melody her flowers. The gang entertains a surprise special guest and says goodbye to a former castmate."
      },
      {
        "id": "tvmaze:3287858",
        "title": "NDAs and DNA",
        "season": 10,
        "episode": 1,
        "released": "2025-07-19",
        "overview": "The group deals with fallout after the trip to LA, including Martell's social media and Chris' comments about NDAs. Ken and Marques make peace, but tensions erupt when Marques shows up at the house uninvited. And the Fletchers lives are upended."
      },
      {
        "id": "tvmaze:3289247",
        "title": "I Am Ken-ough",
        "season": 10,
        "episode": 2,
        "released": "2025-07-26",
        "overview": "Ken and Tricia recount Marques' outburst. Martell and Destiny talk about the future. Scott Manor is finally taking shape. LaTisha is nervous about MJ and college. Maurice tries to talk to Marques. Tricia, Ken and Marques face off in explosive fashion."
      },
      {
        "id": "tvmaze:3317115",
        "title": "Maur Or Less The Favorite",
        "season": 10,
        "episode": 3,
        "released": "2025-08-02",
        "overview": "After an altercation turns physical, Ken gets defensive with his friends about his relationship. Nell is annoyed that Tisha refuses to be transparent. Maurice learns Jaylin sees Marsau as a father figure and argues with Marsau."
      },
      {
        "id": "tvmaze:3317116",
        "title": "Cowboys and NDAs",
        "season": 10,
        "episode": 4,
        "released": "2025-08-09",
        "overview": "Drama takes over Tricia's western-themed birthday party when Nell confronts Kimmi and Tisha about their lack of transparency, and the men corner Chris about his NDA comments. Tensions rise when Tisha steps in and demands Chris tells the truth."
      },
      {
        "id": "tvmaze:3317117",
        "title": "Nell To The No",
        "season": 10,
        "episode": 5,
        "released": "2025-08-16",
        "overview": "Nell hatches a plan to help Lance with the baby, whether Chris likes it or not. Destiny refuses to take sides between the Scotts and Martell. Trish convinces an irate Nell to talk it out with Tisha, but their meeting goes left."
      },
      {
        "id": "tvmaze:3317118",
        "title": "Martell Me No Lies",
        "season": 10,
        "episode": 6,
        "released": "2025-08-23",
        "overview": "Nell and Tisha try to mend fences. Kimmi questions if reasoning with Martell is a lost cause. Marsau warns Tisha not to trust Destiny. Maurice confronts Martell about his accusations of infidelity against Marsau and himself."
      },
      {
        "id": "tvmaze:3342092",
        "title": "BeTwan Two Worlds",
        "season": 10,
        "episode": 7,
        "released": "2025-09-06",
        "overview": "Tempers flare as the guys try to get to the bottom of the beef between Marsau and Martell. Lance and Destiny agree to be friends. Nell is upset that Destiny wants to date her godson, Twon. Nell agrees to meet up with Destiny to work through their issues."
      },
      {
        "id": "tvmaze:3344517",
        "title": "Humpsville, AL",
        "season": 10,
        "episode": 8,
        "released": "2025-09-13",
        "overview": "Maurice goads Marsau and Martell into meeting. Ken threatens to move out after he and Tricia hit a rough patch. Marsau spends time with Maci. Tricia vents to Sharon and Destiny. Martell and Marsau attempt to end their war of words."
      },
      {
        "id": "tvmaze:3429843",
        "title": "Ken We Fix It?",
        "season": 10,
        "episode": 9,
        "released": "2025-11-15",
        "overview": "The new episodes begin with Marsau and Martell having settled their beef and calling a truce, inspiring the Fletchers to throw a get-together game night for the group. Meanwhile, Destiny goes on a date with Nell's godson, and Latricia and Ken have a heart to heart that prompts Latricia to begin a powerful healing journey through therapy."
      },
      {
        "id": "tvmaze:3429844",
        "title": "Like A Bat Out of Nell",
        "season": 10,
        "episode": 10,
        "released": "2025-11-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3429845",
        "title": "Wanda-ful Chaos",
        "season": 10,
        "episode": 11,
        "released": "2025-11-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3436547",
        "title": "Destiny's Men-ifesto",
        "season": 10,
        "episode": 12,
        "released": "2025-12-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3436548",
        "title": "Huntsville Christmas After Dark",
        "season": 10,
        "episode": 13,
        "released": "2025-12-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3452569",
        "title": "Nell in a Handbasket",
        "season": 10,
        "episode": 14,
        "released": "2025-12-27",
        "overview": ""
      }
    ]
  }
}