{
  "meta": {
    "id": "tvmaze:64507",
    "type": "series",
    "name": "Watson",
    "description": "In Watson a year after the death of his friend and partner Sherlock Holmes at the hands of Moriarty, Dr. John Watson resumes his medical career as the head of a clinic dedicated to treating rare disorders. Watson's old life isn't done with him, though — Moriarty and Watson are set to write their own chapter of a story that has fascinated audiences for more than a century. Watson is a medical show with a strong investigative spine, featuring a modern version of one of history's greatest detectives as he turns his attention from solving crimes to addressing the greatest mystery of all: illness, and the ways it disrupts our lives.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/590/1476556.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/590/1476556.jpg",
    "videos": [
      {
        "id": "tvmaze:3429743",
        "title": "Never Been CRISPR'd",
        "season": 2,
        "episode": 10,
        "released": "2025-12-15",
        "overview": "Watson's biohacker friend Hobie returns when he rushes his new girlfriend to the Holmes Clinic after they partake in a gene-editing experiment that goes wrong; Watson becomes suspicious of Sherlock."
      },
      {
        "id": "tvmaze:3443454",
        "title": "TBA",
        "season": 2,
        "episode": 11,
        "released": "2026-03-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3446869",
        "title": "TBA",
        "season": 2,
        "episode": 12,
        "released": "2026-03-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3446870",
        "title": "TBA",
        "season": 2,
        "episode": 13,
        "released": "2026-03-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3429742",
        "title": "Shannon Says Bex Loves Micah",
        "season": 2,
        "episode": 9,
        "released": "2025-12-08",
        "overview": "Watson and the fellows help Laila's son Micah, who was injured in a car accident while pursuing his crush, Bex, with the help of his AI chatbot."
      },
      {
        "id": "tvmaze:3029874",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2025-01-26",
        "overview": "Dr. John Watson resumes his medical career as the head of a clinic dedicated to treating rare disorders six months after the death of his friend and partner, Sherlock Holmes, at the hands of Moriarty."
      },
      {
        "id": "tvmaze:3029926",
        "title": "Redcoat",
        "season": 1,
        "episode": 2,
        "released": "2025-02-16",
        "overview": "Watson and the fellows investigate the perplexing case of a family man with a bullet lodged in his head who insists he is a Scottish soldier and seems to be hiding something nefarious; Watson looks for clues to whom his estranged wife Mary is dating."
      },
      {
        "id": "tvmaze:3126163",
        "title": "Wait for the Punchline",
        "season": 1,
        "episode": 3,
        "released": "2025-02-23",
        "overview": "Watson and the fellows treat a comic who collapsed at an open mic night; the team becomes concerned when Watson collapses and suffers another traumatic brain injury."
      },
      {
        "id": "tvmaze:3126164",
        "title": "Patient Question Mark",
        "season": 1,
        "episode": 4,
        "released": "2025-03-02",
        "overview": "When Sasha discovers a link between her current patient and a cadaver she dissected during medical school, the team traces the case to Amish country."
      },
      {
        "id": "tvmaze:3126166",
        "title": "The Man with the Glowing Chest",
        "season": 1,
        "episode": 5,
        "released": "2025-03-09",
        "overview": "Watson takes a major ethical risk when he decides to treat a sickle cell patient with an unorthodox surgery; Ingrid struggles to get her sister admitted to her spinal project."
      },
      {
        "id": "tvmaze:3126165",
        "title": "The Camgirl Inquiry",
        "season": 1,
        "episode": 6,
        "released": "2025-03-16",
        "overview": "Stephens musters the courage to ask Watson to help him when his camgirl suddenly collapses during a video call; the team must act quickly to locate her before it's too late; Watson grapples with guilt over Sherlock's death."
      },
      {
        "id": "tvmaze:3126167",
        "title": "Teeth Marks",
        "season": 1,
        "episode": 7,
        "released": "2025-03-23",
        "overview": "While Watson and the team help a woman whose memory resets every three minutes, Watson struggles with auditory hallucinations and questions whether someone is behind his current decline; Moriarty plots his next move."
      },
      {
        "id": "tvmaze:3126168",
        "title": "A Variant of Unknown Significance",
        "season": 1,
        "episode": 8,
        "released": "2025-03-30",
        "overview": "Watson runs into an old friend of Sherlock Holmes when her son Angus is admitted to UHOP for temporary paralysis; the fellows help Watson after he grows fond of Angus, pursuing various leads to find a cure to his illness."
      },
      {
        "id": "tvmaze:3143493",
        "title": "Take a Family History",
        "season": 1,
        "episode": 9,
        "released": "2025-04-13",
        "overview": "Ingrid's lies come back to haunt her when her sister Gigi needs to be treated by the team after she develops side effects to the secret treatments Ingrid put her through; Watson and Mary bond over a tragedy."
      },
      {
        "id": "tvmaze:3139948",
        "title": "The Man with the Alien Hand",
        "season": 1,
        "episode": 10,
        "released": "2025-04-20",
        "overview": "Watson is thrown into a detective case when he is unsure whether the patient he is treating for one of the most rare ailments in the world, alien hand syndrome, is guilty of pushing his brother in front of a bus to his death."
      },
      {
        "id": "tvmaze:3180962",
        "title": "The Dark Day Deduction",
        "season": 1,
        "episode": 11,
        "released": "2025-04-27",
        "overview": "Watson confronts a traumatic event from his Army days that still weighs heavily on him after his friend's wife reaches out begging for help when her husband is seemingly having a psychotic break; Shinwell is asked for one last favor by Moriarty."
      },
      {
        "id": "tvmaze:3180965",
        "title": "Your Life's Work, Part 1",
        "season": 1,
        "episode": 12,
        "released": "2025-05-04",
        "overview": "When part of the team falls ill after becoming targets of a sinister plot, it becomes an all-hands-on-deck situation to save them before it's too late; Watson announces a new ambitious project that he has been working on."
      },
      {
        "id": "tvmaze:3180967",
        "title": "Your Life's Work, Part 2",
        "season": 1,
        "episode": 13,
        "released": "2025-05-11",
        "overview": "Watson and the team are faced with an impossible choice when two lives hang in the balance, but they only have one vial of antidote available; Shinwell races to help the team; Watson goes head-to-head with Moriarty."
      },
      {
        "id": "tvmaze:3301110",
        "title": "A Son in the Oven",
        "season": 2,
        "episode": 1,
        "released": "2025-10-13",
        "overview": "Watson and the fellows spring back into action when Mary's mother accidentally poisons herself while suffering from a rare form of dementia that is progressing with impossible speed; Sherlock Holmes resurfaces after being presumed dead."
      },
      {
        "id": "tvmaze:3333364",
        "title": "Back from the Dead",
        "season": 2,
        "episode": 2,
        "released": "2025-10-20",
        "overview": "When a microbiology university researcher returns from an expedition to Siberia, she and her team members fall ill from a possible revived pathogen; Watson catches up with his friend Sherlock Holmes after finding out he is alive."
      },
      {
        "id": "tvmaze:3333365",
        "title": "Expletive Deleted",
        "season": 2,
        "episode": 3,
        "released": "2025-10-27",
        "overview": "Watson and the team work alongside Laila to help a patient named Maxine, a 30-year-old who looks 10."
      },
      {
        "id": "tvmaze:3333366",
        "title": "Happy When It Rains",
        "season": 2,
        "episode": 4,
        "released": "2025-11-03",
        "overview": "Watson and the team jump into action when four people become infected with a flesh-eating bacterium; Shinwell searches for meaning as a nursing student; Adam's wedding to Lauren risks being halted."
      },
      {
        "id": "tvmaze:3334080",
        "title": "Lucky",
        "season": 2,
        "episode": 5,
        "released": "2025-11-10",
        "overview": "While visiting another hospital, Watson becomes convinced that a man is suffering from locked-in syndrome and has been mistaken for a coma patient for over a decade; Sherlock is back in town and is staying with Watson."
      },
      {
        "id": "tvmaze:3424208",
        "title": "Buying Time",
        "season": 2,
        "episode": 6,
        "released": "2025-11-17",
        "overview": "Watson and the fellows race against time to save the life of Xavier, a 21-year-old athlete with a fast-growing, seemingly incurable cancer; Mycroft Holmes lets Watson know his team's work at UHOP may no longer have funding available."
      },
      {
        "id": "tvmaze:3424209",
        "title": "Giant Steps",
        "season": 2,
        "episode": 7,
        "released": "2025-11-24",
        "overview": "Watson's father, Hamish, visits UHOP to introduce Watson and the fellows to his protégé, Annabelle, a saxophone prodigy with musically induced blackouts."
      },
      {
        "id": "tvmaze:3429741",
        "title": "Livvy Sees The Doctor",
        "season": 2,
        "episode": 8,
        "released": "2025-12-01",
        "overview": "Watson and the fellows are taken hostage by a man with a bomb strapped to his chest who is desperate to find a cure for his 9-year-old daughter's illness."
      }
    ]
  }
}