{
  "meta": {
    "id": "tvmaze:2488",
    "type": "series",
    "name": "Masters of Illusion",
    "description": "In Masters of Illusion, the world's greatest magicians and illusionists perform magic in front of a live studio audience. There are no camera or computer tricks involved and you'll see tricks such as women turning into tigers, birds appearing from nowhere and sleight of hands in the blink of an eye! From one amazing trick to another, the performances are shown to you non-stop in a spectacular show filled with reality-twisting, mind-blowing magic.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/485/1213504.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/485/1213504.jpg",
    "videos": [
      {
        "id": "tvmaze:3441234",
        "title": "Impressions, Birdmen, and the Magic Mirror",
        "season": 11,
        "episode": 17,
        "released": "2025-12-05",
        "overview": "Featured magicians include Andi Gladwin, Alex Ramon, Anna DeGuzman, Eric Jones, Naathan Phan, Maxence Vire, Mike Hammer, Hakan Berg, Stuart MacDonald, Nick Dupoch and Xavier Mortimer."
      },
      {
        "id": "tvmaze:187487",
        "title": "Jaws of Death",
        "season": 1,
        "episode": 1,
        "released": "2014-08-01",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jan Rouven, Jared &amp; Raja, Michael Finney, Nathan Burton, Michael Grandinetti, Jonathon Pendragon, Rob Lake and Spencer Horsman."
      },
      {
        "id": "tvmaze:187488",
        "title": "Blindfold",
        "season": 1,
        "episode": 2,
        "released": "2014-08-08",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Michael Giles; Rob Lake; Michael Grandinetti; Rick Thomas; Erix Logan; Aaron Crow."
      },
      {
        "id": "tvmaze:187489",
        "title": "Vanish in Mid Air",
        "season": 1,
        "episode": 3,
        "released": "2014-08-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rob Lake, Nathan Burton, Michael Grandinetti, Michael Giles, Eric Buss, Johnny Ace Palmer, Spencer Horsman."
      },
      {
        "id": "tvmaze:187490",
        "title": "Selbit Sawing",
        "season": 1,
        "episode": 4,
        "released": "2014-08-22",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jan Rouen, Jonathon Pendragon, Michael Turco, Ed Alonzo, Christopher Hart, David Zirbel, Michael Grandinetti."
      },
      {
        "id": "tvmaze:187491",
        "title": "Walk Through Steel",
        "season": 1,
        "episode": 5,
        "released": "2014-08-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jarrett &amp; Raja, Murray SawChuck, Tom Burgoon, Rick Thomas, Michael Giles, David &amp; Dania and Michael Turco."
      },
      {
        "id": "tvmaze:187492",
        "title": "Chained",
        "season": 1,
        "episode": 6,
        "released": "2014-09-05",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Jonathan Pendragon, Hillel, Farrell Dillon, Drexus and Jan Rouven."
      },
      {
        "id": "tvmaze:187493",
        "title": "Levitation",
        "season": 1,
        "episode": 7,
        "released": "2014-09-12",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tony Chapek, Erix Logan &amp; Sara Maya, Johnny Ace Palmer, Nathan Burton, Ed Alonzo, Christopher Hart and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:187494",
        "title": "Under Water",
        "season": 1,
        "episode": 8,
        "released": "2014-09-19",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rob Lake, Nathan Burton, Eric Buss, Johnny Ace Palmer and Spencer Horsman."
      },
      {
        "id": "tvmaze:187495",
        "title": "Evil Met His Match",
        "season": 1,
        "episode": 9,
        "released": "2014-09-26",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jarrett &amp; Raja, Murray SawChuck, Tom Burgoon, Rick Thomas, Michael Giles, David &amp; Dania, Matt Marcy and Michael Turco."
      },
      {
        "id": "tvmaze:187496",
        "title": "Behind the Illusion",
        "season": 1,
        "episode": 10,
        "released": "2015-01-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alana, Drexus, Murray SawChuck, Arthur Trace, Shimshi, Dana Daniels, Rick Thomas and Michael Turco."
      },
      {
        "id": "tvmaze:187497",
        "title": "Twist",
        "season": 1,
        "episode": 11,
        "released": "2015-01-16",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rick Thomas, Farrell Dillon, Mac King, Dana Daniels and Aaron Radatz."
      },
      {
        "id": "tvmaze:187498",
        "title": "Close Up",
        "season": 1,
        "episode": 12,
        "released": "2015-01-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rick Thomas, Alana, Michael Finney, Christopher Hart, Danny Cole, Farrel Dillon and Jeff McBride."
      },
      {
        "id": "tvmaze:187499",
        "title": "Quick Change",
        "season": 1,
        "episode": 13,
        "released": "2015-02-06",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jonathon Pendragon, Erix Logan, Ed Alonzo, Joel Ward, Zelandra and Keelan &amp; Shereen."
      },
      {
        "id": "tvmaze:187500",
        "title": "Spinning the Classics",
        "season": 2,
        "episode": 1,
        "released": "2015-07-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Barry &amp; Stuart, Sos and Victoria, Murray SawChuck, Michael Turco and Rick Thomas."
      },
      {
        "id": "tvmaze:187501",
        "title": "Jet Engines, Magic Ducks and Missing Torsos",
        "season": 2,
        "episode": 2,
        "released": "2015-07-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tommy Wind, Aaron Radatz, Ed Alonzo, Danny Cole, Nathan Phan, Arthur Trace, Greg Gleason, and Les Arnold and Dazzle."
      },
      {
        "id": "tvmaze:187502",
        "title": "Metamorphosis and Imagine Dragons",
        "season": 2,
        "episode": 3,
        "released": "2015-07-24",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Piff the Magic Dragon, Michael Grandinetti, Chipper Lowell, Michael Turco, Nathan Burton and Jeff McBride."
      },
      {
        "id": "tvmaze:187503",
        "title": "Perception, Piranhas and Pendragon",
        "season": 2,
        "episode": 4,
        "released": "2015-07-31",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tommy Wind, Jason Andrews, Mark Bennick, Barry and Stuart, Murray SawChuck, Farrell Dillion and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:187548",
        "title": "Big Cats, Dream Girls and Fun Physics",
        "season": 2,
        "episode": 5,
        "released": "2015-08-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, John Gabriel, Tom Burgoon, Greg Gleason, Ed Alonzo, Rich Thomas and Mike Caveney."
      },
      {
        "id": "tvmaze:187549",
        "title": "Very Sharp Objects and Flying Pianos",
        "season": 2,
        "episode": 6,
        "released": "2015-08-14",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Mark Bennick, Michael Griffin, Tommy Wind, Les Arnold and Dazzle, Jarrett and Raja, John Shyrock and Jason Andrews."
      },
      {
        "id": "tvmaze:187550",
        "title": "Quick Change Duo, Box of Knives and Floating Beauty",
        "season": 2,
        "episode": 7,
        "released": "2015-08-21",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jarrett and Raja, Farrell Dillon, Jonathan Pendragon, Sos and Victoria, Fielding West and John Gabriel."
      },
      {
        "id": "tvmaze:187551",
        "title": "Gravity Defiers, Compactors and Transformations",
        "season": 2,
        "episode": 8,
        "released": "2015-08-28",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Tom Burgoon, Greg Frewin, Arthur Trace, Matt Marcy, Les Arnold and Dazzle and Tommy Wind."
      },
      {
        "id": "tvmaze:204514",
        "title": "Spinning the Classics... Too!",
        "season": 2,
        "episode": 9,
        "released": "2015-09-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonso, Rick Thomas, Michael Grandinetti, Johnny Ace Palmer, Barry and Stuart, Les Arnold &amp; Dazzle, Michael Turco."
      },
      {
        "id": "tvmaze:209162",
        "title": "Deadly Desires and Non-sensory Sensibilities",
        "season": 2,
        "episode": 10,
        "released": "2015-09-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Michael Turco, Mike Caveney, Angela Funovits and Barry and Stuart."
      },
      {
        "id": "tvmaze:211861",
        "title": "Dancing Tables and Dodging Daggers",
        "season": 2,
        "episode": 11,
        "released": "2015-09-25",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Titou, Aaron Radatz, Tommy Wind, Farrell Dillon, Piff the Magic Dragon, Fielding West and Greg Gleason."
      },
      {
        "id": "tvmaze:215938",
        "title": "Razzle Dazzle!",
        "season": 2,
        "episode": 12,
        "released": "2015-10-02",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Michael Turco, Tommy Wind, Jarrett &amp; Raja, Barry and Stuart, Christopher Hart and Les Arnold and Dazzle."
      },
      {
        "id": "tvmaze:215939",
        "title": "Separating Mind, Body and Spirit",
        "season": 2,
        "episode": 13,
        "released": "2015-10-02",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include John Gabriel, Ed Alonzo, Murray SawChuck, Circe Martinez, David &amp; Leeman, Vixen and Greg Gleason."
      },
      {
        "id": "tvmaze:759494",
        "title": "Techno Magic, Quick Change and a Guillotine",
        "season": 3,
        "episode": 1,
        "released": "2016-05-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines — all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Barry and Stuart, Jason Bishop, Michael Grandinetti, Jonathan Pendragon, David and Dania, Bill Cook and Les Arnold and Dazzle"
      },
      {
        "id": "tvmaze:759495",
        "title": "A Magical Smorgasbord",
        "season": 3,
        "episode": 2,
        "released": "2016-05-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines — all in front of a studio audience. Magicians featured in this episode include Tommy Wind, Murray Sawchuck, Trigg Watson, Farrell Dillion, Jason Bird, Tom Burgoon and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:783033",
        "title": "Classic Magic Mashups",
        "season": 3,
        "episode": 3,
        "released": "2016-06-03",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Les Arnold and Dazzle, Chris Randall, Jason Bishop, Johnny Ace Palmer, Sittah and Greg Frewin."
      },
      {
        "id": "tvmaze:792351",
        "title": "Beatbox Magic and The Human Beverage Dispenser",
        "season": 3,
        "episode": 4,
        "released": "2016-06-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Frewin, Adam Wylie, Eric Buss, Michael Grandinetti, and Barry and Stuart."
      },
      {
        "id": "tvmaze:811741",
        "title": "Magical Metamorphoses and Masked Men",
        "season": 3,
        "episode": 5,
        "released": "2016-06-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Erix Logan, Farrell Dillon, Matt Marcy, The Shocker, Bill Cook, RJ Cantu, and Sittah."
      },
      {
        "id": "tvmaze:821618",
        "title": "Invisible Cards, Multipliers, and One Chipper",
        "season": 3,
        "episode": 6,
        "released": "2016-06-24",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Mark Bennick, Bill Cook, Michael Grandinetti, Adam Wylie, The Shocker, Tom Burgoon and Chipper Lowell."
      },
      {
        "id": "tvmaze:834965",
        "title": "Extreme Levitations, Mind Melds, and Water Into Wine",
        "season": 3,
        "episode": 7,
        "released": "2016-07-08",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jonathan Pendragon, Eric Buss, Naathan Phan, Barry &amp; Stuart, Chris Randall, David &amp; Dania."
      },
      {
        "id": "tvmaze:845131",
        "title": "Altered States, Great Escapes, and The Return of the Mask",
        "season": 3,
        "episode": 8,
        "released": "2016-07-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Murray SawChuck, Michael Grandinetti, Greg Gleason, The Shocker and Sittah."
      },
      {
        "id": "tvmaze:861808",
        "title": "Money Matters, Separation Anxiety, and One Ninja Turtle",
        "season": 3,
        "episode": 9,
        "released": "2016-07-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Bill Cook, Chipper Lowell, Titou, Greg Gleason, Greg Frewin and Jason Bishop."
      },
      {
        "id": "tvmaze:899916",
        "title": "Body Piercings, Mind Over Matter, and Those Crazy Cards",
        "season": 3,
        "episode": 10,
        "released": "2016-09-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Gleason, Jonathan Pendragon, Jarrett &amp; Raja, Chris Korn, Jen Kramer and Barry &amp; Stuart."
      },
      {
        "id": "tvmaze:905504",
        "title": "Magic in a Flash, From Thin Air, and One Nail",
        "season": 3,
        "episode": 11,
        "released": "2016-09-16",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jonathan Pendragon, Tommy Wind, Aaron Radatz, Jarrett &amp; Raja, Barry &amp; Stuart, Trigg Watson and Murray SawChuck."
      },
      {
        "id": "tvmaze:910897",
        "title": "A Loaf of Bread, A Magic Dollhouse, and Bound by Music",
        "season": 3,
        "episode": 12,
        "released": "2016-09-23",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Bill Cook, Titou, Tom Burgoon, Sittah, Erix Logan and Naathan Phan."
      },
      {
        "id": "tvmaze:921188",
        "title": "Magic Pup, When Doves Fly, and The Physical Transformations",
        "season": 3,
        "episode": 13,
        "released": "2016-09-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Mark Bennick, Nathan Burton, Jason Bishop &amp; Gizmo, Tom Burgoon, Naathan Phan, Jason Bird, Chris Randall, Tommy Wind, and Greg Gleason."
      },
      {
        "id": "tvmaze:1119251",
        "title": "Crazy, Crazy Cards and Silly Silhouettes",
        "season": 4,
        "episode": 1,
        "released": "2017-06-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Jibrizy, Joshua Jay, Farrell Dillon, Billy Kidd, Bill Cook and Xavier Mortimer."
      },
      {
        "id": "tvmaze:1119252",
        "title": "Turbo Tech Magic and Card Connection",
        "season": 4,
        "episode": 2,
        "released": "2017-06-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jason Bird, Sos Petrosyan, Leon Etienne, Chipper Lowell, Jason Bishop and Tony Chapek."
      },
      {
        "id": "tvmaze:1208836",
        "title": "Manipulation, Transformation and Two Impalers",
        "season": 4,
        "episode": 3,
        "released": "2017-07-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Barry and Stuart, Eric Jones, Murray SawChuck, Jonathan Pendragon, Chris Randall and Neil Croswell."
      },
      {
        "id": "tvmaze:1213775",
        "title": "Maximum Separation and Chipper's Chipper",
        "season": 4,
        "episode": 4,
        "released": "2017-07-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Chipper Lowell, Billy Kidd, Bill Cook, Matt Marcy and Greg Gleason &amp; Farrel Dillon."
      },
      {
        "id": "tvmaze:1208837",
        "title": "Technological Beverages and Rapid-Fire Cards",
        "season": 4,
        "episode": 5,
        "released": "2017-07-14",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include RJ Cantu, Bill Cook, Tommy Wind, Jarrett &amp; Raja, Jibrizy, Scott Pepper, Chris Randall and Jeff McBride."
      },
      {
        "id": "tvmaze:1208838",
        "title": "Warped, Wacky and Weird",
        "season": 4,
        "episode": 6,
        "released": "2017-07-21",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jason Bishop, Barry and Stuart, Ed Alonzo, Nathan Burton, Farrell Dillon, Shaw Farquhar and Les Arnold &amp; Dazzle."
      },
      {
        "id": "tvmaze:1242370",
        "title": "Dancing Broomstick, Fast Coins, and One Giant Buzzsaw",
        "season": 4,
        "episode": 7,
        "released": "2017-07-28",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Billy Kidd, Xavier Mortimer, Jarrett and Raja, Nathan Burton, Chris Korn, Leon Etienne and Greg Gleason."
      },
      {
        "id": "tvmaze:1208839",
        "title": "From the Exotic to Defying the Law of Physics",
        "season": 4,
        "episode": 8,
        "released": "2017-08-04",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Barry and Stuart, Joshua Jay, Jeff McBride, Murray SawChuck, Chris Randall and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:1259412",
        "title": "Spiked Table and Spiked Faces",
        "season": 4,
        "episode": 9,
        "released": "2017-08-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillion, Barry and Stuart, Jonathan Pendragon, Draven, Naathan Phan, Adam Wylie, Eric Jones, Jibrizy and Greg Gleason."
      },
      {
        "id": "tvmaze:1261728",
        "title": "Mirror Mirror and Money Movers",
        "season": 4,
        "episode": 10,
        "released": "2017-08-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Scott Pepper, Chris Randall, Joshua Jay, Murray SawChuck, Billy Kidd and Greg Gleason."
      },
      {
        "id": "tvmaze:1277348",
        "title": "Old School with a Twist",
        "season": 4,
        "episode": 11,
        "released": "2017-09-08",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Michael Grandinetti, Chris Korn, Jeff McBride, Barry and Stuart, Kyle Marlett, Bill Cook, Adam Wylie and Greg Gleason."
      },
      {
        "id": "tvmaze:1280932",
        "title": "The Things You Can Do with Umbrellas",
        "season": 4,
        "episode": 12,
        "released": "2017-09-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Scott Pepper, Jason Bishop, Tommy Wind, Jarret and Raja, Murray SawChuck, Adam Wylie and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:1285730",
        "title": "Of Mice, Men and a Kidd",
        "season": 4,
        "episode": 13,
        "released": "2017-09-22",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Michael Grandinetti, Nathaan Phan, Billy Kidd, Chris Randall, Tommy Wind, Ed Alonzo and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:1452706",
        "title": "It's All in the Cards",
        "season": 5,
        "episode": 1,
        "released": "2018-06-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rick Smith Jr., Ed Alonzo &amp; Samantha Bell, Joel Meyers, Keelan Leyser &amp; Matt Daniel-Baker, Shoot Ozawa, and Andi Gladwin."
      },
      {
        "id": "tvmaze:1481386",
        "title": "A Self-Inflicted Slice, Creepy Crawlies and Passing Glass",
        "season": 5,
        "episode": 2,
        "released": "2018-07-06",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Michael Grandinetti, George Iglesias, Jeki Yoo, The Surrealists, Henok Negash and Eric Jones."
      },
      {
        "id": "tvmaze:1482990",
        "title": "The Fastest Illusion in the World... and More!",
        "season": 5,
        "episode": 3,
        "released": "2018-07-13",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Titou, Greg Frewin, Spidey, Billy Kidd, Jibrizy, Chris Randall, George Iglesias and Murray SawChuck."
      },
      {
        "id": "tvmaze:1487328",
        "title": "Fast Hands, Classic Tricks, New Twists",
        "season": 5,
        "episode": 4,
        "released": "2018-07-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chris Funk, Tommy Wind, Shoot Ogawa, Joel Meyers, Bill Cook, Nathan Burton, Farrell Dillion, Chris Randall and Greg Gleason."
      },
      {
        "id": "tvmaze:1493618",
        "title": "Twisted Classics",
        "season": 5,
        "episode": 5,
        "released": "2018-07-27",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Les Arnold &amp; Dazzle, Chris Korn, Naathan Phan, The Alchemist, Bill Cook, Eric Jones and Xavier Mortimer."
      },
      {
        "id": "tvmaze:1500247",
        "title": "The One with a Floating Orb and One Nasty Power Saw",
        "season": 5,
        "episode": 6,
        "released": "2018-08-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nathan Burton, Jeki Yoo, Murray SawChuck, Michael Grandinetti, RJ Cantu, Billy Kidd and Joseph Gabriel."
      },
      {
        "id": "tvmaze:1502776",
        "title": "Broken Glass, A Box of Swords and Cards That Really Cut",
        "season": 5,
        "episode": 7,
        "released": "2018-08-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Eric Jones, Chris Funk, Chipper Lowell, Greg Gleason, Shoot Ogawa, Titou and Rick Smith Jr."
      },
      {
        "id": "tvmaze:1512486",
        "title": "The Mind Freaks and The Million Dollar Trick",
        "season": 5,
        "episode": 8,
        "released": "2018-08-31",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Joseph Gabriel, Ed Alonzo, Andi Gladwin, Joel Meyers, Chris Korn, Joshua Jay and Jason Bishop."
      },
      {
        "id": "tvmaze:1514593",
        "title": "Smart Money, Smart Phones and A Rising Pianist",
        "season": 5,
        "episode": 9,
        "released": "2018-09-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Greg Gleason, Farrell Dillon, Jason Bird, Billy Kidd, Chris Funk, Keelan Leyser &amp; Matt Daniel-Baker and Jarrett &amp; Raja."
      },
      {
        "id": "tvmaze:1518140",
        "title": "More Twists on the Classics",
        "season": 5,
        "episode": 10,
        "released": "2018-09-14",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Jeki Yoo, Joel Meyers, Jibrizy, Naathan Phan, Ed Alonzo and Noora Karma."
      },
      {
        "id": "tvmaze:1521723",
        "title": "All About the Benjamins and One Switcheroo",
        "season": 5,
        "episode": 11,
        "released": "2018-09-21",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jarrett and Raja, Shoot Ogawa, Spidey, Rick Smith, Jr, Joshua Jay, Bill Cook, Greg Frewin and Tommy Wind."
      },
      {
        "id": "tvmaze:1526410",
        "title": "A Symphony of Magic",
        "season": 5,
        "episode": 12,
        "released": "2018-09-28",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Billy Kidd, Nathan Burton, Chipper Lowell, Andi Gladwin, Jason Bird and Greg Frewin."
      },
      {
        "id": "tvmaze:1529386",
        "title": "Fast Hands, Loose Change and A Bird Out of a Cannon",
        "season": 5,
        "episode": 13,
        "released": "2018-10-05",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chris Funk, Eric Jones, Murray SawChuck, Greg Gleason, Bill Cook, Spidey and Ed Alonzo."
      },
      {
        "id": "tvmaze:1641558",
        "title": "Goth Magic, Deceptive Antics, and Water Submersion",
        "season": 6,
        "episode": 1,
        "released": "2019-06-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Dan Sperry, Joshua Jay, Anna DeGuzman, Shoot Ogawa, Naathan Phan, Jeki Yoo and Greg Frewin."
      },
      {
        "id": "tvmaze:1641559",
        "title": "Dancing Objects, Neon Magic, and Ed Alonzo",
        "season": 6,
        "episode": 2,
        "released": "2019-06-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Eric Buss, Titou, Joseph Gabriel, Ed Alonzo, Eric Jones and Jarol Martin."
      },
      {
        "id": "tvmaze:1659869",
        "title": "Card Darts, Speed Magic, and Figaro",
        "season": 6,
        "episode": 3,
        "released": "2019-06-14",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Rick Smith Jr, Michael Turco, Jason Andrews, Lefty, Alexandra Duvivier, Matt Marcy and Naathan Phan."
      },
      {
        "id": "tvmaze:1663400",
        "title": "Human Voodoo Doll and a Seance",
        "season": 6,
        "episode": 4,
        "released": "2019-06-21",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Dan Sperry, Murray SawChuck, Chris Funk, Joel Meyers George Iglesias, Billy Kidd, and Greg Frewin."
      },
      {
        "id": "tvmaze:1666626",
        "title": "Putting Our Cards on the Table",
        "season": 6,
        "episode": 5,
        "released": "2019-06-28",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jeki Yoo, Greg Gleason, Joshua Jay, Bill Cook, Shoot Ogawa, Chipper Lowell, Jibrizy and Jonathan Pendragon."
      },
      {
        "id": "tvmaze:1676053",
        "title": "Floating Fire, Quick Hands, and One Spidey",
        "season": 6,
        "episode": 6,
        "released": "2019-07-19",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Michael Tetro, Anna DeGuzman, Eric Jones, Joshua Jay, Tommy Wind, Spidey, and Ed Alonzo."
      },
      {
        "id": "tvmaze:1678140",
        "title": "Ultimate Mind Readers and One Big Green Bag",
        "season": 6,
        "episode": 7,
        "released": "2019-07-26",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chris Funk, Shoot Ogawa, Chris Korn, Chipper Lowell, The Evasons, Joseph Gabriel, and Greg Frewin."
      },
      {
        "id": "tvmaze:1681757",
        "title": "A Kidd, The Wind, and Dan Sperry's Eyeball of Thread",
        "season": 6,
        "episode": 8,
        "released": "2019-08-02",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tommy Wind, Billy Kidd, Jonathan Pendragon, Spidey, Steven Brundage, Joel Meyers, Dan Sperry, and Shaun Jay."
      },
      {
        "id": "tvmaze:1684516",
        "title": "Perishing Piano, Mesmerizing Minds, and A Little Red Ball",
        "season": 6,
        "episode": 9,
        "released": "2019-08-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jarrett &amp; Raja, Ed Alonzo, Jeki Yoo, Titou, Jason Andrews, The Evasons, Lefty, and Murray SawChuck."
      },
      {
        "id": "tvmaze:1690619",
        "title": "Random Feats of Magic and One Fireball",
        "season": 6,
        "episode": 10,
        "released": "2019-08-23",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tetro, Bill Cook, Anna DeGuzman, Andi Gladwin, Steve Brundage, and Greg Frewin."
      },
      {
        "id": "tvmaze:1697792",
        "title": "Amazing Twist on the Classics and Spray Paint Designer",
        "season": 6,
        "episode": 11,
        "released": "2019-08-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chris Funk, George Iglesias, Bill Cook, Tommy Wind, Jason Andrews, Jarrett &amp; Raja, and Joel Meyers."
      },
      {
        "id": "tvmaze:1705400",
        "title": "Going Mental, Stretching the Money, and Houdini on the Rope",
        "season": 6,
        "episode": 12,
        "released": "2019-09-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chris Funk, Miss Katalin, Greg Frewin, Jibrizy, Simon Coronel &amp; Shoot Ogawa, The Evasons and Shaun Jay."
      },
      {
        "id": "tvmaze:1712082",
        "title": "Game Show Magic, Money Fun Box, and Breaking the Chain",
        "season": 6,
        "episode": 13,
        "released": "2019-09-27",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Michael Turco, Nathaan Phan, Murray SawChuck, Tommy Wind, Andi Gladwin, Francis Menotti, and Greg Gleason."
      },
      {
        "id": "tvmaze:1827396",
        "title": "Quick Changes, The Bird King, and Very Sharp Objects",
        "season": 7,
        "episode": 1,
        "released": "2020-05-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jeki Yoo &amp; Ellie, Dan Sperry, Trigg Watson, Josephine Lee, Hakan Berg and Hans Klok."
      },
      {
        "id": "tvmaze:1827397",
        "title": "The Sphere of Fog, Crossbows, and More Ed Alonzo",
        "season": 7,
        "episode": 2,
        "released": "2020-05-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Tommy Wind, Louie Foxx, Alexandra Duvivier, Ben Blaque, Ed Alonzo and Jason Bishop."
      },
      {
        "id": "tvmaze:1861161",
        "title": "Alex, I'll Take Pickpockets and Monkeys for $1000",
        "season": 7,
        "episode": 3,
        "released": "2020-05-22",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Michael Turco, Leon Etienne, The Sacred Riana, Chipper Lowell and Jay Jay."
      },
      {
        "id": "tvmaze:1865598",
        "title": "Virtual Magic, Psychic Worms, and Hans Klok",
        "season": 7,
        "episode": 4,
        "released": "2020-05-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Trigg Watson, Jeki Yoo, Lefty, Krystyn Lambert, Eric Jones and Hans Klok."
      },
      {
        "id": "tvmaze:1869973",
        "title": "The Blind Magician and Floating Off a Barstool",
        "season": 7,
        "episode": 5,
        "released": "2020-06-05",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Titou, Juliana Fay, Leon Etienne, Joshua Jay, Richard Turner and Ed Alonzo."
      },
      {
        "id": "tvmaze:1873728",
        "title": "Crossbow Roulette and Magic Just for the Funovits",
        "season": 7,
        "episode": 6,
        "released": "2020-06-12",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Michael Turco, Hans Klok, Chipper Lowell, Angela Funovits and Ben Blaque."
      },
      {
        "id": "tvmaze:1874404",
        "title": "Video Magic and The Magical Murder Mystery Tour",
        "season": 7,
        "episode": 7,
        "released": "2020-06-19",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Trigg Watson, Naathan Phan, Paige Thompson, Shaun Jay and The Sacred Riana."
      },
      {
        "id": "tvmaze:1879593",
        "title": "Laughs, Levitations, and Lies",
        "season": 7,
        "episode": 8,
        "released": "2020-06-26",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Xavier Mortimer, Mai Wynn, Jay Jay, Murray SawChuck and Jarrett &amp; Raja."
      },
      {
        "id": "tvmaze:1888401",
        "title": "Cell Phone Hack, Water Torture, and Alonzo's Shop of Horrors",
        "season": 7,
        "episode": 9,
        "released": "2020-07-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Naathan Phan, Anna DeGuzman, Richard Turner, Ed Alonzo, Eric Jones and Titou."
      },
      {
        "id": "tvmaze:1893327",
        "title": "All the Kings Clubs, Motorcycles, and Let's Get Small",
        "season": 7,
        "episode": 10,
        "released": "2020-07-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Hans Klok, Tommy Wind, Kyle Marlett, Michael Turco, Nick Lewin, Alexandria Duvivier and Ed Alonzo."
      },
      {
        "id": "tvmaze:1903085",
        "title": "The Sound of Magic and The Intrusive Rope",
        "season": 7,
        "episode": 11,
        "released": "2020-08-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Håkan Berg, Shoot Ogawa, Chris Funk, Nick Dopuch and My Uyên."
      },
      {
        "id": "tvmaze:1911672",
        "title": "Copycats, Magical Matrimony, and Moments in Time",
        "season": 7,
        "episode": 12,
        "released": "2020-08-28",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Kyle Marlett, Ed Alonzo, Matthew Laslo, Angela Funovits, and \"Lefty.\""
      },
      {
        "id": "tvmaze:1920851",
        "title": "Insane Twists on the Classics",
        "season": 7,
        "episode": 13,
        "released": "2020-09-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alex Ramon, Eric Eaton, Paige Thompson, Murry SawChuck, Shaun Jay, Leon Etienne, Chris Funk, and Hans Klok."
      },
      {
        "id": "tvmaze:1924634",
        "title": "Brick Walls, Plexiglass, and a Fish Hook Endoscopy",
        "season": 7,
        "episode": 14,
        "released": "2020-09-25",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jeki Yoo, Anna DeGuzman, Shoot Ogawa, Jason Bishop, Eric Jones and Alex Ramon."
      },
      {
        "id": "tvmaze:1928201",
        "title": "Window Panes, Ring Crushers, and The Magic Earthworm",
        "season": 7,
        "episode": 15,
        "released": "2020-10-02",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Murray SawChuck, Chris Funk, Ed Alonzo, Michael Turco, Krystyn Lambert and Hans Klock."
      },
      {
        "id": "tvmaze:1931744",
        "title": "A New Twist on the Classics",
        "season": 7,
        "episode": 16,
        "released": "2020-10-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Dan Sperry, My Uyên, Shoot Ogawa, Trigg Watson, Lefty and Alexandra Duvivier."
      },
      {
        "id": "tvmaze:1937536",
        "title": "Body, Mind and Transformations",
        "season": 7,
        "episode": 17,
        "released": "2020-10-16",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alex Ramon, Chipper Lowell, Nick Dopuch, Murray SawChuck, Kent Axell and Shaun Jay."
      },
      {
        "id": "tvmaze:1942047",
        "title": "Supercharging Your Very First Magic Tricks",
        "season": 7,
        "episode": 18,
        "released": "2020-10-23",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Louie Foxx, Nick Lewin, Richard Turner, Shoot Ogawa, Ana DeGuzman, Eric Eaton, Trigg Watson and Dan Sperry."
      },
      {
        "id": "tvmaze:2280103",
        "title": "Matters of the Head",
        "season": 8,
        "episode": 1,
        "released": "2022-04-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Rob Lake, Shoot Ogawa, Clairvoyants, Stuart MacDonald and Eric Buss."
      },
      {
        "id": "tvmaze:2301261",
        "title": "The William Tell Experiment",
        "season": 8,
        "episode": 2,
        "released": "2022-04-16",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Eric Jones, Farrell Dillon &amp; Trino, Kevin Li, My Uyên, and Jonathan Goodwin."
      },
      {
        "id": "tvmaze:2305412",
        "title": "The Classics Remixed",
        "season": 8,
        "episode": 3,
        "released": "2022-04-23",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Bill Cook, Dan Sperry, Tetro, Nick Dopuch, Joel Meyers, Joshua Jay, and Alex Ramon."
      },
      {
        "id": "tvmaze:2309835",
        "title": "Music and Tech Magic",
        "season": 8,
        "episode": 4,
        "released": "2022-04-30",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Levent, Jeff Hobson, Kid Ace, Trigg Watson, Chris Funk, Johnny Ace Palmer and Ed Alonzo."
      },
      {
        "id": "tvmaze:2312878",
        "title": "The One About a Chipper, Sawchuck and a Cook",
        "season": 8,
        "episode": 5,
        "released": "2022-05-07",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Chipper Lowell, Murray SawChuck, Rachel Wax, Rob Lake, Shaun Jay, Bill Cook, and My Uyên."
      },
      {
        "id": "tvmaze:2317699",
        "title": "The Bed of Nails and the Magic Wand",
        "season": 8,
        "episode": 6,
        "released": "2022-05-14",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Naathan Phan, Jonathan Goodwin, Eric Jones, Levent and Stuart MacDonald."
      },
      {
        "id": "tvmaze:2320413",
        "title": "Of Mind and Body",
        "season": 8,
        "episode": 7,
        "released": "2022-05-21",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Eric Jones, Alex Ramon, Kevin Li, The Clairvoyants, Joel Meyers, and Shoot Ogawa."
      },
      {
        "id": "tvmaze:2327893",
        "title": "Body Transformation",
        "season": 8,
        "episode": 8,
        "released": "2022-06-04",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Joshua Jay, Rob Lake, Tetro, Naathan Phan, Bill Cook and Paige Thompson."
      },
      {
        "id": "tvmaze:2333631",
        "title": "Cool Cards, Coins and Close-Ups",
        "season": 8,
        "episode": 9,
        "released": "2022-06-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Kid Ace, Trino, Nick Dopuch, Johnny Ace Palmer, Naathan Phan, Dan Sperry and Trigg Watson."
      },
      {
        "id": "tvmaze:2334007",
        "title": "A Smorgasbord of Magic",
        "season": 8,
        "episode": 10,
        "released": "2022-06-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Rob Lake, Eric Jones, Chipper Lowell, Diego Chavez, Matt Marcy, and Ed Alonzo."
      },
      {
        "id": "tvmaze:2339740",
        "title": "Mind or Magic?",
        "season": 8,
        "episode": 11,
        "released": "2022-06-25",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Levent, Murray SawChuck, The Clairvoyants, Jeff Hobson, and My Uyên."
      },
      {
        "id": "tvmaze:2348857",
        "title": "Mystery Magic, Techno Time Travel, And Math Magic",
        "season": 8,
        "episode": 12,
        "released": "2022-07-09",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Eric Buss, Ed Alonzo, Magical Katrina, Trigg Watson, Joshua Jay, and Joel Meyers."
      },
      {
        "id": "tvmaze:2352638",
        "title": "Right Before Your Very Eyes",
        "season": 8,
        "episode": 13,
        "released": "2022-07-16",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Kevin Li, Murray SawChuck, Ran D' Shine, Eric Eaton, Shoot Ogawa, and Louie Foxx."
      },
      {
        "id": "tvmaze:2365598",
        "title": "Up Close and Personal",
        "season": 8,
        "episode": 14,
        "released": "2022-08-13",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Chris Funk, Joel Meyers, Diego Chavez, Tetro, Johnny Ace Palmer, Bill Cook and Krysten Lambert."
      },
      {
        "id": "tvmaze:2367404",
        "title": "When Goth Meets the Art of the Illusion",
        "season": 8,
        "episode": 15,
        "released": "2022-08-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Eric Jones, Matt Marcy, Dan Sperry, Chipper Lowell, Shoot Ogawa, Hollie England and Jeff Hobson."
      },
      {
        "id": "tvmaze:2370544",
        "title": "Funky Magic and the Dancing Flame",
        "season": 8,
        "episode": 16,
        "released": "2022-08-27",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Naathan Phan, Bill Cook, Chris Funk, My Uyên, Ed Alonzo, Farrell Dillon, Magical Katrina, and Glenn Strange."
      },
      {
        "id": "tvmaze:2376055",
        "title": "A Magical Musical",
        "season": 8,
        "episode": 17,
        "released": "2022-09-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Bill Cook, Alex Ramon, Jeff Hobson, Eric Buss, Trino, Paige Thompson and Greg Gleason."
      },
      {
        "id": "tvmaze:2389043",
        "title": "The Extreme Exotic",
        "season": 8,
        "episode": 18,
        "released": "2022-09-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists, and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Ngô Mỹ Uyên, Stuart MacDonald, Johnny Ace Palmer, Levent, Ran'D Shine, Eric Jones, and Ed Alonzo."
      },
      {
        "id": "tvmaze:2439917",
        "title": "Deception, Heights, and One Crossbow",
        "season": 9,
        "episode": 1,
        "released": "2023-02-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Xavier Mortimer, Eric Buss, Farrell Dillon, Alexandra Duvivier and Deadly Games."
      },
      {
        "id": "tvmaze:2480584",
        "title": "Blocks, Crystals, and Cocktails",
        "season": 9,
        "episode": 2,
        "released": "2023-02-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Murray SawChuck, Lucy Darling, Jonathan LaChance, Dan Sperry, Robert Ramirez and My Uyên."
      },
      {
        "id": "tvmaze:2484291",
        "title": "Flash, Shine, and Wonderland",
        "season": 9,
        "episode": 3,
        "released": "2023-02-25",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alexandra Duvivier, Rudy Coby, Joshua Jay, Ana DeGuzman, Chipper Lowell, Andy Gladwin and Clarvoyants."
      },
      {
        "id": "tvmaze:2488165",
        "title": "History, Mystery and Hilarity",
        "season": 9,
        "episode": 4,
        "released": "2023-03-04",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Murray SawChuck, Trigg Watson, Eric Jones, Eric Eaton, Sirinda and Ed Alonzo."
      },
      {
        "id": "tvmaze:2493234",
        "title": "Mind Tricks, Time Travel, and Sharp Things",
        "season": 9,
        "episode": 5,
        "released": "2023-03-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Dan Sperry, Deadly Game, Ben Barnes, Smoothini, Rob Lake, Joshua Jay, and Wayne Hoffman."
      },
      {
        "id": "tvmaze:2495707",
        "title": "Love, Fashion, and Money",
        "season": 9,
        "episode": 6,
        "released": "2023-03-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Lucy Darling, Xavier Mortimer, Alexandra Duvivier, David Gabbay, Jonathan Levitt, Adam Wylie and My Uyên."
      },
      {
        "id": "tvmaze:2507865",
        "title": "Conjurors, A Darling, and the Most Dangerous Card Trick",
        "season": 9,
        "episode": 7,
        "released": "2023-04-08",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Jonathan LaChance, Farrell Dillon, Nick Dopuch, The Conjurors, Chipper Lowell, Lucy Darling and Rudy Coby."
      },
      {
        "id": "tvmaze:2510800",
        "title": "Fire, Crush, and the Wacky Tacky Box",
        "season": 9,
        "episode": 8,
        "released": "2023-04-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Wayne Hoffman, Eric Jones, Ana DeGuzman, Rob Lake, Robert Ramirez, My Uyên, Dan Sperry and Ed Alonzo."
      },
      {
        "id": "tvmaze:2515108",
        "title": "Science, Oracles, and a Twist on Houdini",
        "season": 9,
        "episode": 9,
        "released": "2023-04-22",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Adam Wylie, Jonathan LaChance, Murray SawChuck, Clairvoyants, Eric Buss, Joshua Jay and Naathan Phan (with magical assistant Kanoe Mann)."
      },
      {
        "id": "tvmaze:2520949",
        "title": "Bubbly Pop, Magic Tech, and the Impaler",
        "season": 9,
        "episode": 10,
        "released": "2023-04-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include My Uyên, Andi Gladwin, Kevin Li, Shaun Jay, David Gabbay, Trigg Watson and Wayne Hoffman."
      },
      {
        "id": "tvmaze:2526613",
        "title": "Old School Remix Volume I",
        "season": 9,
        "episode": 11,
        "released": "2023-05-06",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Murray SawChuck, Naathan Phan, Eric Jones, Ben Barnes, Ed Alonzo, Eric Eaton and Robert Ramirez."
      },
      {
        "id": "tvmaze:2529761",
        "title": "A Very Sperry Cherry, Darling",
        "season": 9,
        "episode": 12,
        "released": "2023-05-13",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Eric Eaton, Chipper Lowell, My Uyên, Dan Sperry, Rob Lake, Adam Wylie and Lucy Darling."
      },
      {
        "id": "tvmaze:2536071",
        "title": "A Carpenter, Endless Wine and ... Ed Alonzo?",
        "season": 9,
        "episode": 13,
        "released": "2023-05-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Andi Gladwin, Shaun Jay, The Conjurors, Smoothini and Eric Buss."
      },
      {
        "id": "tvmaze:2545960",
        "title": "Old School Remix Volume II",
        "season": 9,
        "episode": 14,
        "released": "2023-06-03",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ana DeGuzman, Ed Alonzo, Eric Buss, My Uyên, Kevin Li, Krystyn Lambert and Farrell Dillon."
      },
      {
        "id": "tvmaze:2551533",
        "title": "Twists, Turns and the Magic Body Shop",
        "season": 9,
        "episode": 15,
        "released": "2023-06-10",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ruby Coby, Naathan Phan, Meir Yedid, Joshua Jay, Murray SawChuck, Alexandra Duvivier, The Conjurors and Eric Eaton."
      },
      {
        "id": "tvmaze:2558535",
        "title": "Fire, Bubbles, and Soul Mates",
        "season": 9,
        "episode": 16,
        "released": "2023-06-17",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Meir Yedid, Lucy Darling, Rudy Coby, My Uyên, Nick Dopuch, Meadow Perry, Rob Lake, and Dan Sperry."
      },
      {
        "id": "tvmaze:2595601",
        "title": "Knives Out and Other Strange Magic",
        "season": 10,
        "episode": 1,
        "released": "2023-11-06",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Deadly Games, Lucy Darling, Joshua Jay, Lioz, and Caleb Alexander."
      },
      {
        "id": "tvmaze:2595602",
        "title": "Giant Drill, Magic on Edge, Floating Objects",
        "season": 10,
        "episode": 2,
        "released": "2023-11-13",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alexandra Duvivier, Reza, Maxence Vire, Andi Gladwin and Jaana Felicitas."
      },
      {
        "id": "tvmaze:2668666",
        "title": "Trial By Fire, Quick Change, and the Uncanny",
        "season": 10,
        "episode": 3,
        "released": "2023-11-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Adam Wylie, Ed Alonzo, Joel Ward, Mat O'Neill, My Uyên, and Wayne Hoffman."
      },
      {
        "id": "tvmaze:2676055",
        "title": "Real, Tech, and the Triple Threat",
        "season": 10,
        "episode": 4,
        "released": "2023-11-27",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Deadly Games, Alex Ramone, Shoot Ogawa, Trigg Watson, Topas and Chipper Lowell."
      },
      {
        "id": "tvmaze:2689375",
        "title": "Dark, Darling, and Twisted",
        "season": 10,
        "episode": 5,
        "released": "2023-12-04",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Murray SawChuck, Lucy Darling, Nick Dopuch, Dan Sperry, Naathan Phan, Farrell Dillon, and Caleb Alexander."
      },
      {
        "id": "tvmaze:2692483",
        "title": "Cool, Crazy, and Close-up",
        "season": 10,
        "episode": 6,
        "released": "2024-01-12",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Anna DeGuzman, Christian Mascia, Joel Meyers, Jeffrey Wang, Lioz, Alexandra Duvivier and Reza."
      },
      {
        "id": "tvmaze:2730115",
        "title": "Pushing the Limits of Crazy Fun Magic",
        "season": 10,
        "episode": 7,
        "released": "2024-01-19",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Deadly Games, Jaana Felicitas, Noah Sonie, Mat O'Neill and Ed Alonzo."
      },
      {
        "id": "tvmaze:2736950",
        "title": "True Magic, Lollipops, and Blades of Death",
        "season": 10,
        "episode": 8,
        "released": "2024-01-26",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Nick Dopuch, Christian Mascia, Andi Gladwin, Maxence Vire, Wayne Hoffman and My Uyên."
      },
      {
        "id": "tvmaze:2803399",
        "title": "Flames, Floating, and Out of this World",
        "season": 10,
        "episode": 9,
        "released": "2024-06-20",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Chipper Lowell, Reza, Eric Eaton, Joel Meyers, Adam Wylie, and Trigg Watson."
      },
      {
        "id": "tvmaze:2906441",
        "title": "The Beauty of Magic, Through the Metal Door, and My Magic Robot",
        "season": 10,
        "episode": 10,
        "released": "2024-06-27",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Shoot Ogawa, Keelan Leyser, Lucy Darling, Joshua Jay, Naathan Phan, Dan Sperry and Christian Mascia."
      },
      {
        "id": "tvmaze:2920134",
        "title": "Mystic Roses, the Lucky Ring, and a Magical Romance",
        "season": 10,
        "episode": 11,
        "released": "2024-07-04",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Ed Alonzo, Chipper Lowell, Murray SawChuck, Alexandra Duvivier, Andi Gladwin, Shaun Jay and Christian Mascia."
      },
      {
        "id": "tvmaze:2922792",
        "title": "Pup Magic, Twisted Cards, and a Buzzsaw of Death",
        "season": 10,
        "episode": 12,
        "released": "2024-07-11",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Lucy Darling, Alex Ramon, Trino, Maxence Vire, Joshua Jay, Noah Sonie, and Reza."
      },
      {
        "id": "tvmaze:2931607",
        "title": "The Gospel of Magic, Finding Aces, Elephant in the Room",
        "season": 10,
        "episode": 13,
        "released": "2024-07-18",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Farrell Dillon, Anna DeGuzman, Adam Wylie, Joel Meyers, Eric Eaton, Shaun Jay, and My Uyên."
      },
      {
        "id": "tvmaze:2936312",
        "title": "Fun with Cards, Fruit Bouquet, and Mass Audience Magic",
        "season": 10,
        "episode": 14,
        "released": "2024-07-25",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Alexandra Duvivier, Farrell Dillon, Noah Sonie, Alex Ramon, Naathan Phan, Nick Dopuch and Wayne Hoffman."
      },
      {
        "id": "tvmaze:2939605",
        "title": "Ropes, Fears, and Dark Magic",
        "season": 10,
        "episode": 15,
        "released": "2024-08-08",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured include Naathan Phan, Maxence Vire, Reza, Trino and Dan Sperry."
      },
      {
        "id": "tvmaze:2955826",
        "title": "Bullet Catch, AI Magic, and the Magic Lamp",
        "season": 10,
        "episode": 16,
        "released": "2024-08-15",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Topas, Murray SawChuck, Keelan Leyser, My Uyên, Adam Wylie, Mat O'Neill and Reza."
      },
      {
        "id": "tvmaze:2961901",
        "title": "The Magic Bartender, Master Class Close-Up, Rapid Fire Cards",
        "season": 10,
        "episode": 17,
        "released": "2024-08-22",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Andi Gladwin, Alexandra Duvivier, Naathan Phan, Chipper Lowell, Shoot Ogawa, Jeffrey Wang and Caleb Alexander."
      },
      {
        "id": "tvmaze:2977739",
        "title": "Magical Gamble, Mayhem, and Passing Through Metal",
        "season": 10,
        "episode": 18,
        "released": "2024-08-29",
        "overview": "Hosted by Dean Cain, \"Masters of Illusion\" features amazing magic performed by cutting-edge illusionists, escape artists and performers displaying skills ranging from perplexing interactive mind magic to hilarious comedy routines - all in front of a studio audience. Magicians featured in this episode include Adam Wylie, Lucy Darling, Anna DeGuzman, Dan Sperry, Trino, Eric Eaton and Reza."
      },
      {
        "id": "tvmaze:3063531",
        "title": "Logically Illogical, AI Mind Reader, and Phone-y Magic",
        "season": 11,
        "episode": 1,
        "released": "2025-01-24",
        "overview": "Featured magicians include Ed Alonzo, Jeki Yoo &amp; Ellie, Eric Eaton, Eric Jones, Alexandra, Trigg Watson, Joshua Jay and Artem Shchukin."
      },
      {
        "id": "tvmaze:3108085",
        "title": "Sizzles, Twists, and Blurred Realities",
        "season": 11,
        "episode": 2,
        "released": "2025-01-31",
        "overview": "Featured magicians include Adam Wylie, Lucy Darling, Ivan Amodei, Maxence Vire, Alex Ramon, Murray Sawchuck, Anna DeGuzman and Joseph Reohm."
      },
      {
        "id": "tvmaze:3115604",
        "title": "The Bold and the Beauty with a Crossbow",
        "season": 11,
        "episode": 3,
        "released": "2025-02-07",
        "overview": "Magicians featured include My Uyen, Michael Blomeke, Naathan Phan, Jonathan Levit, Andi Gladwin, Chipper Lowell and Anna Dangerous."
      },
      {
        "id": "tvmaze:3123331",
        "title": "Optics, Glass, and a Rubberband Man",
        "season": 11,
        "episode": 4,
        "released": "2025-02-14",
        "overview": "Magicians featured include Dan Sperry, Dreygon Hibbler, David Goldrake, Trino, Jackson Ridd, Mike Caveney, Adam Wyle, Nathaniel Segal and Farrell Dillon."
      },
      {
        "id": "tvmaze:3129643",
        "title": "Blind Sight, Sensual Magic, and The Butterfly Effect",
        "season": 11,
        "episode": 5,
        "released": "2025-02-21",
        "overview": "Featured magicians include Trino, Andi Gladwin, Joel Meyers, My Uyen, Mind 2 Mind, Boris Wild, Murray Sawchuck, Jeki Yoo and Alexandra."
      },
      {
        "id": "tvmaze:3139939",
        "title": "Magic Game Shows, Coins, and Prison Bars",
        "season": 11,
        "episode": 6,
        "released": "2025-02-28",
        "overview": "Featured magicians include Lucy Darling, Trigg Watson, Andi Gladwin, Carisa Hendrix, Dreygon, Maxence Vire and David Goldrake."
      },
      {
        "id": "tvmaze:3147834",
        "title": "Feet, Forks, and Felines",
        "season": 11,
        "episode": 7,
        "released": "2025-03-07",
        "overview": "Featured magicians include Anna DeGuzman, Alex Ramon, Nick Dupoch, Jonathan Levit, The Mysterious Maks, Chris Korn, Artem Shchukin, Adam Wylie and Naathan Phan, and Hayden Allcorn."
      },
      {
        "id": "tvmaze:3155077",
        "title": "Straitjacket Surfing, Winning the Lottery, and Channeling Houdini",
        "season": 11,
        "episode": 8,
        "released": "2025-03-14",
        "overview": "Featured magicians include Trino, Ed Alonzo, Eric Jones, Joel Meyers, Jeki Yoo, Joshua Jay, My Uyen, Nathaniel Segal, Dan Sperry and Farrell Dillon."
      },
      {
        "id": "tvmaze:3161293",
        "title": "Science, Whips, and Flush Paper",
        "season": 11,
        "episode": 9,
        "released": "2025-03-21",
        "overview": "Featured magicians include Carisa Hendrix, Murray Sawchuck, Jackson Ridd, Mike Caveney, Anna Dangerous, Boris Wild and Dan Sperry."
      },
      {
        "id": "tvmaze:3170663",
        "title": "Spikes, Love, and Hen Solo",
        "season": 11,
        "episode": 10,
        "released": "2025-03-28",
        "overview": "Magicians featured include Jonathan Levit, Maxence Vire, Greg Frewin, Adam Wylie, Naathan Phan, Jeki Yoo, Nathaniel Segal, Mind 2 Mind, Joseph Reohm and Ed Alonzo."
      },
      {
        "id": "tvmaze:3370460",
        "title": "Gothic Birds, Vacuums, and the Letters of Fate",
        "season": 11,
        "episode": 11,
        "released": "2025-10-10",
        "overview": "Featured magicians include Chipper Lowell, Dan Sperry, Mike Hammer, Ivan Amodei, Joel Meyers, the Mysterious Maks, Michael Bloemeke and My Uyen."
      },
      {
        "id": "tvmaze:3379756",
        "title": "Poker, Liars, and the Jaws of Death",
        "season": 11,
        "episode": 12,
        "released": "2025-10-17",
        "overview": "Magicians featured include Eric Jones, Adam Wylie, Farrell Dillon, Lucy Darling, Andi Gladwin, Murray Sawchuck, Dreygon and Alexandra."
      },
      {
        "id": "tvmaze:3388001",
        "title": "Pickpockets, Blinded Crossbow, and a Magic Bunny",
        "season": 11,
        "episode": 13,
        "released": "2025-10-24",
        "overview": "Featured magicians include Ed Alonzo, Jonathan Levit, Mike Hammer, Joseph Reohm, Dan Sperry, Boris Wild, Alexandra Duvivier and Anna Dangerous."
      },
      {
        "id": "tvmaze:3400610",
        "title": "Woman of Fire, Levitation, and a Dean Cain Amputation",
        "season": 11,
        "episode": 14,
        "released": "2025-11-07",
        "overview": "Featured magicians include Adam Wylie, Mike Caveney, Nick Dupoch, Joshua Jay, Jeki Yoo, David Goldrake, My Uyen, Lucy Darling, Eric Jones and Maxence Vire."
      },
      {
        "id": "tvmaze:3407507",
        "title": "Mind Matters, Premonitions and the Circus of Magic",
        "season": 11,
        "episode": 15,
        "released": "2025-11-14",
        "overview": "Featured magicians include Andi Gladwin, Farrell Dillon, Lucy Darling, Jackson Ridd, Naathan Phan, Eric Eaton, Eric Jones, Alexander Duvivier, Boris Wild and Ed Alonzo."
      },
      {
        "id": "tvmaze:3428071",
        "title": "The Magic Fly, Bent Forks, and the Floating Orb",
        "season": 11,
        "episode": 16,
        "released": "2025-11-21",
        "overview": "Featured magicians include My Uyen, Jason Bishop, Jeki Yoo, Trino, The Mysterious Maks, Alexandra Duvivier, R.J. Cantu, Joel Meyers and Eric Eaton."
      },
      {
        "id": "tvmaze:3441234",
        "title": "Impressions, Birdmen, and the Magic Mirror",
        "season": 11,
        "episode": 17,
        "released": "2025-12-05",
        "overview": "Featured magicians include Andi Gladwin, Alex Ramon, Anna DeGuzman, Eric Jones, Naathan Phan, Maxence Vire, Mike Hammer, Hakan Berg, Stuart MacDonald, Nick Dupoch and Xavier Mortimer."
      }
    ]
  }
}