{
  "meta": {
    "id": "tvmaze:103",
    "type": "series",
    "name": "Law & Order: Special Victims Unit",
    "description": "In the criminal justice system, sexually-based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472924.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472924.jpg",
    "videos": [
      {
        "id": "tvmaze:3427381",
        "title": "Shadow Counsel",
        "season": 27,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:6979",
        "title": "Payback",
        "season": 1,
        "episode": 1,
        "released": "1999-09-20",
        "overview": "The grisly murder and dismemberment of a New York cabbie draws the elite Special Victims Unit of the NYPD, including veteran Detective Elliot Stabler and his partner, Olivia Benson, who soon discover that the victim had assumed the identity of another man."
      },
      {
        "id": "tvmaze:6980",
        "title": "A Single Life",
        "season": 1,
        "episode": 2,
        "released": "1999-09-27",
        "overview": "When the body of Gretchen Quinn is found wearing only a red slip after having gone through an upper-story window, Benson and Stabler soon find out that \"Gretchen Quinn\" never existed."
      },
      {
        "id": "tvmaze:6981",
        "title": "...Or Just Look Like One",
        "season": 1,
        "episode": 3,
        "released": "1999-10-04",
        "overview": "Stabler and Benson investigate the case of a beaten teen model who was dumped in front of a hospital."
      },
      {
        "id": "tvmaze:6982",
        "title": "Hysteria",
        "season": 1,
        "episode": 4,
        "released": "1999-10-11",
        "overview": "Stabler and Benson investigate the murder of a young woman mistaken for a prostitute."
      },
      {
        "id": "tvmaze:6983",
        "title": "Wanderlust",
        "season": 1,
        "episode": 5,
        "released": "1999-10-18",
        "overview": "After a travel writer is found tied up with a woman's undergarments choking off his air supply, Benson and Stabler initially suspect his landlord's boyfriend, but suspicion soon turns to the landlord and her teenage daughter. Both seem far too interested in what their tenant is doing with his time."
      },
      {
        "id": "tvmaze:6984",
        "title": "Sophomore Jinx",
        "season": 1,
        "episode": 6,
        "released": "1999-10-25",
        "overview": "Benson and Stabler investigate a female student's murder at a local college. When they develop two suspects on the basketball team, they experience resistance from the college, which is trying to preserve its reputation and its chance at an upcoming championship."
      },
      {
        "id": "tvmaze:6985",
        "title": "Uncivilized",
        "season": 1,
        "episode": 7,
        "released": "1999-11-15",
        "overview": "The murder of an 8-year-old boy leads to a case involving the rights of a convicted child molester who has served his sentence and has returned to society."
      },
      {
        "id": "tvmaze:6986",
        "title": "Stalked",
        "season": 1,
        "episode": 8,
        "released": "1999-11-22",
        "overview": "A killing leads to a case in which the murderer is someone who stalks his victims...and Benson (Mariska Hargitay) finds that she's a target."
      },
      {
        "id": "tvmaze:6987",
        "title": "Stocks & Bondage",
        "season": 1,
        "episode": 9,
        "released": "1999-11-29",
        "overview": "The investigation of the killing of a Wall Street stock analyst involves illicit financial dealings and sado-masochism."
      },
      {
        "id": "tvmaze:6988",
        "title": "Closure",
        "season": 1,
        "episode": 10,
        "released": "2000-01-07",
        "overview": "After being raped by an intruder, a waitress (Tracy Pollan) reports the crime...and has to deal with its aftermath."
      },
      {
        "id": "tvmaze:6989",
        "title": "Bad Blood",
        "season": 1,
        "episode": 11,
        "released": "2000-01-14",
        "overview": "The investigation of a gay man's murder, following a party in his apartment building, involves an ex-con and his brother."
      },
      {
        "id": "tvmaze:6990",
        "title": "Russian Love Poem",
        "season": 1,
        "episode": 12,
        "released": "2000-01-21",
        "overview": "The investigation of a multimillionaire's killing involves bisexual infidelities and a number of Russians."
      },
      {
        "id": "tvmaze:6991",
        "title": "Disrobed",
        "season": 1,
        "episode": 13,
        "released": "2000-02-04",
        "overview": "The investigation of a judge's murder involves blackmail, sexual favors, and a convict's wife (Kathryn Meisle), who was a battered spouse."
      },
      {
        "id": "tvmaze:6992",
        "title": "Limitations",
        "season": 1,
        "episode": 14,
        "released": "2000-02-11",
        "overview": "Faced with the expiration of a statute of limitations, the staff tries to find a rapist involved in three assaults that occurred five years earlier."
      },
      {
        "id": "tvmaze:6993",
        "title": "Entitled, Part 1",
        "season": 1,
        "episode": 15,
        "released": "2000-02-18",
        "overview": "The detectives of Special Victims Unit team with the 27th Precinct to investigate a salesman's murder, leading them to a politically influential family. When the case goes to court, McCoy finds the matriarch to be a formidable opponent."
      },
      {
        "id": "tvmaze:6994",
        "title": "The Third Guy",
        "season": 1,
        "episode": 16,
        "released": "2000-02-25",
        "overview": "After two teens are caught in connection to an assault and robbery of an elderly woman, it's apparent that the attack was committed by someone else."
      },
      {
        "id": "tvmaze:6995",
        "title": "Misleader",
        "season": 1,
        "episode": 17,
        "released": "2000-03-31",
        "overview": "The daughter-in-law of the leader of a religious group is found strangled in a New York hotel room. The suspects include a colleague and a thief."
      },
      {
        "id": "tvmaze:6996",
        "title": "Chat Room",
        "season": 1,
        "episode": 18,
        "released": "2000-04-14",
        "overview": "A teen's claim that she was assaulted by a man who befriended her on the Internet leads to a case involving pedophilia."
      },
      {
        "id": "tvmaze:6997",
        "title": "Contact",
        "season": 1,
        "episode": 19,
        "released": "2000-04-28",
        "overview": "A forensic psychologist (Audra McDonald) is called in to help apprehend a serial rapist who preys on women in the subway."
      },
      {
        "id": "tvmaze:6998",
        "title": "Remorse",
        "season": 1,
        "episode": 20,
        "released": "2000-05-05",
        "overview": "A TV newswoman's on-air discussion of her assault leads to a case involving two fatal bombings."
      },
      {
        "id": "tvmaze:6999",
        "title": "Nocturne",
        "season": 1,
        "episode": 21,
        "released": "2000-05-12",
        "overview": "After a piano teacher is arrested for pedophilia, the detectives want a long-time student to testify against him."
      },
      {
        "id": "tvmaze:7000",
        "title": "Slaves",
        "season": 1,
        "episode": 22,
        "released": "2000-05-19",
        "overview": "Detectives try to help a woman who claims that she was \"trapped in a situation she cannot escape from.\""
      },
      {
        "id": "tvmaze:7001",
        "title": "Wrong is Right",
        "season": 2,
        "episode": 1,
        "released": "2000-10-20",
        "overview": "Detectives investigate the murder of a man who was set on fire."
      },
      {
        "id": "tvmaze:7002",
        "title": "Honor",
        "season": 2,
        "episode": 2,
        "released": "2000-10-27",
        "overview": "The case of an assaulted woman found in a park leads to an investigation involving a clash of cultures and a family's honor."
      },
      {
        "id": "tvmaze:7003",
        "title": "Closure, Part 2",
        "season": 2,
        "episode": 3,
        "released": "2000-11-03",
        "overview": "A year after she was raped, a woman (Tracy Pollan) follows her attacker (Neil Maffin) and reports his activities to the police."
      },
      {
        "id": "tvmaze:7004",
        "title": "Legacy",
        "season": 2,
        "episode": 4,
        "released": "2000-11-10",
        "overview": "The detectives investigate the case of a comatose 7-year-old girl and try to determine who has abused her."
      },
      {
        "id": "tvmaze:7005",
        "title": "Baby Killer",
        "season": 2,
        "episode": 5,
        "released": "2000-11-17",
        "overview": "The squad is assigned a special case: to investigate the fatal shooting of a little girl by her 7-year-old classmate"
      },
      {
        "id": "tvmaze:7006",
        "title": "Noncompliance",
        "season": 2,
        "episode": 6,
        "released": "2000-11-24",
        "overview": "A schizophrenic (Kevin Breznahan) who refuses to take his medication becomes the main suspect in a killing and an assault."
      },
      {
        "id": "tvmaze:7007",
        "title": "Asunder",
        "season": 2,
        "episode": 7,
        "released": "2000-12-01",
        "overview": "A rape charge made by a woman (Amy Carlson) against her police-sergeant husband (Nestor Serrano) leads to a complicated case."
      },
      {
        "id": "tvmaze:7008",
        "title": "Taken",
        "season": 2,
        "episode": 8,
        "released": "2000-12-15",
        "overview": "The detectives investigate a rape that occurred during the opening festivities of a luxury hotel."
      },
      {
        "id": "tvmaze:7009",
        "title": "Pixies",
        "season": 2,
        "episode": 9,
        "released": "2001-01-12",
        "overview": "The investigation of a gymnast's murder involves her strict trainer, a wealthy benefactor and a competitor."
      },
      {
        "id": "tvmaze:7010",
        "title": "Consent",
        "season": 2,
        "episode": 10,
        "released": "2001-01-19",
        "overview": "A rape victim (Tammy Blanchard) can't remember the circumstances of her attack."
      },
      {
        "id": "tvmaze:7011",
        "title": "Abuse",
        "season": 2,
        "episode": 11,
        "released": "2001-01-26",
        "overview": "After a singing star's son is killed, Benson becomes concerned about the safety of the singer's little girl (Hayden Panettiere)."
      },
      {
        "id": "tvmaze:7012",
        "title": "Secrets",
        "season": 2,
        "episode": 12,
        "released": "2001-02-02",
        "overview": "The discovery of a murdered teacher's body leads to an investigation involving sex addiction."
      },
      {
        "id": "tvmaze:7013",
        "title": "Victims",
        "season": 2,
        "episode": 13,
        "released": "2001-02-09",
        "overview": "Stabler and Benson are assigned to a homicide involving a pedophile from a past case."
      },
      {
        "id": "tvmaze:7014",
        "title": "Paranoia",
        "season": 2,
        "episode": 14,
        "released": "2001-02-16",
        "overview": "After a female officer is raped, the case involves a police investigation, gambling debts and drugs."
      },
      {
        "id": "tvmaze:7015",
        "title": "Countdown",
        "season": 2,
        "episode": 15,
        "released": "2001-02-23",
        "overview": "The detectives work around the clock to find the man who's kidnapping, raping and often killing young girls."
      },
      {
        "id": "tvmaze:7016",
        "title": "Runaway",
        "season": 2,
        "episode": 16,
        "released": "2001-03-02",
        "overview": "The detectives tell Internal Affairs reps what occurred during the search for a police officer's runaway teenage daughter."
      },
      {
        "id": "tvmaze:7017",
        "title": "Folly",
        "season": 2,
        "episode": 17,
        "released": "2001-03-23",
        "overview": "The squad tries to find the person who's luring and then attacking young men who work for an escort service."
      },
      {
        "id": "tvmaze:7018",
        "title": "Manhunt",
        "season": 2,
        "episode": 18,
        "released": "2001-04-20",
        "overview": "Munch and Fin travel upstate to find a serial killer."
      },
      {
        "id": "tvmaze:7019",
        "title": "Parasites",
        "season": 2,
        "episode": 19,
        "released": "2001-04-27",
        "overview": "The discovery of human remains in a garden leads to an investigation that involves a mail-order-bride operation and a prostitution ring."
      },
      {
        "id": "tvmaze:7020",
        "title": "Pique",
        "season": 2,
        "episode": 20,
        "released": "2001-05-04",
        "overview": "After a pregnant personnel executive is found murdered, suspicion falls on a wealthy young friend (Chad Lowe), who submits to a series of interrogations by Stabler."
      },
      {
        "id": "tvmaze:7021",
        "title": "Scourge",
        "season": 2,
        "episode": 21,
        "released": "2001-05-11",
        "overview": "When several people including a child are killed, the team tries to find the killer. They catch the man who did it. Cabot wants to throw the book at him despite his erratic behavior. But Huang wants to examine him and he says that the man is sick. And they eventually learn that the insurance company he applied to knew of his condition and that they didn't tell him which would have allowed him the opportunity to be cured."
      },
      {
        "id": "tvmaze:7022",
        "title": "Repression",
        "season": 3,
        "episode": 1,
        "released": "2001-09-28",
        "overview": "An 18-year-old (Kelly Hutchinson) in therapy recalls being sexually abused by her father (Brian Kerwin) and presses charges against him."
      },
      {
        "id": "tvmaze:7023",
        "title": "Wrath",
        "season": 3,
        "episode": 2,
        "released": "2001-10-05",
        "overview": "After three murder victims are connected to Benson's past cases, it's believed that the killer is seeking revenge on the detective."
      },
      {
        "id": "tvmaze:7024",
        "title": "Stolen",
        "season": 3,
        "episode": 3,
        "released": "2001-10-12",
        "overview": "A kidnapping investigation links a past case with which Cragen was involved to a 12-year-old (Ian Cronin) whose adoption is deemed illegal."
      },
      {
        "id": "tvmaze:7025",
        "title": "Rooftop",
        "season": 3,
        "episode": 4,
        "released": "2001-10-19",
        "overview": "Stabler tries to build a case against an ex-con who's HIV-positive and preys on young girls."
      },
      {
        "id": "tvmaze:7026",
        "title": "Tangled",
        "season": 3,
        "episode": 5,
        "released": "2001-10-26",
        "overview": "When guests arrive for a party, they find the hosts have been assaulted, one of them fatally."
      },
      {
        "id": "tvmaze:7027",
        "title": "Redemption",
        "season": 3,
        "episode": 6,
        "released": "2001-11-02",
        "overview": "A brash, intense detective (David Keith) is assigned to help Stabler catch a serial rapist-killer."
      },
      {
        "id": "tvmaze:7028",
        "title": "Sacrifice",
        "season": 3,
        "episode": 7,
        "released": "2001-11-09",
        "overview": "The investigation of a shooting near a gay bar leads to a couple's involvement with porn movies."
      },
      {
        "id": "tvmaze:7029",
        "title": "Inheritance",
        "season": 3,
        "episode": 8,
        "released": "2001-11-16",
        "overview": "The search for a serial rapist leads to a case in which the defense attorney (Diane Baker) tries to blame the suspect's actions on his genes."
      },
      {
        "id": "tvmaze:7030",
        "title": "Care",
        "season": 3,
        "episode": 9,
        "released": "2001-11-23",
        "overview": "A computer game provides clues in the death of a physically abused little girl in foster care."
      },
      {
        "id": "tvmaze:7031",
        "title": "Ridicule",
        "season": 3,
        "episode": 10,
        "released": "2001-12-14",
        "overview": "The investigation of an apparently accidental death leads to charges by a male stripper that the deceased was one of three women who sexually assaulted him."
      },
      {
        "id": "tvmaze:7032",
        "title": "Monogamy",
        "season": 3,
        "episode": 11,
        "released": "2002-01-04",
        "overview": "A woman who's seven months pregnant is found assaulted, with her fetus removed."
      },
      {
        "id": "tvmaze:7033",
        "title": "Protection",
        "season": 3,
        "episode": 12,
        "released": "2002-01-11",
        "overview": "The detectives seek a woman who is on the run from her drug-dealing lover, whom she saw murder a rival."
      },
      {
        "id": "tvmaze:7034",
        "title": "Prodigy",
        "season": 3,
        "episode": 13,
        "released": "2002-01-18",
        "overview": "The detectives investigate a double slaying in which the female victim was dismembered."
      },
      {
        "id": "tvmaze:7035",
        "title": "Counterfeit",
        "season": 3,
        "episode": 14,
        "released": "2002-01-25",
        "overview": "Benson teams up with Fin to investigate the murder of a woman found under a highway."
      },
      {
        "id": "tvmaze:7036",
        "title": "Execution",
        "season": 3,
        "episode": 15,
        "released": "2002-02-01",
        "overview": "At the request of a murdered teen's parents, Stabler tries to get a serial killer (Nick Chinlund) who's about to be executed to admit that the teen was one of his victims."
      },
      {
        "id": "tvmaze:7037",
        "title": "Popular",
        "season": 3,
        "episode": 16,
        "released": "2002-03-01",
        "overview": "Stabler breaks the rules to uncover the facts when a student (Brittany Slattery) claims that she was assaulted by a teacher."
      },
      {
        "id": "tvmaze:7038",
        "title": "Surveillance",
        "season": 3,
        "episode": 17,
        "released": "2002-03-08",
        "overview": "The detectives investigate the sexual assault of a cellist (Emily Deschanel) and discover surveillance equipment hidden in her apartment."
      },
      {
        "id": "tvmaze:7039",
        "title": "Guilt",
        "season": 3,
        "episode": 18,
        "released": "2002-03-29",
        "overview": "Judith Light joins the series in a recurring role as the unit's tough new chief, as Cabot breaks the rules in an attempt to catch a pedophile (Beau Gravitte)."
      },
      {
        "id": "tvmaze:7040",
        "title": "Justice",
        "season": 3,
        "episode": 19,
        "released": "2002-04-05",
        "overview": "In investigating the sexual assault of a 16-year-old, it's discovered that the victim is the rebellious stepdaughter of a judge (Keir Dullea)."
      },
      {
        "id": "tvmaze:7041",
        "title": "Greed",
        "season": 3,
        "episode": 20,
        "released": "2002-04-26",
        "overview": "Henry Winkler plays a restaurateur whose wife is assaulted during a robbery at their plush Manhattan residence."
      },
      {
        "id": "tvmaze:7042",
        "title": "Denial",
        "season": 3,
        "episode": 21,
        "released": "2002-05-03",
        "overview": "A dark family secret surfaces after a young woman (Martha Plimpton) is raped at a party."
      },
      {
        "id": "tvmaze:7043",
        "title": "Competence",
        "season": 3,
        "episode": 22,
        "released": "2002-05-10",
        "overview": "After a mother (Lois Smith) reports that her mentally challenged daughter (Andrea Fay Friedman) is pregnant, the detectives try to find out who fathered the child."
      },
      {
        "id": "tvmaze:7044",
        "title": "Silence",
        "season": 3,
        "episode": 23,
        "released": "2002-05-17",
        "overview": "Cases include a killing at a church and an investigation that involves sexual-abuse charges against a priest."
      },
      {
        "id": "tvmaze:7045",
        "title": "Chameleon",
        "season": 4,
        "episode": 1,
        "released": "2002-09-27",
        "overview": "Sharon Lawrence portrays a prostitute who claims that she killed a john in self-defense."
      },
      {
        "id": "tvmaze:7046",
        "title": "Deception",
        "season": 4,
        "episode": 2,
        "released": "2002-10-04",
        "overview": "Benson and Stabler wonder if an actress (Sherilyn Fenn) may have played a role in her husband's murder."
      },
      {
        "id": "tvmaze:7047",
        "title": "Vulnerable",
        "season": 4,
        "episode": 3,
        "released": "2002-10-11",
        "overview": "Benson and Stabler try to determine who mistreated an Alzheimer's victim (Jane Powell)."
      },
      {
        "id": "tvmaze:7048",
        "title": "Lust",
        "season": 4,
        "episode": 4,
        "released": "2002-10-18",
        "overview": "The detectives investigate the murder of a public-health doctor whose husband (Michael Gross) is a retired lawyer."
      },
      {
        "id": "tvmaze:7049",
        "title": "Disappearing Acts",
        "season": 4,
        "episode": 5,
        "released": "2002-10-25",
        "overview": "After Stabler and Benson are called in on a rape case, their victim is taken away by Federal agents."
      },
      {
        "id": "tvmaze:7050",
        "title": "Angels",
        "season": 4,
        "episode": 6,
        "released": "2002-11-01",
        "overview": "The discovery of a boy's body leads to a pedophile ring."
      },
      {
        "id": "tvmaze:7051",
        "title": "Dolls",
        "season": 4,
        "episode": 7,
        "released": "2002-11-08",
        "overview": "Gloria Reuben plays a graphics designer who returns from five months in rehab to discover that her daughter is missing."
      },
      {
        "id": "tvmaze:7052",
        "title": "Waste",
        "season": 4,
        "episode": 8,
        "released": "2002-11-15",
        "overview": "The detectives try to determine who impregnated a comatose woman."
      },
      {
        "id": "tvmaze:7053",
        "title": "Juvenile",
        "season": 4,
        "episode": 9,
        "released": "2002-11-22",
        "overview": "Two youths (Shane E. Lyons, Connor Paolo) each blame the other in the murder of a cancer patient who grew marijuana."
      },
      {
        "id": "tvmaze:7054",
        "title": "Resilience",
        "season": 4,
        "episode": 10,
        "released": "2002-12-06",
        "overview": "The investigation into a teen's claim that she was raped involves her parents, little sister, a boyfriend and a boarder."
      },
      {
        "id": "tvmaze:7055",
        "title": "Damaged",
        "season": 4,
        "episode": 11,
        "released": "2003-01-10",
        "overview": "Shootings at a video-rental store lead to a case involving an adopted daughter (Ari Graynor), a sexually abused child, a lawyer's son (Christopher Denham) and a client's immunity."
      },
      {
        "id": "tvmaze:7056",
        "title": "Risk",
        "season": 4,
        "episode": 12,
        "released": "2003-01-17",
        "overview": "Stabler goes undercover to try to find a police detective who's part of a cocaine-smuggling ring."
      },
      {
        "id": "tvmaze:7057",
        "title": "Rotten",
        "season": 4,
        "episode": 13,
        "released": "2003-01-24",
        "overview": "In their investigation of a prisoner's death, Benson and Fin learn that he was assaulted before being incarcerated."
      },
      {
        "id": "tvmaze:7058",
        "title": "Mercy",
        "season": 4,
        "episode": 14,
        "released": "2003-01-31",
        "overview": "The discovery of an infant's remains leads to a case that deals with a fatal genetic disorder and a parent's moral crisis."
      },
      {
        "id": "tvmaze:7059",
        "title": "Pandora",
        "season": 4,
        "episode": 15,
        "released": "2003-02-07",
        "overview": "Stabler is sent to Prague to look for a missing teen (Alexis Dziena) whose pictures are showing up on child-porn Web sites."
      },
      {
        "id": "tvmaze:7060",
        "title": "Tortured",
        "season": 4,
        "episode": 16,
        "released": "2003-02-14",
        "overview": "A former victim of Tibetan political torture is found murdered, with one of her feet missing."
      },
      {
        "id": "tvmaze:7061",
        "title": "Privilege",
        "season": 4,
        "episode": 17,
        "released": "2003-02-21",
        "overview": "The investigation of an apparent suicide leads to a case involving members of a wealthy family."
      },
      {
        "id": "tvmaze:7062",
        "title": "Desperate",
        "season": 4,
        "episode": 18,
        "released": "2003-03-14",
        "overview": "A woman in a tenement is raped and murdered in front of her 6-year-old son (Max Weinstein). Not surprisingly, the boy is too traumatized to answer questions. And one of them turns out to be, What were they doing in that apartment in the first place? They weren't poor, but they were on the run."
      },
      {
        "id": "tvmaze:7063",
        "title": "Appearances",
        "season": 4,
        "episode": 19,
        "released": "2003-03-28",
        "overview": "The discovery of an 8-year-old beauty-pageant contestant's body leads to a case involving a virtual-pornography website."
      },
      {
        "id": "tvmaze:7064",
        "title": "Dominance",
        "season": 4,
        "episode": 20,
        "released": "2003-04-04",
        "overview": "Multiple murders at a Manhattan townhouse are the start of a killing spree."
      },
      {
        "id": "tvmaze:7065",
        "title": "Fallacy",
        "season": 4,
        "episode": 21,
        "released": "2003-04-18",
        "overview": "After a woman (Katherine Moennig) fights off an attacker, what seems to be a case of self-defense murder grows more complicated following a blood test."
      },
      {
        "id": "tvmaze:7066",
        "title": "Futility",
        "season": 4,
        "episode": 22,
        "released": "2003-04-25",
        "overview": "An accused rapist (Fred Savage) decides to represent himself in court."
      },
      {
        "id": "tvmaze:7067",
        "title": "Grief",
        "season": 4,
        "episode": 23,
        "released": "2003-05-02",
        "overview": "After a waitress is found shot outside the club where she worked, her father (Joe Morton) seeks vengeance."
      },
      {
        "id": "tvmaze:7068",
        "title": "Perfect",
        "season": 4,
        "episode": 24,
        "released": "2003-05-09",
        "overview": "A teen's murder leads to a case involving runaways and a doctor (Gale Harold) interested in human cloning."
      },
      {
        "id": "tvmaze:7069",
        "title": "Soulless",
        "season": 4,
        "episode": 25,
        "released": "2003-05-16",
        "overview": "Benson speaks to a 15-year-old at a hospital, just before the teen is abducted."
      },
      {
        "id": "tvmaze:7070",
        "title": "Tragedy",
        "season": 5,
        "episode": 1,
        "released": "2003-09-23",
        "overview": "The search is on for an abducted woman who's about to give birth."
      },
      {
        "id": "tvmaze:7071",
        "title": "Manic",
        "season": 5,
        "episode": 2,
        "released": "2003-09-30",
        "overview": "Misuse of a prescription drug is involved in the killing of two students."
      },
      {
        "id": "tvmaze:7072",
        "title": "Mother",
        "season": 5,
        "episode": 3,
        "released": "2003-10-07",
        "overview": "After a psychiatrist (Susanna Thompson) has been raped in a crack house, she's very uncooperative with the investigation."
      },
      {
        "id": "tvmaze:7073",
        "title": "Loss",
        "season": 5,
        "episode": 4,
        "released": "2003-10-14",
        "overview": "While constructing a murder case, ADA Alexandra Cabot becomes the target of a Colombian drug cartel."
      },
      {
        "id": "tvmaze:7074",
        "title": "Serendipity",
        "season": 5,
        "episode": 5,
        "released": "2003-10-21",
        "overview": "The discovery of the bodies of a newborn and her mother leads to a doctor (Martin Donovan) coming under suspicion. Diane Neal joins the cast as ADA Casey Novak."
      },
      {
        "id": "tvmaze:7075",
        "title": "Coerced",
        "season": 5,
        "episode": 6,
        "released": "2003-10-28",
        "overview": "A homeless schizophrenic (Leland Orser) kidnaps a 5-year-old boy in this harrowing episode in which Beverly D'Angelo begins a recurring role as public defender Rebecca Balthus."
      },
      {
        "id": "tvmaze:7076",
        "title": "Choice",
        "season": 5,
        "episode": 7,
        "released": "2003-11-04",
        "overview": "A rape leads to the case of a woman (Josie Bissett), her abusive husband and the rights of their unborn child."
      },
      {
        "id": "tvmaze:7077",
        "title": "Abomination",
        "season": 5,
        "episode": 8,
        "released": "2003-11-11",
        "overview": "A young man is found dead in the Village. Evidence lead Benson and Stabler to the guy's boyfriend and the boyfriend's father (George Segal) - an anti-gay."
      },
      {
        "id": "tvmaze:7078",
        "title": "Control",
        "season": 5,
        "episode": 9,
        "released": "2003-11-18",
        "overview": "A man is running through a subway station bleeding to death because his penis was cut off."
      },
      {
        "id": "tvmaze:7079",
        "title": "Shaken",
        "season": 5,
        "episode": 10,
        "released": "2003-11-25",
        "overview": "Lucy Prichard, 20 months old, is taken while playing at the park."
      },
      {
        "id": "tvmaze:7080",
        "title": "Escape",
        "season": 5,
        "episode": 11,
        "released": "2003-12-02",
        "overview": "Michael Baxter escapes from prison years after being convicted for raping his girlfriend's son Lee."
      },
      {
        "id": "tvmaze:7081",
        "title": "Brotherhood",
        "season": 5,
        "episode": 12,
        "released": "2004-01-06",
        "overview": "A fraternity boy is found murdered."
      },
      {
        "id": "tvmaze:7082",
        "title": "Hate",
        "season": 5,
        "episode": 13,
        "released": "2004-01-13",
        "overview": "A Muslim woman is raped then burned to death. Benson and Stabler fear it could be a hate crime."
      },
      {
        "id": "tvmaze:7083",
        "title": "Ritual",
        "season": 5,
        "episode": 14,
        "released": "2004-02-03",
        "overview": "A seven year old is found dismembered in Central Park, and it appears it was some kind of ritual killing."
      },
      {
        "id": "tvmaze:7084",
        "title": "Families",
        "season": 5,
        "episode": 15,
        "released": "2004-02-10",
        "overview": "Shannon Coyle, a sixteen year old student, is found dead in an alley."
      },
      {
        "id": "tvmaze:7085",
        "title": "Home",
        "season": 5,
        "episode": 16,
        "released": "2004-02-17",
        "overview": "Jacob Nesbit, a nine year old boy, is found eating food out of a trash can."
      },
      {
        "id": "tvmaze:7086",
        "title": "Mean",
        "season": 5,
        "episode": 17,
        "released": "2004-02-24",
        "overview": "Emily Sullivan, a sixteen year old student, is found murdered in the trunk of her father's car."
      },
      {
        "id": "tvmaze:7087",
        "title": "Careless",
        "season": 5,
        "episode": 18,
        "released": "2004-03-02",
        "overview": "A six year old boy has been suffocated to death."
      },
      {
        "id": "tvmaze:7088",
        "title": "Sick",
        "season": 5,
        "episode": 19,
        "released": "2004-03-30",
        "overview": "An internet chat room tracks down a 12 year old boy named Jeremy, who is threatening to kill a 5 year old girl."
      },
      {
        "id": "tvmaze:7089",
        "title": "Lowdown",
        "season": 5,
        "episode": 20,
        "released": "2004-04-06",
        "overview": "Jeff York, an assistant DA is found murdered."
      },
      {
        "id": "tvmaze:7090",
        "title": "Criminal",
        "season": 5,
        "episode": 21,
        "released": "2004-04-20",
        "overview": "Rebecca Wheeler, a criminology student is found murdered in Central Park."
      },
      {
        "id": "tvmaze:7091",
        "title": "Painless",
        "season": 5,
        "episode": 22,
        "released": "2004-04-27",
        "overview": "A woman dies and initial evidence lead Benson and Stabler to believe she has been murdered."
      },
      {
        "id": "tvmaze:7092",
        "title": "Bound",
        "season": 5,
        "episode": 23,
        "released": "2004-05-04",
        "overview": "An elderly woman is found strangled to death at her home."
      },
      {
        "id": "tvmaze:7093",
        "title": "Poison",
        "season": 5,
        "episode": 24,
        "released": "2004-05-11",
        "overview": "The poisoning of a couple's adopted daughter prompts Stabler and Benson to suspect the child's mother based on testimony from her other 7-year-old daughter."
      },
      {
        "id": "tvmaze:7094",
        "title": "Head",
        "season": 5,
        "episode": 25,
        "released": "2004-05-18",
        "overview": "A spy camera is found in a Central Park public restroom."
      },
      {
        "id": "tvmaze:7095",
        "title": "Birthright",
        "season": 6,
        "episode": 1,
        "released": "2004-09-21",
        "overview": "Six-year-old Patty Branson, is almost abducted in Central Park while her father reads the paper. Benson and Stabler investigate to find out that the men who attacked her are actually P.I.'s, and have been hired by Michele Osborne to kidnap Patty, claiming she is Patty's real mother. M.E. Warner conducts a DNA test to prove the child's true biological mother. Meanwhile, Benson traces the source of the confusion about the child's origins back to a fertility doctor."
      },
      {
        "id": "tvmaze:7096",
        "title": "Debt",
        "season": 6,
        "episode": 2,
        "released": "2004-09-28",
        "overview": "After Detectives Benson and Stabler find two small Chinese children mysteriously abandoned by their missing mother, they soon discover that the mother is an illegal immigrant whose older daughter is being held against her will until the mother can pay off the smugglers' fee for bringing the family to America. The police use the missing woman's sister, Li Mei , to penetrate the secretive society and find out what happened to her -- but their plan backfires when Li Mei is found severely beaten while bearing an ominous message from the kidnappers."
      },
      {
        "id": "tvmaze:7097",
        "title": "Obscene",
        "season": 6,
        "episode": 3,
        "released": "2004-10-12",
        "overview": "Well-known actress Jesse who is the star of a controversial teen show, is raped in her trailer on the set. Benson and Fin investigate, and find the actress is hated by many community members, such as Carolyn Spencer because they feel she's a bad influence on young girls. Carolyn's public statements of hatred and disapproval of the actress make her a prime suspect. The investigation unravels further clues, which point to Carolyn's son Danny, who is arrested after being placed at the scene of the crime. Although it appears that he was acting out his mother's wishes, the boy also was influenced by the directions of a radio shock jock."
      },
      {
        "id": "tvmaze:7098",
        "title": "Scavenger",
        "season": 6,
        "episode": 4,
        "released": "2004-10-19",
        "overview": "Detectives Benson and Stabler discover an abandoned baby with a note indicating the mother's kidnapping. A trail of clues connect the mysterious kidnapping to a serial killer on the loose. As they uncover more murders, the detectives discover that their perpetrator is copycatting the actions of a serial killer from the past. Guest star Ann Meara plays the serial killer's mother."
      },
      {
        "id": "tvmaze:7099",
        "title": "Outcry",
        "season": 6,
        "episode": 5,
        "released": "2004-10-26",
        "overview": "After a missing sixteen-year-old girl, Tandi is found in an abandoned building, Benson and Stabler questions her and she reveals that she was pulled into the building by three men in uniform, and kept there for several days. Her story seems to have some holes in it, and as the investigation unfolds, the involvement of these men in uniform are called into question and her father is implicated as a suspect."
      },
      {
        "id": "tvmaze:7100",
        "title": "Conscience",
        "season": 6,
        "episode": 6,
        "released": "2004-11-09",
        "overview": "When a five-year-old boy disappears from a playground, Benson and Stabler are on the scene, searching for suspects. They meet the boy's thirteen-year-old neighbor, Jake who witnessed the boy being watched by a man earlier that day. The case takes a grim turn, when the boy is discovered dead by suffocation and all clues lead to Jake as the killer."
      },
      {
        "id": "tvmaze:7101",
        "title": "Charisma",
        "season": 6,
        "episode": 7,
        "released": "2004-11-16",
        "overview": "When twelve-year-old Melanie, is hospitalized with pregnancy complications, Benson and Stabler make a hospital call. They discover that Melanie's husband, the father of her unborn child, is the leader of a cult in which Melanie is involved. The investigation takes an emotional turn when the detectives pay a visit to the cult leader and make a horrifying discovery."
      },
      {
        "id": "tvmaze:7102",
        "title": "Doubt",
        "season": 6,
        "episode": 8,
        "released": "2004-11-23",
        "overview": "After a woman claims to have been sexually assaulted by her college professor, the accused academician agrees to help Detectives Benson and Stabler by volunteering to submit a DNA sample for testing. But the case turns into a classic \"he said, she said\" stand-off when the professor claims the alleged victim showed up at his apartment seeking more then professional advice."
      },
      {
        "id": "tvmaze:7103",
        "title": "Weak",
        "season": 6,
        "episode": 9,
        "released": "2004-11-30",
        "overview": "When Benson and Stabler investigate a series of assaults in the Upper West side, they find that they will have to rely on the help of psychiatrist Rebecca Hendrix and her schizophrenic patient, also a victim of this crime, to nail down their predator. The investigation takes an unexpected turn when Benson and Stabler locate the criminal, Thomas Mathers. However, conflicting evidence leaves Benson and Stabler questioning whether or not Thomas is the right man to have in custody."
      },
      {
        "id": "tvmaze:7104",
        "title": "Haunted",
        "season": 6,
        "episode": 10,
        "released": "2004-12-07",
        "overview": "While on a stakeout with Detective Benson, Detective Fin wanders into a convenience store and finds himself at the scene of a robbery. Shots are fired and Fin is down, and nearly loses his life. This traumatic event turns bittersweet, as Benson reunites Fin with his son Ken who he has not seen in years. Meanwhile, a woman reads about the shootout in the paper, and recognizes Fin from his days in narcotics. Fin once promised to help locate her missing daughter, but was unable to go through with it, because it would have blown his cover. This rediscovery drives Fin to return to narcotics, and finish the job he once promised to do. Teaming up with partner Nick Sandoval they set out to complete this search, and come to find the end result is not what they expected. T"
      },
      {
        "id": "tvmaze:7105",
        "title": "Contagious",
        "season": 6,
        "episode": 11,
        "released": "2005-01-11",
        "overview": "Family is rushed to the hospital after a car accident, and while examining the nine-year-old daughter for injuries, the doctor discovers she has been molested. SVU is called to the case and Det. Benson questions his daughter, Holly, to get to the truth. They discover that she in fact has been molested, and the same perp who molested her had previously killed another eight-year-old girl. Benson and Stabler work with Holly to track down the person responsible."
      },
      {
        "id": "tvmaze:7106",
        "title": "Identity",
        "season": 6,
        "episode": 12,
        "released": "2005-01-18",
        "overview": "After a gang member sexually assaults a young woman, he is pushed from a rooftop in what appears to be an act of retribution. However, when the victim Katie also turns up dead, Benson and Stabler realize that the case is far more complicated than they originally suspected."
      },
      {
        "id": "tvmaze:7107",
        "title": "Quarry",
        "season": 6,
        "episode": 13,
        "released": "2005-01-25",
        "overview": "After receiving an anonymous tip, Detective Benson is led to the body of a boy who has been missing since 1980. Back in 1980, the police identified Lucas Biggs, a professional ball player, as the murderer, but evidence fell short of a guilty verdict. In present day, Lucas is on death row for the kidnapping and murder of another victim. Benson and Cragen suspect this new information is a ploy to prolong his death sentence by forcing the police to re-open the case."
      },
      {
        "id": "tvmaze:7108",
        "title": "Game",
        "season": 6,
        "episode": 14,
        "released": "2005-02-08",
        "overview": "Detectives Stabler and Fin investigate the rape and murder of a prostitute who is the victim of a brutal rape. The investigation leads detectives to find that the teenagers were bringing to life the acts included in their favorite video game. The case goes to court, and tension builds as Novak must argue against opposing council Gates' defense that the teenagers were influenced by the violent video game."
      },
      {
        "id": "tvmaze:7109",
        "title": "Hooked",
        "season": 6,
        "episode": 15,
        "released": "2005-02-15",
        "overview": "15-year-old girl is found murdered and Detectives Benson and Stabler discover that the victim was using a fake ID, living a secret life in a world of teenaged prostitution -- and HIV positive after having unprotected sex in pornographic films. This last fact leads detectives to her murderer, but the case takes a dramatic turn as a second victim is discovered murdered by someone else."
      },
      {
        "id": "tvmaze:7110",
        "title": "Ghost",
        "season": 6,
        "episode": 16,
        "released": "2005-02-22",
        "overview": "Well-to-do couple are found tortured and murdered, and Benson and Stabler are on the scene. It turns out they were laundering money for South American drug dealers, and skimming some for themselves. Detectives Benson and Stabler are joined by Detective Sandoval. The investigation goes through many layers, and evidence finally leads the detectives back to the Special Victims Unit's former A.D.A. Alexandra Cabot, who was presumed dead. Despite the risk, Cabot returns from hiding to once again help the team solve the case."
      },
      {
        "id": "tvmaze:7111",
        "title": "Rage",
        "season": 6,
        "episode": 17,
        "released": "2005-03-01",
        "overview": "Gordon Rickett is brought to the interrogation room once again for the murder of an adolescent girl and Detective Stabler hopes that he will put Rickett away for good this time -- though he must first keep his own rage under control. As tension fills the room, Rickett and Stabler face each other again in a race against the clock over the next 24 hours."
      },
      {
        "id": "tvmaze:7112",
        "title": "Pure",
        "season": 6,
        "episode": 18,
        "released": "2005-03-08",
        "overview": "-A mother reports her eighteen-year-old daughter missing and Detectives Stabler and Benson are on the scene and attempt to track her daughter down. Psychic Sebastian Ballentine is brought into the investigation and seems to hold all of the clues, claiming to see visions of the girl. The investigation takes a shocking turn, leading the detectives to suspect that Sebastian knows more about the case then he is sharing."
      },
      {
        "id": "tvmaze:7113",
        "title": "Intoxicated",
        "season": 6,
        "episode": 19,
        "released": "2005-03-29",
        "overview": "Cathy Moriarty guest stars as Denise Eldridge, a mother who reports a case of statutory rape in an effort to keep her teenage daughter away from her 21-year old boyfriend. The daughter, Carrie Eldridge, makes it difficult for SVU involvement when she claims that she and her boyfriend have never had sexual relations. After Carrie undergoes questioning, Mrs. Eldridge is found murdered in her apartment and detectives Benson and Stabler first suspect Carrie's boyfriend. The surprising plot twist hits particularly close to home for Benson, as personal issues with her mother resurface."
      },
      {
        "id": "tvmaze:7114",
        "title": "Night",
        "season": 6,
        "episode": 20,
        "released": "2005-05-03",
        "overview": "Detectives Benson and Stabler investigate the rape and murder of a woman who is found near a nightclub, with $500 stuffed into her mouth. The only clue in the case is the money and fingerprints lead detectives to hotshot lawyer Jason Whittaker,. Benson and Stabler discover that he was trustee of the Duvall family estate and they question matriarch Eleanor Duvall who leads them to her son Gabriel. All clues point to Mr. Duvall, however there is not enough evidence to accuse him. A surprising plot-twist puts A.D.A Novak in grave danger, and Tracy Kibre is brought in to work on the case."
      },
      {
        "id": "tvmaze:7115",
        "title": "Blood",
        "season": 6,
        "episode": 21,
        "released": "2005-05-10",
        "overview": "Melinda Dillon guest-stars - A girl is brutally assaulted outside a nightclub with her attackers stealing her car and throwing her nine-month-old baby from the car as they disappear. Detectives Benson and Stabler investigate the case, and discover that the sexual assault is connected to illegal trafficking in painkillers, and the source behind the drug-dealing appears to be an elderly woman, Jenny Rogers. As the investigation progresses, Benson and Stabler discover that Rodgers is being abused by her son Kevin and her daughter-in-law. When Rogers' daughter-in-law is suddenly murdered, Benson and Stabler persuade Rogers to turn in her son, saving her from his abusive behavior. Meanwhile, Stabler struggles with a pressing issue involving one of his own children."
      },
      {
        "id": "tvmaze:7116",
        "title": "Parts",
        "season": 6,
        "episode": 22,
        "released": "2005-05-17",
        "overview": "When a woman's body is found dismembered in a junkyard, Detectives Benson and Stabler investigate and evidence leads them to the victim's boyfriend, Leon Shragewitz. Shragewitz confesses to the murder, by pushing her down a flight of stairs, and leaving her to die. A twist in the case leads Benson and Stabler to find that a kidney was then extracted from the victim's body by a man trying to save his sick son, leaving the rest of her remains in the junkyard. Detectives Besnon and Stabler turn to Amy Solwey to help them solve the case by leading them to the transplant surgeon who is at the center of an illegal body part ring. I"
      },
      {
        "id": "tvmaze:7117",
        "title": "Goliath",
        "season": 6,
        "episode": 23,
        "released": "2005-05-24",
        "overview": "When two Police officers from separate precincts attack their wives and demonstrate suicidal behavior, Detectives Benson and Stabler investigate, and connect the incidents to both men serving in the same Reserve unit in Afghanistan. Linking this behavior to a similar trail of attacks in 2002 by officers, Benson and Stabler connect this to a drug called Quinium, which the Army prescribes to fight malaria. When they discover that the Army is aware of its side affects, Novak goes after the government for administering the drug. Meanwhile, Detective Stabler faces some tough personal issues at home with his wife."
      },
      {
        "id": "tvmaze:7118",
        "title": "Demons",
        "season": 7,
        "episode": 1,
        "released": "2005-09-20",
        "overview": "After 21 years, sex offender Ray Schenkel is released from jail. Retired officer William Dorsey who initially locked him up, is convinced he'll offend again and begs Detectives Benson and Stabler to put him away for good. Stabler goes undercover to see if Dorsey is correct and in doing so befriends Schenkel, posing as a sex offender on parole and earning his trust. As the investigation unfolds, Stabler sets Schenkel up, but this time he doesn't take the bait. When Stabler's cover is blown, the investigation is not only compromised, but Stabler finds his life in danger."
      },
      {
        "id": "tvmaze:7119",
        "title": "Design",
        "season": 7,
        "episode": 2,
        "released": "2005-09-27",
        "overview": "A distraught and pregnant April Troost, is found on a ledge threatening to commit suicide. After being talked down, she confides in Benson that she has been raped, and her unborn child is a product of that crime. Troost accuses Barclay Palmer, a handsome, wealthy and successful business man, of the crime. Although Palmer denies involvement, DNA tests prove he is the father. The case goes to trial, but when it becomes evident that Troost is willing to settle for money, her credibility diminishes and Benson and Stabler become suspicious of her story."
      },
      {
        "id": "tvmaze:7120",
        "title": "911",
        "season": 7,
        "episode": 3,
        "released": "2005-10-04",
        "overview": "Disturbing 911 call from nine-year-old Maria Recinos is forwarded to Detective Olivia Benson. Recinos is calling for help from a room she claims to have been locked in for days. The detectives put a trace on the cell phone she is using, however it turns up multiple phony leads due to manipulation of the signal, which leaves detectives confused. As the case progresses, Benson eventually convinces Recinos to divulge crucial clues, including the name of her captor. Recinos will only talk to Benson, and just as she is getting closer to finding her, the cops question the case and are now concerned that it could be a prank. Benson knows this is real, when the phone goes dead, Benson realizes that she is losing time and needs to act quickly on what little information she has if she is going to save this girl's life."
      },
      {
        "id": "tvmaze:7121",
        "title": "Ripped",
        "season": 7,
        "episode": 4,
        "released": "2005-10-11",
        "overview": "When a 17-year-old high school student is brutally attacked by one of her classmates on campus, Detectives Stabler, Benson and Fin investigate Luke Breslin the prime suspect. When asked about attacking his friend, Breslin becomes enraged and attacks Det. Fin but when later questioned, he claims to have no memory of attacking anyone. Meanwhile, Stabler realizes that Breslin is the son of his former partner Pete Breslin and Detective Cragen suspends Stabler after he makes a number of unprofessional choices in trying to go easy on his friend's son. As the investigation continues, Stabler tries to help both Breslin and his son, but begins to lose control because of his own rage. Stabler turns to Dr. Rebecca Hendrix for help coping with his own anger issues."
      },
      {
        "id": "tvmaze:7122",
        "title": "Strain",
        "season": 7,
        "episode": 5,
        "released": "2005-10-18",
        "overview": "Man is found murdered execution style in the window of his workplace, and above him the word Killer is written. A stamp on his hand leads Detectives Benson and Fin to a gay circuit club, also a methamphetamine hangout. Detectives Benson and Fin scan the ID's of the guests who were at the club and during the investigation, Fin discovers his estranged son Ken Randall was also there. As the case continues, Detective Fin confronts his son and Medical Examiner Warner confirms that the victim Robin Weller had the deadly and contagious new strain of AIDS which is becoming an epidemic. When Weller's boyfriend, who also carried the deadly strain of AIDS, is also found murdered, eyes turn toward Gabriel Thurman an activist trying to stop the spread of the disease. The case goes to trial and Thompson's attorney Carolyn Maddox, tries to sway the jury that her client's actions were justified."
      },
      {
        "id": "tvmaze:7123",
        "title": "Raw",
        "season": 7,
        "episode": 6,
        "released": "2005-11-01",
        "overview": "Detectives Benson and Stabler investigate a school shooting, where three children are shot. When one African-American child dies, detectives follow critical clues and are lead to believe the crime was racially motivated. As the case progresses, Detectives find evidence that the rifle used in the killings is linked to a gun store, which also serves as the headquarters for a white supremacist group: Revolution Aryan Warriers. Detectives discover that Star Morrison, and the store owner's 14-year-old son Kyle both keep Nazi paraphernalia in the basement of the shop. DNA from the rifle leads detectives to the person they believe is the killer and when the case goes to court shots are fired inside the court house by group members and a major twist is revealed."
      },
      {
        "id": "tvmaze:7124",
        "title": "Name",
        "season": 7,
        "episode": 7,
        "released": "2005-11-08",
        "overview": "When construction workers pour the sand into a newly made playground and discover the remains of a young boy, Detective Stabler teams up with CSU tech Millie Vizcarrondo to investigate,which leads them to resurrect a cold case where four boys disappeared 30 years earlier. As the investigation unfolds, new forensic evidence surfaces but no progress can be made solving this case until Anna surfaces, claiming her stepfather Robert Sawyer was the killer."
      },
      {
        "id": "tvmaze:7125",
        "title": "Starved",
        "season": 7,
        "episode": 8,
        "released": "2005-11-15",
        "overview": "When a series of rapes is linked to a speed-dating service, Detective Benson goes undercover and discovers Mike Jergens is the assailant. As the case progresses, Jergens' insecure girlfriend Cora Kennison - an alcoholic and bulimic - becomes an unwilling pawn as both Benson and attorney Minerva Grahame-Bishop seek to persuade Kennison to testify for their respective sides - despite her mother's insistence that her daughter is too fragile. Kennison opts to marry Jergens in the hope that spousal privilege will save her from taking the stand, but since the rapes occurred before they married, she is still forced to testify. Distraught, Kennison drinks to excess, leaving her in an irreversible coma, and her fate in the hands of her husband."
      },
      {
        "id": "tvmaze:7126",
        "title": "Rockabye",
        "season": 7,
        "episode": 9,
        "released": "2005-11-22",
        "overview": "When Lauren Westley is found badly beaten and taken to a New York hospital, it is discovered she's a runaway from Virginia whose father Philip Westley has been in the city searching for her. Detectives discover that Westley was 24 weeks pregnant and due to her injuries, suffered a miscarriage. As the investigation unfolds Detectives Benson and Stabler question Wayne Meredith a teenager from Westley's high school who is the father of the baby. Westley and Meredith ran away to New York seeking the help from an abortion clinic. When the case goes to court, Meredith's attorney, Sophie Devere, tries to defend Meridith's actions but new evidence is introduced questioning the credibility of the abortion clinic and whether the doctor there was ultimately responsible for West's injuries."
      },
      {
        "id": "tvmaze:7127",
        "title": "Storm",
        "season": 7,
        "episode": 10,
        "released": "2005-11-29",
        "overview": "Detectives Benson and Stabler aggressively pursue a child molester who kidnapped three young sisters from New Orleans after their parents were killed in the aftermath of Hurricane Katrina -- but their efforts to secretly locate the third child are compromised by an ambitious reporter. However, a far greater problem looms as the New York cops butt heads with federal authorities after the suspect is discovered to have deadly anthrax that could result in a full-blown epidemic."
      },
      {
        "id": "tvmaze:7128",
        "title": "Alien",
        "season": 7,
        "episode": 11,
        "released": "2005-12-06",
        "overview": "When a bruised, bloodied and severely injured 12-year-old boy is dumped outside a hospital, Detectives Benson and Stabler are led to Charlie Monaghan, a teenager seen beating the boy a week earlier at St. Victor's school. But the suspect's alibi proves unlikely when his 8-year-old half sister's own problems at school and tormented past at the hands off the injured boy surface. Meanwhile, the girl's legal woes are exacerbated when questions concerning legal guardianship and consent - and what constitutes fit parenting - come into play."
      },
      {
        "id": "tvmaze:7129",
        "title": "Infected",
        "season": 7,
        "episode": 12,
        "released": "2006-01-03",
        "overview": "When a woman is found shot to death in her apartment, Detectives Benson and Stabler discover 14-year-old Nathan Phelps, traumatized and hiding in the closet. The investigation leads the detectives to Ted Carthage, the head of a charity organization, and whose voice Nathan recognizes as belonging to the man who shot his mother. Without a positive I.D., Carthage is released, but later found dead - shot by Nathan. A.D.A. Novak must prosecute Nathan and attempts to give him a break when his attorney Sophie Devere finds a study that suggests people who witness gun violence are more likely to commit acts of violence themselves. But their plan to settle with a plea is disrupted when a gun manufacturer's advocacy group catches wind of the defense, fearing legal implications."
      },
      {
        "id": "tvmaze:7130",
        "title": "Blast",
        "season": 7,
        "episode": 13,
        "released": "2006-01-10",
        "overview": "When an eight-year-old girl is kidnapped on her way home from school and DNA tests on the blood found in the abductor's abandoned van reveal she has leukemia, M.E. Warner visits the girl's family to inform them of her findings. No sooner does Warner deliver the diagnosis than she's drawn into the kidnapper's deadly game when it's clear he has the family's apartment - and its occupants - in his sights and no cops are to be involved."
      },
      {
        "id": "tvmaze:7131",
        "title": "Taboo",
        "season": 7,
        "episode": 14,
        "released": "2006-01-17",
        "overview": "When a newborn baby boy is discovered in the trash, Detectives Benson and Stabler use a bar t-shirt found at the scene to trace the crime back to a well-to-do college co-ed. At the precinct, the girl collapses and is treated for a potentially lethal post-conception complication, where she then admits to Benson that she had been raped and was unaware that she had been pregnant prior to the birth. The girl soon loses sympathy when it is also discovered that the girl had been connected to another abandoned newborn a year later, but was never arrested - and that the girl is the daughter of a city councilman. At the trial, Dr. Huang's diagnosis of postpartum psychosis sets the stage for the defense - but it's soon discovered other factors are at play when the father of both abandoned babies is revealed."
      },
      {
        "id": "tvmaze:7132",
        "title": "Manipulated",
        "season": 7,
        "episode": 15,
        "released": "2006-02-07",
        "overview": "When the body of a young woman is found murdered in her apartment, Detectives Benson and Stabler discover she's a successful attorney - and stripper, which is apparently unknown to her fianc and boss, Tessa McKellen. Later, tape from a student crew filming the night of the murder reveals the victim was with Linus McKellen, Tessa's husband - whose sperm was found in both the victim and her friend and fellow stripper, also found murdered. The investigation is further complicated when it's revealed the killer entered both apartments from outside windows, leading the detectives to suspect the crimes could also be tied to Tessa's corporate work."
      },
      {
        "id": "tvmaze:7133",
        "title": "Gone",
        "season": 7,
        "episode": 16,
        "released": "2006-02-28",
        "overview": "Three teens -- Jason King, Doug Waverly and Nick Pratt -- are suspected of foul play when high school student Jennifer Durning disappears after a night of partying. Nick and Doug's wealthy parents and their attorneys argue the plan was for Jason to lose his virginity to Jennifer before the other two had consensual sex with her -- but Jason got greedy. Jason agrees to testify, but when he disappears, Judge Donnelly has no choice but to dismiss the case. A.D.A. Casey Novak becomes suspicious because without Jason's testimony there's no case against the other boys. Attorneys Dave Seaver, Oliver Gates and Monica Bradshaw represent the teens."
      },
      {
        "id": "tvmaze:7134",
        "title": "Class",
        "season": 7,
        "episode": 17,
        "released": "2006-03-21",
        "overview": "Hudson University co-ed, Caroline Pereira, dependent on financial aid, is found murdered with an unexplained influx of cash. Caroline's wealthy roommate, Gloria Kulhane, is found with one of Caroline's rings, making her a suspect as the two were not friends. Detectives Benson, Fin and Stabler, have several theories about her murderer and their motive and investigate the various suspects; the roommate, her childhood friend, and someone connected to a heavily trafficked website where Caroline was selling term papers for cash."
      },
      {
        "id": "tvmaze:7135",
        "title": "Venom",
        "season": 7,
        "episode": 18,
        "released": "2006-03-28",
        "overview": "Detective \"Fin\" Tutuola is torn between his family and \"the system\" when his son Ken Randall is roughed up and arrested for digging in a vacant lot late at night. Detectives Stabler and Benson question Randall who claims he was drawn to the site after overhearing a stranger's murder confession while out with his troubled cousin Darius Parker. The story is weak, prompting suspicion and a deeper investigation that leads to an unsolved double homicide - and the realization Randall and Parker have more in common than Tutuola even suspected. Lisa Gay Hamilton guest stars as Tutuola's ex-wife Teresa Randall."
      },
      {
        "id": "tvmaze:7136",
        "title": "Fault",
        "season": 7,
        "episode": 19,
        "released": "2006-04-04",
        "overview": "Solid investigative work leads the detectives to a violent repeat sex offender Jeremy Paul Wilson who was recently released back onto the streets. Wilson, a cold blooded murderer and pedophile, is in possession of a cache of hunting knives, has kidnapped two children and has nothing to lose. The manhunt for Wilson brings Dets. Fin, Benson and Stabler to a bus terminal where a violent and emotional showdown with Wilson takes a dangerous turn."
      },
      {
        "id": "tvmaze:7137",
        "title": "Fat",
        "season": 7,
        "episode": 20,
        "released": "2006-05-02",
        "overview": "Band of teenage siblings attack and sodomize a teenage girl, Jessica Delay, who is a gifted piano student at a prestigious high school in Harlem. Through help from Medical Examiner Warner who identifies the attackers as overweight, Det. Stabler and his one-time partner Det. Lucius Blaine track down the siblings, who claim they attacked Jessica to avenge an attack on their morbidly obese brother Rudi. After the case goes to trial, there is a hollow victory for the \"winner\" due to the enormous health issues facing the teenager."
      },
      {
        "id": "tvmaze:7138",
        "title": "Web",
        "season": 7,
        "episode": 21,
        "released": "2006-05-09",
        "overview": "A mother (Dana Eskelson) is devastated by the revelation that her 8-year-old son (Jack Vignone) has been sexually abused years after her ex-husband was sent to prison for molesting her older child, whose DNA now implicates him in his brother's case."
      },
      {
        "id": "tvmaze:7139",
        "title": "Influence",
        "season": 7,
        "episode": 22,
        "released": "2006-05-16",
        "overview": "In SVU's season seven finale, former rock star Derek Lord goes on a national talk show and lectures about the abuse of psychiatric drugs. Meanwhile, an unstable young woman Jamie Hoskins, who loses her virginity, goes off her prescribed medication, gets behind the wheel of a car, and mows down 10 people. As these events are played out in a highly charged way, the argument about prescribed \"meds\" is challenged."
      },
      {
        "id": "tvmaze:7140",
        "title": "Informed",
        "season": 8,
        "episode": 1,
        "released": "2006-09-19",
        "overview": "Agent Star Morrison reappears on the scene, where alleged rape victim Haley refuses a rape kit. Benson learns that Haley is an FBI informant whose ex-boyfriend is a radical environmental rights advocate. In order to foil the group's terrorist activities, Benson goes undercover to further investigate."
      },
      {
        "id": "tvmaze:7141",
        "title": "Clock",
        "season": 8,
        "episode": 2,
        "released": "2006-09-26",
        "overview": "Dets. Stabler and Fin investigate when two high school kids, Connor and Janey, disappear from a field trip to a museum. They later discover Connor was attempting a fake kidnapping plot, and Janey has gone off with the family's much older driver. In this episode, Stabler meets his new partner NYPD Warrants Officer Dani Beck. Betty Buckley returns as guest star attorney Colette Walsh."
      },
      {
        "id": "tvmaze:7142",
        "title": "Recall",
        "season": 8,
        "episode": 3,
        "released": "2006-10-03",
        "overview": "Collected evidence leads detectives to a surprising suspect, Martin Trenway is able to break open the case."
      },
      {
        "id": "tvmaze:7143",
        "title": "Uncle",
        "season": 8,
        "episode": 4,
        "released": "2006-10-10",
        "overview": "When mother and daughter are brutally raped and murdered, it seemed too much for Warrants Officer Detective Dani Beck to handle as she begins to crack under the pressure. However, when their number one suspect, Andrew, turns out to be detective Munch's Uncle, the case twists into something that none of the Special Victims Squad had imagined."
      },
      {
        "id": "tvmaze:7144",
        "title": "Confrontation",
        "season": 8,
        "episode": 5,
        "released": "2006-10-17",
        "overview": "Based on the timeline of those subsequent attacks, Dr. George Huang suspects the rapist has one disturbing motive for these crimes. Tensions flare between the detectives as they make a difficult decision to help bring in the dangerous perp."
      },
      {
        "id": "tvmaze:7145",
        "title": "Infiltrated",
        "season": 8,
        "episode": 6,
        "released": "2006-10-31",
        "overview": "Det. Benson still deep undercover in Oregon as \"Persephone James\" is called upon by ADA Novak to help present evidence that will strengthen the case against a brutal rapist. This case will have a dramatic impact on Benson's critical work in Oregon, but intimately, her testimony in the rape trial will lead her back to the Special Victims Unit."
      },
      {
        "id": "tvmaze:7146",
        "title": "Underbelly",
        "season": 8,
        "episode": 7,
        "released": "2006-11-14",
        "overview": "With the victims' pimp, Victor Dodine as the prime suspect, detectives must rely on one of his young girls Belinda \"Passion\" Holt, to testify against him. This case rattles Beck in more ways than one."
      },
      {
        "id": "tvmaze:7147",
        "title": "Cage",
        "season": 8,
        "episode": 8,
        "released": "2006-11-21",
        "overview": "The accident leads Detective Dani Beck and Detective Eliot Stabler to the foster parents and some questionable medical practices involving a controversial \"rebirthing\" therapy. As the detectives dig deeper into the case, they discover other gruesome secrets involving the children, which lead Beck to make some surprising choices about her life and a profound decision about her career."
      },
      {
        "id": "tvmaze:7148",
        "title": "Choreographed",
        "season": 8,
        "episode": 9,
        "released": "2006-11-28",
        "overview": "Woman, is found dead in Central Park, and medical examiner Warner can find no apparent reason for her death. Det.Stabler begins the investigation by himself, talking to the victim's husband, Wesley, who owns a dance troupe, as his friends Glenn and Naomi Cheales pay a condolence visit. Stabler's investigation unravels a case of drugs, infidelity and an elaborate plot that impacts everyone involved in the troupe. Attorney Stella Danquiss, who defends Glenn, is played by. In this star-studded episode, Stabler also discovers Det. Benson is back in town, so he pays her a visit."
      },
      {
        "id": "tvmaze:7149",
        "title": "Scheherezade",
        "season": 8,
        "episode": 10,
        "released": "2007-01-02",
        "overview": "His riveting story reveals a string of crimes that took place several decades ago, including the murder of his partner and also how he took his partner's daughter to raise as his own."
      },
      {
        "id": "tvmaze:7150",
        "title": "Burned",
        "season": 8,
        "episode": 11,
        "released": "2007-01-09",
        "overview": "In this powerful episode directed by Eriq LaSalle, the Sennet couple will stop at nothing to get custody of their daughter Tessa. Dets. Stabler and Benson are given the difficult assignment of sorting through the lies and deception in a classic \"he said, she said\" case that ends up leaving one of the parents in a grave medical state. This episode reunites Eriq LaSalle with former ER castmate"
      },
      {
        "id": "tvmaze:7151",
        "title": "Outsider",
        "season": 8,
        "episode": 12,
        "released": "2007-01-16",
        "overview": "Ken Randall is the resident adviser at the University where one of his students is raped. The skittish girl and her parents do not want to talk to the police, but after a socialite is attacked by someone who fits the matched description, Fin begins working with a Brooklyn SVU Detective Chester Lake who is convinced they are looking for the same guy. As the investigation deepens, the trail leads to a medical clinic and an unusual suspect played by Henry, the son of a doctor who works there."
      },
      {
        "id": "tvmaze:7152",
        "title": "Loophole",
        "season": 8,
        "episode": 13,
        "released": "2007-02-06",
        "overview": "Photograph in the envelope leads Dets. Fin and Munch to the apartment building that houses the crime scene. The investigation reveals the building supervisor has spent a lot of time with the boy in the picture, and he falls under suspicion. The case takes a physical toll on Det. Olivia Benson, the victim, and the boy's mother when they all appear to have similar medical issues. Their symptoms all appear to point to the same origin which unearth a corporate conspiracy and cover-up. Former wrestling champion Bill Goldberg guest stars as Cupid, a roughneck who tears SVU headquarters apart."
      },
      {
        "id": "tvmaze:7153",
        "title": "Dependent",
        "season": 8,
        "episode": 14,
        "released": "2007-02-13",
        "overview": "Mob lawyer Sidney Truex and his wife are brutally attacked, leaving his young son emotionally scarred. When the Detectives have to locate the Truexs' daughter, Charlotte, to notify her about the attack on her parents, Detectives Olivia Benson and Elliot Stabler find Charlotte at her boyfriend Ryan's apartment. Through an exhaustive interview process, the Detectives must sort through the web of lies Charlotte has told in order to piece together a night of drinking and drugs leaving Charlotte unable to recall details of the evening. However, her father comes out of surgery and is able to vividly remember his daughter at the crime scene. The disturbing case takes another turn as Stabler is brought up on charges of excessive force after getting into a very serious altercation with Ryan."
      },
      {
        "id": "tvmaze:7154",
        "title": "Haystack",
        "season": 8,
        "episode": 15,
        "released": "2007-02-20",
        "overview": "In a \"ripped-from-the-headlines\" episode, overzealous reporter Cindy Marino accuses new mother Laura Kozowloski on national television of kidnapping and trying to kill her baby. That's the last straw for the despondent woman, who promptly commits suicide. Although everyone is under suspicion, including the mother and her ex-husband, Dan, the case takes an unusual emotional toll on Detective Stabler, who is drawn in by the mother and her past. The search for the baby Kendall seems to be at a dead end -- but DNA provides clues that help solve the case, and offer new questions for one of the detectives."
      },
      {
        "id": "tvmaze:7155",
        "title": "Philadelphia",
        "season": 8,
        "episode": 16,
        "released": "2007-02-27",
        "overview": "When Detective Benson investigates a rape case outside her jurisdiction, she finds herself being questioned by local Police Captain Julia Millfield and although she gets some answers, some are difficult to accept. Benson also needs to discuss with police psychologist Dr. Rebecca Hendrix about some of her actions that have led to tensions with Detective Stabler and major distractions that have marred the rape case."
      },
      {
        "id": "tvmaze:7156",
        "title": "Sin",
        "season": 8,
        "episode": 17,
        "released": "2007-03-27",
        "overview": "Benson and Stabler pay a visit to The New Souls Church, where Reverend Jeb Curtis, his wife Hannah and their remaining nine children are mourning the death of a military son in Afghanistan. They seem like a loving family from the outside, but things are not what they seem. Hannah provides the detectives with a taped conversation of the Reverend that leads the SVU to come after a different suspect."
      },
      {
        "id": "tvmaze:7157",
        "title": "Responsible",
        "season": 8,
        "episode": 18,
        "released": "2007-04-03",
        "overview": "An honor student dies at a party, while the primary suspect is their alcohol supplier, the four honors students who threw the party - are arrested for criminally negligent homicide, but get a slap on the wrist from Judge Donnelly. Det. Stabler enlists his own teenage daughter Kathleen to guide him through the world of teenage cyberspace to find out where the next party is taking place. The website leads to the home of one of the students, where they find the mother of one of the kids -- Lillian Rice in a compromising position, and she is arrested. The arrest and entire cyberspace scenario hits a personal nerve with Stabler."
      },
      {
        "id": "tvmaze:7158",
        "title": "Florida",
        "season": 8,
        "episode": 19,
        "released": "2007-05-01",
        "overview": "Det. Olivia Benson is called upon to help in an investigation regarding her brother Simon Marsden. She finds herself caught in the investigation of her brother between Police Captain Julia Millfield and FBI Agent Porter. Benson believes her brother is innocent, but this case is starting to threaten her career, as she digs deeper into the case she uncovers family secrets."
      },
      {
        "id": "tvmaze:7159",
        "title": "Annihilated",
        "season": 8,
        "episode": 20,
        "released": "2007-05-08",
        "overview": "The investigation of a bride-to-be's murder uncovers a man's double life; a turn in the case rattles Stabler, who turns to his wife and children for comfort. When Dets. Stabler and Benson speak to the girl's grief-stricken parents they discover her fiance, a CIA agent named Stephen Dashiell, had been threatened by terrorists -- they believe this may have been a professional hit. Their difficult search for Dashiell leads them to a perfect suburban family - and then a tragedy - one that pushes Stabler to face new truths about his own family."
      },
      {
        "id": "tvmaze:7160",
        "title": "Pretend",
        "season": 8,
        "episode": 21,
        "released": "2007-05-15",
        "overview": "Teenage boy is killed in what appears to be a play fight with his best friend, is a victim of a not so innocent crime. The victim's best friend Scott Heston turns up at the squad room with a video and claims he filmed the death. Dets. Benson and Stabler quickly figure out that there is more than meets the eye when the victim's alleged girlfriend arrives at the court to reveal a new twist to this case."
      },
      {
        "id": "tvmaze:7161",
        "title": "Screwed",
        "season": 8,
        "episode": 22,
        "released": "2007-05-22",
        "overview": "The trial of Darius Parker begins and his defense focuses on the conduct of the SVU. He exposes several secrets, like Stabler's intervening for his daughter when she was arrested, and Fin during his days as a narcotics cop. Olivia is in trouble for helping her brother."
      },
      {
        "id": "tvmaze:7162",
        "title": "Alternate",
        "season": 9,
        "episode": 1,
        "released": "2007-09-25",
        "overview": "Cynthia Nixon turns in a powerful performance as a woman with multiple personalities who may have abused and fatally harmed her daughter. As Detectives Olivia Benson and Elliot Stabler dig more deeply into the case - with initial resistance from Dr. Henry Carlisle -- Donovan continues to present even more personalities along with a harrowing twist to the case. For the detectives, it's a race against time to find the infant, while adjusting to sweeping changes in the SVU - a result from poor decisions made by the detectives that have spilled over to the squad."
      },
      {
        "id": "tvmaze:7163",
        "title": "Avatar",
        "season": 9,
        "episode": 2,
        "released": "2007-10-02",
        "overview": "Kristi McGarrett is raped by her sister's boyfriend, Dan Friedich, while her sister Rachel goes missing. Friedich remains a suspect, while Detective Benson and Stabler use Rachel's \"avatar\" to track down the kidnapper before time runs out."
      },
      {
        "id": "tvmaze:7164",
        "title": "Impulsive",
        "season": 9,
        "episode": 3,
        "released": "2007-10-09",
        "overview": "When 15 year-old Shane Mills is diagnosed with a sexually transmitted disease, he claims he caught it from his teacher, Sarah Trent who supposedly seduced him. Sarah argues Shane raped her. Detectives Olivia Benson and Elliot Stabler search further into both Sarah and Shane's lives and uncover some dark secrets."
      },
      {
        "id": "tvmaze:7165",
        "title": "Savant",
        "season": 9,
        "episode": 4,
        "released": "2007-10-16",
        "overview": "Ben Nicholson finds his wife Corrine beaten into a coma, and the only witness is their mentally challenged daughter, Katie. Because of Katie's sensitive mental condition - the detectives are reluctant to have her testify. Detectives Olivia Benson, Elliot Stabler and Dr. Huang work with Katie, and begin to piece together the night of the beating and some of Corrine's well-hidden secrets."
      },
      {
        "id": "tvmaze:7166",
        "title": "Harm",
        "season": 9,
        "episode": 5,
        "released": "2007-10-23",
        "overview": "When a private school teacher is found stabbed to death, the detectives link her case to a victim's center, where she was working with an Iraqi man- his story helped uncover some major military secrets, which may have led to her demise."
      },
      {
        "id": "tvmaze:7167",
        "title": "Svengali",
        "season": 9,
        "episode": 6,
        "released": "2007-11-06",
        "overview": "When a college student is found murdered, Detectives Benson and Elliot Stabler recognize the body's mutilation as a \"copycat\" of serial killer Robert Morton. Cecilia, the last person to see the victim alive, suddenly goes missing herself. In a race to find Cecilia alive, the detectives seek out Morton and discover his loyal following, including one twisted man whose comic book series glorifies Morton's murders. The comic books are the key to finding Cecilia, but the investigation angers Morton's followers and Detective Benson find herself in serious danger."
      },
      {
        "id": "tvmaze:7168",
        "title": "Blinded",
        "season": 9,
        "episode": 7,
        "released": "2007-11-13",
        "overview": "When Detectives Olivia Benson and Elliot Stabler discover a kidnapped girl in the trunk of a stolen rental car, they are led to her abductor; a violent, schizophrenic artist named Saul Picard. Picard's rage seriously injures Elliot, and the trial drives A.D.A. Casey Novak to face not only a complicated case on temporary insanity, but her own dark past as well."
      },
      {
        "id": "tvmaze:7169",
        "title": "Fight",
        "season": 9,
        "episode": 8,
        "released": "2007-11-20",
        "overview": "A young girl's death seems to be linked to the world of ultimate fighting, but after questioning Kona and his girlfriend, the evidence trail leads Detectives Chester Lake and Odafin \"Fin\" Tutuola to two young brothers who have more than a few skeletons in their closet. When the brothers are arrested, tension brew within the SVU."
      },
      {
        "id": "tvmaze:7170",
        "title": "Paternity",
        "season": 9,
        "episode": 9,
        "released": "2007-11-27",
        "overview": "When a family's nanny is found gruesomely murdered, the obvious suspect is her Internet love interest, \"Casanova\". But it isn't long before Detectives Olivia Benson and Elliot Stabler suspect the nanny's employers may have a few dark skeletons in their closet. The investigation leads to a case of murder and infidelity, which is further complicated when Stabler's own family suffers a tragedy that leaves Stabler's unborn child in serious danger."
      },
      {
        "id": "tvmaze:7171",
        "title": "Snitch",
        "season": 9,
        "episode": 10,
        "released": "2007-12-04",
        "overview": "When a polygamist's wife is killed, the Nigerian national fears his testifying in a separate crime may have led to his wife's murder. Detectives Olivia Benson and Elliot Stabler investigate only to find a website exposing potential witnesses to the other crime leading the SVU to believe that his cultural tradition may be the root cause of his wife's murder."
      },
      {
        "id": "tvmaze:7172",
        "title": "Streetwise",
        "season": 9,
        "episode": 11,
        "released": "2008-01-01",
        "overview": "Park Avenue socialite Shelby Crawford's body is found in NYC'S Central Park, and Detectives Olivia Benson and Elliott Stabler initially suspect her wealthy boyfriend. But when Shelby's priceless earrings turn up in a pawnshop, the detectives realize someone wants to cash in on her death. While questioning former classmate Josie Mayes, Benson and Stabler are led to Cole and Cassidy, the leaders of a homeless community."
      },
      {
        "id": "tvmaze:7173",
        "title": "Signature",
        "season": 9,
        "episode": 12,
        "released": "2008-01-08",
        "overview": "Woman's body is found murdered in a park alongside a man with a bullet in his head - Detective Benson and Special Agent Cooper join forces and suspect \"The Woodsman\", a serial killer Cooper has tried to catch for years. Detective Chester Lake and Benson begin to question Cooper's true motives when the male victim is later identified as \"The Woodsman\"."
      },
      {
        "id": "tvmaze:7174",
        "title": "Unorthodox",
        "season": 9,
        "episode": 13,
        "released": "2008-01-15",
        "overview": "When David Zelinsky shows up to school visibly beaten and sexually assaulted, Detectives Olivia Benson and Elliot Stabler look to David's tutor and his Rabbi for answers. The investigation soon leads to one of David's troubled classmates, Jack Trembley, as more victims begin to come forward. The case quickly turns into a media circus as Trembley's attorney, Roxana Hickey, uses it as an opportunity for her own self-promotion."
      },
      {
        "id": "tvmaze:7175",
        "title": "Inconceivable",
        "season": 9,
        "episode": 14,
        "released": "2008-01-22",
        "overview": "The robbery of fertilized embryos from a sperm bank call for Detectives Olivia Benson and Elliot Stabler to track down the thief. Clues from the clinic's security tape lead Benson and Stabler to a long list of suspects including James and Victoria Grall, two publicity-hungry extremists. The detectives race against the clock to find the missing embryos, but that isn't the only clock that's ticking - Olivia considers her own fertility and the possibility of motherhood."
      },
      {
        "id": "tvmaze:7176",
        "title": "Undercover",
        "season": 9,
        "episode": 15,
        "released": "2008-04-15",
        "overview": "When Ashley Tyler is found raped and beaten in a local community garden, Detectives Olivia Benson and Elliot Stabler initially suspect her drug-dealing uncle, Rick Tyler. After the rape kit identifying the rapist goes missing, a crooked prison guard comes under suspicion. Detective Benson puts herself in great danger as she goes undercover as a prison inmate to catch the predator."
      },
      {
        "id": "tvmaze:7177",
        "title": "Closet",
        "season": 9,
        "episode": 16,
        "released": "2008-04-22",
        "overview": "When money manager Jeremy Grandon is found murdered in his loft, detectives Benson and Elliot Stabler initially suspect troubled teenager, Freddie Ramirez. A hidden video camera leads the detectives to the victims secret lover, Lincoln Morse, a star-studded pro- football player whose agent, Gary Lesley, may go too far in protecting his client's persona. Morse's history of memory loss brings defense attorney Rebecca Balthus into the case, while Detective Benson finally finds a boyfriend, Kurt Foss, an editor at the Ledger who unfortunately clashes with her detective work."
      },
      {
        "id": "tvmaze:7178",
        "title": "Authority",
        "season": 9,
        "episode": 17,
        "released": "2008-04-29",
        "overview": "When restaurant manager Dwight Lomax is caught molesting a female employee, he claims that he was following orders from a Detective Milgram over the phone. As detectives Olivia Benson and Elliot Stabler delve into the case, they discover Detective Milgram was a hoax by engineer, Merritt Rook. Rook later turns his trial into a media circus by using the courtroom as a soapbox. Rook's courtroom antics set him free, and with a group of followers, detective Benson and Stabler fall prey to another one of Rook's psychological schemes leaving the SVU department vulnerable."
      },
      {
        "id": "tvmaze:7179",
        "title": "Trade",
        "season": 9,
        "episode": 18,
        "released": "2008-05-06",
        "overview": "Firefighters are called to put out a fire in a burning brownstone, and among the debris uncover a pregnant woman's body, Jenna Ludlow. Detectives Elliot Stabler and Olivia Benson are called to the scene and question the victim's affluent fianc, PJ Bartlett. Interrogating Barlett and his family proves to be a challenge, as Attorney Trevor Langan represents the family and is trying to cover their mistakes all over the country. But when an affair between Ludlow and her fianc's father, Peter Bartlett is revealed, the detectives unveil a web of family secrets including conspiracies, sex, and blackmail."
      },
      {
        "id": "tvmaze:7180",
        "title": "Cold",
        "season": 9,
        "episode": 19,
        "released": "2008-05-13",
        "overview": "An old murder case of a teenage girl is reopened, when Detective Lake is caught in a gunfight and wounded by the case's former investigator, Detective Mary Kralik. The shooting leaves Kralik dead, and Lake's uncooperative answers lead to confusion in the squad room. The case intensifies when Lake escapes from the hospital, and takes hostage the original case's only witness, Celina Cruz. The SVU squad is left to revisit the original murder case, as Detectives Olivia Benson and Elliot Stabler search for Lake and his hostage."
      },
      {
        "id": "tvmaze:7181",
        "title": "Trials",
        "season": 10,
        "episode": 1,
        "released": "2008-09-23",
        "overview": "After a young boy, Christopher Ryan, is caught driving a runaway van, Detective Elliot Stabler and Detective Benson take the seven year-old into questioning. When Christopher claims his foster parents, Gwen and Noah Sibert, bribe him in exchange for abusive medical testing, the detectives investigate his allegations. As Detective Benson continues to study the boy's accusations, she is led back to a former unsolved rape case involving Kaitlyn Murphy. After reviewing both cases, Benson uncovers a common factor, and with help from new A.D.A Kim Greylek she just might be able to solve the cases."
      },
      {
        "id": "tvmaze:7182",
        "title": "Confession",
        "season": 10,
        "episode": 2,
        "released": "2008-09-30",
        "overview": "Teenage boy Eric Byers admits himself into the squad room, and warns the team about an unnatural desire towards his younger stepbrother, Cory Kelly. Detective Elliot Stabler and Olivia Benson's suspicions arise, and Eric admits to also looking at a website to try to curb his pedophilic urge. With no crime committed, the detectives decide to investigate this self-help website for pedophiles leading them to it's creator, Jake Berlin. Eric's rage induced stepfather is also questioned, and shortly after Eric is found missing. The detectives must race to place the clues together to find and stop Eric before any crime is committed."
      },
      {
        "id": "tvmaze:7183",
        "title": "Swing",
        "season": 10,
        "episode": 3,
        "released": "2008-10-14",
        "overview": "Young woman is found trespassing in a family's home, and Detective Elliot Stabler is called in to catch the intruder. The trespasser's wallet leads Stabler to a surprising suspect, his daughter, Kathleen Stabler. Detective Stabler is shocked to find his daughter has fallen in love with the kind of crowd he spends his days condemning. With his family life at stake, Stabler must decide how far he will go to save Kathleen, even turning to his estranged mother, Bernadette Stabler, for help. In order to save Kathleen, Detective Olivia Benson knows that she must step in to help her friend and partner before things take a turn for the worst."
      },
      {
        "id": "tvmaze:7184",
        "title": "Lunacy",
        "season": 10,
        "episode": 4,
        "released": "2008-10-21",
        "overview": "After famous astronaut Marga Janssen's corpse is found afloat in the waters of Battery Park, Detectives Elliot Stabler and Olivia Benson initially believe the murder is linked to a string of serial rapes. Upon further investigation, this theory is proven false when their suspect's alibi checks out. At a dead end, Detective Stabler turns to his old mentor and former colleague of Janssen's, NASA astronaut Dick Finley to shed some light on the case. Finley's advice exposes several more suspects, but possibly takes the detectives further from the truth."
      },
      {
        "id": "tvmaze:7185",
        "title": "Retro",
        "season": 10,
        "episode": 5,
        "released": "2008-10-28",
        "overview": "Detectives Elliot Stabler and Olivia Benson find themselves in unfamiliar territory when Doctor Raye Massey calls them in to investigate the case of a baby infected with AIDS. The detectives enlist the help of Dr. Melinda Warner, a member of an AIDS surveillance team along with Dr. Massey. While Dr. Warner investigates the baby's medical case, Detectives Stabler and Benson discover that the baby had been prescribed ineffective vitamins by Doctor Gideon Hutton, who runs a \"voodoo\" medical practice. After the detectives probe for more answers, similar cases of mistreated AIDS surface, such as the death of Susan Ross' daughter. Her 18-year-old son Tommy Ross also gets pulled into the case, forcing him to decide whether to take on his mother's belief in homeopathic medicine or fight against it. With Dr. Warner's medical research and testimony, the case calls the ethics of Dr. Hutton's practices into question."
      },
      {
        "id": "tvmaze:7186",
        "title": "Babes",
        "season": 10,
        "episode": 6,
        "released": "2008-11-11",
        "overview": "When a boy is lit on fire, Detectives Elliot Stabler and John Munch investigate the malicious crime. In search of a lead, the Detectives end up at Blessed Heart High School, where their student escort, Max Matarazzo introduces them to the 'Blessed Heart Chastity Circle' and senior Alec Bernardi. Alec admits to hurting the victim, but in turn opens a new door for the detectives when he unveils a group of pregnant teenage girls. A strange web of secrets and bad blood in this \"close-knit\" neighborhood offers a challenge for the detectives."
      },
      {
        "id": "tvmaze:7187",
        "title": "Wildlife",
        "season": 10,
        "episode": 7,
        "released": "2008-11-18",
        "overview": "Detective Elliot Stabler arrives on the scene of a murder to find a young woman brutally killed, and carrying a rare bird species found dead in her purse. Dr. Melinda Warner comes back with some startling evidence - the saliva found in the cuts on the victim's body shows she was mauled by a tiger. Oscar Assadorian leads the detectives to the victim's twin sister, Anna Bleers who in turn leads the detectives to Hip Hop artist, Gots Money. Gots, who admits to working for an animal smuggling ring, agrees to go undercover with Detective Stabler to catch the smugglers, Andre Bushido and Tybor. But when Detective Olivia Benson poses as a prostitute to help out her partner undercover, Detective Stabler finds himself wounded and his marriage in disarray."
      },
      {
        "id": "tvmaze:7188",
        "title": "Persona",
        "season": 10,
        "episode": 8,
        "released": "2008-11-25",
        "overview": "Mia Lorimer claims to have been raped in attempt to hide being abused by her husband, Brett Lorimer. Their tenants, Jonah and Linnie Malcolm, are aware of the abuse, but in fear of being evicted, do not report it."
      },
      {
        "id": "tvmaze:7189",
        "title": "PTSD",
        "season": 10,
        "episode": 9,
        "released": "2008-12-02",
        "overview": "Detective Olivia Benson is put to the test when pregnant Corporal Jessica Crewes disappears from her post as a Marine, and is about to give birth to her rapist's child. When Jessie is found dead in the trunk of her car, Navy Commander Grant Marcus attempts to take over proceedings, but Detective Benson and ADA Kim Greylek must fight together and stand their ground to keep the case within the SVU squad. With flashbacks of sexual assault, Detective Benson soon realizes that her past may stir up painful emotions that threaten her ability to remain professional, and enlists the help of Detective Odafin Tutulola to find Jessie's killer."
      },
      {
        "id": "tvmaze:7190",
        "title": "Smut",
        "season": 10,
        "episode": 10,
        "released": "2008-12-09",
        "overview": "Kelly Sun is found wandering Riverside Park, beaten and raped, and has no memory of what happened. Detective Olivia Benson discovers Sun was on her way to Korea, but never boarded her flight and instead is found leaving the airport with mystery man, Eric Lutz."
      },
      {
        "id": "tvmaze:7191",
        "title": "Stranger",
        "season": 10,
        "episode": 11,
        "released": "2009-01-06",
        "overview": "Heather Hallander miraculously returns home after being reported missing over four years ago. Unrecognizable to her family, Heather tells Detectives Olivia Benson and Elliot Stabler of the cement cell where she spent the past four years as a sex slave and of her fortunate escape. Heather's sister, Erica Hallander, is relieved to see her long-lost sister after launching a website asking for search tips, but, Nikki Hallander, Heather's other sister, seems annoyed with her return. In search of the mystery kidnapper, Benson and Stabler drive Heather around town to help stir up any memories of her abduction. When Heather's answers don't seem to match up, the detectives find revealing evidence that make them question Heather's kidnapping and true identity."
      },
      {
        "id": "tvmaze:7192",
        "title": "Hothouse",
        "season": 10,
        "episode": 12,
        "released": "2009-01-13",
        "overview": "When the body of a fourteen-year-old girl is found floating in the Hudson River, Detectives Olivia Benson and Elliot Stabler think she was smuggled into the country by sex traffickers. To identify the body, Detective Benson goes undercover as a Madame and busts sex trafficker Alik. When Alik makes a deal with ADA Kim Greylek he identifies the body as Elsa Lychkoff. To the detectives' surprise, Elsa wasn't a prostitute, but a child prodigy. Prying more into the victim's secret life, the detectives investigate her elite boarding school and her roommate Jennifer Banks, who in turn, leads them to compulsive gambler, Joseph Lychkoff, Elsa's father. When the motive of Joseph seems obvious as to why he would kill his daughter, Detective Odafin Tutuola discovers some new evidence that could change the entire case."
      },
      {
        "id": "tvmaze:7193",
        "title": "Snatched",
        "season": 10,
        "episode": 13,
        "released": "2009-02-03",
        "overview": "When young girl Rosie Rinaldi is kidnapped, the girl's mother, Liz Ranaldi immediately points Detectives Olivia Benson and Elliot Stabler in the direction of her ex-husband, Geno Parnell, a recently paroled convict. When Parnell's alibi checks out, a fight erupts between Parker and Detectives Stabler and Odafin Tutola, which in turn unveils some knowledge on Parker's ex-wife. Parker admits Liz's father is Frank Hagar, a master thief with a lot of enemies. The detectives pay a visit to Hagar, but are surprised to find he has a severe case of Alzheimer's disease. With the help of Dr. George Huang, the detectives are able to put together a few clues to solve the case, but must pair up again with Parker in order to find Rosie."
      },
      {
        "id": "tvmaze:7194",
        "title": "Transitions",
        "season": 10,
        "episode": 14,
        "released": "2009-02-17",
        "overview": "When a man is found badly beaten with no memory of what happened in a strip club parking lot, Detectives Olivia Benson and Elliot Stabler are at a loss for evidence as a rainstorm washed away any clues. A fake fingernail embedded in the victim's back leads the detectives to believe that the attacker is female. Detective Benson and Stabler turn to the female dancers at the club for questioning, but a homeless man, Sid Gabbert, points the detectives to the victim's truck. Using evidence found in the truck, the detectives learn that the victim, Mark Van Kuren, was sent to repossess the car of strip club dancer, Molly \"Misty\" Lambert. After questioning \"Misty,\" Van Kuren awakes in the hospital with no memory, but brings the attention to his ex-wife Ellen and their 13-year-old transgender son Henry."
      },
      {
        "id": "tvmaze:7195",
        "title": "Lead",
        "season": 10,
        "episode": 15,
        "released": "2009-03-10",
        "overview": "Pediatrician Gilbert Keppler is found guilty of sexually assaulting four of his male patients. Soon after his trial, his attorney Lionel Granger informs the detectives that Keppler will be suing the NYPD and the Denslow Medical Center on the grounds that they knew he was sexually abusing patients long before they took any action to stop him. Detectives Elliot Stabler and Olivia Benson decide to go directly to Keppler for questioning only to find him murdered in his apartment. To the detectives' surprise, ADA Alexandra Cabot shows up at the crime scene, after three years in the witness protection program. Attorney Lorna Scarry reminds Cabot how tough solving a case can be. The SVU team must put the past and lost time behind them in order to solve the case."
      },
      {
        "id": "tvmaze:7196",
        "title": "Ballerina",
        "season": 10,
        "episode": 16,
        "released": "2009-03-17",
        "overview": "When Detectives Benson and Stabler arrive on the scene of a single murder, they discover two more dead bodies, those of Tisa Flores and Alejandro Reyes, in the apartment next door. They investigate Tisa's past and find that she was working at a strip club owned by a former Rockette, Birdie Sulloway. Birdie and her nephew Chet try to assist with the investigation, but when the prime suspect for the three murders suddenly dies, the detectives discover a vigilante with a violent past."
      },
      {
        "id": "tvmaze:7197",
        "title": "Hell",
        "season": 10,
        "episode": 17,
        "released": "2009-03-31",
        "overview": "Young girl, Miriam Burdett, is found in an alley, with her throat cut and evidence of repeated rape and physical abuse. When asked to write who attacked her, because of her inability to speak, she draws a picture of the devil. When Detective Munch investigates, he finds several reports of a local priest, Father Theo Burdett, who neighbors claim is a devil worshipper."
      },
      {
        "id": "tvmaze:7198",
        "title": "Baggage",
        "season": 10,
        "episode": 18,
        "released": "2009-04-07",
        "overview": "After an up-and-coming artist is brutally murdered in her apartment, Detectives Odafin Tutuola and Elliot Stabler link her death to another unsolved murder case. As they pursue the case further, they realize that these two murders have striking similarities to a string of murders by a mysterious serial killer that Detective Victor Moran has been following for months. Moran fights to keep his control over the case as Detectives Fin and Stabler struggle to find the killer."
      },
      {
        "id": "tvmaze:7199",
        "title": "Selfish",
        "season": 10,
        "episode": 19,
        "released": "2009-04-28",
        "overview": "When it is reported by Ruth Walker that her two year-old granddaughter, Sierra Walker, is missing Detectives Olivia Benson and Elliot Stabler investigate. After rounds of interrogation and a failed Amber Alert, Benson and Stabler believe that the prime suspect is none other than Sierra's young and irresponsible mother, Ashlee Walker."
      },
      {
        "id": "tvmaze:7200",
        "title": "Crush",
        "season": 10,
        "episode": 20,
        "released": "2009-05-05",
        "overview": "Kim Garnet is found brutally beaten after she sends out nude photos of herself via text message. Detectives Olivia Benson and Elliot Stabler pay a visit to Kim's boyfriend, Steve Walker, but eventually learn that he is not the only recipient of the nude photos. Kathleen Stabler steps in to give Kim advice, as she tries to track down the culprit who distributed the photos. But after Counselor Samantha Copeland demands that Benson arrest Kim for producing and distributing child pornography, Kim must face the possibility of life-long consequences when Judge Hilda Marsden hands down an unusually harsh sentence."
      },
      {
        "id": "tvmaze:7201",
        "title": "Liberties",
        "season": 10,
        "episode": 21,
        "released": "2009-05-19",
        "overview": "When Pamela Galliano seeks to have a restraining order reinstated against her ex-boyfriend, Tyler Gleason, the assigned judge has something else on his mind. In order for some peace of mind, Judge Koehler asks Detectives Elliot Stabler and Olivia Benson to question a convicted serial killer about the whereabouts of his son's body, which adds a new twist to the case."
      },
      {
        "id": "tvmaze:7202",
        "title": "Zebras",
        "season": 10,
        "episode": 22,
        "released": "2009-06-02",
        "overview": "When a tourist is found dead in Central Park with the word 'guilty' written across her forehead, Detectives Olivia Benson and Elliot Stabler recover photos from the victim's camera. With the help of crime scene unit technician Dale Stuckey, they discover that former artist Peter Harrison was at the park during the crime. After arresting Harrison for questioning, the detectives leave Detectives John Munch and Fin Tutuola to keep Harrison under close surveillance. But when Harrison suddenly escapes, Detective Munch must turn to his ex-wife Gwen for help."
      },
      {
        "id": "tvmaze:7203",
        "title": "Unstable",
        "season": 11,
        "episode": 1,
        "released": "2009-09-23",
        "overview": "Officer Nate Kendall aids a woman in trouble and becomes roped into solving a rape case. While Detectives Elliot Stabler and Olivia Benson believe that Kendall is not right for the case due to his unstable personality, Executive ADA Sonya Paxton joins the team, bringing evidence of a common thread among three other rape cases. With Paxton's help, the team might expose a serial rapist."
      },
      {
        "id": "tvmaze:7204",
        "title": "Sugar",
        "season": 11,
        "episode": 2,
        "released": "2009-09-30",
        "overview": "Young woman's body is found stuffed inside a suitcase, and police believe that Mindy Keefe, the victim, was a train passenger on her way to Tampa when she was murdered. Detectives Elliot Stabler and Olivia Benson turn to Keefe's financier boyfriend, Owen Cassidy's yacht to investigate. However, Cassidy claims he was on his boat during the time of the murder. After further searching, the detectives discover Keefe belonged to an online dating website. But when the CEO of the dating website, Vance Shepard, refuses to comment on the case, the detectives turn to ADA Sonya Paxton for help."
      },
      {
        "id": "tvmaze:7205",
        "title": "Solitary",
        "season": 11,
        "episode": 3,
        "released": "2009-10-07",
        "overview": "When Lily Milton is reported missing, her boyfriend, Parker Hubbard, points Detectives Olivia Benson and Elliot Stabler in the direction of Callum Donovan, Lily's downstairs neighbor and convicted bank robber who spent nineteen years in solitary confinement. During the investigation into Donovan's alibi, Lily is found alive, adding a surprising twist to the case and exposing more of Donovan's dark past."
      },
      {
        "id": "tvmaze:7206",
        "title": "Hammered",
        "season": 11,
        "episode": 4,
        "released": "2009-10-14",
        "overview": "After a night of heavy drinking, Dalton Rindell wakes up to a bloody apartment, a terrible cut on his head and a dead woman in his bed. Unable to recall the night before, Rindell immediately calls the police. Detectives Olivia Benson and Elliot Stabler suspect the crime is the result of a deadly love triangle; however Rindell does not recognize the victim. After questioning Rindell and the victim's family and friends, Benson and Stabler are provided with leads in several different directions. Unsure which lead to follow, the two detectives decide to return to the bar where the night began in order to piece together the gruesome truth."
      },
      {
        "id": "tvmaze:7207",
        "title": "Hardwired",
        "season": 11,
        "episode": 5,
        "released": "2009-10-21",
        "overview": "After Eva Banks makes a shocking discovery about her son, Cory's behavior at school, she takes him to the doctor, only to find out that he has been the victim of sexual abuse. Detectives Olivia Benson and Elliot Stabler come onto the scene and question the victim and his family. From the boy's frightened reaction when his stepfather, Thomas Banks, silences the investigation, it is clear to everyone in the room who the real perpetrator is. Detective Benson and Stabler are about to arrest the suspect when Thomas agrees to give up the leader of the largest pro child-adult relationship civil rights group in exchange for amnesty."
      },
      {
        "id": "tvmaze:7208",
        "title": "Spooked",
        "season": 11,
        "episode": 6,
        "released": "2009-10-28",
        "overview": "When a young couple is found murdered in the back of a padlocked truck, Detectives Olivia Benson and Elliot Stabler investigate the scene and link the male victim to a dangerous Mexican drug cartel. Benson and Stabler follow a lead to an abandoned drug den where they are surprised to see FBI Special Agent Dean Porter, who is separately working on the case. Porter tries to take over the investigation, but suspicion arises and the two continue the hunt for the murderer. Following their intuition, Benson and Stabler come across shocking discoveries, which lead them to believe this case is much larger than a mere drug-related murder."
      },
      {
        "id": "tvmaze:7209",
        "title": "Users",
        "season": 11,
        "episode": 7,
        "released": "2009-11-04",
        "overview": "After a crime scene photo of a murdered teenage girl rapidly becomes an Internet phenomenon, the police initiate an investigation with the victim's father, Greg Dunne. When Greg points the detectives towards Martin Gold, his daughter's suspicious therapist, it turns out that Gold's alibi is airtight. While Fin and Munch are busy tracking down the girl's stolen credit card, Dr. Melinda Warner and Detective Elliot Stabler discover that one of Gold's other patients has broken into the morgue. The case takes an unexpected turn, revealing a sinister prescription for murder at the hands of unlikely suspects."
      },
      {
        "id": "tvmaze:7210",
        "title": "Turmoil",
        "season": 11,
        "episode": 8,
        "released": "2009-11-11",
        "overview": "After risqu? photos of a fifteen-year-old rape victim are leaked onto the internet, Detectives Elliot Stabler and Olivia Benson's case becomes much more complicated. As the detectives' case slowly morphs into an investigation by the State Bar, Stabler's son becomes entangled in a streak of compromising events at the hands of his best friend, a recovering drug addict. As Benson takes charge of the rape case, Stabler is forced to set his personal opinions aside and deal with the potentially life-threatening situation his son and his friend have so carelessly gotten themselves into."
      },
      {
        "id": "tvmaze:7211",
        "title": "Perverted",
        "season": 11,
        "episode": 9,
        "released": "2009-11-18",
        "overview": "While in the park, a family stumbles upon the sexually mutilated body of Clyde Vandyne, a member of a biker gang known for prostitution and contract killing. To everyone's surprise, incriminating DNA evidence points to Detective Benson as the prime suspect. Munch and Fin investigate the murder, while Stabler fights to prove his partner's innocence. The detectives must find the missing link to both Vandyne's murder and Benson's involvement. A"
      },
      {
        "id": "tvmaze:7212",
        "title": "Anchor",
        "season": 11,
        "episode": 10,
        "released": "2009-12-09",
        "overview": "When two young girls are similarly murdered a little over a month apart, Detective Odafin Tutuola decides to investigate the gruesome crimes. After a third killing, Fin discovers that all three children were \"anchor babies\" of immigrant families, and reaches out to the Center of Immigrant Services. After sifting through the Center's hate mail, and witnessing a fight between immigration lawyer Randall Carver and Joe Thagard, a fanatical follower of a xenophobic talk show host, Fin begins to narrow in on the killer."
      },
      {
        "id": "tvmaze:7213",
        "title": "Quickie",
        "season": 11,
        "episode": 11,
        "released": "2010-01-06",
        "overview": "When seventeen year-old Andrea McWilliams is found strangled and beaten to death in an alley, her ex-boyfriend leads the cops to a website that McWilliams used to meet up with random men. Detective Olivia Benson decides to create a user account for the site and finds womanizer Peter Butler, the man who met up with McWilliams. The case is closed when a different suspect is proven guilty of her murder, and a new one opens when McWilliams rape kit tests positive for HIV. Not only is HIV spreading as a result of countless attacks, but now the detectives must also catch a rapist on the loose."
      },
      {
        "id": "tvmaze:7214",
        "title": "Shadow",
        "season": 11,
        "episode": 12,
        "released": "2010-01-13",
        "overview": "When a rich and powerful couple with political connections is found murdered in their bedroom, Detectives Olivia Benson and Elliot Stabler decide to speak to the deceased couple's daughter, Anne, for more information. After hearing Anne's account of a nefarious man who has been following her, the detectives soon discover that Anne's supposed stalker is none other than Detective Ash Ramsey of the Special Frauds division. Convinced that Anne killed her parents for their money, Ramsey becomes suspicious of Anne's business manager and is led to believe that he helped her steal money from the foundation she runs. When blackmail and embezzlement come into play, the detectives find that their lives may be at risk over a girl with some serious parent issues."
      },
      {
        "id": "tvmaze:7215",
        "title": "P.C.",
        "season": 11,
        "episode": 13,
        "released": "2010-03-03",
        "overview": "Detectives Olivia Benson and Eliot Stabler find a woman bleeding from the neck and nearly dead. The woman dies before they reach the hospital, and soon the investigation leads them to the frontman of the death metal band Vampyre Sacrifyce. He bites girls, steals blood from the local blood bank and sings about violence to women all in the name of his strange, vampiric lifestyle. The singer claims he was nowhere near the scene of the crime, and soon a lesbian rights group led by Babs Duffy gets involved, claiming the victim's death was a result of police neglect. However, when more women from Babs's group are attacked, it becomes clear that the victim's case wasn't an isolated incident and that someone out there has a larger plan to bring the group down."
      },
      {
        "id": "tvmaze:7216",
        "title": "Savior",
        "season": 11,
        "episode": 14,
        "released": "2010-03-03",
        "overview": "When a series of young prostitutes are found murdered with homemade prayer cards attached to their bodies, Detectives Olivia Benson and Eliot Stabler struggle to find the common thread. However, just when they think that they've found the murderer, Captain Donald Cragen informs the detectives that another victim named Gladys has turned up with a prayer card. This time she survived. As the case unfolds, Benson finds herself getting emotionally invested in the survivor until she is forced to make a decision that she isn't ready to face."
      },
      {
        "id": "tvmaze:7217",
        "title": "Confidential",
        "season": 11,
        "episode": 15,
        "released": "2010-03-10",
        "overview": "When security cameras record footage of a woman being abducted, it isn't long before Captain Donald Cragen and the SVU squad find the woman dead in the basement. Detective John Munch recalls a similar case from twenty years before, sending Detectives Olivia Benson and Eliot Stabler to Sing Sing to speak to the culprit, who begs them to reopen his case and prove his innocence. As strange similarities between the two cases begin to arise, Benson and Stabler face fierce opposition from Ingrid Block, the pit bull attorney for the main suspect who will do whatever it takes to prove her client's innocence. Ultimately, it falls on DA Jack McCoy to decide whether or not the ruthless lengths to which Block went to defend her client constituted a crime itself."
      },
      {
        "id": "tvmaze:7218",
        "title": "Witness",
        "season": 11,
        "episode": 16,
        "released": "2010-03-17",
        "overview": "Soon after a young girl, Laine McAlister, is raped in her apartment building's stairwell, Detectives Olivia Benson and Eliot Stabler meet Laine in the hospital and find her extremely shaken with a large cut on her hand. After an unpleasant exchange with a man she claims is her boyfriend, the detectives become suspicious that she may have fabricated her rape to get attention. Their suspicions grow when she waits to reveal that there was an eyewitness. As the gravity of the situation intensifies, Benson and Stabler find themselves in a race to track down the witness and get a testimony before it is too late."
      },
      {
        "id": "tvmaze:7219",
        "title": "Disabled",
        "season": 11,
        "episode": 17,
        "released": "2010-03-24",
        "overview": "Detectives Olivia Benson and Eliot Stabler are called in to investigate when a disabled woman, Cara Benson, is beaten and raped. Though the victim's condition has rendered her unable to speak, the detectives soon deduce that someone close to her is responsible, with the lead suspects being her resentful sister and troubled nephew. As the investigation continues, Benson and Stabler strive to make Cara comfortable with coming forward to stand up for herself and illuminating some of the disturbing truths about the assisted living business."
      },
      {
        "id": "tvmaze:7220",
        "title": "Bedtime",
        "season": 11,
        "episode": 18,
        "released": "2010-03-31",
        "overview": "Detective Olivia Benson and Detective Eliot Stabler are called to the scene of a crime where an investigative journalist has been found dead in her bed with an \"X\" carved into her cheek. Captain Donald Cragen recognizes the killer's tactics from a similar case thirty years earlier, when the \"Bedtime Butcher\" murdered five women in the Bronx. The trail leads the detectives to a patrol cop, a jealous ex-lover of the prime suspect, and even sends Benson on a dangerous undercover mission to uncover the truth."
      },
      {
        "id": "tvmaze:7221",
        "title": "Conned",
        "season": 11,
        "episode": 19,
        "released": "2010-04-07",
        "overview": "Detectives Olivia Benson and Eliot Stabler are called to a crime scene where the body of a young man has been found in a hotel storage room. Initially, it is assumed that the young man was a wedding crasher, but security tapes indicate that he was with the bride's godfather. However, when the presumed victim turns up alive, Benson and Stabler must determine the true identity of the victim and find the murderer."
      },
      {
        "id": "tvmaze:7222",
        "title": "Beef",
        "season": 11,
        "episode": 20,
        "released": "2010-04-21",
        "overview": "After a young woman is sexually assaulted and murdered, Detectives Olivia Benson and Eliot Stabler track down the woman's boyfriend - their first suspect - but learn that he is a devout vegan who wouldn't hurt a fly. They soon find that the victim had been deeply involved in the fight to expose questionable practices in the meat-packing industry, even going undercover at a large company to find out the truth. Benson goes undercover herself to retrace the woman's footsteps and to identify who the victim might have angered along the way."
      },
      {
        "id": "tvmaze:7223",
        "title": "Torch",
        "season": 11,
        "episode": 21,
        "released": "2010-04-28",
        "overview": "When two sisters are killed in a fire, Detectives Olivia Benson and Eliot Stabler are confused about why they are called to investigate. They soon discover that Stabler's old partner, ADA Jo Marlowe , has been put on the case -- despite the absence of a sex crime -- because the two victims were so young, and that she has enlisted the duo to help. However, as the investigation continues, Benson and Stabler find that the case might be more suited to their department than anyone originally assumed, and Stabler's interrogation tactics threaten to get the detectives into trouble."
      },
      {
        "id": "tvmaze:7224",
        "title": "Ace",
        "season": 11,
        "episode": 22,
        "released": "2010-05-05",
        "overview": "When a pregnant woman is raped, Detectives Olivia Benson and Eliot Stabler arrive at the hospital to find that she has fled. Even when someone is arrested for a similar offense, ADA Jo Marlowe says she doesn't have a case in court unless they find the victim and get a statement from her. Soon, Benson and Stabler connect the woman to an illegal adoption operation, forcing them to go undercover and expose the truth."
      },
      {
        "id": "tvmaze:7225",
        "title": "Wannabe",
        "season": 11,
        "episode": 23,
        "released": "2010-05-12",
        "overview": "After a man flashes customers at an electronics store, it is discovered that someone who matches his description has recently raped three young girls. Captain Donald Cragen orchestrates a movement to catch the rapist, and a rookie cop makes an arrest. Detectives Olivia Benson and Eliot Stabler confirm that they've found their man, but after ADA Jo Marlowe expresses some doubts, it is soon discovered that the so-called rookie may have some secrets of his own."
      },
      {
        "id": "tvmaze:7226",
        "title": "Shattered",
        "season": 11,
        "episode": 24,
        "released": "2010-05-19",
        "overview": "When an 8-year-old boy is kidnapped off a city street, Detectives Olivia Benson and Eliot Stabler are called to investigate. They soon find that the boy is in his father's custody, and his mother has a history of overstepping her bounds. As the case comes to a head, members of the SVU team find themselves in a life-threatening standoff and learn shocking details about ADA Jo Marlowe's past."
      },
      {
        "id": "tvmaze:7227",
        "title": "Locum",
        "season": 12,
        "episode": 1,
        "released": "2010-09-22",
        "overview": "Detectives Benson and Stabler are called to the hospital after a 10-year-old girl is raped. They arrive to find her so traumatized that she cannot even tell them her name. With the help of Detectives Odafin Tutuola and John Munch, they are able to identify the young victim. But they soon realize that her home life is far from normal as Dr. George Huang discovers that her mother suffers from a rare condition that renders her unable to recognize that the young girl is, in fact, her daughter. When the detectives find themselves without a lead, Erik Weber, a man they met on their previous case, decides to get involved. But he may be overstepping his bounds."
      },
      {
        "id": "tvmaze:7228",
        "title": "Bullseye",
        "season": 12,
        "episode": 2,
        "released": "2010-09-22",
        "overview": "Detectives Benson and Stabler are called to the hospital after a 10-year-old girl is raped. They arrive to find her so traumatized that she cannot even tell them her name. With the help of Detectives Odafin Tutuola and John Munch, they are able to identify the young victim. But they soon realize that her home life is far from normal as Dr. George Huang discovers that her mother suffers from a rare condition that renders her unable to recognize that the young girl is, in fact, her daughter. When the detectives find themselves without a lead, Erik Weber, a man they met on their previous case, decides to get involved. But he may be overstepping his bounds."
      },
      {
        "id": "tvmaze:7229",
        "title": "Behave",
        "season": 12,
        "episode": 3,
        "released": "2010-09-29",
        "overview": "Rape victim, Vicki, is brought into the hospital initially claiming she has been attacked multiple times by the same man. Detectives Benson and Stabler are determined to help her, but she lives in such terror that she then denies she has been raped at all and refuses to submit to a rape kit. As Benson looks for a way to help, she is horrified to learn that there are police precincts and evidence labs across the country that never test their rape kits at all. The investigation soon leads her to Los Angeles where she meets Detective Rex Winters, who has information that could finally help Vicki get justice."
      },
      {
        "id": "tvmaze:7230",
        "title": "Merchandise",
        "season": 12,
        "episode": 4,
        "released": "2010-10-06",
        "overview": "When a 15-year-old girl is hit by a car and killed, Detectives Benson and Stabler are surprised when Dr. Melinda Warner rules it a homicide. She has found signs that the girl was being starved, and had even recently given birth. As the two look into the case with the help of Detective Odafin Tutuola and Dr. George Huang, they find that the girl had fallen victim to a human trafficking ring, and though some think it's a case for the FBI, the cops instead reach out to Assistant U.S. Attorney and friend Christine Danielson, who has moved up in the world since the detectives last saw her. Meanwhile, Captain Donald Cragen is frustrated by his crumbling precinct."
      },
      {
        "id": "tvmaze:7231",
        "title": "Wet",
        "season": 12,
        "episode": 5,
        "released": "2010-10-13",
        "overview": "Detectives Benson and Stabler arrive on the scene where a woman is found dead in Bethesda Fountain. When her squeaky clean image doesn't match up with her promiscuous actions on the night of her murder, ADA Mikka Von encourages the cops to dig deeper into her past. When they find out that the woman was poisoned with toxic mushrooms, they suspect a crazed activist and professor is responsible. As the case develops, Benson and Stabler go to dangerous lengths to ensure that justice is served."
      },
      {
        "id": "tvmaze:7232",
        "title": "Branded",
        "season": 12,
        "episode": 6,
        "released": "2010-10-20",
        "overview": "When detectives Benson and Stabler investigate a brutal attack on an unassuming, upstanding father, they find he's also been branded on his chest with a wire coat hanger. Before long, another victim turns up who has suffered the same injuries. Once they track down the suspect, some startling memories surface that completely change the course of the case."
      },
      {
        "id": "tvmaze:7233",
        "title": "Trophy",
        "season": 12,
        "episode": 7,
        "released": "2010-11-03",
        "overview": "After a young woman has been raped and murdered, her body turns up in an industrial laundry facility. Detectives Benson and Stabler soon find that she was involved in an environmental group called CLEAN, and it isn't long before they track down the prime suspect. However, the case soon puts them in the line of fire and exposes a much larger mystery that includes even more victims. As the investigation progresses, Detective Benson builds a connection to a victim's daughter that invokes her own past in ways she never anticipated."
      },
      {
        "id": "tvmaze:7234",
        "title": "Penetration",
        "season": 12,
        "episode": 8,
        "released": "2010-11-10",
        "overview": "Agent Dana Lewis is assaulted by a stranger and asks Detective Benson to have her rape kit tested. Before the cops can really help her, Lewis goes back undercover and refuses to talk about the assignment or the rape, for fear that she will be exposed and pulled off the case. She reluctantly allows Benson and Stabler to get involved in what looks like a protest against the construction of a mosque at Ground Zero, but they find themselves scrambling to put the pieces together of a much larger puzzle than they had anticipated."
      },
      {
        "id": "tvmaze:7235",
        "title": "Gray",
        "season": 12,
        "episode": 9,
        "released": "2010-11-17",
        "overview": "Detective Stabler goes to his daughter Kathleen's university to discuss rape prevention at a Take Back the Night rally. When a girl from the crowd accuses another student of rape, Stabler and Detective Benson are assigned the case. What emerges are conflicting accounts and fiery accusations without substantial evidence to back them up. To complicate matters further, ADA Paxton returns to prosecute the case, and Kathleen oversteps her bounds, which could land her and her father in hot water."
      },
      {
        "id": "tvmaze:7236",
        "title": "Rescue",
        "season": 12,
        "episode": 10,
        "released": "2010-12-01",
        "overview": "With young Calvin in her care, Detective Benson continues the search for his drug-addict mother, Vivian, but Detective Stabler notices a strong bond forming between Benson and the boy. When Vivian's name comes up during a rape investigation, Captain Cragen assigns Detectives Fin and Munch to the case instead. However, it will take more than Cragen's orders to keep Benson away."
      },
      {
        "id": "tvmaze:7237",
        "title": "Pop",
        "season": 12,
        "episode": 11,
        "released": "2011-01-05",
        "overview": "A young boy is found dead on a park carousel after being dropped off by his uncle Joe Gilbert. When Detectives Benson and Stabler learn that the boy was beaten to death they suspect that it could be the result of a bully at school. The investigation leads to an unsettling gambling ring. Detectives suspect that Gilbert's acquaintance, Joe Roberts is beating his wife Sandra and the case takes a horrifying turn. In response, a lawyer, Debbie Marsh, gets involved."
      },
      {
        "id": "tvmaze:7238",
        "title": "Possessed",
        "season": 12,
        "episode": 12,
        "released": "2011-01-05",
        "overview": "A young man finds that his girlfriend Larissa Welsh has been attacked in her apartment with evidence that points to her buried past. Detectives Benson and Stabler go in search of her attacker and discover that an elderly man, Orville Underwood, may have been involved in traumatic events of Welsh's past. For the detectives, solving the case comes down to who was in possession of the evidence."
      },
      {
        "id": "tvmaze:7239",
        "title": "Mask",
        "season": 12,
        "episode": 13,
        "released": "2011-01-12",
        "overview": "Debbie Shields comes home to find her partner Ann Jackson being raped by a man wearing a haunting mask. Shields contacts Ann's father to notify him of her critical condition. As detectives Benson and Stabler interrogate Ann's father, Captain Jackson, his sordid past is revealed filled with sexual and alcohol addiction. Jackson's new role as a sex therapist is hindering the detectives from getting the information they need to solve the case and if Jackson won't comply, the detectives are going to have to get creative."
      },
      {
        "id": "tvmaze:7240",
        "title": "Dirty",
        "season": 12,
        "episode": 14,
        "released": "2011-01-19",
        "overview": "Detective Saliyah \"Sunny\" Qadri goes in search of Brooklyn District Attorney Page Ferguson, who she fears may be in danger. Qadri finds Ferguson just in time to witness her fall from the top of a parking garage. When Benson arrives, she discovers that the crime scene has been tampered with. Benson turns to an old friend, Assistant U.S. Attorney Christine Danielson for help. As the investigation progresses, Benson begins to question Ferguson's suspicious past and Qadri's involvement in the case."
      },
      {
        "id": "tvmaze:7241",
        "title": "Flight",
        "season": 12,
        "episode": 15,
        "released": "2011-02-02",
        "overview": "When it is discovered that a teenage girl is suffering from Post Traumatic Stress Disorder due to sexual abuse, all leads point to billionaire Jordan Kress. As Detectives Benson and Stabler continue to investigate, Kress involves his lawyer, Dwight Stanitch, who throws the whole case awry."
      },
      {
        "id": "tvmaze:7242",
        "title": "Spectacle",
        "season": 12,
        "episode": 16,
        "released": "2011-02-09",
        "overview": "After the sexual assault of a young woman is videotaped and featured on a campus-wide intranet feed, detectives Elliot Stabler and Odafin \"Fin\" Tutola go in search of the victim and her attacker. As they delve into the investigation, it becomes clear that the perpetrator created a spectacle to draw attention to his own issues."
      },
      {
        "id": "tvmaze:7243",
        "title": "Pursuit",
        "season": 12,
        "episode": 17,
        "released": "2011-02-16",
        "overview": "When Alicia Harding, host of the television series \"Neighborhood Predator,\" begins to receive personal threats, her life-long pursuit to find her sister's abductor emerges. Detectives Olivia Benson and Odafin \"Fin\" Tutola are joined in the investigation by ADA Sonya Paxton, who may be too involved in the case. As Harding thinks she is getting close to the truth, another's life hangs in the balance."
      },
      {
        "id": "tvmaze:7244",
        "title": "Bully",
        "season": 12,
        "episode": 18,
        "released": "2011-02-23",
        "overview": "When an art patron, Cindi, discovers a gruesome work of art, it leads gallery visitors to find a woman dead in her apartment above. Detectives Benson and Stabler look into the victim's personal contacts in search of suspects, including the victim's close friend Annette Cole. The detectives soon discover a work environment that leads them to question if bullying does go beyond the playground."
      },
      {
        "id": "tvmaze:7245",
        "title": "Bombshell",
        "season": 12,
        "episode": 19,
        "released": "2011-03-23",
        "overview": "After Jerry Bullard is found stabbed in a parking garage, Detectives Benson and Stabler discover that the family man might have had an illicit hobby. When the detectives go undercover at a swingers club they meet a popular lady named Cassandra Davina and her jealous boyfriend, Doug Loveless. As tensions grow, the detectives question just how far jealousy can push someone."
      },
      {
        "id": "tvmaze:7246",
        "title": "Totem",
        "season": 12,
        "episode": 20,
        "released": "2011-03-30",
        "overview": "When a young girl is found dead with a doll that is believed to have been left as a totem, detectives Benson and Stabler team up with Captain Jackson, a psychologist who assisted them with a recent case, to investigate her murder. Jackson joins the detectives as they retrace the girl's last steps and go to meet with her piano teacher June Frye. Jackson's skills prove to be invaluable in deciphering the meaning of the totem and ultimately finding her killer."
      },
      {
        "id": "tvmaze:7247",
        "title": "Reparations",
        "season": 12,
        "episode": 21,
        "released": "2011-04-06",
        "overview": "Jonah Dekker comes to NYC from Los Angeles to defend his cousin who has been accused of rape. Meanwhile, ADA Casey Novak returns to help detectives Benson and Stabler with the case. The detectives soon discover that the case goes much deeper than the current accusation and it raises the question: how far will someone go to get revenge for their family?"
      },
      {
        "id": "tvmaze:7248",
        "title": "Bang",
        "season": 12,
        "episode": 22,
        "released": "2011-05-04",
        "overview": "When an abandoned baby is found on playground, Detectives Benson and Stabler go in search of the child's caregiver. Upon meeting the nanny and her boyfriend, Ken Turner, they soon realize that he is also engaged to the baby's adoptive mother, Dede Aston. As the detectives dig deeper into Turner's malevolent past, they realize that the law may be on his side."
      },
      {
        "id": "tvmaze:7249",
        "title": "Delinquent",
        "season": 12,
        "episode": 23,
        "released": "2011-05-11",
        "overview": "When a young woman finds a teenage boy asleep and naked in her bedroom, his mother, Bree Walsh, is quick to defend him. While Detective Benson and Detective Stabler try to figure out what truly happened, they also have to manage the sneaky teenager and his naive mother. As the detectives dig deeper, they discover how deceptive appearances can be."
      },
      {
        "id": "tvmaze:7250",
        "title": "Smoked",
        "season": 12,
        "episode": 24,
        "released": "2011-05-18",
        "overview": "When a woman is murdered during an afternoon shopping trip with her daughter, Detectives Benson and Stabler are called in because she was scheduled to testify in their high-profile rape case. As the detectives continue to investigate the correlation between the murder and their case, they discover unlikely friendships that will lead them to the truth."
      },
      {
        "id": "tvmaze:7251",
        "title": "Scorched Earth",
        "season": 13,
        "episode": 1,
        "released": "2011-09-21",
        "overview": "The detectives of the Special Victims Unit are called to the scene when a hotel maid reports being assaulted by Italian diplomat Robert Distasio Bureau Chief Mike Cutter and ADA Alex Cabot prosecute the high-profile case, which quickly grows more complicated as the maid's credibility is publicly questioned. Detective Amanda Rollins joins the Manhattan SVU from Atlanta, while Benson struggles to cope with the fall-out from the shooting in the precinct."
      },
      {
        "id": "tvmaze:7252",
        "title": "Personal Fouls",
        "season": 13,
        "episode": 2,
        "released": "2011-09-28",
        "overview": "As Coach Ray Masters is inducted to the Metro Basketball Hall of Fame by former students Carmelo Anthony and Chris Bosh, an ex-player accuses the coach of sexually abusing him as a child. Detective Nick Amaro transfers into the SVU squad and is thrown on to the case. The detectives interview former players but no one admits to abuse, forcing Benson and Fin to dig deeper into Coach Ray's most successful player, basketball star Prince Miller and his manager/cousin"
      },
      {
        "id": "tvmaze:7253",
        "title": "Blood Brothers",
        "season": 13,
        "episode": 3,
        "released": "2011-10-05",
        "overview": "When a pregnant thirteen-year-old girl refuses to identify her baby's father, Benson and the SVU squad work to determine if she was raped. Their investigation leads to several men in her life including Tripp Raines, the teenage son of high-profile political couple Andrew and Kathleen Raines and Arturo Rivera, the son of the Raines' housekeeper The detectives uncover much more than they bargained for when a Raines family secret is revealed and a family member goes missing."
      },
      {
        "id": "tvmaze:7254",
        "title": "Double Strands",
        "season": 13,
        "episode": 4,
        "released": "2011-10-12",
        "overview": "Dancer is followed home and raped by a man with a distinctive tattoo and the details of the attack remind Rollins of a serial rapist she was tracking back home. The detectives arrest Gabriel Thomas, a family man who maintains his innocence, but his description and DNA match this assault and the string of rapes across multiple states that Rollins had been investigating. Although the evidence supports the arrest, the more Detectives Benson and Amaro dig into Thomas' past, the more they begin to believe his story."
      },
      {
        "id": "tvmaze:7255",
        "title": "Missing Pieces",
        "season": 13,
        "episode": 5,
        "released": "2011-10-19",
        "overview": "Young woman visiting from Buffalo claims that her car was stolen outside a Manhattan convenience store with her baby still buckled in the backseat. Benson and Amaro get as much information as they can from the anxious mother and her boyfriend at the police station, while Fin and Rollins track their path from Buffalo for clues. When the parents' stories don't add up, the detectives must uncover what really happened to the missing baby, and the truth surprises everyone."
      },
      {
        "id": "tvmaze:7256",
        "title": "True Believers",
        "season": 13,
        "episode": 6,
        "released": "2011-11-02",
        "overview": "Young music student is raped at gunpoint in her own apartment, but with her help, the SVU squad makes a quick arrest. Bureau Chief Mike Cutter takes over the case when he finds that opposing counsel is high-profile defense attorney Bayard Ellis. As Ellis works to undermine their police work and damage the victim's credibility, the detectives take the stand to prove they have more than just a he-said, she-said case."
      },
      {
        "id": "tvmaze:7257",
        "title": "Russian Brides",
        "season": 13,
        "episode": 7,
        "released": "2011-11-09",
        "overview": "When a young woman is found brutally murdered, the SVU detectives use her distinctive tattoos to identify her as a recently engaged Russian mail-order bride. Upon questioning her distraught fianc, they learn that she was kidnapped and held for ransom the night of their engagement party. While the detectives follow the money to a deadly blackmail scam run by the Russian Mafia, Captain Cragen goes undercover as a sad and lonely suitor to lure out a killer."
      },
      {
        "id": "tvmaze:7258",
        "title": "Educated Guess",
        "season": 13,
        "episode": 8,
        "released": "2011-11-16",
        "overview": "Man in custody at a mental hospital claims to have witnessed a rape in a break room. Despite the witness' shaky credibility the SVU begins an investigation, but the alleged victim, Gia Eskas, denies being assaulted. Detectives Benson and Rollins struggle to piece together what really happened to this young woman, especially when her aunt and mother say Gia has been repeatedly institutionalized, and has cried rape in the past."
      },
      {
        "id": "tvmaze:7259",
        "title": "Lost Traveler",
        "season": 13,
        "episode": 9,
        "released": "2011-11-30",
        "overview": "Romani child disappears on his way home from school. Benson and Amaro interview the distraught parents, who are distrustful of the police. The initial investigation leads Fin and Rollins to the powerful leader of the Romani community, but he denies any involvement. The family remains hopeful their boy will be found, especially when they discover his cell phone is still active. With the help of their TARU tech and a meddling newspaper reporter, the detectives narrow the perpetrators to a mentally challenged neighbor, throwing the tight-knit Romani community into turmoil."
      },
      {
        "id": "tvmaze:7260",
        "title": "Spiraling Down",
        "season": 13,
        "episode": 10,
        "released": "2011-12-07",
        "overview": "Military colleague of Detective Amaro's wife reports his 14-year-old daughter missing. The detectives find the girl working as a prostitute under a possessive pimp. They quickly set up a sting operation to entrap Johns on rape charges with a minor, and arrest aging pro quarterback Jake Stanton Detective Benson and ADA Cabot seek to make an example out of the football legend, but the case is thrown into chaos with the return of defense attorney Bayard Ellis, who questions Stanton's mental capacity after years of injuries on the field."
      },
      {
        "id": "tvmaze:7261",
        "title": "Theatre Tricks",
        "season": 13,
        "episode": 11,
        "released": "2012-01-11",
        "overview": "An actress in an interactive theater production is raped on stage, while the audience believes it to be part of the show. The SVU detectives hit a dead end in their investigation when they learn the show's passionate director gave the audience, including the assailant, masks to wear during the performance. Detectives Rollins and Tutuola track down an obsessed fan of the young actress who recorded the assault while stalking her, which leads Detectives Benson and Amaro to a respected judge With the judge's reputation on the line, the SVU squad explores the underbelly of the New York theater world to uncover who really orchestrated the public attack."
      },
      {
        "id": "tvmaze:7262",
        "title": "Official Story",
        "season": 13,
        "episode": 12,
        "released": "2012-01-18",
        "overview": "The powerful CEO of a private military contractor is confronted by protesters and later found drugged and sexually assaulted in a park. Detectives Benson and Amaro begin their investigation but find the victim unwilling to cooperate. As the SVU squad and the district attorney's office explore the motives behind the attack, a much larger crime and conspiracy in Iraq is unveiled."
      },
      {
        "id": "tvmaze:7263",
        "title": "Father's Shadow",
        "season": 13,
        "episode": 13,
        "released": "2012-02-08",
        "overview": "An aspiring actress is found unconscious in Central Park with drugs in her system and evidence of sexual trauma. Detectives Benson and Amaro pay a visit to the reality show producer for whom she had auditioned just before the attack, and stop him from assaulting another actress on the casting couch. The detectives arrest the producer, but the situation turns dangerous when his distraught son takes drastic action in order to get his father out of jail. Meanwhile, Benson and Executive ADA David Haden grow closer."
      },
      {
        "id": "tvmaze:7264",
        "title": "Home Invasions",
        "season": 13,
        "episode": 14,
        "released": "2012-02-15",
        "overview": "Gunman storms a family's home, killing the parents and leaving their teenage daughter in critical condition. When a hate crime investigation turns into a dead end, Benson and the SVU detectives struggle to find a motive for such violence. The clues lead to a surprising revelation about Detective Rollins, which threatens her future in the Special Victims Unit."
      },
      {
        "id": "tvmaze:7265",
        "title": "Hunting Ground",
        "season": 13,
        "episode": 15,
        "released": "2012-02-22",
        "overview": "Detective Benson and Executive ADA Haden's romantic weekend is interrupted by news that an underage prostitute has gone missing. As the SVU detectives dig into her disappearance, they find a pattern of several missing escorts who all posted ads on a popular newspaper's website. The line between Benson and Haden's personal and professional lives starts to blur as the squad races against the clock to find the girl before it's too late."
      },
      {
        "id": "tvmaze:7266",
        "title": "Child's Welfare",
        "season": 13,
        "episode": 16,
        "released": "2012-02-29",
        "overview": "Detective Benson's half-brother Simon Marsden turns up in New York after a five year absence, and asks for help - Child Services is threatening to take his children away from him. She asks defense attorney Bayard Ellis to represent her brother, but the seemingly simple case turns into a disaster for Ellis and his client. Meanwhile, a homeless couple finds a newborn baby abandoned near a hospital, and Detectives Fin and Rollins follow the evidence to a shocking discovery."
      },
      {
        "id": "tvmaze:7267",
        "title": "Justice Denied",
        "season": 13,
        "episode": 17,
        "released": "2012-04-11",
        "overview": "Rape victim is brought to the hospital after a harrowing hours-long ordeal, and Benson recognizes the suspect's M.O. from a case she solved eight years ago. The jailed rapist confessed to Benson after a tough interrogation but has been claiming his innocence ever since his conviction. The SVU squad is forced to reopen Benson's old case to determine if they are dealing with a copycat or a case of wrongful imprisonment. As Benson's detective work is challenged, her personal relationship with Executive ADA Haden is also placed in jeopardy when Counselor Bayard Ellis gets involved."
      },
      {
        "id": "tvmaze:7268",
        "title": "Valentine's Day",
        "season": 13,
        "episode": 18,
        "released": "2012-04-18",
        "overview": "While video chatting with his wife on the way home from an international business trip, a Wall Street executive watches an intruder assault and abduct her. The kidnappers demand ransom, and Detectives Benson, Amaro, Rollins, and Tutuola are on the scene when the missing housewife arrives to pick up the money. She frantically tells the detectives about her ordeal, but Benson grows suspicious of her story. The SVU squad and Assistant District Attorney Casey Novak dig deeper to find out who the real victim is in this increasingly complicated case."
      },
      {
        "id": "tvmaze:7269",
        "title": "Street Revenge",
        "season": 13,
        "episode": 19,
        "released": "2012-04-25",
        "overview": "String of rapes in West Soho inspires a group of vigilantes to organize against both neighborhood crime and the NYPD. While Reporter Dennis Griscomb takes every opportunity to publicly criticize police efforts, the SVU squad struggles to find a lead in the case until one of the vigilantes is attacked. As the other detectives fight for control over the investigation and angry citizens, Amaro is distracted by the suspicion that his wife is seeing another man"
      },
      {
        "id": "tvmaze:7270",
        "title": "Father Dearest",
        "season": 13,
        "episode": 20,
        "released": "2012-05-02",
        "overview": "Detectives Benson and Amaro investigate the disappearance of a teenaged girl after her young brother calls 9-1-1. While Fin and Rollins look into a possible abduction, they discover the girl had been searching for her biological father, an anonymous sperm donor. The investigation takes a startling turn when a suspect is found to be targeting several young, vulnerable women, all with the same personal connection. But the suspect isn't what he seems, and Dr. Huang must delve into his past to save the women."
      },
      {
        "id": "tvmaze:7271",
        "title": "Learning Curve",
        "season": 13,
        "episode": 21,
        "released": "2012-05-09",
        "overview": "As Detective Tutuola's son Ken prepares to tell his father that he is getting married, his fiance is brutally assaulted by a street gang. He's the latest in a string of recent hate crimes against gay men, and before the SVU squad can arrest a suspect, a school teacher, is similarly brutalized even though he doesn't fit the pattern. As the detectives search for a connection, they learn that he was dismissed from an elite private school for having an inappropriate relationship with a student In trying to make their case, they quickly realize the facts don't add up and another teacher may hold the clues to what really happened."
      },
      {
        "id": "tvmaze:7272",
        "title": "Strange Beauty",
        "season": 13,
        "episode": 22,
        "released": "2012-05-16",
        "overview": "While off-duty, Detective Rollins spots a young woman screaming in the back of a moving taxi. The SVU squad quickly identifies the victim as a rebellious teenager, estranged from her family and experimenting in the world of tattoos and self-mutilation. The case takes an unexpected turn when the Medical Examiner presents the detectives with a cleanly severed leg, reminiscent of a similar finding in an old unsolved case. The detectives are drawn into the psychological elements of self-mutilation and ritual amputation as they investigate two brothers in order to link the cases and find the missing woman."
      },
      {
        "id": "tvmaze:7273",
        "title": "Rhodium Nights",
        "season": 13,
        "episode": 23,
        "released": "2012-05-23",
        "overview": "An underage escort is found dead at a wild bachelor party, and Captain Cragen cautions his team to investigate with discretion, as there were several high-profile people at the scene. In their efforts to question a well-known leader in the New York escort world, Benson and Amaro encounter former SVU detective Brian Cassidy, who's been working undercover. With his help, the detectives dig deeper into a vicious power struggle between the two top escort businesses, but before the case is cracked, a shocking event threatens to destroy the life of one SVU squad member."
      },
      {
        "id": "tvmaze:7274",
        "title": "Lost Reputation",
        "season": 14,
        "episode": 1,
        "released": "2012-09-26",
        "overview": "In the season 14 premiere, the SVU squad is reeling from the fallout after Captain Cragen wakes up with a dead escort - a potential witness in an SVU case - in his bed. Tensions run high at the precinct as the detectives contend with District Attorney Paula Foster's investigation of Cragen, as well as the arrival of a tough new captain, Steven Harris. Brian Cassidy treads an increasingly narrow line as an undercover cop in Bart Ganzel's escort organization, as Detective Nick Amaro struggles with the case and his marriage."
      },
      {
        "id": "tvmaze:7275",
        "title": "Above Suspicion",
        "season": 14,
        "episode": 2,
        "released": "2012-09-26",
        "overview": "In the season 14 premiere, the SVU squad is reeling from the fallout after Captain Cragen wakes up with a dead escort - a potential witness in an SVU case - in his bed. Tensions run high at the precinct as the detectives contend with District Attorney Paula Foster's investigation of Cragen, as well as the arrival of a tough new captain, Steven Harris. Brian Cassidy treads an increasingly narrow line as an undercover cop in Bart Ganzel's escort organization, as Detective Nick Amaro struggles with the case and his marriage."
      },
      {
        "id": "tvmaze:7276",
        "title": "Twenty-Five Acts",
        "season": 14,
        "episode": 3,
        "released": "2012-10-10",
        "overview": "The young author of a wildly successful S&amp;M romance novel goes home with a famous television show host, who forces himself on her. Detectives Benson and Rollins work to convince the victim to file charges, with the assistance of a brash new Manhattan District Attorney As the SVU squad digs into her background to uncover potential trial pitfalls, Detective Amaro uncovers a secret that threatens to destroy the young woman's career as well as her case."
      },
      {
        "id": "tvmaze:7277",
        "title": "Acceptable Loss",
        "season": 14,
        "episode": 4,
        "released": "2012-10-17",
        "overview": "With Captain Cragen back in the precinct, the SVU squad is in full force and working to expose a sex trafficking operation that enslaves young women. The detectives are on the verge of cracking the case when their efforts are halted by Lieutenant Alexandra Eames, forcing Detective Benson to get creative with the investigation."
      },
      {
        "id": "tvmaze:7278",
        "title": "Manhattan Vigil",
        "season": 14,
        "episode": 5,
        "released": "2012-10-24",
        "overview": "In the series' landmark 300th episode, a young boy from Morningside Heights is kidnapped while in the care of his father, and the investigation reminds Captain Cragen Sergeant Munch and Detective Benson of an unsolved kidnapping that occurred in the same neighborhood thirteen years ago. While the entire squad races against the clock to find the missing boy, Benson vows to learn from past mistakes to set both cases right."
      },
      {
        "id": "tvmaze:7279",
        "title": "Friending Emily",
        "season": 14,
        "episode": 6,
        "released": "2012-10-31",
        "overview": "An underage girl disappears after following her older sister to a college party in Manhattan. The SVU detectives mobilize to recover the missing girl but find themselves thwarted by a high-tech kidnapper using the internet to cover his tracks. As the case hits a dead end, DA Barba returns with some unlikely help. Meanwhile, Rollins is distracted by the sudden appearance of her very troubled sister."
      },
      {
        "id": "tvmaze:7280",
        "title": "Vanity's Bonfire",
        "season": 14,
        "episode": 7,
        "released": "2012-11-14",
        "overview": "The abduction of a baby from a city playground quickly turns into a custody dispute when the kidnapper swears she is the child's biological mother. She also claims the father is a high-powered legal expert, sending Detectives Benson and Amaro on an investigation that forever changes the lives of two unsuspecting families."
      },
      {
        "id": "tvmaze:7281",
        "title": "Lessons Learned",
        "season": 14,
        "episode": 8,
        "released": "2012-11-21",
        "overview": "Professor's unusual encounter with Detective Amaro sends the SVU on an investigation into reports of sexual abuse at a prestigious private school. Stonewalled by the school board, Detective Benson enlists ADA Barba and a retired teacher to help reveal a massive cover-up as more and more victims emerge."
      },
      {
        "id": "tvmaze:7282",
        "title": "Dreams Deferred",
        "season": 14,
        "episode": 9,
        "released": "2012-12-05",
        "overview": "When a man goes on a killing rampage through New York, the lead FBI agent calls upon the SVU to get information from the suspect's last known contact - a prostitute who had been involved in one of Benson's old cases. As the detectives work with her to track down the killer, they find themselves drawn into her world and must fight to save her life."
      },
      {
        "id": "tvmaze:7283",
        "title": "Presumed Guilty",
        "season": 14,
        "episode": 10,
        "released": "2013-01-02",
        "overview": "The SVU's holiday celebrations are disrupted when Detective Tutuola's ex-brother-in-law is arrested for assaulting a priest Convinced of his innocence despite his criminal record, Fin asks the detectives to find evidence that exonerates him, and in the process, a buried church scandal begins to unravel."
      },
      {
        "id": "tvmaze:7284",
        "title": "Beautiful Frame",
        "season": 14,
        "episode": 11,
        "released": "2013-01-09",
        "overview": "When a rape victim in an SVU case is arrested for the murder of her ex-boyfriend, Suffolk County DA Pam James lands the case and swiftly brings charges against the young woman. Detective Benson questions the circumstances of the arrest and gathers enough evidence for DA Barba to levy charges in Manhattan against another suspect. The two ambitious DA's square off in separate trials for the same murder, hoping to get a conviction before the other derails their case."
      },
      {
        "id": "tvmaze:7285",
        "title": "Criminal Hatred",
        "season": 14,
        "episode": 12,
        "released": "2013-01-30",
        "overview": "The SVU detectives go undercover to arrest a man who targets and brutally attacks other men. They gather enough evidence for ADA Barba to file charges, but the case begins to spiral as he contends with a deceptively tough defense attorney"
      },
      {
        "id": "tvmaze:7286",
        "title": "Monster's Legacy",
        "season": 14,
        "episode": 13,
        "released": "2013-02-06",
        "overview": "When a janitor brutally attacks an athletic coach, the SVU connects his violent behavior to a history of sexual abuse by someone he trusted. The detectives soon uncover more victims of the same predator, including a prisoner on death row. When the truth finally comes out, Detective Benson enlists Bayard Ellis to dig into the case before the looming execution date."
      },
      {
        "id": "tvmaze:7287",
        "title": "Secrets Exhumed",
        "season": 14,
        "episode": 14,
        "released": "2013-02-13",
        "overview": "When FBI Agent Dana Lewis suspects that a 25 year-old rape-murder case in New York is connected to several unsolved cases across the country, she joins the SVU in investigating the crimes. As Lewis relentlessly pursues her prime suspect, Detectives Benson and Amaro have their doubts about his guilt."
      },
      {
        "id": "tvmaze:7288",
        "title": "Deadly Ambition",
        "season": 14,
        "episode": 15,
        "released": "2013-02-20",
        "overview": "Detective Rollins comes home to find her sister Kim in her apartment, beaten up by her abusive boyfriend, and this time, pregnant. The SVU squad does all they can to keep her safe, but an unexpected visitor forces Rollins to take drastic action. Once again Internal Affairs must open an investigation into the SVU's unconventional methods, and the squad is in jeopardy of losing one of their own."
      },
      {
        "id": "tvmaze:7289",
        "title": "Funny Valentine",
        "season": 14,
        "episode": 16,
        "released": "2013-02-27",
        "overview": "Promising singer is brutally attacked by her boyfriend, a popular hip hop star. ADA Barba works to build a case, but the victim refuses to aid the prosecution and, despite Detective Benson's best efforts, continues to put herself in danger. The case quickly spirals into a media circus, perpetrated by both the defendant and his uncompromising attorney."
      },
      {
        "id": "tvmaze:7290",
        "title": "Undercover Blue",
        "season": 14,
        "episode": 17,
        "released": "2013-03-20",
        "overview": "As he prepares to testify against pimp Bart Ganzel, a woman comes forward claiming that Brian Cassidy raped her while he was an undercover detective. ADA Barba, Detective Benson and the SVU squad nervously await the outcome of the trial, concerned for Cassidy as well as the ongoing prosecution of Ganzel. When prosecutor Derek Strauss pushes hard for a win, Cassidy and his lawyer use some surprising methods of defense, with shocking consequences for Detective Amaro."
      },
      {
        "id": "tvmaze:7291",
        "title": "Legitimate Rape",
        "season": 14,
        "episode": 18,
        "released": "2013-03-27",
        "overview": "Popular sports reporter seeks out Detective Benson to accuse a cameraman of rape and stalking. The SVU squad and ADA Barba begin their preparations for a difficult trial when the victim learns she is pregnant as result of the rape. As the case proceeds, the defense uses controversial tactics in its efforts to persuade the jury."
      },
      {
        "id": "tvmaze:7292",
        "title": "Born Psychopath",
        "season": 14,
        "episode": 19,
        "released": "2013-04-03",
        "overview": "When a school nurse notices several injuries on a young girl, the SVU detectives are called in to investigate. A closer look at her family reveals a mother struggling to manage the violent outbursts of her nine year old son As the SVU squad and the visiting Dr. Huang debate an appropriate course of treatment, the situation rapidly explodes into a dangerous standoff. Meanwhile, Detective Amaro tries to establish a relationship with his newly discovered son."
      },
      {
        "id": "tvmaze:7293",
        "title": "Girl Dishonored",
        "season": 14,
        "episode": 20,
        "released": "2013-04-24",
        "overview": "Olivia Benson and the detectives of the Special Victims Unit investigate the alleged rape of a sorority pledge on a college campus. Their attempts to piece together the events of the crime are thwarted by drunk students and conflicting accounts. As the detectives pursue the case, they unearth a widespread university culture of school administrators and students that look the other way instead of protecting their own."
      },
      {
        "id": "tvmaze:7294",
        "title": "Traumatic Wound",
        "season": 14,
        "episode": 21,
        "released": "2013-05-01",
        "overview": "Suburban teen is brutally assaulted when a concert turns into a mob scene. Friends and eyewitnesses give mixed accounts of the event, and Detective Amaro finds himself trying to save the reputation of the prime suspect, a fellow military veteran whose fractured memory could hold the answer to why the girl was targeted."
      },
      {
        "id": "tvmaze:7295",
        "title": "Poisoned Motive",
        "season": 14,
        "episode": 22,
        "released": "2013-05-08",
        "overview": "Two surprise sniper attacks on the NYPD leave the SVU squad scrambling for answers. When the link between the shootings appears to be Detective Tutuola, he reconnects with his former Narcotics partner in order to uncover a possible motive tied to their old cases. As the violence continues, Lieutenant Eames joins the investigation and the Special Victims Unit races to hunt down a killer no one saw coming."
      },
      {
        "id": "tvmaze:7296",
        "title": "Brief Interlude",
        "season": 14,
        "episode": 23,
        "released": "2013-05-15",
        "overview": "Detectives Benson and Amaro are called to the scene when an unconscious woman with signs of physical trauma is found in a river near the Mayor's home. With the victim in a coma, the squad races to identify and account for her prior whereabouts. They uncover a wild side to an otherwise normal wife and mother, and the investigation reaches an unsettling conclusion."
      },
      {
        "id": "tvmaze:7297",
        "title": "Her Negotiation",
        "season": 14,
        "episode": 24,
        "released": "2013-05-22",
        "overview": "After making a seemingly routine arrest of a man exposing himself in Central Park, Detective Rollins has a bad feeling about the suspect and calls upon the entire SVU squad and ADA Barba to help. With no way to discover the suspect's true identity, he masterfully outplays them at every turn. A shocking theory comes to light, and as Barba's trial comes to a close, the situation rapidly escalates and Detective Benson is put into mortal danger."
      },
      {
        "id": "tvmaze:7298",
        "title": "Surrender Benson",
        "season": 15,
        "episode": 1,
        "released": "2013-09-25",
        "overview": "Hours turn into days, and with no word from Detective Benson, the SVU squad takes drastic measures to find her and her abductor. A trail of murders and rape victims leads them to fear it may be too late."
      },
      {
        "id": "tvmaze:7299",
        "title": "Imprisoned Lives",
        "season": 15,
        "episode": 2,
        "released": "2013-09-25",
        "overview": "A young boy is abandoned in Times Square and leads the detectives to the house where his family lives. Inside they find a locked basement where more victims await rescue, and work to solve decades-old cold cases."
      },
      {
        "id": "tvmaze:7300",
        "title": "American Tragedy",
        "season": 15,
        "episode": 3,
        "released": "2013-10-02",
        "overview": "String of rapes on the Upper West Side raises concerns across the city, and while Detectives Tutuola and Rollins question everyone who fits the suspect's description, celebrity chef Jolene Castille fears she's the next victim when someone follows her home. The SVU arrests her for shooting and killing the unarmed teen, and her attorney faces off against ADA Barba in a trial that tests the limits of the jury's moral and legal responsibilities. Meanwhile, Detective Benson continues to struggle with the aftermath of her traumatic ordeal."
      },
      {
        "id": "tvmaze:7301",
        "title": "Internal Affairs",
        "season": 15,
        "episode": 4,
        "released": "2013-10-09",
        "overview": "Officer Michael Groves ends up in a psych ward after turning on his old squad - he accuses the 12th precinct of cooking the books and making rape allegations disappear. Internal Affairs Lt. Tucker enlists the help of the SVU to investigate, and plants Brian Cassidy as an undercover. But one crooked cop goes to great lengths to keep things as they are, and the squad realizes too late that they put Cassidy in grave danger."
      },
      {
        "id": "tvmaze:7302",
        "title": "Wonderland Story",
        "season": 15,
        "episode": 5,
        "released": "2013-10-16",
        "overview": "Sarah Walsh wakes up from a night of partying and believes she's been raped. In shock that it could happen again, she calls Detective Benson, who handled her previous rape case, for help. The search for sarah's attacker leads the cops to a smooth-talking cyber mogul who preys on vulnerable girls and bribes them for their silence. Meanwhile, the SVU comes together to say goodbye to the retiring Sergeant Munch."
      },
      {
        "id": "tvmaze:7303",
        "title": "October Surprise",
        "season": 15,
        "episode": 6,
        "released": "2013-10-23",
        "overview": "When ADA Barba's childhood friend, Eddie Garcia, is arrested for attempted rape, his connection to mayoral frontrunner Alex Munoz puts the campaign in jeopardy. But when an undercover investigation uncovers further misconduct by Munoz himself, Detective Amaro and the SVU team wonder if Barba can put aside personal feelings to prosecute the men he used to idolize."
      },
      {
        "id": "tvmaze:7304",
        "title": "Dissonant Voices",
        "season": 15,
        "episode": 7,
        "released": "2013-11-06",
        "overview": "Singing coach Jackie Walker is at the height of his career, with a featured role on television's biggest reality show, \"American Diva,\" and a steady position teaching music at a prestigious New York City school. When a four year-old student comes forward with claims of sexual abuse, Detective Rollins asks the squad to be mindful of Walker's reputation, but Benson's investigation uncovers evidence that condemns the popular personality. As the case becomes public, more and more victims come forward, but Walker refuses to come clean."
      },
      {
        "id": "tvmaze:7305",
        "title": "Military Justice",
        "season": 15,
        "episode": 8,
        "released": "2013-11-13",
        "overview": "Junior officer Amelia Albers is arrested for DUI while on leave in New York City, but her ripped clothes and injuries lead the police to call Detective Benson for help. When a group of soldiers from her unit are named as suspects in her rape, Amelia refuses to cooperate with the SVU for fear of damage to her reputation in the military. When her commanding officer also hinders the investigation, Detective Amaro asks his ex-wife to dig up information on the case, and learns the grim reality that every female officer faces."
      },
      {
        "id": "tvmaze:7306",
        "title": "Rapist Anonymous",
        "season": 15,
        "episode": 9,
        "released": "2013-11-20",
        "overview": "Detective Amanda Rollins helps her friend Lena Olson press charges against her lover when she accuses him of rape. But Lena's history with the suspect and her proclivity for rough sex makes the he-said she-said investigation too difficult to pursue. When the case escalates to murder, a dangerous love triangle is discovered and Rollins is forced to confess her private life on the stand."
      },
      {
        "id": "tvmaze:7307",
        "title": "Psycho/Therapist",
        "season": 15,
        "episode": 10,
        "released": "2014-01-08",
        "overview": "'The Beast' returns when Detective Benson is forced to face Lewis in the courtroom, and the stress of reliving the attack causes setbacks in her recovery. With Lewis trying every trick in the book to continue his legal winning streak, Benson is forced to reveal some of the secrets she's kept about the ordeal."
      },
      {
        "id": "tvmaze:7308",
        "title": "Amaro's One-Eighty",
        "season": 15,
        "episode": 11,
        "released": "2014-01-15",
        "overview": "Detectives Amaro and Rollins leave a party and stumble upon Officer McKenna in pursuit of a suspected drug dealer. A standoff leads to gunfire and the teenaged suspect is gravely wounded. While Amaro struggles to reconcile his by-the-book actions with his conscience, the SVU fights to keep Internal Affairs from jumping to conclusions. The case becomes a public spectacle and Amaro must decide if fighting for his badge is the best decision for his family. Meanwhile, Captain Cragen makes a surprise announcement."
      },
      {
        "id": "tvmaze:7309",
        "title": "Jersey Breakdown",
        "season": 15,
        "episode": 12,
        "released": "2014-01-22",
        "overview": "The SVU teams up with federal prosecutor Connie Rubirosa after an underage runaway is found raped and beaten under the Highline. The sex trafficking investigation leads to New Jersey strip club owner Perry Cannavaro, who does all he can to keep the victim out of the SVU's jurisdiction. When ADA Barba fails to get the help he needs from Jersey law enforcement, he suspects a cover-up involving some high ranking court officials."
      },
      {
        "id": "tvmaze:7310",
        "title": "Betrayal's Climax",
        "season": 15,
        "episode": 13,
        "released": "2014-01-29",
        "overview": "Sixteen year-old Avery Capshaw's parents report her kidnapped, and the SVU finds signs of a party turned violent. Her boyfriend, Manny Montero, is a scholarship student from the Projects, and though his family swears he's on the right track, Amaro suspects he's involved with a dangerous gang. When Manny refuses to talk, the cops are forced to arrest him, but the violence only escalates. Meanwhile, Benson is sworn in as the SVU's new sergeant."
      },
      {
        "id": "tvmaze:7311",
        "title": "Wednesday's Child",
        "season": 15,
        "episode": 14,
        "released": "2014-02-05",
        "overview": "Tom Moore arrives home from a business trip to find his young son, Nicky, missing from his bed. With a history of behavioral problems, the cops suspect he wandered off alone, and the search becomes more urgent as the diabetic boy's insulin pump runs out. But the investigation leads to something more dangerous when a criminal couple, known for child endangerment and pornography, is spotted with Nicky. With a child's life on the line, the cops try to turn one suspect against the other before it's too late. Meanwhile, a personal issue derails Sergeant Benson's current course."
      },
      {
        "id": "tvmaze:7312",
        "title": "Comic Perversion",
        "season": 15,
        "episode": 15,
        "released": "2014-02-26",
        "overview": "Popular comedian Josh Galloway is faced with student protestors after a set at Tompkins Square University. His demeaning jokes about women and rape become more serious when a student is assaulted by two of Galloway's fans. Though Barba can't arrest him for speaking his mind, he charges the SVU to find proof that Galloway's actions reflect his words. When TSU student Carly Rydell accuses Galloway of rape, Sergeant Benson is happy to arrest him. But Barba finds major roadblocks in the he-said she-said case, and thinks Benson should have chosen her battle more carefully. Meanwhile, a detective from Chicago seeks help from the NYPD."
      },
      {
        "id": "tvmaze:7313",
        "title": "Gridiron Soldier",
        "season": 15,
        "episode": 16,
        "released": "2014-03-05",
        "overview": "High school football star Cedric Jones goes missing in New York City, and his uncle seeks help from their hometown friend, Detective Rollins. Though already committed to attending Georgia Tech, Cedric nevertheless accepted a free weekend recruiting trip from Hudson University's football team. When the cops find him in jail, they suspect the truth may have led to a cruel prank that spiraled out of control. Sgt. Benson's investigation into the football team and its popular coach uncovers several victims of abuse, prejudice and hazing. Meanwhile, Rollins turns to an old friend to help deal with her escalating troubles."
      },
      {
        "id": "tvmaze:7314",
        "title": "Gambler's Fallacy",
        "season": 15,
        "episode": 17,
        "released": "2014-03-12",
        "overview": "Detective Amanda Rollins' addiction drives her to an illegal gambling club, where waitress Clare Wilson recognizes her as a cop. To protect her job, Rollins strikes a deal with the club managers to make their illegal transgressions disappear. But when the debt isn't paid to their liking, she doubles down and loses, forcing Sergeant Benson and Detective Tutuola to suspect one of their own of an unthinkable crime."
      },
      {
        "id": "tvmaze:7315",
        "title": "Criminal Stories",
        "season": 15,
        "episode": 18,
        "released": "2014-03-19",
        "overview": "Renowned New York Ledger columnist Jimmy MacArthur is given full access to Sergeant Benson and the squad for an inside look at the city's Special Victims Unit. When the rape case of a young Muslim woman escalates to a hate crime, Jimmy stays one step ahead of the investigation and declares the entire crime a hoax. With the victim under fierce public scrutiny, Benson struggles to keep the case on solid ground and fears a rapist will go free."
      },
      {
        "id": "tvmaze:7316",
        "title": "Downloaded Child",
        "season": 15,
        "episode": 19,
        "released": "2014-04-02",
        "overview": "Single mom Jenny Aschler is arrested for child endangerment. Not trusting anyone to take care of her young daughter Maddie, she instead leaves her home alone for days. Jenny's fierce motherly instincts and fear of men leads Sergeant Benson to suspect she may have been a victim of child abuse. With help from Dr. Lindstrom, Jenny recovers deeply repressed memories of violence, rape and neglect."
      },
      {
        "id": "tvmaze:7317",
        "title": "Beast's Obsession",
        "season": 15,
        "episode": 20,
        "released": "2014-04-09",
        "overview": "The sadistic William Lewis escapes from prison, arbitrarily killing as he goes. Concerned for Benson's safety, a security detail is assigned to her 24/7, but it doesn't take long for Lewis to get her back where he left off. With time running out, Benson must decide how much she's willing to sacrifice in order to save the life of a child."
      },
      {
        "id": "tvmaze:7318",
        "title": "Post-Mortem Blues",
        "season": 15,
        "episode": 21,
        "released": "2014-04-30",
        "overview": "In the moments after William Lewis' death, Sergeant Benson is rescued by the SVU squad, but her torment continues. The Internal Affairs investigation of her actions is deemed inconclusive, and with no evidence to corroborate her story, Prosecutor Derek Strauss convenes a grand jury and calls for Benson's arrest. With increasing pressure from Lt. Tucker and Lt. Murphy to save herself any way she can, Benson must choose between her convictions and her badge."
      },
      {
        "id": "tvmaze:7319",
        "title": "Reasonable Doubt",
        "season": 15,
        "episode": 22,
        "released": "2014-05-07",
        "overview": "Benson and Murphy question renowned television producer Frank Maddox when he's accused of molesting his 8 year-old daughter Chelsea. Maddox's estranged wife, actress Catherine Summers, wants justice for her daughter but refuses to cooperate, leading the cops to suspect the accusation was a ploy to win the public's favor. With Catherine's young sister Rose engaged to Maddox and accusations flying back and forth in the media, Benson strives to help a child by discovering the truth."
      },
      {
        "id": "tvmaze:7320",
        "title": "Thought Criminal",
        "season": 15,
        "episode": 23,
        "released": "2014-05-14",
        "overview": "Under the guidance of Lieutenant Murphy, Sergeant Benson and the SVU take an active approach to catching sex offenders - they target Simon Wilkes, a well-regarded photographer with a secret life. An undercover investigation finds his graphic fantasies may have crossed the line into reality, at a child's expense. But the case becomes impossible when no evidence of a victim is found."
      },
      {
        "id": "tvmaze:7321",
        "title": "Spring Awakening",
        "season": 15,
        "episode": 24,
        "released": "2014-05-21",
        "overview": "Amaro's recklessness once again makes him the target of Internal Affairs, and he has no choice but to face the consequences. With his professional and personal life at risk, he looks to his friend John Munch for advice. Meanwhile, an online ad for escorts leads to the rape and robbery of several male tourists, and one of the suspects has a surprising connection to Sergeant Benson that may change her life forever."
      },
      {
        "id": "tvmaze:7322",
        "title": "Girls Disappeared",
        "season": 16,
        "episode": 1,
        "released": "2014-09-24",
        "overview": "In the season 16 premiere, Sergeant Benson juggles work and her new role as foster mother to baby Noah Porter. Amaro, now working the traffic beat in Queens, arrests an underage prostitute with connections to Noah's mother Ellie, who was \"greenlit\" by her pimp and brutally murdered. Amaro's undercover work sets off a chain of events that puts everyone connected to the case - even baby Noah - in danger. Meanwhile, a new detective assigned to Manhattan SVU starts off on the wrong foot."
      },
      {
        "id": "tvmaze:7323",
        "title": "American Disgrace",
        "season": 16,
        "episode": 2,
        "released": "2014-10-01",
        "overview": "Basketball superstar Shakir \"The Shark\" Wilkins announces his partnership with the Orion Bay clothing line, owned by billionaire Orion Bauer and his daughter Cordelia. But the SVU intervenes when Orion press rep Carla Cannon tells reporters she was raped by Wilkins. When more women come forward, Benson and Detective Carisi disagree on the authenticity of each woman's story, and Barba takes a shaky case to court. Meanwhile, the case takes Rollins to her former precinct in Atlanta, where ex-colleagues bring up old memories."
      },
      {
        "id": "tvmaze:7324",
        "title": "Producer's Backend",
        "season": 16,
        "episode": 3,
        "released": "2014-10-08",
        "overview": "Amaro reports to the scene of a car crash where Hollywood starlet Tensley Evans tries to flirt her way out of an arrest. Amaro's by-the-book handling of the situation gets him back on the SVU squad, just in time to investigate Tensley's latest offense - the statutory rape of a 15 year-old boy. But Benson suspects that underlying issues may have led to Tensley's downward spiral - is the victimizer also a victim?"
      },
      {
        "id": "tvmaze:7325",
        "title": "Holden's Manifesto",
        "season": 16,
        "episode": 4,
        "released": "2014-10-15",
        "overview": "New York City bike messenger Holden March creates a video diary of his troubles with women. Talk soon escalates to action, and the SVU scrambles to find his manifesto before he commits another violent act. When Rollins and Amaro come face to face with Holden, they find out just how dangerous a desperate man can be. Meanwhile, as Benson balances the responsibilities of motherhood and career, the new Deputy Chief of SVU calls her leadership into question."
      },
      {
        "id": "tvmaze:7326",
        "title": "Pornstar's Requiem",
        "season": 16,
        "episode": 5,
        "released": "2014-10-22",
        "overview": "Evie Barnes answers a modeling ad hoping to make some cash for tuition, but the job quickly spirals into online pornography. When her classmates discover her double life, they cross the boundary between fiction and reality. Even though she's not the one on trial, Evie is forced to prove her innocence in court."
      },
      {
        "id": "tvmaze:7328",
        "title": "Glasgowman's Wrath",
        "season": 16,
        "episode": 6,
        "released": "2014-11-05",
        "overview": "Best friends Perry Gilbert and Mia Harris sneak into the woods with Mia's young sister Zoe in tow. Their search for the mythical Glasgowman leads to a series of violent events, leaving Zoe gravely injured and the other girls missing. While Detectives Rollins and Carisi work to locate the suspect, Sgt. Benson digs through the stories to distinguish fantasy from reality."
      },
      {
        "id": "tvmaze:7329",
        "title": "Chicago Crossover",
        "season": 16,
        "episode": 7,
        "released": "2014-11-12",
        "overview": "Sergeant Hank Voight and Detectives Erin Lindsay and Jay Halstead track a child pornography victim to his last-known whereabouts in New York City, where Sergeant Benson and the SVU squad get a new lead - evidence of a livestreamed pornography \"club\" that caters to its subscriber's shocking requests. When Lindsay discovers someone from her past is involved, she hopes it will help lead them to the site's ringleader, but tensions between Voight and Benson could threaten the case."
      },
      {
        "id": "tvmaze:20892",
        "title": "Spousal Privilege",
        "season": 16,
        "episode": 8,
        "released": "2014-11-19",
        "overview": "Detective Tutuola comes across leaked security footage of a violent domestic dispute in a parking garage, showing sportscaster A.J. Martin hit his girlfriend Paula. While Fin and Benson investigate the couple's lifestyle and history, Paula pushes back to keep her relationship and family intact. Benson turns to ADA Barba for help to convince Paula that her world doesn't have to revolve around A.J. Meanwhile, the case has an interesting effect on Rollins and Amaro's relationship."
      },
      {
        "id": "tvmaze:46973",
        "title": "Pattern Seventeen",
        "season": 16,
        "episode": 9,
        "released": "2014-12-10",
        "overview": "When a series of young, petite girls are assaulted in the early morning hours, Detective Rollins matches the pattern to several rapes she worked in Atlanta. When she finds that the victims' rape kits were never tested, Atlanta SVU Chief Patton claims none of the cases were worth pursuing. Intense media scrutiny and the lack of a suspect brings the heat down on Sgt. Benson, who has to face Chief Dodds and their commanders in a CompStat briefing. Meanwhile, a family court judge threatens to remove baby Noah from Benson's care."
      },
      {
        "id": "tvmaze:57570",
        "title": "Forgiving Rollins",
        "season": 16,
        "episode": 10,
        "released": "2015-01-07",
        "overview": "Atlanta's Deputy Chief Charles Patton and his newest detective, Reese Taymor visit New York for a law enforcement conference. When Reese is found unconscious in her hotel bathroom, she cries rape at the scene but changes her story when Sgt. Benson arrives. When Rollins uncovers a personal connection to the suspect, ADA Barba seeks her help in the courtroom and she's forced to confront the demons of her past to stop a dangerous predator."
      },
      {
        "id": "tvmaze:96504",
        "title": "Agent Provocateur",
        "season": 16,
        "episode": 11,
        "released": "2015-01-14",
        "overview": "Fifteen year-old Madison Baker sneaks out of her uncle's home to meet breakout movie star Scott Russo, who invited her to a party via social media. Later that night, a patrolman finds her in an alley, sexually assaulted and barely alive. Sgt. Benson suspects Russo and his manager, Lydia Lebasi, are covering up the crime when security footage from the party goes missing. When gossip site mogul Lenny Simmons airs the stolen footage, he refuses to give up the source material and ADA Barba takes him to court to find the truth."
      },
      {
        "id": "tvmaze:96505",
        "title": "Padre Sandunguero",
        "season": 16,
        "episode": 12,
        "released": "2015-01-21",
        "overview": "Amaro's father, Nicolas, asks his estranged family to attend his marriage to 28-year-old Gabriella Nunez, and despite their volatile past, all but Amaro agree. When a fight breaks out at the wedding and Nicolas is put in handcuffs, Amaro becomes a witness in a case that could expose family secrets and tear his family apart."
      },
      {
        "id": "tvmaze:117539",
        "title": "Decaying Morality",
        "season": 16,
        "episode": 13,
        "released": "2015-02-04",
        "overview": "Benson and Rollins find a teenaged girl crying in the street, her clothes torn. Jenna Davis says she was raped in a pizzeria bathroom by Jerome Jones. Jones has a criminal record as well as a pending lawsuit against the NYPD, but with little evidence to go on, the SVU releases him until an arrest can be made. With emotions running high, Jenna's father takes the law into his own hands with a decision that will change their lives forever."
      },
      {
        "id": "tvmaze:117540",
        "title": "Intimidation Game",
        "season": 16,
        "episode": 14,
        "released": "2015-02-11",
        "overview": "Video game developer Raina Punjabi solidifies the launch of her first game amid a stream of online insults, intimidation and death threats from the male-dominated gaming community. When a female employee is assaulted at a gamer convention, Detective Tutuola investigates the crime but Raina refuses to delay the launch, and the cops must \"level up\" to protect her."
      },
      {
        "id": "tvmaze:117541",
        "title": "Undercover Mother",
        "season": 16,
        "episode": 15,
        "released": "2015-02-18",
        "overview": "Working undercover to bust a sex trafficking ring, Det. Carisi stumbles upon Martha Thornhill, a mother who has embedded herself as a Madame in the organization for three years in hopes of finding and saving her daughter, Ariel. Martha joins forces with the SVU and they work together to bust the pimp and his cohorts, but Ariel is still missing. Meanwhile, Sgt. Benson is confronted with a harsh revelation that will change her life forever."
      },
      {
        "id": "tvmaze:117542",
        "title": "December Solstice",
        "season": 16,
        "episode": 16,
        "released": "2015-02-25",
        "overview": "Celebrity author Walter Briggs is the focus of a feud between his sixth wife, Charmaine, and his daughters from previous marriages (guest stars Emily Bergl and Susan Pourfar). The fight over control for both his well-being and his estate becomes a criminal case when Charmaine is accused of abusing her husband. Meanwhile, Barba struggles with his own family drama when he goes against his grandmother's wishes."
      },
      {
        "id": "tvmaze:139561",
        "title": "Parole Violations",
        "season": 16,
        "episode": 17,
        "released": "2015-03-25",
        "overview": "Detective Carisi's sister Bella prepares for her wedding to fianc Tommy Sullivan and the upcoming birth of their child. But when Tommy falls back into bad habits and accuses his parole officer of rape, Carisi must investigate whether the claim is real or just another one of Tommy's excuses."
      },
      {
        "id": "tvmaze:144132",
        "title": "Devastating Story",
        "season": 16,
        "episode": 18,
        "released": "2015-04-01",
        "overview": "Popular television host Skip Peterson airs an interview with college student Heather Manning, who claims she was gang raped in a fraternity house. While the tragic account of Heather's story brings national attention to the epidemic of rape on campus, the sensational details of the she-said, they-said case leaves Sgt. Benson and ADA Barba with several suspects and a rocky trial."
      },
      {
        "id": "tvmaze:144131",
        "title": "Granting Immunity",
        "season": 16,
        "episode": 19,
        "released": "2015-04-08",
        "overview": "Pornographic photos from 15 year-old Savannah Biel's house party quickly circulate around her Tribeca high school and go viral. Barba's efforts to arrest the student responsible for posting the images is stalled when several suspects fall victim to a fast-moving measles outbreak. When Benson's foster son also catches the illness, she investigates a group of mothers who may have falsified their children's medical records. Meanwhile, Amaro receives some distressing news about his son."
      },
      {
        "id": "tvmaze:153000",
        "title": "Daydream Believer",
        "season": 16,
        "episode": 20,
        "released": "2015-04-29",
        "overview": "Benson and Voight lead their teams in the investigation of a rape/murder case that is frighteningly similar to a case from New York a decade ago. When forced to release their main suspect, the Chicago PD joins the SVU in New York in pursuit of Yates."
      },
      {
        "id": "tvmaze:153470",
        "title": "Perverted Justice",
        "season": 16,
        "episode": 21,
        "released": "2015-05-06",
        "overview": "Bayard Ellis takes on the case of a man incarcerated for incest and rape, whose daughter Michelle, the victim and star witness when she was a child, wants to recant her testimony and set her father free. When a judge refuses to reopen the 17 year old case, the SVU turns to retired Captain Cragen, who remembers the investigation and provides evidence that could change the convict's fate."
      },
      {
        "id": "tvmaze:153001",
        "title": "Parent's Nightmare",
        "season": 16,
        "episode": 22,
        "released": "2015-05-13",
        "overview": "Year-old Owen Farhidi disappears from school and his mother Dana receives a ransom request. When surveillance footage shows that Owen recognized his abductor, Detective Amaro works with Dana and her ex-husband Sam to find and arrest the suspect, but tensions between the estranged couple obstructs the investigation. Meanwhile, Sgt. Benson is asked to take the Lieutenant's exam to formally take the lead over her squad."
      },
      {
        "id": "tvmaze:141977",
        "title": "Surrendering Noah",
        "season": 16,
        "episode": 23,
        "released": "2015-05-20",
        "overview": "Sgt. Benson and ADA Barba take Johnny D to trial for sex trafficking, rape, assault and kidnapping. But when Baby Noah's adoption becomes entangled in the case, Benson fears for Noah's future and his safety. In an intense courtroom showdown, the SVU will face a threat that could change the squad forever."
      },
      {
        "id": "tvmaze:181899",
        "title": "Devil's Dissections",
        "season": 17,
        "episode": 1,
        "released": "2015-09-23",
        "overview": "The SVU is called to a familiar crime scene - the beach where serial killer Gregory Yates buried his many victims. When another body washes ashore, Detective Rollins tries to coax him into confessing, but the surprising information he provides sends shockwaves through the police department. As the case goes to court, Barba faces off against two hotshot defense attorneys in a trial that leads to blackmail, an incriminating confession, a new victim and a fugitive suspect."
      },
      {
        "id": "tvmaze:181900",
        "title": "Criminal Pathology",
        "season": 17,
        "episode": 2,
        "released": "2015-09-23",
        "overview": "The SVU is called to a familiar crime scene - the beach where serial killer Gregory Yates buried his many victims. When another body washes ashore, Detective Rollins tries to coax him into confessing, but the surprising information he provides sends shockwaves through the police department. As the case goes to court, Barba faces off against two hotshot defense attorneys in a trial that leads to blackmail, an incriminating confession, a new victim and a fugitive suspect."
      },
      {
        "id": "tvmaze:181901",
        "title": "Transgender Bridge",
        "season": 17,
        "episode": 3,
        "released": "2015-09-30",
        "overview": "15 year-old Avery Parker walks home from school through Fort Tryon Park when she's surrounded by a group of rowdy boys. Taunts and jokes intensify to pushing and shoving, leaving Avery in the hospital and three assailants under arrest. When the DA's office decides to try one of the culprits, 15 year-old Darius McCrae, as an adult, the SVU squad agonizes over whether the punishment fits the crime, and must deal with the pain of both families involved."
      },
      {
        "id": "tvmaze:206512",
        "title": "Institutional Fail",
        "season": 17,
        "episode": 4,
        "released": "2015-10-07",
        "overview": "A starving toddler found wandering the streets alone leads detectives to the home of Manuela Ozuna and another child in grave condition. The police question Department of Child Services caseworker Keith Musio, whose vague and backdated reports on the family suggest he hadn't checked on the children in months. When the overworked Keith accuses his supervisor, Janette Grayson, of orchestrating the false reports, Chief Dodds promises to conduct an internal investigation. But when neglect leads to death, Barba takes matters into his own hands and arrests them for manslaughter. Meanwhile, Dodds indicates some changes coming to Benson's squad."
      },
      {
        "id": "tvmaze:206513",
        "title": "Community Policing",
        "season": 17,
        "episode": 5,
        "released": "2015-10-14",
        "overview": "In the pursuit of an SVU rape suspect, detectives from another precinct shoot and kill an unarmed black man. As racial tensions rise in the city, Barba is tasked to indict three officers who claim they had no choice but to follow police procedure."
      },
      {
        "id": "tvmaze:206514",
        "title": "Maternal Instincts",
        "season": 17,
        "episode": 6,
        "released": "2015-10-21",
        "overview": "Rollins' mother Beth throws her a baby shower while the SVU reports to a four-star hotel where a famous violinist was raped by her colleague, Anton Krasnikov. With no memory of the crime, Anton claims a hired escort drugged and robbed him, and evidence leads to the shocking return of Rollins' fugitive sister Kim. Meanwhile, Sgt. Mike Dodds arrives for his first day at SVU."
      },
      {
        "id": "tvmaze:206515",
        "title": "Patrimonial Burden",
        "season": 17,
        "episode": 7,
        "released": "2015-11-04",
        "overview": "The SVU investigates an unraveling web of secrets when the virtuous 13 year-old daughter of a famous reality TV family discovers she's pregnant."
      },
      {
        "id": "tvmaze:260877",
        "title": "Melancholy Pursuit",
        "season": 17,
        "episode": 8,
        "released": "2015-11-11",
        "overview": "The hunt for a missing teenage girl takes an emotional toll on Sgt. Dodds, and DNA evidence becomes a crucial lead in finding the girl's abductor."
      },
      {
        "id": "tvmaze:260878",
        "title": "Depravity Standard",
        "season": 17,
        "episode": 9,
        "released": "2015-11-18",
        "overview": "Lt. Benson seeks justice in the trial of child abductor Lewis Hodda, but when a plea deal is rejected, Barba must rely on decades-old evidence to make his case and faces off against former SVU colleague Dr. Huang."
      },
      {
        "id": "tvmaze:473794",
        "title": "Catfishing Teacher",
        "season": 17,
        "episode": 10,
        "released": "2016-01-06",
        "overview": "A high school student plans a clandestine hookup with his female teacher but ends up in a far more sinister situation."
      },
      {
        "id": "tvmaze:541976",
        "title": "Townhouse Incident",
        "season": 17,
        "episode": 11,
        "released": "2016-01-13",
        "overview": "Benson is taken hostage when she tries to stop a violent home invasion."
      },
      {
        "id": "tvmaze:549807",
        "title": "A Misunderstanding",
        "season": 17,
        "episode": 12,
        "released": "2016-01-20",
        "overview": "A murky he-said, she-said date rape case ruins the futures of two high school students."
      },
      {
        "id": "tvmaze:567162",
        "title": "Forty-One Witnesses",
        "season": 17,
        "episode": 13,
        "released": "2016-02-03",
        "overview": "A woman is followed home and raped outside her building, where several neighbors witness the crime but fail to call for help."
      },
      {
        "id": "tvmaze:577065",
        "title": "Nationwide Manhunt",
        "season": 17,
        "episode": 14,
        "released": "2016-02-10",
        "overview": "Chicago P.D. detectives Lindsay and Dawson join the SVU in the hunt for two escaped murderers they helped to convict."
      },
      {
        "id": "tvmaze:583613",
        "title": "Collateral Damages",
        "season": 17,
        "episode": 15,
        "released": "2016-02-17",
        "overview": "An undercover sting leads to the takedown of an online pedophile ring and the arrest of two high-profile suspects."
      },
      {
        "id": "tvmaze:596862",
        "title": "Star-Struck Victims",
        "season": 17,
        "episode": 16,
        "released": "2016-02-24",
        "overview": "When a lack of evidence leads Barba to drop rape charges against a popular actor, Rollins takes matters into her own hands."
      },
      {
        "id": "tvmaze:608544",
        "title": "Manhattan Transfer",
        "season": 17,
        "episode": 17,
        "released": "2016-03-02",
        "overview": "An investigation into the sexual exploitation of underage Catholic schoolgirls leads to shocking charges against judges, legislators, DAs, and members of the NYPD."
      },
      {
        "id": "tvmaze:633524",
        "title": "Unholiest Alliance",
        "season": 17,
        "episode": 18,
        "released": "2016-03-23",
        "overview": "When one of their own is implicated in a cover-up, the SVU struggles to unravel a sex trafficking operation deeply-rooted in government offices, the police department, and the Catholic Church."
      },
      {
        "id": "tvmaze:644507",
        "title": "Sheltered Outcasts",
        "season": 17,
        "episode": 19,
        "released": "2016-03-30",
        "overview": "Detective Carisi lives undercover at a homeless shelter to determine if one of its sex offender residents is the suspect in a string of neighborhood rapes."
      },
      {
        "id": "tvmaze:664361",
        "title": "Fashionable Crimes",
        "season": 17,
        "episode": 20,
        "released": "2016-05-04",
        "overview": "A young model is raped by a renowned fashion house photographer, who looks to his successful brother to make the charges disappear."
      },
      {
        "id": "tvmaze:664360",
        "title": "Assaulting Reality",
        "season": 17,
        "episode": 21,
        "released": "2016-05-11",
        "overview": "The producers of a reality dating series make Benson and the SVU part of the show when they investigate a contestant's claim that she was raped."
      },
      {
        "id": "tvmaze:666139",
        "title": "Intersecting Lives",
        "season": 17,
        "episode": 22,
        "released": "2016-05-18",
        "overview": "A corrections officer is arrested for sexually assaulting female inmates in and out of prison, and the union that supports him targets Barba and the SVU."
      },
      {
        "id": "tvmaze:666143",
        "title": "Heartfelt Passages",
        "season": 17,
        "episode": 23,
        "released": "2016-05-25",
        "overview": "When the investigation of Corrections Officer Gary Munson deepens, he and his union take drastic actions that threaten the lives of ADA Barba and the SVU squad."
      },
      {
        "id": "tvmaze:834099",
        "title": "Terrorized",
        "season": 18,
        "episode": 1,
        "released": "2016-09-21",
        "overview": "A young boy is found wandering alone in Central Park and the search for his parents leads to startling evidence of a planned mass casualty event in the city. As the SVU works with the joint-terrorism task force to find the suspects and the motive, Lt. Benson must also convince Barba to address allegations of rape and torture the boy's mother discloses."
      },
      {
        "id": "tvmaze:880635",
        "title": "Making a Rapist",
        "season": 18,
        "episode": 2,
        "released": "2016-09-28",
        "overview": "After 16 years in prison, a convicted rapist is exonerated due to newly tested DNA evidence. But only a day later, Fin is called to the scene of a shocking crime and must once again investigate the whereabouts of the man he arrested years ago."
      },
      {
        "id": "tvmaze:891930",
        "title": "Imposter",
        "season": 18,
        "episode": 3,
        "released": "2016-10-05",
        "overview": "A man tears a family apart when he uses a prominent fake identity to lure a vulnerable wife and mother into his bed. Barba argues that the evidence amounts to rape, but he's faced with a powerful defense attorney and a skeptical judge in court."
      },
      {
        "id": "tvmaze:929544",
        "title": "Heightened Emotions",
        "season": 18,
        "episode": 4,
        "released": "2016-10-12",
        "overview": "An athlete is the victim of sexual assault, but her secret double life could ruin both the case against her attacker and her Olympic future. Meanwhile, Rollins reconnects with her sister Kim after she's released from prison on parole."
      },
      {
        "id": "tvmaze:962829",
        "title": "Rape Interrupted",
        "season": 18,
        "episode": 5,
        "released": "2016-10-26",
        "overview": "A sergeant makes Benson choose between loyalty and duty when his son is accused of rape."
      },
      {
        "id": "tvmaze:939449",
        "title": "Broken Rhymes",
        "season": 18,
        "episode": 6,
        "released": "2016-11-09",
        "overview": "A record label CEO and his protg are questioned for their involvement in the assault of a transgender student."
      },
      {
        "id": "tvmaze:939451",
        "title": "Next Chapter",
        "season": 18,
        "episode": 7,
        "released": "2017-01-04",
        "overview": "A woman is sexually assaulted by a masked man, but she believes the rapist is the same man who went to jail for stalking her. Meanwhile, Tucker contemplates retirement and a future with Benson."
      },
      {
        "id": "tvmaze:1019508",
        "title": "Chasing Theo",
        "season": 18,
        "episode": 8,
        "released": "2017-01-11",
        "overview": "A 6 year-old boy disappears from his bed in the midst of a wild, drug-fueled party thrown by his mother. With a child's life on the line, the case causes Benson to scrutinize her own role as a mother."
      },
      {
        "id": "tvmaze:981734",
        "title": "Decline and Fall",
        "season": 18,
        "episode": 9,
        "released": "2017-01-18",
        "overview": "The powerful family of a retail empire closes ranks when a bartender accuses one of their own of rape."
      },
      {
        "id": "tvmaze:981736",
        "title": "Motherly Love",
        "season": 18,
        "episode": 10,
        "released": "2017-02-08",
        "overview": "A teenaged boy uses a rifle to stop an assault on his mother, but soon learns the target was someone he knows."
      },
      {
        "id": "tvmaze:1043711",
        "title": "Great Expectations",
        "season": 18,
        "episode": 11,
        "released": "2017-02-15",
        "overview": "The SVU investigates the players of a top youth hockey team after a vicious locker room hazing."
      },
      {
        "id": "tvmaze:1053704",
        "title": "No Surrender",
        "season": 18,
        "episode": 12,
        "released": "2017-02-22",
        "overview": "Fin revisits his military roots when a fellow Army Ranger struggles to recover from a sexual assault."
      },
      {
        "id": "tvmaze:1071382",
        "title": "Genes",
        "season": 18,
        "episode": 13,
        "released": "2017-03-22",
        "overview": "An investigation hits a nerve with Benson when a suspect claims his genetics causes him to commit rape."
      },
      {
        "id": "tvmaze:1071383",
        "title": "Net Worth",
        "season": 18,
        "episode": 14,
        "released": "2017-03-29",
        "overview": "A top-level investment banker accuses her billionaire client of rape."
      },
      {
        "id": "tvmaze:1071381",
        "title": "Know It All",
        "season": 18,
        "episode": 15,
        "released": "2017-04-05",
        "overview": "A man under investigation for rape and murder threatens to expose the secrets of those working the case."
      },
      {
        "id": "tvmaze:1071384",
        "title": "The Newsroom",
        "season": 18,
        "episode": 16,
        "released": "2017-04-26",
        "overview": "Benson and Barba ask witnesses to put their jobs on the line after a news anchor makes an on-air disclosure of rape against her boss."
      },
      {
        "id": "tvmaze:1071385",
        "title": "Real Fake News",
        "season": 18,
        "episode": 17,
        "released": "2017-05-03",
        "overview": "A congressman falsely accused of soliciting underage girls asks SVU to debunk the rumor, but the investigation leads to a real sex trafficking ring. Meanwhile, Benson and Rollins become the targets of a salacious website."
      },
      {
        "id": "tvmaze:1071386",
        "title": "Spellbound",
        "season": 18,
        "episode": 18,
        "released": "2017-05-10",
        "overview": "The SVU investigates a charismatic spiritual healer when a client claims he incapacitated and assaulted her using hypnosis."
      },
      {
        "id": "tvmaze:1071387",
        "title": "Conversion",
        "season": 18,
        "episode": 19,
        "released": "2017-05-17",
        "overview": "When a young woman is raped by a member of her church group, Barba must argue that the First Amendment doesn't entitle a person to break the law."
      },
      {
        "id": "tvmaze:1071388",
        "title": "American Dream",
        "season": 18,
        "episode": 20,
        "released": "2017-05-24",
        "overview": "A hate crime against a Muslim family results in the death of their daughter. When a crucial witness in the case is deported, Barba is forced to drop the charges against a suspect, and tensions rise between communities on opposing sides of the case."
      },
      {
        "id": "tvmaze:1099631",
        "title": "Sanctuary",
        "season": 18,
        "episode": 21,
        "released": "2017-05-24",
        "overview": "The unexpected release of a suspect in a hate crime case leaves Benson and Barba caught between two families seeking justice for their loved ones. As public protests escalate to violence, Benson goes to desperate lengths to make an arrest."
      },
      {
        "id": "tvmaze:1217479",
        "title": "Gone Fishin'",
        "season": 19,
        "episode": 1,
        "released": "2017-09-27",
        "overview": "When Fin crosses international borders to catch a fugitive rapist, a political tug-of-war derails Barba's legal case. Meanwhile, shocking allegations against Benson lead to the return of an old friend."
      },
      {
        "id": "tvmaze:1231670",
        "title": "Mood",
        "season": 19,
        "episode": 2,
        "released": "2017-10-04",
        "overview": "The bizarre details of a woman's rape put the SVU at odds when Rollins and Carisi think her story is fabricated. Meanwhile, Benson goes on the offensive when her personal life is scrutinized."
      },
      {
        "id": "tvmaze:1231671",
        "title": "Contrapasso",
        "season": 19,
        "episode": 3,
        "released": "2017-10-11",
        "overview": "When a man is found castrated and left for dead, Rollins and Carisi uncover three female suspects with possible motives. Meanwhile, Langan brings devastating news for Benson."
      },
      {
        "id": "tvmaze:1231672",
        "title": "No Good Reason",
        "season": 19,
        "episode": 4,
        "released": "2017-10-18",
        "overview": "A teenager disappears after schoolmates make her the subject of a vicious cyberbullying attack."
      },
      {
        "id": "tvmaze:1284881",
        "title": "Complicated",
        "season": 19,
        "episode": 5,
        "released": "2017-10-25",
        "overview": "A ten-year-old kidnapping case is reopened when a young woman is found wandering Central Park alone."
      },
      {
        "id": "tvmaze:1231673",
        "title": "Unintended Consequences",
        "season": 19,
        "episode": 6,
        "released": "2017-11-01",
        "overview": "When a teenaged girl is found dead, Rollins goes undercover at a high-end rehab center where the victim was last seen alive. Meanwhile, Benson tries to overcome her doubts about Sheila."
      },
      {
        "id": "tvmaze:1334062",
        "title": "Something Happened",
        "season": 19,
        "episode": 7,
        "released": "2017-11-29",
        "overview": "When an amnesic rape victim is found unconscious, Benson must unravel the facts about what happened. Her investigation drudges up the victim's dark secrets and reopens her own emotional wounds."
      },
      {
        "id": "tvmaze:1349496",
        "title": "Intent",
        "season": 19,
        "episode": 8,
        "released": "2017-12-06",
        "overview": "When a social media celebrity is raped by an MMA champion, SVU connects the case to one of the stars' small-town fans; Benson and Sheila cooperate in caring for Noah."
      },
      {
        "id": "tvmaze:1359551",
        "title": "Gone Baby Gone",
        "season": 19,
        "episode": 9,
        "released": "2018-01-03",
        "overview": "Emotions run high as the SVU squad embarks on a frantic search for Benson's missing son."
      },
      {
        "id": "tvmaze:1359552",
        "title": "Pathological",
        "season": 19,
        "episode": 10,
        "released": "2018-01-10",
        "overview": "When the SVU investigates a case involving two students in a special needs school, Rollins discovers that one child's medical issues stem from a surprising source."
      },
      {
        "id": "tvmaze:1362021",
        "title": "Flight Risk",
        "season": 19,
        "episode": 11,
        "released": "2018-01-17",
        "overview": "When an airline pilot accuses her captain of sexual assault, Barba convenes a Grand Jury to determine their employer's complicity in the crime. Meanwhile, Fin takes steps to ensure Benson is protected at work."
      },
      {
        "id": "tvmaze:1387004",
        "title": "Info Wars",
        "season": 19,
        "episode": 12,
        "released": "2018-01-31",
        "overview": "After a female pundit is assaulted during a protest, Benson and Barba struggle to put their political beliefs aside in order to help bring the attacker to justice."
      },
      {
        "id": "tvmaze:1387061",
        "title": "The Undiscovered Country",
        "season": 19,
        "episode": 13,
        "released": "2018-02-07",
        "overview": "When an infant goes missing, the SVU finds themselves taking sides in a family's right-to-die court case. Meanwhile, Barba's interference in the case puts the entire DA's office in jeopardy."
      },
      {
        "id": "tvmaze:1389427",
        "title": "Chasing Demons",
        "season": 19,
        "episode": 14,
        "released": "2018-02-28",
        "overview": "A doctor arrested for sexually abusing his patients is set free after Cassidy's testimony causes a mistrial."
      },
      {
        "id": "tvmaze:1407075",
        "title": "In Loco Parentis",
        "season": 19,
        "episode": 15,
        "released": "2018-03-07",
        "overview": "Carisi opens a police investigation when his niece reports a classmate for sexual assault, and Stone learns there are no perfect witnesses when it comes to sex crimes."
      },
      {
        "id": "tvmaze:1414668",
        "title": "Dare",
        "season": 19,
        "episode": 16,
        "released": "2018-03-14",
        "overview": "A girl's tragic death becomes a criminal case when a surgeon harvests her organs without parental consent."
      },
      {
        "id": "tvmaze:1418588",
        "title": "Send in the Clowns",
        "season": 19,
        "episode": 17,
        "released": "2018-03-21",
        "overview": "When a student disappears during a school trip to New York City, the cops race to find a mysterious masked man. Meanwhile, Fin and Stone both get visits from family."
      },
      {
        "id": "tvmaze:1422141",
        "title": "Service",
        "season": 19,
        "episode": 18,
        "released": "2018-04-11",
        "overview": "The SVU must break through military red tape when a soldier is suspected of sexual assault.When a prostitute is beaten and raped, SVU looks inside the Army for the perpetrator; Benson must crack a tough witness who doesn't want to talk; and Rollins is vexed by SVU's efforts to help a \"hooker.\""
      },
      {
        "id": "tvmaze:1422142",
        "title": "Sunk Cost Fallacy",
        "season": 19,
        "episode": 19,
        "released": "2018-04-18",
        "overview": "The search for an abducted woman and her young daughter leads Lt. Benson to cross paths with an old friend. Meanwhile, Stone must make a tough decision on behalf of his sister."
      },
      {
        "id": "tvmaze:1424036",
        "title": "The Book of Esther",
        "season": 19,
        "episode": 20,
        "released": "2018-05-02",
        "overview": "Rollins races to rescue a girl being held captive by her father.When an emaciated young girl is found huddled in a train bathroom quoting biblical passages, Rollins takes a special interest in her and takes it upon herself to uncover the truth about the girl's unsettling home life."
      },
      {
        "id": "tvmaze:1434479",
        "title": "Guardian",
        "season": 19,
        "episode": 21,
        "released": "2018-05-09",
        "overview": "Fin investigates a man's claim that his sister was gang raped."
      },
      {
        "id": "tvmaze:1435975",
        "title": "Mama",
        "season": 19,
        "episode": 22,
        "released": "2018-05-16",
        "overview": "An Alzheimer's patient claims she was raped, but her illness casts doubt on the case; Fin's sergeant orders come in."
      },
      {
        "id": "tvmaze:1435976",
        "title": "Remember Me",
        "season": 19,
        "episode": 23,
        "released": "2018-05-23",
        "overview": "When a young woman takes a man hostage at gunpoint, Benson makes a dangerous attempt to defuse the situation. Meanwhile, the SVU discovers the shocking motive behind the abduction."
      },
      {
        "id": "tvmaze:1435977",
        "title": "Remember Me Too",
        "season": 19,
        "episode": 24,
        "released": "2018-05-23",
        "overview": "Benson's suspicions about a kidnapping victim uncovers a dangerous criminal network prepared to silence anyone who gets in their way."
      },
      {
        "id": "tvmaze:1482237",
        "title": "Man Up",
        "season": 20,
        "episode": 1,
        "released": "2018-09-27",
        "overview": "Teenager Sam Conway shows evidence of rape but refuses to name his attacker. Meanwhile, Benson and Rollins confess to some major life changes."
      },
      {
        "id": "tvmaze:1482238",
        "title": "Man Down",
        "season": 20,
        "episode": 2,
        "released": "2018-09-27",
        "overview": "ADA Stone blames himself for the shocking verdict in Sam's case, and before Benson can offer help, Sam makes a tragic decision."
      },
      {
        "id": "tvmaze:1500307",
        "title": "Zero Tolerance",
        "season": 20,
        "episode": 3,
        "released": "2018-10-04",
        "overview": "After the rescue of a young girl from a sex trafficker, Benson and Stone must take drastic measures to reunite her with her mother. Meanwhile, Rollins decides to give her rocky relationship another chance."
      },
      {
        "id": "tvmaze:1514192",
        "title": "Revenge",
        "season": 20,
        "episode": 4,
        "released": "2018-10-11",
        "overview": "As a string of break-in assaults grows more violent, the cops investigate an online incel group to identify a suspect."
      },
      {
        "id": "tvmaze:1521481",
        "title": "Accredo",
        "season": 20,
        "episode": 5,
        "released": "2018-10-18",
        "overview": "A member of a women's empowerment group is found murdered, leading the cops to the group's charismatic male leader. Meanwhile, Rollins keeps her pregnancy under wraps to avoid going on desk duty."
      },
      {
        "id": "tvmaze:1521482",
        "title": "Exile",
        "season": 20,
        "episode": 6,
        "released": "2018-10-25",
        "overview": "A young woman wakes up in the hospital with no memory of her assault, and Carisi's investigation stalls when she disappears."
      },
      {
        "id": "tvmaze:1521483",
        "title": "Caretaker",
        "season": 20,
        "episode": 7,
        "released": "2018-11-01",
        "overview": "The cops wrestle with an unthinkable crime when a family is murdered in their sleep."
      },
      {
        "id": "tvmaze:1521484",
        "title": "Hell's Kitchen",
        "season": 20,
        "episode": 8,
        "released": "2018-11-08",
        "overview": "A waitress from a trendy New York restaurant is sexually assaulted at an after-hours VIP party."
      },
      {
        "id": "tvmaze:1521486",
        "title": "Mea Culpa",
        "season": 20,
        "episode": 9,
        "released": "2018-11-15",
        "overview": "Stone takes his own case to trial when a woman from his past accuses him of sexual assault."
      },
      {
        "id": "tvmaze:1553943",
        "title": "Alta Kockers",
        "season": 20,
        "episode": 10,
        "released": "2018-11-29",
        "overview": "The investigation into a promising new author's death leads to a decades-old secret kept between two reclusive brothers."
      },
      {
        "id": "tvmaze:1571538",
        "title": "Plastic",
        "season": 20,
        "episode": 11,
        "released": "2019-01-10",
        "overview": "A woman accuses a celebrity plastic surgeon and his girlfriend of rape."
      },
      {
        "id": "tvmaze:1585292",
        "title": "Dear Ben",
        "season": 20,
        "episode": 12,
        "released": "2019-01-17",
        "overview": "Stone takes up the unsolved cold case of a serial rapist that consumed his father's career."
      },
      {
        "id": "tvmaze:1588181",
        "title": "A Story of More Woe",
        "season": 20,
        "episode": 13,
        "released": "2019-01-31",
        "overview": "Benson tries to help two teenage sisters after their father is killed. Meanwhile, Rollins goes into labor."
      },
      {
        "id": "tvmaze:1595365",
        "title": "Part 33",
        "season": 20,
        "episode": 14,
        "released": "2019-02-07",
        "overview": "As Stone prosecutes the case of a woman who killed her abusive husband, Benson and her squad wrestle with the duty of testifying against her."
      },
      {
        "id": "tvmaze:1596137",
        "title": "Brothel",
        "season": 20,
        "episode": 15,
        "released": "2019-02-14",
        "overview": "Fin teams up with an old colleague to track down the proprietor of a pop-up brothel."
      },
      {
        "id": "tvmaze:1594602",
        "title": "Facing Demons",
        "season": 20,
        "episode": 16,
        "released": "2019-02-21",
        "overview": "A young man's suicide sparks a child molestation investigation, and Benson turns to Cassidy when the case hits a dead end."
      },
      {
        "id": "tvmaze:1612296",
        "title": "Missing",
        "season": 20,
        "episode": 17,
        "released": "2019-03-14",
        "overview": "The SVU pursues a suspect when a child is discovered in the trunk of an abandoned car."
      },
      {
        "id": "tvmaze:1612297",
        "title": "Blackout",
        "season": 20,
        "episode": 18,
        "released": "2019-03-21",
        "overview": "When Defense Attorney Nikki Staines is raped after a police charity event, Benson reluctantly looks to her own for a suspect."
      },
      {
        "id": "tvmaze:1616056",
        "title": "Dearly Beloved",
        "season": 20,
        "episode": 19,
        "released": "2019-04-04",
        "overview": "The SVU investigates a he-said, she-said case when a woman crashes a wedding to accuse her therapist of sexual assault.."
      },
      {
        "id": "tvmaze:1621354",
        "title": "The Good Girl",
        "season": 20,
        "episode": 20,
        "released": "2019-04-11",
        "overview": "Benson works to uncover a pregnant teenager's secret when she refuses to name the baby's father."
      },
      {
        "id": "tvmaze:1627648",
        "title": "Exchange",
        "season": 20,
        "episode": 21,
        "released": "2019-04-25",
        "overview": "Benson helps a teenaged exchange student after she's assaulted by a cab driver."
      },
      {
        "id": "tvmaze:1627649",
        "title": "Diss",
        "season": 20,
        "episode": 22,
        "released": "2019-05-02",
        "overview": "When a pop star is assaulted in her home, the SVU investigates the public feud between her rapper husband and a competing recording artist. Meanwhile, Fin's family ties to a suspect takes him off the case."
      },
      {
        "id": "tvmaze:1632943",
        "title": "Assumptions",
        "season": 20,
        "episode": 23,
        "released": "2019-05-09",
        "overview": "The SVU searches for two suspects spotted fleeing the scene after a Muslim woman is assaulted inside a synagogue. Meanwhile, Benson is dismayed to find Rob Miller out on bail."
      },
      {
        "id": "tvmaze:1632944",
        "title": "End Game",
        "season": 20,
        "episode": 24,
        "released": "2019-05-16",
        "overview": "When a teenager is found dead in the Hudson River, Lt. Benson suspects Rob Miller is behind the mysterious death but can't prove it. Despite having only circumstantial evidence, ADA Stone takes the case to court before Miller can destroy more lives."
      },
      {
        "id": "tvmaze:1672015",
        "title": "I'm Going to Make You a Star",
        "season": 21,
        "episode": 1,
        "released": "2019-09-26",
        "overview": "When an actress accuses a high-powered media mogul of attempted rape, Benson finds herself in a high-stakes game of cat and mouse. Changes in the squad room put Carisi between a rock and a hard place."
      },
      {
        "id": "tvmaze:1687792",
        "title": "The Darkest Journey Home",
        "season": 21,
        "episode": 2,
        "released": "2019-10-03",
        "overview": "Benson works with a young woman to help her remember the details and suspects in her rape. In order to learn a new witness interview technique, Rollins and Fin have to experience it for themselves."
      },
      {
        "id": "tvmaze:1687793",
        "title": "Down Low in Hell's Kitchen",
        "season": 21,
        "episode": 3,
        "released": "2019-10-10",
        "overview": "A serial predator targeting men in gay bars proves difficult to catch, until a celebrity comes forward with his story."
      },
      {
        "id": "tvmaze:1690753",
        "title": "The Burden of Our Choices",
        "season": 21,
        "episode": 4,
        "released": "2019-10-17",
        "overview": "Rollins clashes with the parents of a teenaged runaway. The squad comes together for a special event."
      },
      {
        "id": "tvmaze:1690754",
        "title": "At Midnight in Manhattan",
        "season": 21,
        "episode": 5,
        "released": "2019-10-24",
        "overview": "The detectives are spread thin when three major cases come in at Midnight. Rollins and Carisi argue over an arrest."
      },
      {
        "id": "tvmaze:1690755",
        "title": "Murdered at a Bad Address",
        "season": 21,
        "episode": 6,
        "released": "2019-10-31",
        "overview": "The case of a teenage girl assaulted in the projects leads to a startling discovery. Benson puts her trust in someone from her past."
      },
      {
        "id": "tvmaze:1719988",
        "title": "Counselor, It's Chinatown",
        "season": 21,
        "episode": 7,
        "released": "2019-11-07",
        "overview": "The SVU joins an undercover task force in busting a human trafficking ring."
      },
      {
        "id": "tvmaze:1719989",
        "title": "We Dream of Machine Elves",
        "season": 21,
        "episode": 8,
        "released": "2019-11-14",
        "overview": "Rollins goes undercover to find a suspect who is drugging and assaulting tourists, while Benson helps the victims sort out their memories from their hallucinations."
      },
      {
        "id": "tvmaze:1751864",
        "title": "Can't Be Held Accountable",
        "season": 21,
        "episode": 9,
        "released": "2019-11-21",
        "overview": "A fellow detective asks the SVU for help when he suspects his two daughters are being groomed by a serial predator. Kat disobeys the Captain's orders."
      },
      {
        "id": "tvmaze:1758516",
        "title": "Must Be Held Accountable",
        "season": 21,
        "episode": 10,
        "released": "2020-01-09",
        "overview": "A desperate father takes matters into his own hands in the case against his daughter's rapist."
      },
      {
        "id": "tvmaze:1762045",
        "title": "She Paints for Vengeance",
        "season": 21,
        "episode": 11,
        "released": "2020-01-16",
        "overview": "After a sexual assault investigation is stalled for months, a woman puts her accusations against a popular athlete on a billboard."
      },
      {
        "id": "tvmaze:1770533",
        "title": "The Longest Night of Rain",
        "season": 21,
        "episode": 12,
        "released": "2020-01-30",
        "overview": "Benson investigates a police officer's accusations of sexual assault. Captain Tucker's retirement party ends in tragedy."
      },
      {
        "id": "tvmaze:1772590",
        "title": "Redemption in Her Corner",
        "season": 21,
        "episode": 13,
        "released": "2020-02-06",
        "overview": "Kat steps over the line when she suspects a trainer at her boxing gym is taking advantage of his students."
      },
      {
        "id": "tvmaze:1778317",
        "title": "I Deserve Some Loving Too",
        "season": 21,
        "episode": 14,
        "released": "2020-02-13",
        "overview": "Rollins goes undercover to root out a government worker withholding green cards in exchange for sex."
      },
      {
        "id": "tvmaze:1799707",
        "title": "Swimming with the Sharks",
        "season": 21,
        "episode": 15,
        "released": "2020-02-20",
        "overview": "The female CEO of a popular wellness company says she was raped, but her business partner claims the accusation is part of an embezzlement coverup."
      },
      {
        "id": "tvmaze:1788473",
        "title": "Eternal Relief From Pain",
        "season": 21,
        "episode": 16,
        "released": "2020-02-27",
        "overview": "Rollins' sister stirs up trouble and a possible SVU investigation when she reports a doctor who trades prescription painkillers for sex."
      },
      {
        "id": "tvmaze:1808853",
        "title": "Dance, Lies and Videotape",
        "season": 21,
        "episode": 17,
        "released": "2020-03-26",
        "overview": "An ingnue ballerina discovers she's been secretly videotaped for a pornographic website."
      },
      {
        "id": "tvmaze:1811527",
        "title": "Garland's Baptism by Fire",
        "season": 21,
        "episode": 18,
        "released": "2020-04-02",
        "overview": "Chief Garland must put friendship aside when a pastor at his church is arrested."
      },
      {
        "id": "tvmaze:1811528",
        "title": "Solving for the Unknowns",
        "season": 21,
        "episode": 19,
        "released": "2020-04-16",
        "overview": "The SVU struggles to find a serial predator who uses a date rape drug that leaves no evidence behind. Rollins receives some good news."
      },
      {
        "id": "tvmaze:1822083",
        "title": "The Things We Have to Lose",
        "season": 21,
        "episode": 20,
        "released": "2020-04-23",
        "overview": "As Carisi begins the long-anticipated trial of Sir Toby Moore, the SVU faces setbacks in several other cases."
      },
      {
        "id": "tvmaze:1920534",
        "title": "Guardians and Gladiators",
        "season": 22,
        "episode": 1,
        "released": "2020-11-12",
        "overview": "When the squad tries to solve an assault in Central Park, they are hampered by their own blind spots and a community that is losing trust in the police."
      },
      {
        "id": "tvmaze:1948869",
        "title": "The Ballad of Dwight and Irena",
        "season": 22,
        "episode": 2,
        "released": "2020-11-19",
        "overview": "Rollins and Kat respond to a dangerous domestic violence call, while Fin gives his deposition in the lawsuit against him."
      },
      {
        "id": "tvmaze:1971590",
        "title": "Remember Me in Quarantine",
        "season": 22,
        "episode": 3,
        "released": "2020-12-03",
        "overview": "The SVU questions a group of college roommates when one of them goes missing during Covid lockdown."
      },
      {
        "id": "tvmaze:1976808",
        "title": "Sightless in a Savage Land",
        "season": 22,
        "episode": 4,
        "released": "2021-01-07",
        "overview": "The squad spends New Year's Eve tracking down an Amber Alert, and Carisi faces off against Counselor Rafael Barba in an emotional courtroom battle."
      },
      {
        "id": "tvmaze:1984537",
        "title": "Turn Me On Take Me Private",
        "season": 22,
        "episode": 5,
        "released": "2021-01-14",
        "overview": "The SVU investigates when a role-play session on a camming website turns violent after one user decides to meet his idol in person."
      },
      {
        "id": "tvmaze:1984538",
        "title": "The Long Arm of the Witness",
        "season": 22,
        "episode": 6,
        "released": "2021-01-21",
        "overview": "Carisi takes on a powerful judge when he inexplicably dismisses the rape case of a university student."
      },
      {
        "id": "tvmaze:1995715",
        "title": "Hunt, Trap, Rape and Release",
        "season": 22,
        "episode": 7,
        "released": "2021-02-18",
        "overview": "Benson teams up with Lt. Barek and the Bronx SVU to track down a serial rapist with victims in both boroughs."
      },
      {
        "id": "tvmaze:1984539",
        "title": "The Only Way Out Is Through",
        "season": 22,
        "episode": 8,
        "released": "2021-02-25",
        "overview": "Benson helps two sisters get closure from a harrowing childhood assault. Kat's cousin reaches out for help."
      },
      {
        "id": "tvmaze:2024062",
        "title": "Return of the Prodigal Son",
        "season": 22,
        "episode": 9,
        "released": "2021-04-01",
        "overview": "The squad rallies around Det. Stabler to find the suspect behind a threat to his family."
      },
      {
        "id": "tvmaze:1995716",
        "title": "Welcome to the Pedo Motel",
        "season": 22,
        "episode": 10,
        "released": "2021-04-08",
        "overview": "The SVU must contend with an angry neighborhood watch group when a girl goes missing near a building housing several sex offenders."
      },
      {
        "id": "tvmaze:1995717",
        "title": "Our Words Will Not Be Heard",
        "season": 22,
        "episode": 11,
        "released": "2021-04-15",
        "overview": "A high-profile activist suspects her sister has been kidnapped by a hate group. Garland and Benson push for change with NYPD brass. Kat gets some good news."
      },
      {
        "id": "tvmaze:2057859",
        "title": "In the Year We All Fell Down",
        "season": 22,
        "episode": 12,
        "released": "2021-04-22",
        "overview": "Benson walks into a hostage situation at a neighborhood restaurant. Rollins tries to help her father after he's hospitalized."
      },
      {
        "id": "tvmaze:2057860",
        "title": "Trick-Rolled at the Moulin'",
        "season": 22,
        "episode": 13,
        "released": "2021-05-13",
        "overview": "The SVU search for three women suspected of drugging and robbing wealthy men. The case leads to personal connections for both Benson and Kat."
      },
      {
        "id": "tvmaze:2057866",
        "title": "Post-Graduate Psychopath",
        "season": 22,
        "episode": 14,
        "released": "2021-05-20",
        "overview": "Rollins must revisit an old case when a child sent to juvenile detention is released after his 18th birthday."
      },
      {
        "id": "tvmaze:2060979",
        "title": "What Can Happen in the Dark",
        "season": 22,
        "episode": 15,
        "released": "2021-05-27",
        "overview": "Garland asks Benson to investigate an unusual domestic violence case when his neighbor is found injured."
      },
      {
        "id": "tvmaze:2083375",
        "title": "Wolves in Sheep's Clothing",
        "season": 22,
        "episode": 16,
        "released": "2021-06-03",
        "overview": "While Fin and Phoebe make wedding plans, Benson and Rollins try to help a homeless single mother who's being trafficked in exchange for safe housing."
      },
      {
        "id": "tvmaze:2131648",
        "title": "And the Empire Strikes Back",
        "season": 23,
        "episode": 1,
        "released": "2021-09-23",
        "overview": "Benson's loyalty to Garland is tested. Rollins and Carisi try to keep their witnesses on board when the congressman is identified as a suspect."
      },
      {
        "id": "tvmaze:2161666",
        "title": "Never Turn Your Back on Them",
        "season": 23,
        "episode": 2,
        "released": "2021-09-23",
        "overview": "The search for a missing witness leads Fin and Kat down a dangerous path. Chief McGrath puts pressure on Garland and Benson to get a conviction."
      },
      {
        "id": "tvmaze:2161667",
        "title": "I Thought You Were on My Side",
        "season": 23,
        "episode": 3,
        "released": "2021-09-30",
        "overview": "Benson and Rollins must contend with the FBI and the Organized Crime bureau when a rape victim identifies a dangerous mobster as her assailant."
      },
      {
        "id": "tvmaze:2175398",
        "title": "One More Tale of Two Victims",
        "season": 23,
        "episode": 4,
        "released": "2021-10-07",
        "overview": "The SVU searches for a serial rapist who preys on mothers with young children. Benson and Fin struggle under the tightened reins of Chief McGrath."
      },
      {
        "id": "tvmaze:2175399",
        "title": "Fast Times @TheWheelhouse",
        "season": 23,
        "episode": 5,
        "released": "2021-10-14",
        "overview": "The SVU faces the fury of social media fans when they arrest two popular influencer brothers."
      },
      {
        "id": "tvmaze:2175400",
        "title": "The Five Hundredth Episode",
        "season": 23,
        "episode": 6,
        "released": "2021-10-21",
        "overview": "Amaro asks the SVU for help in clearing a convicted man's name and brings a figure from Benson's past back into her life."
      },
      {
        "id": "tvmaze:2175401",
        "title": "They'd Already Disappeared",
        "season": 23,
        "episode": 7,
        "released": "2021-11-04",
        "overview": "When a teenage sex worker disappears, Rollins and Velasco find a key clue in a pile of neglected missing persons reports."
      },
      {
        "id": "tvmaze:2200352",
        "title": "Nightmares in Drill City",
        "season": 23,
        "episode": 8,
        "released": "2021-11-11",
        "overview": "Carisi asks the SVU for help with a murder investigation when one of the witnesses shows signs of abuse."
      },
      {
        "id": "tvmaze:2212279",
        "title": "People vs Richard Wheatley",
        "season": 23,
        "episode": 9,
        "released": "2021-12-09",
        "overview": "Carisi tries Richard Wheatley for the murder of Kathy Stabler. Benson finds herself at odds with a friend when Barba agrees to take the case."
      },
      {
        "id": "tvmaze:2212280",
        "title": "Silent Night, Hateful Night",
        "season": 23,
        "episode": 10,
        "released": "2022-01-06",
        "overview": "The SVU is called in to help investigate a wave of hate crimes on Christmas Eve. Rollins catches up with an old flame."
      },
      {
        "id": "tvmaze:2215523",
        "title": "Burning With Rage Forever",
        "season": 23,
        "episode": 11,
        "released": "2022-01-13",
        "overview": "A boy disappears after meeting up with an online gamer. Benson suspects her son is being bullied."
      },
      {
        "id": "tvmaze:2244490",
        "title": "Tommy Baker's Hardest Fight",
        "season": 23,
        "episode": 12,
        "released": "2022-01-20",
        "overview": "When a popular fighter doesn't show up for the biggest bout of the year, Rollins and Velasco are drawn into a complicated web of secrets. McGrath confides in Benson."
      },
      {
        "id": "tvmaze:2244491",
        "title": "If I Knew Then What I Know Now",
        "season": 23,
        "episode": 13,
        "released": "2022-02-24",
        "overview": "A young woman learning about her birth parents asks Benson for help. Carisi and Rollins weigh the risks of taking their relationship public."
      },
      {
        "id": "tvmaze:2244492",
        "title": "Video Killed the Radio Star",
        "season": 23,
        "episode": 14,
        "released": "2022-03-03",
        "overview": "Benson investigates allegations against a popular radio personality. Rollins goes undercover when a shocking confession leads to another crime."
      },
      {
        "id": "tvmaze:2244493",
        "title": "Promising Young Gentlemen",
        "season": 23,
        "episode": 15,
        "released": "2022-03-10",
        "overview": "Carisi's niece helps a friend report a sexual assault; Benson investigates a college's secret society that preys on female students."
      },
      {
        "id": "tvmaze:2264357",
        "title": "Sorry If It Got Weird for You",
        "season": 23,
        "episode": 16,
        "released": "2022-03-17",
        "overview": "The creator of a dating app is accused of using it to rape women. Velasco's experience as an SVU detective is put on trial."
      },
      {
        "id": "tvmaze:2264358",
        "title": "Once Upon a Time in El Barrio",
        "season": 23,
        "episode": 17,
        "released": "2022-04-07",
        "overview": "Velasco asks Benson for help finding three girls who were trafficked from his hometown to New York City."
      },
      {
        "id": "tvmaze:2264359",
        "title": "Eighteen Wheels a Predator",
        "season": 23,
        "episode": 18,
        "released": "2022-04-14",
        "overview": "Rollins and Fin investigate an assault in Kentucky that has striking similarities to victim found in Central Park. Benson receives intel that turns the case upside down."
      },
      {
        "id": "tvmaze:2301765",
        "title": "Tangled Strands of Justice",
        "season": 23,
        "episode": 19,
        "released": "2022-04-28",
        "overview": "Garland asks Benson to reopen a missing persons case he worked as a rookie officer. A victim in one of Carisi's recent cases is arrested."
      },
      {
        "id": "tvmaze:2303795",
        "title": "Did You Believe in Miracles?",
        "season": 23,
        "episode": 20,
        "released": "2022-05-05",
        "overview": "When a student's school reports a girl missing, the squad must track down a trusted family friend for answers. Benson gets a Mother's Day surprise."
      },
      {
        "id": "tvmaze:2303796",
        "title": "Confess Your Sins to Be Free",
        "season": 23,
        "episode": 21,
        "released": "2022-05-12",
        "overview": "When the only evidence in a crime is a church confession, Carisi must find another way to prove his suspect guilty. Benson agrees to meet with an old friend seeking to make amends for past transgressions."
      },
      {
        "id": "tvmaze:2308809",
        "title": "A Final Call At Forlini's Bar",
        "season": 23,
        "episode": 22,
        "released": "2022-05-19",
        "overview": "The SVU provides help and protection for a longtime domestic violence victim, but when she winds up at the defendant's table in court, Rollins surprises Carisi with a formidable opponent at trial."
      },
      {
        "id": "tvmaze:2355075",
        "title": "Gimme Shelter, Part II",
        "season": 24,
        "episode": 1,
        "released": "2022-09-22",
        "overview": "A young girl is shot and Cosgrove teams with Det. Jalen Shaw to track down her killer. Benson and Stabler assist and realize it's more than a typical homicide. McCoy and Price seek justice against an international crime ring, but complications threaten the case."
      },
      {
        "id": "tvmaze:2381290",
        "title": "The One You Feed",
        "season": 24,
        "episode": 2,
        "released": "2022-09-29",
        "overview": "A group of teens terrorizing tourists has the SVU squad working overtime; McGrath teams them up with the Bronx gang unit to track down a crucial lead."
      },
      {
        "id": "tvmaze:2381291",
        "title": "Mirror Effect",
        "season": 24,
        "episode": 3,
        "released": "2022-10-06",
        "overview": "Benson tries to help a pop star in a volatile relationship; Rollins struggles with taking the stress of work home with her; Fin teaches a rookie a lesson in respecting fellow officers."
      },
      {
        "id": "tvmaze:2381292",
        "title": "The Steps We Cannot Take",
        "season": 24,
        "episode": 4,
        "released": "2022-10-13",
        "overview": "A home invasion and kidnapping leads the SVU to a shocking discovery. Muncy tries to fit in with the squad."
      },
      {
        "id": "tvmaze:2381293",
        "title": "Breakwater",
        "season": 24,
        "episode": 5,
        "released": "2022-10-27",
        "overview": "A young man asks the SVU for help when he suspects his boss is preying on his sister;Velasco tries to convince a reluctant witness to testify in court."
      },
      {
        "id": "tvmaze:2416460",
        "title": "Controlled Burn",
        "season": 24,
        "episode": 6,
        "released": "2022-11-03",
        "overview": "Rollins investigates an assault by a masked man at an underground party. Benson uncovers a suspect who may be valuable as a witness."
      },
      {
        "id": "tvmaze:2420016",
        "title": "Dead Ball",
        "season": 24,
        "episode": 7,
        "released": "2022-11-10",
        "overview": "When the case against a popular sports star falls through, Benson digs into the suspect's past to uncover additional victims. Velasco is disappointed when he meets one of his heroes."
      },
      {
        "id": "tvmaze:2424652",
        "title": "A Better Person",
        "season": 24,
        "episode": 8,
        "released": "2022-11-17",
        "overview": "The SVU hunts for a violent suspect who killed a detective's child. Rollins ponders a potential opportunity."
      },
      {
        "id": "tvmaze:2427588",
        "title": "And a Trauma in a Pear Tree",
        "season": 24,
        "episode": 9,
        "released": "2022-12-08",
        "overview": "Carisi and Rollins work together on an important arraignment. Benson tries to make Noah's Christmas wish come true when a case falls in her lap."
      },
      {
        "id": "tvmaze:2427589",
        "title": "Jumped In",
        "season": 24,
        "episode": 10,
        "released": "2023-01-05",
        "overview": "When Benson becomes the target of a ruthless gang leader, Capt. Duarte takes the case. Fin works with the Bronx SVU to help clear their case backlog. Sgt. Dixon offers to translate when a deaf student is raped."
      },
      {
        "id": "tvmaze:2448455",
        "title": "Soldier Up",
        "season": 24,
        "episode": 11,
        "released": "2023-01-12",
        "overview": "While Benson tries to help the gang member who attacked her, Duarte reveals a shocking piece of evidence in the case. Fin is tasked with hiring new detectives for the Bronx SVU."
      },
      {
        "id": "tvmaze:2464877",
        "title": "Blood Out",
        "season": 24,
        "episode": 12,
        "released": "2023-01-26",
        "overview": "As Benson and Carisi put a vengeful crime boss on trial, Fin tries to help a woman who was drugged and left for dead. Velasco takes drastic action to get information from a witness."
      },
      {
        "id": "tvmaze:2474310",
        "title": "Intersection",
        "season": 24,
        "episode": 13,
        "released": "2023-02-02",
        "overview": "A car accident leads the detectives on a search for an ambulance driver assaulting his charges. Fin gives Det. Bruno a tour of Manhattan SVU."
      },
      {
        "id": "tvmaze:2482149",
        "title": "Dutch Tears",
        "season": 24,
        "episode": 14,
        "released": "2023-02-16",
        "overview": "A recently released convict goes looking for his arresting officer, Fin Tutuola. Carisi tries to get an arrest warrant without a positive suspect ID."
      },
      {
        "id": "tvmaze:2482150",
        "title": "King of the Moon",
        "season": 24,
        "episode": 15,
        "released": "2023-02-23",
        "overview": "A man with dementia confesses to murder, but Benson and Carisi believe there's more to the case. When rumors swirl around the squadroom, Fin presses Velasco for the truth."
      },
      {
        "id": "tvmaze:2490972",
        "title": "The Presence of Absence",
        "season": 24,
        "episode": 16,
        "released": "2023-03-23",
        "overview": "An Internet dating site becomes the source of terror for a young widow. Muncy struggles with Velasco's absence."
      },
      {
        "id": "tvmaze:2500270",
        "title": "Lime Chaser",
        "season": 24,
        "episode": 17,
        "released": "2023-03-30",
        "overview": "The search for a suspect drugging women's drinks in crowded bars leads the SVU to Muncy's brother. Churlish makes a risky move to impress Benson."
      },
      {
        "id": "tvmaze:2500271",
        "title": "Bubble Wrap",
        "season": 24,
        "episode": 18,
        "released": "2023-04-06",
        "overview": "A construction tycoon interferes with an SVU investigation into her family. Carisi struggles to get an indictment when the complainant backs down."
      },
      {
        "id": "tvmaze:2517616",
        "title": "Bend the Law",
        "season": 24,
        "episode": 19,
        "released": "2023-04-27",
        "overview": "Carisi must tread carefully when Maxwell's husband becomes a person of interest in an SVU investigation. Benson sends Velasco to take an old friend into custody."
      },
      {
        "id": "tvmaze:2517617",
        "title": "Debatable",
        "season": 24,
        "episode": 20,
        "released": "2023-05-04",
        "overview": "Benson tries to help a student after she's assaulted on a field trip. Fin suspects a witness in the case may not be telling the whole truth."
      },
      {
        "id": "tvmaze:2517618",
        "title": "Bad Things",
        "season": 24,
        "episode": 21,
        "released": "2023-05-11",
        "overview": "Benson and Carisi are baffled when a series of assaults have the same M.O. but different DNA at each crime scene. Muncy believes Elias Olsen has struck again and is determined to prove it."
      },
      {
        "id": "tvmaze:2517622",
        "title": "All Pain Is One Malady",
        "season": 24,
        "episode": 22,
        "released": "2023-05-18",
        "overview": "In the search for a revenge-for-hire crime ring, Benson and Stabler combine forces on a case that has now spread globally. Fin and Bruno help a rape victim assaulted a second time. Jet's plan to hack the dark web backfires and puts the team in danger."
      },
      {
        "id": "tvmaze:2691458",
        "title": "Tunnel Blind",
        "season": 25,
        "episode": 1,
        "released": "2024-01-18",
        "overview": "As the squad celebrates Rollins and Carisi's child, another child goes missing in broad daylight."
      },
      {
        "id": "tvmaze:2732680",
        "title": "Truth Embargo",
        "season": 25,
        "episode": 2,
        "released": "2024-01-25",
        "overview": "As Benson teams up with the FBI on an unsolved case, Fin and Velasco investigate a flash mob robbery that lead to a sexual assault."
      },
      {
        "id": "tvmaze:2732681",
        "title": "The Punch List",
        "season": 25,
        "episode": 3,
        "released": "2024-02-01",
        "overview": "The SVU helps a man come to terms with being victimized; Benson tries to support a victim's family when tragedy strikes twice."
      },
      {
        "id": "tvmaze:2746744",
        "title": "Duty to Report",
        "season": 25,
        "episode": 4,
        "released": "2024-02-08",
        "overview": "When Chief McGrath's daughter discloses a sexual assault, Benson must balance the intricacies of the investigation with McGrath's impulsive actions."
      },
      {
        "id": "tvmaze:2746745",
        "title": "Zone Rouge",
        "season": 25,
        "episode": 5,
        "released": "2024-02-22",
        "overview": "A cryptic message sends SVU on a new track to find Maddie. Benson tries to help a federal agent when the case hits too close to home. Capt. Curry tries to make amends with Fin."
      },
      {
        "id": "tvmaze:2746746",
        "title": "Carousel",
        "season": 25,
        "episode": 6,
        "released": "2024-02-29",
        "overview": "The SVU must track down a mysterious suspect targeting tourists staying in hostels and race to identify one woman's attacker before she opts to go home."
      },
      {
        "id": "tvmaze:2749784",
        "title": "Probability of Doom",
        "season": 25,
        "episode": 7,
        "released": "2024-03-14",
        "overview": "When a woman turns her husband in for possessing child pornography, the case is complicated by a sudden death. Benson tries to reconnect with a victim she saved."
      },
      {
        "id": "tvmaze:2783720",
        "title": "Third Man Syndrome",
        "season": 25,
        "episode": 8,
        "released": "2024-03-21",
        "overview": "A brutal assault in the street leads Carisi to pursue hate crime charges. Benson must support a homebound witness too scared to speak up."
      },
      {
        "id": "tvmaze:2799253",
        "title": "Children of Wolves",
        "season": 25,
        "episode": 9,
        "released": "2024-04-11",
        "overview": "A teenager found unconscious in the park leads to a missing persons investigation. Benson must help Noah come to terms with the past when he questions the origins of his birth."
      },
      {
        "id": "tvmaze:2812319",
        "title": "Combat Fatigue",
        "season": 25,
        "episode": 10,
        "released": "2024-04-18",
        "overview": "The squad is on edge as Carisi waits for a verdict in Maddie's kidnapping case. Benson tries to help the Flynn family pick up the pieces of their broken life."
      },
      {
        "id": "tvmaze:2830354",
        "title": "Prima Nocta",
        "season": 25,
        "episode": 11,
        "released": "2024-05-02",
        "overview": "A runaway bride calls the SVU for help on the day of her wedding. Rollins pitches in on her day off."
      },
      {
        "id": "tvmaze:2836702",
        "title": "Marauder",
        "season": 25,
        "episode": 12,
        "released": "2024-05-09",
        "overview": "Agent Sykes struggles to cope on the anniversary of her sister's disappearance. Benson suspects a cold case from Manhattan could help her get closure."
      },
      {
        "id": "tvmaze:2836703",
        "title": "Duty To Hope",
        "season": 25,
        "episode": 13,
        "released": "2024-05-16",
        "overview": "The SVU searches for a pattern assailant before his crimes escalate to murder. Fin must contend with a suspect's aggrieved son. Carisi is pressured to close the case quickly to ease public concern."
      },
      {
        "id": "tvmaze:2939430",
        "title": "Fractured",
        "season": 26,
        "episode": 1,
        "released": "2024-10-03",
        "overview": "The SVU investigates a brutal attack on a group of law students. Benson hopes the discovery of a hidden camera will crack the case open. Carisi's best chance at conviction is catching the defendant in a lie."
      },
      {
        "id": "tvmaze:3005578",
        "title": "Excavation",
        "season": 26,
        "episode": 2,
        "released": "2024-10-10",
        "overview": "Devastating repressed memories come back to a woman when she finds an old notebook in her family home; bringing charges in a decades-old crime proves even more difficult for Carisi when a powerful judge stalls the case."
      },
      {
        "id": "tvmaze:3005580",
        "title": "Divide & Conquer",
        "season": 26,
        "episode": 3,
        "released": "2024-10-17",
        "overview": "A couple have their NYC dinner party interrupted by a brutal home invasion and assault by masked men."
      },
      {
        "id": "tvmaze:3005579",
        "title": "Constricted",
        "season": 26,
        "episode": 4,
        "released": "2024-10-24",
        "overview": "A romantic date ends with a teenager fighting for her life in the hospital; Carisi can't help bringing the case home with him as he envisions the dangers ahead for his growing daughters."
      },
      {
        "id": "tvmaze:3005581",
        "title": "Economics of Shame",
        "season": 26,
        "episode": 5,
        "released": "2024-10-31",
        "overview": "When a TV reporter becomes the victim of sextortion that could ruin her career, Benson helps her take back control while Velasco goes undercover as a potential rich target."
      },
      {
        "id": "tvmaze:3005582",
        "title": "Rorschach",
        "season": 26,
        "episode": 6,
        "released": "2024-11-07",
        "overview": "Agent Clay consults with Benson when a woman is found gravely injured at a remote campground and the suspect could be anywhere along the Eastern Seaboard; Bruno and Silva take a chance on an odd hunch to see if it becomes a lead."
      },
      {
        "id": "tvmaze:3005583",
        "title": "Tenfold",
        "season": 26,
        "episode": 7,
        "released": "2024-11-14",
        "overview": "Bruno must get to the center of a victim's incomplete story to track down a serial rapist; Carisi is helpless to stop a crime he suspects is about to be committed."
      },
      {
        "id": "tvmaze:3005584",
        "title": "Cornered",
        "season": 26,
        "episode": 8,
        "released": "2024-11-21",
        "overview": "Carisi tries to protect two women taken hostage in a tense standoff between police and a violent thief; Benson and Rollins devise a risky plan to get everyone to safety."
      },
      {
        "id": "tvmaze:3060218",
        "title": "First Light",
        "season": 26,
        "episode": 9,
        "released": "2025-01-16",
        "overview": "An abhorrent web of lies and betrayal is uncovered when a woman is confronted with video of a night she can't remember; Carisi struggles to move on from his ordeal when the suspect changes his plea."
      },
      {
        "id": "tvmaze:3103885",
        "title": "Master Key",
        "season": 26,
        "episode": 10,
        "released": "2025-01-23",
        "overview": "When a teen from a group home goes missing, the squad must quickly determine if he ran away or was abducted. Velasco puts pressure on the system at large for letting children slip through the cracks."
      },
      {
        "id": "tvmaze:3110133",
        "title": "Deductible",
        "season": 26,
        "episode": 11,
        "released": "2025-01-30",
        "overview": "A young boy seeks help when his sister doesn't come home from work; Benson and Carisi suspect a woman's assault was prearranged by a third party."
      },
      {
        "id": "tvmaze:3110134",
        "title": "Calculated",
        "season": 26,
        "episode": 12,
        "released": "2025-02-13",
        "overview": "When a high school principal busts a student for sexting, the SVU uncovers a sinister case of distribution concerning hundreds of underage students; Silva pleads for leniency for a suspect she believes is innocent."
      },
      {
        "id": "tvmaze:3123317",
        "title": "Extinguished",
        "season": 26,
        "episode": 13,
        "released": "2025-02-20",
        "overview": "Velasco teams up with a community security guard eager to prove his mettle to find a suspect in the assault of two teens."
      },
      {
        "id": "tvmaze:3133589",
        "title": "The Grid Plan",
        "season": 26,
        "episode": 14,
        "released": "2025-02-27",
        "overview": "A Midwestern tourist is viciously attacked in Times Square; as the squad scours the area for clues, the victim takes the investigation into her own hands; a secret motive threatens to derail Carisi's case."
      },
      {
        "id": "tvmaze:3133604",
        "title": "Undertow",
        "season": 26,
        "episode": 15,
        "released": "2025-03-13",
        "overview": "A complicated case of sex and drug use divides the squad; Carisi must convince a jury to focus on the law and not the defendant's accusations."
      },
      {
        "id": "tvmaze:3133624",
        "title": "Let Me Bring Pardon",
        "season": 26,
        "episode": 16,
        "released": "2025-03-20",
        "overview": "The doctor of a comatose woman calls SVU when he discovers his patient is pregnant; Benson must convince the family to reject magical thinking and look at the facts."
      },
      {
        "id": "tvmaze:3169663",
        "title": "Accomplice Liability",
        "season": 26,
        "episode": 17,
        "released": "2025-04-03",
        "overview": "Carisi attempts to put aside his role as prosecutor to serve as a witness in a trial. Benson tries to help a rape survivor struggling with her recovery."
      },
      {
        "id": "tvmaze:3169664",
        "title": "The Accuser",
        "season": 26,
        "episode": 18,
        "released": "2025-04-10",
        "overview": "When a man is ruthlessly assaulted, the SVU's investigation uncovers a decades-old secret."
      },
      {
        "id": "tvmaze:3181178",
        "title": "Play With Fire Part 2",
        "season": 26,
        "episode": 19,
        "released": "2025-04-17",
        "overview": "When the SVU and the 2-7 uncover a pattern of rape and murder targeting marginalized women, Carisi and ADA Price team up to charge the suspect with multiple crimes."
      },
      {
        "id": "tvmaze:3183337",
        "title": "Shock Collar",
        "season": 26,
        "episode": 20,
        "released": "2025-05-01",
        "overview": "When a car with a young girl in the backseat is stolen, the SVU investigates whether it was a crime of opportunity or a targeted abduction."
      },
      {
        "id": "tvmaze:3190564",
        "title": "Aperture",
        "season": 26,
        "episode": 21,
        "released": "2025-05-08",
        "overview": "When an assault at gunpoint is witnessed through a neighboring window, the squad scrambles to locate the victim to confirm she's safe; a threat to extort the victim's family leads to a shocking suspect."
      },
      {
        "id": "tvmaze:3199866",
        "title": "Post-Rage",
        "season": 26,
        "episode": 22,
        "released": "2025-05-15",
        "overview": "Benson investigates a string of sexual assaults targeting local female psychiatrists; the squad celebrates a promotion."
      },
      {
        "id": "tvmaze:3316796",
        "title": "In The Wind",
        "season": 27,
        "episode": 1,
        "released": "2025-09-25",
        "overview": "Danger swirls around the squad as they investigate a suspect for rape and try to protect their key witness; a new chief of detectives puts Benson to the test; an off-duty Fin tries to stop an assault in progress."
      },
      {
        "id": "tvmaze:3348553",
        "title": "A Waiver of Consent",
        "season": 27,
        "episode": 2,
        "released": "2025-10-02",
        "overview": "When a member of an elite social club is assaulted, Carisi must convince witnesses to come forward despite the club's strict confidentiality rules; Chief Tynan offers Benson some extra help; Velasco is confronted with a surprising opportunity."
      },
      {
        "id": "tvmaze:3348559",
        "title": "A Vicious Circle",
        "season": 27,
        "episode": 3,
        "released": "2025-10-09",
        "overview": "Bruno suspects a bomb was planted to destroy DNA evidence in a rape case. Benson takes on a murder investigation connected to the bombing. Griffin experiences the frustrating setbacks of working an SVU case."
      },
      {
        "id": "tvmaze:3366704",
        "title": "Clickbait",
        "season": 27,
        "episode": 4,
        "released": "2025-10-16",
        "overview": "When a tween suffers a life-threatening miscarriage, the SVU must unravel a web of online fabrications to identify a suspect; Rollins carefully weighs her career options."
      },
      {
        "id": "tvmaze:3366705",
        "title": "Feed the Craving",
        "season": 27,
        "episode": 5,
        "released": "2025-10-23",
        "overview": "When a woman in active labor is abducted, Rollins and Curry look to her doula for an account of events. Carisi tries to get a confession in front of the jury."
      },
      {
        "id": "tvmaze:3395658",
        "title": "Under the Influence",
        "season": 27,
        "episode": 6,
        "released": "2025-10-30",
        "overview": "The squad investigates an assault at a house party where no one can identify the assailant; when two suspects are detained for questioning, Rollins takes the chance to turn one against the other."
      },
      {
        "id": "tvmaze:3399046",
        "title": "False Idols",
        "season": 27,
        "episode": 7,
        "released": "2025-11-13",
        "overview": "The SVU must determine fact from fantasy when a famous author twists the details of a serious crime; Fin has a challenging day at work."
      },
      {
        "id": "tvmaze:3427380",
        "title": "Showdown",
        "season": 27,
        "episode": 8,
        "released": "2025-11-20",
        "overview": "When a man claims his girlfriend was kidnapped, Bruno investigates the holes in his story; Tynan comes down hard on Benson after a disagreement; Griffin must defend his police work on the stand."
      }
    ]
  }
}