{
  "meta": {
    "id": "tvmaze:6888",
    "type": "series",
    "name": "Horrible Histories",
    "description": "Sketches, cartoons and quizzes liberally splattered with blood and gore, based on the books published by Scholastic.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/595/1488730.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/595/1488730.jpg",
    "videos": [
      {
        "id": "tvmaze:3455529",
        "title": "Top Ten Naughtiest People",
        "season": 11,
        "episode": 14,
        "released": "2025-12-12",
        "overview": ""
      },
      {
        "id": "tvmaze:3455530",
        "title": "Pitiful Princes and Princesses",
        "season": 11,
        "episode": 15,
        "released": "2025-12-19",
        "overview": ""
      },
      {
        "id": "tvmaze:400027",
        "title": "Rotten Romans",
        "season": 1,
        "episode": 1,
        "released": "2009-04-16",
        "overview": "A pirate captain worries about an early bedtime, a soldier from World War I struggles to cook with fake food and the four King Georges form a boyband."
      },
      {
        "id": "tvmaze:400028",
        "title": "Measly Middle Ages",
        "season": 1,
        "episode": 2,
        "released": "2009-04-23",
        "overview": "A Stone Age doctor tries to help a modern patient, a whining Pharaoh invents the pyramid and Henry VIII meets his dead friends."
      },
      {
        "id": "tvmaze:400029",
        "title": "Wicked Witches",
        "season": 1,
        "episode": 3,
        "released": "2009-04-30",
        "overview": "A Roman emperor finds an alternative to candles, an Egyptian tries to save on mummification, and Roundheads and Cavaliers take part in Historical Wife Swap."
      },
      {
        "id": "tvmaze:400030",
        "title": "Smashing Saxons",
        "season": 1,
        "episode": 4,
        "released": "2009-05-07",
        "overview": "The Tudors sing their family history, Bob explains the history of Rome in two minutes, and a mad Victorian gentleman eats King Louis XIV's mummified heart."
      },
      {
        "id": "tvmaze:400031",
        "title": "Awful Egyptians",
        "season": 1,
        "episode": 5,
        "released": "2009-05-14",
        "overview": "A priest makes a piano from live pigs, Emperor Caligula declares war on the sea, and there are some disgusting beauty tips from ancient Egypt."
      },
      {
        "id": "tvmaze:400032",
        "title": "Measly Middle Ages",
        "season": 1,
        "episode": 6,
        "released": "2009-05-21",
        "overview": "An evil Greek god guests on a daytime chat show, a rich Georgian swaps his wife with a peasant, and some weird medieval monsters make an appearance."
      },
      {
        "id": "tvmaze:400033",
        "title": "Terrible Tudors",
        "season": 1,
        "episode": 7,
        "released": "2009-05-28",
        "overview": "There is a terrible smell in the Houses of Parliament, and Helen of Troy reveals her complicated love life."
      },
      {
        "id": "tvmaze:400034",
        "title": "Vicious Vikings",
        "season": 1,
        "episode": 8,
        "released": "2009-06-04",
        "overview": "The Saxons exchange disgusting Christmas presents, and a caveman goes on a TV cookery show. Plus discover the bizarre causes of World War I."
      },
      {
        "id": "tvmaze:400035",
        "title": "Terrible Tudors",
        "season": 1,
        "episode": 9,
        "released": "2009-06-11",
        "overview": "A Victorian inspector checks that school is suitably cruel, HHTV News reports live from the Great Plague, and Thumbelina drowns unpleasantly."
      },
      {
        "id": "tvmaze:400036",
        "title": "Rotten Romans",
        "season": 1,
        "episode": 10,
        "released": "2009-06-18",
        "overview": "HHTV News reports from the Battle of Thermopylae, Celt housewives find uses for severed heads, and the truth about Roman toilets is revealed."
      },
      {
        "id": "tvmaze:400037",
        "title": "Terrible Tudors",
        "season": 1,
        "episode": 11,
        "released": "2009-06-25",
        "overview": "Queen Victoria learns that her British comforts are not British and on 'Axe Factor', contestants try to become executioners."
      },
      {
        "id": "tvmaze:400038",
        "title": "Smashing Saxons",
        "season": 1,
        "episode": 12,
        "released": "2009-07-02",
        "overview": "A Victorian teacher is confused by her pupils' bizarre names and the Romans run out of animals to execute."
      },
      {
        "id": "tvmaze:400039",
        "title": "Rotten Romans",
        "season": 1,
        "episode": 13,
        "released": "2009-07-09",
        "overview": "A lazy aristocrat invents the sandwich, the Romans host their own revolting cookery show and William Shakespeare is haunted by King Richard III's ghost."
      },
      {
        "id": "tvmaze:400040",
        "title": "Rotten Romans",
        "season": 2,
        "episode": 1,
        "released": "2010-05-31",
        "overview": "A prank-loving emperor hosts a dinner party on Roman Come Dine with Me, and the Durham Home Guard injure themselves while learning first aid."
      },
      {
        "id": "tvmaze:400041",
        "title": "Putrid Pirates",
        "season": 2,
        "episode": 2,
        "released": "2010-06-01",
        "overview": "A pirate regrets stealing a herd of cows, King Charles II raps about his party lifestyle, and the Georgian army goes to war against a bunch of schoolboys."
      },
      {
        "id": "tvmaze:400042",
        "title": "Rotten Romans",
        "season": 2,
        "episode": 3,
        "released": "2010-06-02",
        "overview": "In Ancient Greece it's Spartan High School Musical, a jester breaks bad news to Henry VIII, and Roman emperor Nero stars in a (not very) romantic movie."
      },
      {
        "id": "tvmaze:400043",
        "title": "Gorgeous Georgians",
        "season": 2,
        "episode": 4,
        "released": "2010-06-03",
        "overview": "Britain's greatest sailor, Admiral Nelson, turns out to be horribly seasick, and the World War 2 Girls sing about girl power on the Home Front."
      },
      {
        "id": "tvmaze:400044",
        "title": "Putrid Pirates",
        "season": 2,
        "episode": 5,
        "released": "2010-06-04",
        "overview": "An Incan kid has the worst birthday ever, a Roman farmer meets a door-to-door poo salesman, and King George IV embarks on a solo musical career."
      },
      {
        "id": "tvmaze:400045",
        "title": "Gorgeous Georgians",
        "season": 2,
        "episode": 6,
        "released": "2010-06-08",
        "overview": "The Ug and Ugio families go head to head on Stone Age Family Fortunes and mad King George III's doctors are even madder than he is."
      },
      {
        "id": "tvmaze:400046",
        "title": "Measly Middle Ages",
        "season": 2,
        "episode": 7,
        "released": "2010-06-15",
        "overview": "Joan of Arc gets a visit from a confused angel, a pirate captain tries to make his crew dress like ladies, and Mrs Celt enjoys being a Roman on Historical Wife Swap."
      },
      {
        "id": "tvmaze:400047",
        "title": "Vicious Vikings",
        "season": 2,
        "episode": 8,
        "released": "2010-06-22",
        "overview": "A Georgian peasant gets a posh makeover, Crimewatch BC tries to solve Julius Caesar's murder, and prepare to be confused by the Egyptian Hieroglyphics song."
      },
      {
        "id": "tvmaze:400048",
        "title": "Slimy Stuarts",
        "season": 2,
        "episode": 9,
        "released": "2010-06-29",
        "overview": "The Stuarts are confused by tea, a Viking funeral ends in a fight and a child evacuated in the Blitz thinks farm animals are monsters."
      },
      {
        "id": "tvmaze:400049",
        "title": "Measly Middle Ages",
        "season": 2,
        "episode": 10,
        "released": "2010-07-06",
        "overview": "King Charles I sends someone else to get married for him, a new recruit regrets joining the Georgian army, and Queen Cleopatra reveals her beauty secrets."
      },
      {
        "id": "tvmaze:400050",
        "title": "Rotten Romans",
        "season": 2,
        "episode": 11,
        "released": "2010-07-13",
        "overview": "Barmy Roman emperor Caligula fails to invade Britain, King Henry VIII plays tennis while Anne Boleyn is executed, and some Saxon monks throw a party."
      },
      {
        "id": "tvmaze:400051",
        "title": "Savage Stone Age",
        "season": 2,
        "episode": 12,
        "released": "2010-07-20",
        "overview": "How to paint like a caveman, World War II codebreakers forget their own code, and Henry VIII challenges the King of France to a smackdown!"
      },
      {
        "id": "tvmaze:2273197",
        "title": "Savage Songs Special",
        "season": 2,
        "episode": 13,
        "released": "2010-07-27",
        "overview": "A compilation of the songs from the series, featuring Spartan High School Musical, the Viking Rock Band, punky Queen Boudica, Incan emperor Pachacuti, the posh rapping of Charles II, Blackbeard the Pirate, George IV going solo, the Victorian Inventions song and the World War II Girls."
      },
      {
        "id": "tvmaze:400052",
        "title": "Rotten Romans",
        "season": 3,
        "episode": 1,
        "released": "2011-05-30",
        "overview": "Historical sketch show. Including an annoying French prankster from the Middle Ages, and what happens when Queen Elizabeth I needs the toilet."
      },
      {
        "id": "tvmaze:400053",
        "title": "Nasty Knights",
        "season": 3,
        "episode": 2,
        "released": "2011-05-31",
        "overview": "Some medieval knights discover the most disgusting way to attack a castle and a Georgian goes shopping in a modern pet shop."
      },
      {
        "id": "tvmaze:400054",
        "title": "Frightful First World War",
        "season": 3,
        "episode": 3,
        "released": "2011-06-01",
        "overview": "A confused World War I soldier spends his first day in the trenches and the Welsh women of Fishguard defeat a French invasion without even trying."
      },
      {
        "id": "tvmaze:400055",
        "title": "Slimy Stuarts",
        "season": 3,
        "episode": 4,
        "released": "2011-06-02",
        "overview": "A modern detective tries to solve a series of murders in Emperor Caligula's house, King George IV meets his dead relatives and other historical hijinks."
      },
      {
        "id": "tvmaze:400056",
        "title": "Measly Middle Ages",
        "season": 3,
        "episode": 5,
        "released": "2011-06-03",
        "overview": "A Welsh prince from the Middle Ages has a very stupid death, and Queen Cleopatra sings about her reputation as a femme fatale."
      },
      {
        "id": "tvmaze:400057",
        "title": "Terrible Tudors",
        "season": 3,
        "episode": 6,
        "released": "2011-06-07",
        "overview": "Henry VIII promotes his all meat, no vegetables diet plan, and Admiral Nelson confuses everyone with his last words."
      },
      {
        "id": "tvmaze:400058",
        "title": "Awful Egyptians",
        "season": 3,
        "episode": 7,
        "released": "2011-06-14",
        "overview": "Robert Walpole struggles to talk to England's German king and a Scottish sportsman attacks dead cows in the Highland Games."
      },
      {
        "id": "tvmaze:400059",
        "title": "Measly Middle Ages",
        "season": 3,
        "episode": 8,
        "released": "2011-06-21",
        "overview": "Saxon king Ethelred the Unready suffers online bullying from the Vikings and the suffragettes set the record straight in song."
      },
      {
        "id": "tvmaze:400060",
        "title": "Vicious Vikings",
        "season": 3,
        "episode": 9,
        "released": "2011-06-28",
        "overview": "The Vikings launch an advert, Queen Elizabeth I surprises her court with some very odd laws and the Aztec priests sing their gruesome disco song."
      },
      {
        "id": "tvmaze:400061",
        "title": "Frightful First World War",
        "season": 3,
        "episode": 10,
        "released": "2011-07-12",
        "overview": "First World War soldiers try some unusual ways to cure frostbite in the winter. Also, the not-at-all romantic movie starring William the Conqueror."
      },
      {
        "id": "tvmaze:400062",
        "title": "Terrible Tudors",
        "season": 3,
        "episode": 11,
        "released": "2011-07-05",
        "overview": "A pirate chef disgusts the judges of Historical Masterchef, and a Stone Age inventor appears on Dragons' Den."
      },
      {
        "id": "tvmaze:400063",
        "title": "Measly Middle Ages",
        "season": 3,
        "episode": 12,
        "released": "2011-07-19",
        "overview": "Historical sketch show. The people of Strasbourg are afflicted with dance fever, and HHTV presenter Fearne Polyester reports from a bizarre Greek festival."
      },
      {
        "id": "tvmaze:400064",
        "title": "Savage Songs",
        "season": 3,
        "episode": 13,
        "released": "2011-07-26",
        "overview": "Historical sketch show. Savage Songs compilation featuring the hip-hop battle of the Celts, pop superstar Cleopatra, rock rebel William Wallace and the soulful suffragettes."
      },
      {
        "id": "tvmaze:400065",
        "title": "Slimy Stuarts",
        "season": 4,
        "episode": 1,
        "released": "2012-04-09",
        "overview": "Dick Whittington pitches a movie about his life, and some German bomber pilots find an unfortunate use for a tourist guidebook to Britain."
      },
      {
        "id": "tvmaze:400066",
        "title": "Vile Victorians",
        "season": 4,
        "episode": 2,
        "released": "2012-04-10",
        "overview": "Henry VIII appears on a TV show hoping to raise money from his antique abbeys. Also, Charles Darwin sings about his theory of natural selection."
      },
      {
        "id": "tvmaze:400067",
        "title": "Measly Middle Ages",
        "season": 4,
        "episode": 3,
        "released": "2012-04-11",
        "overview": "Queen Elizabeth I goes online dating, Greek philosopher Socrates foils his own rescue from prison, and Emicho of the Rhineland goes crusading."
      },
      {
        "id": "tvmaze:400068",
        "title": "Groovy Greeks",
        "season": 4,
        "episode": 4,
        "released": "2012-04-12",
        "overview": "HHTV's war reporter Mike Peabody regrets his decision to cover the Norman Siege of Palermo, and the Pilgrim Fathers rap about Jamestown in America."
      },
      {
        "id": "tvmaze:400069",
        "title": "Savage Stone Age",
        "season": 4,
        "episode": 5,
        "released": "2012-04-13",
        "overview": "People from the Bronze Age argue about building the world's first city and Bob Hale explains the entire history of the Renaissance."
      },
      {
        "id": "tvmaze:400070",
        "title": "Potty Pioneers",
        "season": 4,
        "episode": 6,
        "released": "2012-04-20",
        "overview": "A confused Christopher Columbus declares he has found India, and a Georgian woman reveals her very stupid death."
      },
      {
        "id": "tvmaze:400071",
        "title": "Gorgeous Georgians",
        "season": 4,
        "episode": 7,
        "released": "2012-04-27",
        "overview": "Emperor Napoleon plays in a very unusual chess match and a Victorian inventor builds an anti-seasickness ship with one small design flaw."
      },
      {
        "id": "tvmaze:400072",
        "title": "Vicious Vikings",
        "season": 4,
        "episode": 8,
        "released": "2012-05-04",
        "overview": "Emperor Nero visits the victims of the Great Fire of Rome and some Crusaders attend a training course on how to fight weird monsters."
      },
      {
        "id": "tvmaze:400073",
        "title": "Measly Middle Ages",
        "season": 4,
        "episode": 9,
        "released": "2012-05-11",
        "overview": "King Edward III gets married in a building site, while Julius Caesar reveals his not-very-secret tips on hiding baldness."
      },
      {
        "id": "tvmaze:400074",
        "title": "Measly Middle Ages",
        "season": 4,
        "episode": 10,
        "released": "2012-05-18",
        "overview": "A Saxon joins a modern dating agency, and there is a surprise in store for the people on Victorian Wife Swap."
      },
      {
        "id": "tvmaze:400075",
        "title": "Slimy Stuarts",
        "season": 4,
        "episode": 11,
        "released": "2012-05-25",
        "overview": "Dr Culpeper invites us all to his highly unhealthy health spa and a Crusader knight competes on Historical MasterChef."
      },
      {
        "id": "tvmaze:400076",
        "title": "Vile Victorians",
        "season": 4,
        "episode": 12,
        "released": "2012-06-01",
        "overview": "A Victorian woman books a ticket on a very odd railway, and a modern patient is (mis)treated by a Roman dentist."
      },
      {
        "id": "tvmaze:400077",
        "title": "Savage Songs",
        "season": 4,
        "episode": 13,
        "released": "2012-06-08",
        "overview": "In a special musical episode of the award-winning Horrible Histories, host Rattus Rattus chooses his favourite songs to entertain his young nephew."
      },
      {
        "id": "tvmaze:400078",
        "title": "Sport Special",
        "season": 4,
        "episode": 14,
        "released": "2012-07-20",
        "overview": "Special sport episode of the historical sketch show, based on the successful series of books. All the top sporting action from the past, including Emperor Nero and Jesse Owens singing the history of the Olympics. We're at the finish line to see Pheidippides run the first ever marathon, then we count down the top marathon cheats of all time and take a look back at some of our favourite Horrible Histories sporting events."
      },
      {
        "id": "tvmaze:400079",
        "title": "Scary Special",
        "season": 4,
        "episode": 15,
        "released": "2012-10-31",
        "overview": "Horrible Histories favourite Death, of 'Stupid Deaths' fame, presents his very own show crammed full of spooky highlights. We join him at home and get a good look around as he reveals his creepiest moments - a Tudor family show us the extent of their ghostly superstitions and the Vikings demonstrate how to become truly terrifying to your enemies. Death himself is joined by some rather creepy friends to sing about his favourite scary things."
      },
      {
        "id": "tvmaze:400080",
        "title": "Smashing Saxons",
        "season": 5,
        "episode": 1,
        "released": "2013-05-27",
        "overview": "The Saxon gods form an unlikely team of superheroes and Rosa Parks sings about her struggle for equality."
      },
      {
        "id": "tvmaze:400081",
        "title": "Slimy Stuarts",
        "season": 5,
        "episode": 2,
        "released": "2013-05-28",
        "overview": "There's a surprisingly charming Stuart highwayman, while the captain of the Titanic holds the world's worst safety briefing."
      },
      {
        "id": "tvmaze:400082",
        "title": "Awful Egyptians",
        "season": 5,
        "episode": 3,
        "released": "2013-05-29",
        "overview": "Charles Dickens sings about his life and books, and Vlad the Impaler reveals his horrible new plan for keeping out the neighbours."
      },
      {
        "id": "tvmaze:400083",
        "title": "Slimy Stuarts",
        "season": 5,
        "episode": 4,
        "released": "2013-05-30",
        "overview": "Featuring the rather eccentric Georgian philosopher Jeremy Bentham and super-rich Roman politician Crassus, who raps about his blinging lifestyle."
      },
      {
        "id": "tvmaze:400084",
        "title": "Smashing Saxons",
        "season": 5,
        "episode": 5,
        "released": "2013-05-31",
        "overview": "Famous monk St Augustine struggles to introduce Christianity to Saxon England, and Stuart diarist Samuel Pepys annoys the smartest men in Britain."
      },
      {
        "id": "tvmaze:400085",
        "title": "Vile Victorians",
        "season": 5,
        "episode": 6,
        "released": "2013-06-04",
        "overview": "Queen Victoria's coronation doesn't go quite as planned, while George IV pulls out all the stops to impress his guests on Historical Come Dine with Me."
      },
      {
        "id": "tvmaze:400086",
        "title": "Rotten Romans",
        "season": 5,
        "episode": 7,
        "released": "2013-06-11",
        "overview": "Roman emperor Caesar Augustus reveals the lazy secret of his success, and TV's most excitable reporter Bob Hale explains the very complex history of WWII."
      },
      {
        "id": "tvmaze:400087",
        "title": "Terrible Tudors",
        "season": 5,
        "episode": 8,
        "released": "2013-06-18",
        "overview": "A Celtic farmer isn't terribly keen on plans for Hadrian's Wall, and the brainy pioneers of transportation sing about their inventions."
      },
      {
        "id": "tvmaze:400088",
        "title": "Slimy Stuarts",
        "season": 5,
        "episode": 9,
        "released": "2013-06-25",
        "overview": "There is public confusion when King Charles II bans coffee shops and mighty Egyptian pharaoh Ramesses II meets some smelly peasants on Historical Wife Swap."
      },
      {
        "id": "tvmaze:400089",
        "title": "Rotten Romans",
        "season": 5,
        "episode": 10,
        "released": "2013-07-02",
        "overview": "There is a right royal squabble over who should rule medieval England."
      },
      {
        "id": "tvmaze:400090",
        "title": "Vile Victorians",
        "season": 5,
        "episode": 11,
        "released": "2013-07-09",
        "overview": "Prime Ministers Neville Chamberlain and Winston Churchill argue online over what to do about Adolf Hitler."
      },
      {
        "id": "tvmaze:400091",
        "title": "Vile Victorians",
        "season": 5,
        "episode": 12,
        "released": "2013-07-16",
        "overview": "Featuring a female dinosaur expert who sells seashells down on the seashore. Also, a handsome scientist reveals the weird wonders of the Greek Universe."
      },
      {
        "id": "tvmaze:400092",
        "title": "Savage Songs",
        "season": 5,
        "episode": 13,
        "released": "2013-07-23",
        "overview": "Some of history's greatest characters serenade us with tales of their lives. Featuring the all-conquering Alexander the Great."
      },
      {
        "id": "tvmaze:400093",
        "title": "Ridiculous Romance",
        "season": 5,
        "episode": 14,
        "released": "2014-02-14",
        "overview": "A romance special of the award-winning comedy, featuring some of history's biggest love rats. King Henry VIII goes on a TV dating show."
      },
      {
        "id": "tvmaze:400094",
        "title": "Frightful First World War Special",
        "season": 5,
        "episode": 15,
        "released": "2014-08-04",
        "overview": "Bob Hale and Rattus Rattus guide viewers through the horrible history of 1914-18. Featuring the soldiers, civilians, suffragettes and even kings who were caught up in the fighting."
      },
      {
        "id": "tvmaze:400095",
        "title": "Crooked King John and Magna Carta",
        "season": 6,
        "episode": 1,
        "released": "2015-02-13",
        "overview": "A special about King John and Magna Carta, starring Ben Miller. After a rap battle, John annoys the barons and agrees Magna Carta at Runnymede."
      },
      {
        "id": "tvmaze:400096",
        "title": "Awesome Alfred the Great",
        "season": 6,
        "episode": 2,
        "released": "2015-05-25",
        "overview": "King Alfred the Great argues with his older brothers then defeats the Vikings using his cunning hit-and-run tactics."
      },
      {
        "id": "tvmaze:400097",
        "title": "Wicked William the Conqueror",
        "season": 6,
        "episode": 3,
        "released": "2015-06-01",
        "overview": "Young William, Duke of Normandy, quarrels with Harold Godwinson and takes the crown at the famous Battle of Hastings in 1066."
      },
      {
        "id": "tvmaze:400098",
        "title": "Mardy Mary Queen of Scots",
        "season": 6,
        "episode": 4,
        "released": "2015-06-08",
        "overview": "This episode follows Mary, Queen of Scots, as she stumbles from being a young girl in Scotland to Elizabeth I's public enemy number one."
      },
      {
        "id": "tvmaze:400099",
        "title": "Naughty Napoleon",
        "season": 6,
        "episode": 5,
        "released": "2015-06-15",
        "overview": "A special episode about the great French leader Napoleon Bonaparte, following his rise from humble beginnings to become the emperor of France."
      },
      {
        "id": "tvmaze:400100",
        "title": "Horrid Henry VIII",
        "season": 6,
        "episode": 6,
        "released": "2015-06-22",
        "overview": "Rowan Atkinson stars as the young King Henry VIII as he struggles with his boring dad, before becoming king and going through wives like most people go through toothbrushes."
      },
      {
        "id": "tvmaze:400101",
        "title": "Crafty Cleopatra",
        "season": 6,
        "episode": 7,
        "released": "2015-06-29",
        "overview": "Egyptian queen Cleopatra clashes with her brother, seizes power and hooks up with great Roman leaders Julius Caesar and Mark Antony."
      },
      {
        "id": "tvmaze:400102",
        "title": "Gorgeous George III",
        "season": 6,
        "episode": 8,
        "released": "2015-07-06",
        "overview": "King George III goes from a young unpopular king to a much-loved figure, and the team give their unique insight into the American Revolution."
      },
      {
        "id": "tvmaze:400103",
        "title": "Bolshy Boudica",
        "season": 6,
        "episode": 9,
        "released": "2015-07-13",
        "overview": "Historical sketch show. British Queen Boudica turns against her Roman masters and unleashes her wrecking ball on Colchester, St Albans and London."
      },
      {
        "id": "tvmaze:400104",
        "title": "Wily Winston Churchill",
        "season": 6,
        "episode": 10,
        "released": "2015-07-20",
        "overview": "Following Winston Churchill from being a young soldier in India during the time of Queen Victoria, through the First World War, to victory in World War II."
      },
      {
        "id": "tvmaze:400105",
        "title": "Tricky Queen Vicky",
        "season": 6,
        "episode": 11,
        "released": "2015-07-27",
        "overview": "Young Queen Victoria marries her true love Albert and has to put up with the open sewers at Buckingham Palace."
      },
      {
        "id": "tvmaze:400106",
        "title": "'Orrible Oliver Cromwell",
        "season": 6,
        "episode": 12,
        "released": "2015-08-03",
        "overview": "Oliver Cromwell rises from obscurity, challenges King Charles I in the English Civil War, and ultimately orders his execution."
      },
      {
        "id": "tvmaze:400107",
        "title": "Rotten Rulers",
        "season": 6,
        "episode": 13,
        "released": "2015-08-10",
        "overview": "Featuring naughty Napoleon annoying his Josephine and horrid Henry VIII getting married again. There's also a song from wily Winston Churchill."
      },
      {
        "id": "tvmaze:400108",
        "title": "It's a Wicked World",
        "season": 6,
        "episode": 14,
        "released": "2015-08-17",
        "overview": "A special episode of the historical sketch show, featuring ghastly Genghis Khan, the wise Confucius and a dance-off during a naval battle!"
      },
      {
        "id": "tvmaze:400109",
        "title": "Savage Songs",
        "season": 6,
        "episode": 15,
        "released": "2015-08-24",
        "overview": "A special episode of the historical sketch show, featuring songs from the series by King Alfred, Henry VIII, William the Conqueror and more."
      },
      {
        "id": "tvmaze:1202340",
        "title": "Monstrous Musicians",
        "season": 7,
        "episode": 1,
        "released": "2017-06-15",
        "overview": "Horrible Histories reveals history's most monstrous musicians. From the earliest screeches of the neanderthal, right through to Jimi Hendrix burning his guitar, Rattus Rattus guides us through the story of music making, even bumping into Simon Cowell at Beethoven's 'H Factor' audition. Starring Ryan Sampson and Gemma Whelan."
      },
      {
        "id": "tvmaze:1250027",
        "title": "Exceptional Explorers",
        "season": 7,
        "episode": 2,
        "released": "2017-07-24",
        "overview": "Horrible Histories goes pear-shaped in an explorers special, meeting Christopher Columbus as he tries to teach a class that the world is indeed, shaped like a pear. On the strict instructions of Emperor Nero, some hapless Roman centurions are quite literally stuck in the mud, searching for the source of the Nile. And intrepid Arctic explorer Peter Freuchen has to dig his way out of the snow with a frozen poo. From the Vikings' first small steps on American soil, to humankind's first giant leaps on the moon, join Horrible Histories on this epic adventure."
      },
      {
        "id": "tvmaze:1250042",
        "title": "Ridiculous Romantics",
        "season": 7,
        "episode": 3,
        "released": "2017-07-31",
        "overview": "This week Horrible Histories charts the path towards true love - and some of history's biggest and most ridiculous romantics are in the spotlight.With his woeful record for choosing the right woman, Henry VIII enlists the help of Maître d' Fred Sirieix as he tries to find the right wife on Historic First Dates. Elsewhere, we sample some Medieval Munich Love Magic, see how Renaissance men tried to impress the ladies, listen to some of History's greatest love letters, and watch as King Alfonso of Spain's wedding takes a turn he's not expecting."
      },
      {
        "id": "tvmaze:1261224",
        "title": "Atrocious Artists",
        "season": 7,
        "episode": 4,
        "released": "2017-08-07",
        "overview": "A look at some of history's greatest artists, from the first images painted onto the walls of caves through to Chris Ofili's work with elephant poo. We discover the most stolen painting in history, how Picasso and Dali found innovative ways of paying for things without using money, the horror of painting people smiling, and see the Teenage Mutant Ninja Renaissance Artists help a lady in distress."
      },
      {
        "id": "tvmaze:1266446",
        "title": "Heroic Heroes & Villainous Villains",
        "season": 7,
        "episode": 5,
        "released": "2017-08-14",
        "overview": "This week Horrible Histories takes a look at the world's greatest Heroes and Villains: on the Heroic side, we've everything from Douglas Bader's frequent escapes to the first men on the moon and Martin Luther King Jr, whereas our more Villainous side contains Al Capone, Rameses the Great, and Steve Biceps brings us History's Deadly 60."
      },
      {
        "id": "tvmaze:1271793",
        "title": "Ingenious Inventors",
        "season": 7,
        "episode": 6,
        "released": "2017-08-21",
        "overview": "In this week's episode mankind's most Ingenious Inventors are given the Horrible Histories treatment, as we take in everything from the invention of the wheel to the crisp, featuring the Gutenberg press, the man who invented both the dictionary (very successfully) and manned flight (less successfully), and the Greeks vs the Chinese battling as to which of them are History's best inventors."
      },
      {
        "id": "tvmaze:1277411",
        "title": "Preposterous US Presidents",
        "season": 7,
        "episode": 7,
        "released": "2017-08-28",
        "overview": "Horrible Histories takes a look at America and its various presidents, from George Washington to the present day, including President Jackson's rude parrot, the establishment of the Secret Service, German cowboys, and spy Mary Elizabeth Bowser."
      },
      {
        "id": "tvmaze:1280836",
        "title": "Ruthless Rulers",
        "season": 7,
        "episode": 8,
        "released": "2017-09-04",
        "overview": "A look at the most ruthless rulers of all time. Henry VIII is so demanding he has a brick wall built at his bedroom door every night, those vicious Vikings find that sorry seems to be the hardest word, hold your nose in Versailles, because Louis XIV hasn't got any loos, and rock out with the Warlords from Hell."
      },
      {
        "id": "tvmaze:1287471",
        "title": "Revolting Russian Revolution",
        "season": 7,
        "episode": 9,
        "released": "2017-09-11",
        "overview": "On its 100th anniversary, Horrible Histories takes a look at the Russian Revolution. Tsar Nicholas II gives tips for survival in Russia's extreme climate, and we reveal that Lenin's European Communism lecture tour took in a trip to London Zoo. Lenin also provides beauty advice on how to look good even after death! Meanwhile, Dave TDS finds out just how hard it is to invade Russia, and we listen to Uncle Joe Stalin's Nursery Rhymes and find out that, at one point, he also decided that the key to world domination might, in fact, lie in poo."
      },
      {
        "id": "tvmaze:1295561",
        "title": "Horrid Health",
        "season": 7,
        "episode": 10,
        "released": "2017-09-18",
        "overview": "A look at the hideous history of health, from the invention of toilet paper to the healthy origins of the cornflake. Along the way we discover that the Mayans believe that drinking wee could cure all ills, that the Tudors had to teach themselves how to swim again (everyone had forgotten), Victorians had a taste in beauty products that was literally shocking, and we take an in-depth look at Louis XIV's bottom problems."
      },
      {
        "id": "tvmaze:1415278",
        "title": "Formidable Florence Nightingale",
        "season": 7,
        "episode": 11,
        "released": "2018-03-08",
        "overview": "A tribute to Florence Nightingale, The Lady with the Lamp 'just don't let Florence hear you calling her that!' The programme charts how Florence revolutionised medicine and the treatment of the sick during the Crimean War, but also how she also unwittingly sparked the public's desire for trinkets and tat featuring her image. Elsewhere, there's the bizarre practice of Victorian War Tourism (tea, cake and carnage), a look at some Embarrassing Victorian Bodies, and a visit to Mary Seacole's British Hotel."
      },
      {
        "id": "tvmaze:1461585",
        "title": "Deadly Dynasties",
        "season": 7,
        "episode": 12,
        "released": "2018-05-07",
        "overview": "A look at the deadliest dynasties and how they came to, and then held on to, power. Witness Aggrippina's deadly recipes for success and Napoleon's needy sister, how the Lancastrians and the Yorkists came together for Love Day, how to stage a Russian coup, and how our royal family, the Windsors, came to change their family name to something a little 'less German'."
      },
      {
        "id": "tvmaze:1461586",
        "title": "Savage Songs",
        "season": 7,
        "episode": 13,
        "released": "2018-05-07",
        "overview": "Horrible Histories presents a collection of some of history's finest songs, as Rattus attempts to put together his own festival (the delightfully named Glastonsmelly). From singing poos to tuneful Warlords, there's something for all musical tastes and Rattus has somehow also roped Brad from The Vamps in to help him out, although rather than playing live on the main stage, Brad's role seems to be more about unblocking the toilets just behind it."
      },
      {
        "id": "tvmaze:1461587",
        "title": "Awesome Ancient Civilisations",
        "season": 7,
        "episode": 14,
        "released": "2018-05-07",
        "overview": "Horrible Histories presents our guide to ancient civilizations, featuring new sketches about Alexander the Great's first kiss, Emperor Nero's greatest hits, and how double parking in ancient times could result in being impaled, rather than fined. Also, Swill Gumbitz takes a look at Greek statues, the musical instrument that could make you poo yourself, and the evolution of bottom-wiping."
      },
      {
        "id": "tvmaze:1461588",
        "title": "Terrible Tudors",
        "season": 7,
        "episode": 15,
        "released": "2018-05-07",
        "overview": "Featuring everything you need to know about history's most famous family. Including a never-before-seen sketch with the murderous Medicis, hilarious outtakes, and a special one-off written by a CBBC competition winner."
      },
      {
        "id": "tvmaze:1664922",
        "title": "Queen Vic's Home Vids",
        "season": 8,
        "episode": 1,
        "released": "2019-06-03",
        "overview": "Did you know that the Victorians invented films? Not only that, but one of the first stars of the moving image was Queen Victoria! Using real footage recently restored by the BFI, this special show takes a Horribly Historical look at the Victorians' obsession with film. We see some of Queen Vicky's very first filmic appearances (also featuring an initially reluctant Tsar Nicholas I), and also how the Victorians became obsessed with filming everything, from their holidays abroad to strapping cameramen to the front of a moving train (using only ropes) to make ‘Phantom Ride' films. Along the way we also meet the Lumiere brothers (one of whom looks a lot like First Dates' Fred Sirieix), Kaiser Wilhelm II, notable Victorian actor Herbert Beerbohm Tree, and we see that the Victorians were also early adopters of Fake News. The episode ends with a show-stopping song that traces the evolution of film from the Victorians' first forays through to the blockbusters we see in the multiplexes today."
      },
      {
        "id": "tvmaze:1664923",
        "title": "Fashion Faux Pas",
        "season": 8,
        "episode": 2,
        "released": "2019-06-03",
        "overview": "From the ancient Egyptians pioneering smelling good (a heady mix of fat and perfume plonked on your head, so that it would gradually melt throughout the day and make you smell all lovely and fragrant), to Coco Chanel turning fashion for women on its head, this show brings you the Horrible History of looking good. Featuring some of fashion's greatest innovations, pioneers, and victims, we look at how the way people have dressed has had an impact on their lives. We visit ancient Rome, where wearing a cumbersome five-metre toga was the law and elsewhere, while in 'Viking Eye for the Saxon Guy' some marauding Vikings take time out of their busy pillaging schedule to give Dave the smelly Saxon some tips on looking good, and smelling a little bit better. We visit Henry VIII, who is having online beef with the Holy Roman Emperor over (literally) dressing to kill, as they argue over who's the best armour maker. Other royals featured include Elizabeth I (who is busy making her courtiers look exactly like her), and King Louis XV who, along with some of his courtiers, has dressed as a hedge for a fancy dress party, so that he can hide from his wife. Also, the Macaronis discover that their outrageous stylings aren't fashionable any more, the Victorians advise us on how to properly dress for mourning, and we look at some of the least practical shoes ever."
      },
      {
        "id": "tvmaze:1668411",
        "title": "Chaotic Collabs",
        "season": 8,
        "episode": 3,
        "released": "2019-06-10",
        "overview": "History is filled with tales of great minds coming together, and collaborating, to achieve incredible things. It's also full of idiots working together to create an unholy mess, and people forming partnerships for decidedly sinister reasons - welcome to Horrible Histories' Chaotic Collabs! The Black Hand Gang worked together to assassinate Archduke Franz Ferdinand of Austria, and thus trigger a chain of events that led to World War One, but did you know that their collaboration was almost unsuccessful, owing to how many mistakes they made? Here, we reveal how they achieved their aim almost by luck, rather than judgement. Elsewhere, Burke and Hare get jobs as supply business teachers in historical educating, King Akhenaten and Queen Nefertiti collaborate with Sophie and Sebastian in a bid to rejuvenate their Gods, and \"Ahoy!\" magazine reveals how Admiral Nelson is seemingly enjoying a collaboration with someone else's wife. We admire one of history's great duos - Sir Edmund Hillary and Tenzing Norgay - whose journey together to be the first people to reach the summit of Everest is rightly the stuff of legend - but there seems to be some disagreement between them as to who was actually the very first to set foot on the top. The collaboration between Great Britain and America has often been referred to as a 'special relationship' - so special in fact, that Winston Churchill once made President Roosevelt take a meeting with him whilst he was in the bath. Literature and the arts are filled with tales of group creativity - did you know that William Shakespeare sometimes brainstormed his plays? One of these instances surrounds Macbeth, and the decision to change his fairy characters into witches. Finally, we take a musical look at one of the finest ever artistic groups: the romantic poets."
      },
      {
        "id": "tvmaze:1672829",
        "title": "Mind Your Manners!",
        "season": 8,
        "episode": 4,
        "released": "2019-06-17",
        "overview": "Rattus is panicking, as the Rat Queen is visiting the sewer and he has no idea how to behave nicely around royalty! Not only that, if he can somehow appear attractive to the Queen, maybe he could be the next Rat King?! Luckily, help is at hand in the (very well-mannered) shape of First Dates' Fred Sirieix, a man who knows all about how to behave politely in high society. Fred will guide Rattus through the Horrible History of Manners and Etiquette, in a bid to help him on his quest. In terms of historical courting tips, we'll see how the Puritans did dating (mostly via an eight-foot-long brass tube), and how Tudor women would put an apple under their arms, which they wouldd then give to a potential partner as a token of their love. A squishy, odd-smelling token of their love. We will also take a trip to Historical Love Island, where Jane Austen is hoping to meet the modern man of her dreams. Rattus will also learn about ancient Greek hospitality customs, the first time the fork came to Britain, and how a man actually died in the Roman emperor's court from holding his farts in for too long (something Rattus definitely doesn't do). Other ancient customs will include the etiquette of dining with Queen Victoria (the key was speed - because as soon as she had finished eating, you had to stop too), and also of actually eating other people. There is also a look at the chivalric code (which, as well as fighting tips, included how to appreciate art and make music), and a handy guide to Victorian funeral customs - something they took very seriously, to the extent that they even hired professional mourners in a bid to give their nearest and dearest a proper send-off."
      },
      {
        "id": "tvmaze:1675027",
        "title": "Fearsome Families",
        "season": 8,
        "episode": 5,
        "released": "2019-06-24",
        "overview": "Families - sometimes you love them, sometimes you bicker with them, and sometimes you marry them off to consolidate your power in Europe. Welcome to a look at some of history's most fearsome families. In this episode, Fred Sirieix is on hand as Queen Victoria makes several trips to the Historical First Dates restaurant, in a bid to marry off her children for love, and definitely not to consolidate her empire. Elsewhere, Leopold Mozart is lovingly retiring his 18-year-old daughter Maria Anna from performing in public, in favour of bringing little Wolfgang into the spotlight, and Henry VIII's children Elizabeth, Mary and Edward are engaging in a regal game of 'Your Mum'. Paulina Pepys is grateful for the help from her brother Samuel when he offers to put her up in his home, right up until the point at which she discovers she is actually graciously being given a roof over her head in return for becoming one of his servants - and she is very much starting at the bottom of the servant scale. In Made In Macedonia, Alexander the Great can't quite work out why people who stand in the way of his advancement keep mysteriously dying, and his mum, Olympias, is completely in the dark about it too. Meanwhile, we take a look at what Puritan children did for fun as they head down to ‘fun' theme park 'Puritown', we see what happened back at home for Viking families when the male Vikings went away pillaging for months, and the Bronte sisters tell us about their triumph over adversity. Brother Branwell tries to get in on the act, too, but it seems that no-one really listens to him."
      },
      {
        "id": "tvmaze:1677526",
        "title": "Bizarre Beasts",
        "season": 8,
        "episode": 6,
        "released": "2019-07-01",
        "overview": "A look at some of the various ways in which, throughout history, humans have lived with, worked with, and interacted with animals - from the very first socialising with wolves thousands of years ago through to farting fish almost starting a nuclear war in more recent history! We take a trip to Elizabeth I's menagerie which was housed at the Tower of London and home to exotic animal gifts from foreign rulers, and included wolves, hyenas, bears, leopards and even lions. There were also some nice dogs but, well, leopards. Sophie and Sebastian are on hand to advise both Alexander the Great and King Porus as to which animals they could use in battle to defeat their enemies, seemingly ignoring the fact that Alexander and Porus are actually fighting each other. Elsewhere, the Australian army faces the unruly might of an emu invasion, Romans release an album in praise of their favourite pet (eels), and Charles Darwin hosts Yummy Planet, a look at some of the animals he actually ate whilst on his travels. Plus, we take a look at how humans have used animal by-products in different ways, including drinking milk and the Victorian penchant for 'coprolite' - jewellery made from fossilised dinosaur poo"
      },
      {
        "id": "tvmaze:1682184",
        "title": "Moon Mayhem",
        "season": 8,
        "episode": 7,
        "released": "2019-07-08",
        "overview": "Comedian and space nerd Dara O Briain joins Rattus as guest host for a special show that marks the anniversary of the 1969 moon landings. For generations, we have looked to the stars and wondered as to the mysteries they contain, and have even used them as a form of celestial advisor, as shown when one Babylonian king bestows his crown upon a peasant because the heavens have foretold that 'the king would die' - so as long as the current king doesn't happen to be the actual king when the death happens, then surely all would be well?! Copernicus, Galileo and Newton are on hand with a floor-filler about their more scientific thoughts on the heavens and the universe and, in Historical Educating, 17th-century philosopher and supply teacher John Wilkins tells his class about their upcoming field trip, during which they will ride a flying chariot to the moon, so that they can meet the people that live there. We see the first manned rocket-powered flight, which occurred much earlier than you think it probably did and was an ill-advised (from a health and safety perspective at least) stunt at a celebration for a sultan. The Space Race proper gets under way in the 1950s, as America and Soviet Russia fight it out to be the first to harness that rocket power, and use it to get their people into space. We see Soviet Russia's fearsome Sputnik satellite (the first to reach space), and the even more scary Ivan Ivanovich - a mannequin that actually floated in space while reciting a recipe for Borscht. Owing to this Russian success, the Americans panic and enlist the help of Sophie and Sebastian to come up with some ideas as to how they can take the lead in the Space Race - suggestions include 'space pool', so it's fair to say that results are mixed, at best. We also discover that Yuri Gagarin's dad was less than impressed with his son being the first man in space, and meet America's solution to finally getting ahead in the race, and getting a man on the moon: a 'computer' called Katherine Johnson. Finally, we learn that the Apollo 10 crew faced the horror of someone's poo floating around in the cockpit, and the episode ends with a swinging tune from JFK and Khrushchev about 'flying to the moon'."
      },
      {
        "id": "tvmaze:1683005",
        "title": "Putrid Politics",
        "season": 8,
        "episode": 8,
        "released": "2019-07-22",
        "overview": "Rattus has formed ‘The Demoratic Party', and has enlisted the help of a political advisor - Dani Dyer - to help him rise to political power. Although Dani may be a surprise appointment for some, her experiences on Love Island have actually given her the perfect experience of the back-stabbing, unholy alliances and lying needed for life in the political sphere. Together, they guide us through a history of politics from the birth of democracy in ancient Greece right up until the arrival on the scene of Britain's first female prime minister, Margaret Thatcher. Along the way, we see how the shift from monarchist to parliamentary rule began in Britain, and some of the workings of parliament itself. The speaker of the house oversees debates within parliament, but did you know that the speaker's chair actually used to include its own toilet facilities? ThesSpeaker could not leave the house while a debate was still ongoing, so here we see how 'the little speaker's room' might have come into play during a particularly lengthy parliamentary session. Also in the Houses of Parliament, Spencer Perceval's PR team work hard to come up with some fittingly historic final words for him to utter, after he becomes the first (and only) prime minister to be shot within its hallowed halls. We also take a look at several political injustices, be it the European 'scramble for Africa', or the fight women had to undertake to even get themselves a voice in British politics - we see them having to sit in The Ladies Gallery (the only place from which they were allowed to watch parliamentary debates), we meet the suffragettes campaigning for women to get the right to vote, and we see how Margaret Thatcher even had to change her voice in a bid to be taken more seriously in her political career."
      },
      {
        "id": "tvmaze:1713826",
        "title": "Heroic Home Front",
        "season": 8,
        "episode": 9,
        "released": "2019-09-09",
        "overview": "Marking the eightieth anniversary of the outbreak of World War II, Horrible Histories looks at how the war affected those left back home in the UK, on the home front. We start with the initial panic following the declaration of war and the measures taken at home to prepare for an imminent Nazi invasion, which didn't actually turn out to be that imminent at all. However, the Nazis are busy planning their invasion - Operation Sea Lion is being carefully orchestrated to avoid damaging places in the UK that they have previously been to on holiday. We see how the blackout during the Blitz affected everyday life, and also how King George and Queen Elizabeth refused to leave Buckingham Palace while London was being bombed, despite being advised to head to Canada by their staff. We meet the 'ATA Girls' - the heroic women of the Air Transport Auxiliary led by Pauline Gower. It was their (horrendously dangerous) job to fly broken planes around the country, so that they could be fixed and put back into battle. The planes had no manuals, were often very badly damaged and had nothing in the way of guns mounted on them, so this was a hugely brave undertaking. We see how things on the home front change when the American GIs arrive, bringing with them items like chocolate and nylon tights, which had not been seen on these shores for some time! German spies were also a real concern for those on the home front, but we tell one real tale of a set of spies who were caught after they washed up in Scotland in possession of radios, guns and, most tellingly, German sausages. Finally, we chart the path to allied victory, including Churchill holding conversations with American president Roosevelt in his secret loo, and a barnstorming song as the nation celebrates VE Day."
      },
      {
        "id": "tvmaze:1817744",
        "title": "Fierce Females",
        "season": 8,
        "episode": 10,
        "released": "2020-03-08",
        "overview": "A show celebrating some of history's greatest and most formidable females. We begin with ancient tales of the Scythians – incredible warrior women who were part of the inspiration for the wonder women that we're more familiar with today (seemingly, the Scythians were a little more boozy and fighty than their comic book counterparts of today). Great women have often had to struggle to get their messages across, and this is something that Joan of Arc has to deal with when the director of Joan of Arc: The Movie has some ideas about killer lines for her to deliver as part of the film. Elsewhere, Marie Antoinette has a revolutionary go at social media, and we take a trip to Historical Love Island, where modern pencil salesman Sam gets way more than he bargained for after choosing to couple with Spartan warrior queen Gorgo. Queen Cleopatra also goes on Historical First Dates in search of a husband who is not her brother. We look at some specifically female jobs from history: in 1930s America, we meet the Hello Girls – women employed to work in the huge telephone exchanges, who wore rollerskates for speed and headsets that weighed roughly the same as two bags of sugar, as they navigated their way through miles of switchboards. Also, in Don't Call the Tudor Midwife, we peer into the mysterious world of Tudor midwifery, a place in which only women were allowed, and one that men would try to infiltrate in a bid to learn their birthing secrets (which included the use of snake skins, rabbit milk and reading). There's an epic a cappella-off between the suffragettes and the suffragists, and the show ends with some of history's most powerful female rulers - Queen Elizabeth I, Mary I, Mary, Queen of Scots and Lady Jane Gray, aka supergroup The Tudor Queens – joining together for a song celebrating the fact that they had the power."
      },
      {
        "id": "tvmaze:1905781",
        "title": "Outrageous Olympics",
        "season": 8,
        "episode": 11,
        "released": "2020-07-17",
        "overview": "Alex Scott joins Rattus for a sport-themed special. Mary Queen of Scots goes grief-golfing, the H2 Freestylers take on a whole village, and sports-mad Henry VIII sings Get Sweaty."
      },
      {
        "id": "tvmaze:1910989",
        "title": "Holly H Song Special",
        "season": 8,
        "episode": 12,
        "released": "2020-07-17",
        "overview": "Rattus has launched his own radio station (‘BBC Radio Number Two') and who better to advise him on the songs he should be playing than social media star Holly H? Together, they bring us a collection of some of the best songs of this series, plus new material from some of the famous historical faces we meet along the way. Queen Elizabeth I, Mary I, Mary Queen of Scots and Lady Jane Gray - aka supergroup The Tudor Queens - are here to sing about having 'the power', before Elizabeth I tells us about using an astrologer for advice during her reign. The romantic poets (Wordsworth, Keats, Mary Shelley, Percy Bysshe Shelley and Lord Byron) sing about their love for nature, while Lord Byron takes time out of his roguish schedule to tell us about one of his favourite fashion accessories. Elsewhere, Queen Victoria sings about her many prime ministers in Mambo Number 10, the GIs make a musical entrance to British shores during World War Two, we take a look at Puritan dating in Court Me Maybe, top boyband The Founding Fathers make America great for the first time, and we finish with a barnstorming look at the Victorians' invention of cinema."
      },
      {
        "id": "tvmaze:1930660",
        "title": "Fantastic Firsts Special",
        "season": 8,
        "episode": 13,
        "released": "2020-07-17",
        "overview": "A special show featuring some of history's greatest firsts, including the first ever library, Olympic Games, people on the moon and rat roller-skating on TV!"
      },
      {
        "id": "tvmaze:2217826",
        "title": "Beastly Bodily Functions",
        "season": 8,
        "episode": 14,
        "released": "2020-08-03",
        "overview": "Doctors Chris and Xand van Tulleken join Rattus for a selection of old and new sketches relating to bodies."
      },
      {
        "id": "tvmaze:1908636",
        "title": "Mayflower Malarkey",
        "season": 8,
        "episode": 15,
        "released": "2020-09-14",
        "overview": "Washington, Jefferson, Queen Elizabeth I, social media sensation Zack Septic-Tank and a host of plucky Puritans star in a show marking 400 years since the Mayflower's famous voyage."
      },
      {
        "id": "tvmaze:2223713",
        "title": "British Black History Animated Special",
        "season": 9,
        "episode": 1,
        "released": "2021-04-30",
        "overview": "Horrible Histories charts the contribution of Black people to British life throughout history. How did African soldiers come to be guarding Hadrian's Wall? Why was a West African diver asked to help salvage Henry VIII's ship, the Mary Rose? And the actor Ira Aldridge tells us how he came to leave New York to find fame in 19th-century England."
      },
      {
        "id": "tvmaze:2237378",
        "title": "Gruesome Guide to Growing Up Animated Special",
        "season": 9,
        "episode": 2,
        "released": "2021-07-07",
        "overview": "Life wasn't always fun for children in the past. Horrible Histories delves into the not-so-easy lives of children throughout history, from the strict parenting of ancient civilisations, to the terrible fights the young King Louis XIV had with his little brother - even weeing on each other's beds! And find out just why Henry VIII was so keen for his son Edward VI to stay inside."
      },
      {
        "id": "tvmaze:2277636",
        "title": "Protesting with Pankhurst Animated Special",
        "season": 9,
        "episode": 3,
        "released": "2021-08-20",
        "overview": "Protests about inequality or environmental damage are common today, but how have people protested in the past? Emmeline Pankhurst is our guide through this history of protest, from Cato the Younger's talkative protest in ancient Rome to the cheese riots of 18th-century Nottingham. Also, how will the Luddites cope with the newfangled technology of a video call?"
      },
      {
        "id": "tvmaze:2277637",
        "title": "Precious Planet",
        "season": 9,
        "episode": 4,
        "released": "2021-11-01",
        "overview": "Charles Darwin presents a special show, as Horrible Histories takes a timely look at our planet and how we've behaved towards it throughout history. We look at how we've not always treated the planet's resources with the utmost care, from the 19th-century gold rush, to Henry VIII enjoying a little too much deforestation to build his warships In The Gone Show, we meet a range of animals that have recently become extinct, and we see how mankind has tried to work with and shape the land, from the earliest guides to farming to the fabulous Gardens of Versailles In Historical Educating, head teacher Mrs Thomas has trouble with her geography supply teachers (a Greek philosopher and a Viking), who seem intent on telling their pupils that the Earth is not round. We reveal that plastic bags were originally invented to save the planet, and in Time Beefs, Judge Rinder settles a dispute between environmentalist Rachel Carson and the businessmen who tried to stop her."
      },
      {
        "id": "tvmaze:2277638",
        "title": "Dastardly Dance",
        "season": 9,
        "episode": 5,
        "released": "2021-11-26",
        "overview": "Strictly's Shirley Ballas joins Rattus for a waltz through the history of dance, with Bruno Tonioli as Nero, who had his dance teacher killed, and Queen Vic's Highland reel!"
      },
      {
        "id": "tvmaze:2277639",
        "title": "Cracking Christmas",
        "season": 9,
        "episode": 6,
        "released": "2021-12-10",
        "overview": "Horrible Histories brings you a cracking Christmas special, delving into the origins of the festive season."
      },
      {
        "id": "tvmaze:2277640",
        "title": "Foul Feasting",
        "season": 9,
        "episode": 7,
        "released": "2022-01-07",
        "overview": "Horrible Histories serves up the history of foul feasting, from Stone Age lentils to Queen Victoria's anti-fart bread."
      },
      {
        "id": "tvmaze:2277641",
        "title": "Infectious Influencers",
        "season": 9,
        "episode": 8,
        "released": "2022-01-14",
        "overview": "From Cleopatra's hairdo to Elizabeth I's flushing loo, meet history's biggest Influencers."
      },
      {
        "id": "tvmaze:2277642",
        "title": "Banging Bling",
        "season": 9,
        "episode": 9,
        "released": "2022-01-21",
        "overview": "From Henry VIII's wine fountain, to Empress Dowager's marble boat, Horrible Histories talks money, jewellery and untold treasures."
      },
      {
        "id": "tvmaze:2277643",
        "title": "Diabolical Daily Life",
        "season": 9,
        "episode": 10,
        "released": "2022-01-28",
        "overview": "Daily life can be a bit of a grind, but not as much as it was in the past! Rattus takes us round the clock, revealing daily routines throughout history, from waking in Ancient Egypt to Medieval Loo Man."
      },
      {
        "id": "tvmaze:2277644",
        "title": "Monstrous Myths",
        "season": 9,
        "episode": 11,
        "released": "2022-02-04",
        "overview": "Count Rattula guides us through some of history's greatest myths and monsters, including Henry VIII's Robin Hood obsession and ancient ghostbusters."
      },
      {
        "id": "tvmaze:2277645",
        "title": "Henry and Liz's Family Face-Off",
        "season": 9,
        "episode": 12,
        "released": "2022-02-11",
        "overview": "Terrible Tudors King Henry VIII and his daughter Queen Elizabeth I bicker about who was the best ruler. Henry had a mechanical dragon kite, but Liz had a flushing toilet."
      },
      {
        "id": "tvmaze:2277646",
        "title": "Cursed Careers",
        "season": 9,
        "episode": 13,
        "released": "2022-02-18",
        "overview": "Rattus considers a career change, and luckily he has the whole of history to look through for ideas. Could he be an inventor like Babbage, or is the pirate life for him?"
      },
      {
        "id": "tvmaze:2277647",
        "title": "Smash Hit Songs",
        "season": 9,
        "episode": 14,
        "released": "2022-02-25",
        "overview": "Rattus has an idea that might make him millions – he is going to launch a streaming service. However, to make Ratify a success, he is going to need some great songs from history."
      },
      {
        "id": "tvmaze:2415627",
        "title": "Big BBC Birthday Bonanza",
        "season": 9,
        "episode": 15,
        "released": "2022-10-22",
        "overview": "Horrible Histories celebrates 100 years of the BBC with this special episode. What was the secret of looking great on a 1930s TV show? How did the BBC try to defeat the Nazi's using regional accents? And just what was a kangaroo doing at the launch of BBC2? Plus our end song takes us through the history of children's TV."
      },
      {
        "id": "tvmaze:2599562",
        "title": "Daft Dads",
        "season": 10,
        "episode": 1,
        "released": "2023-06-16",
        "overview": "In honour of Father's Day, Horrible Histories takes a look at some of history's daftest dads, featuring Henry VIII, Charles Dickens, William the Conqueror and Joseph Stalin!"
      },
      {
        "id": "tvmaze:2599563",
        "title": "NHS 75th Birthday",
        "season": 10,
        "episode": 2,
        "released": "2023-07-05",
        "overview": "How did the NHS come into being? When was the first kidney transplant? Is half a chicken actually a cure for anything? Find out as comedian and former psychiatric nurse Jo Brand joins Rattus to host a special episode in honour of the NHS's 75th birthday. They discover how the NHS came to be, some of its weirder moments, and what life was like before we had the NHS to look after us. Did you know that before the NHS, getting medical help could be both difficult and expensive? We take a look at the role of the almoner, who decided who would have to pay for their treatment, and how much, before Nye Bevan comes along with his notion of free health care for all. We learn the story of the first NHS baby (and how she was encouraged to wait a few minutes before actually coming into the world), of how nurses were recruited in large numbers and how, with ventures such as the Common Cold Unit, the NHS tried to learn about how our health could be improved using some weird and wonderful methods. In 24 Hours in Historical A&amp;E, we venture into a hospital where medics from across the ages are on call to treat the sick. Some of them are geniuses who were ahead of their time, such as tenth-century surgeon al-Zahrawi. There is also an 18th-century Italian surgeon who thinks the answer to all ills lies in blowing smoke up your bum with some bellows, a Tudor doctor armed with two halves of a chicken, and William Shakespeare, and a guy who thinks aggressively licking your palm is the key to diagnosing what ails you. Elsewhere, we stop off for an icky look at treating the plague, before moving to more recent times and the push to vaccinate people against diseases like TB. Finally, we say thanks to our NHS with Nye Bevan and a classic Horrible Histories banger of a tune."
      },
      {
        "id": "tvmaze:2629013",
        "title": "Foul Football",
        "season": 10,
        "episode": 3,
        "released": "2023-07-19",
        "overview": "In honour of the Women's World Cup, legendary Lioness Jill Scott is joined by Rattus for a journey through the history of the beautiful game. Although football as we know it is a relatively recent invention, it's been around in some form or other for much longer than you think. Ball games have been played for centuries, and that's why the manager of struggling Ratchester Utd is scouring history to find players who can help him avoid relegation in Historical All or Nothing. Elsewhere, a Roman legion is struggling to survive the ancient game of harpastum, a ball game that was meant to encourage team spirit, but seemingly actually encouraged death and dismemberment! Women's football is flourishing around the world right now, but did you know that the FA once banned it for more than 70 years? We meet some of the women's game's early pioneers, and also their pet jaguars! In Match of That Day, we witness some of the most bizarre things ever to happen on a football pitch, and we also witness a game in which everyone's toughest opponent was the weather! We take a look at how the game as we know it came to be, including the FA trying to get everyone to play by one unified set of rules rather than their own ridiculous local ones, the origins of some famous football club nicknames, how red and yellow cards came to be a thing, and even how you were actually allowed to just kick people in the shins as part of the game! Finally, if you have long dreamed of seeing what Jill Scott and a rat look like while singing an incredibly catchy football song together, this is the show for you."
      },
      {
        "id": "tvmaze:2696234",
        "title": "The Gruesome Gunpowder Plot",
        "season": 10,
        "episode": 4,
        "released": "2023-11-03",
        "overview": "Horrible Histories presents the sometimes-ludicrous story of Guy Fawkes and the Gunpowder Plot."
      },
      {
        "id": "tvmaze:2762057",
        "title": "Hideous Homes",
        "season": 10,
        "episode": 5,
        "released": "2024-02-02",
        "overview": "From how Henry VIII had the most comfortable poo possible, to finding out which bit of his house Charles Dickens called The Demon - take a tour of horrible homes through history."
      },
      {
        "id": "tvmaze:2767751",
        "title": "Ruinous Rivals",
        "season": 10,
        "episode": 6,
        "released": "2024-02-09",
        "overview": "From warring brothers to farting mothers, Horrible Histories presents some of the biggest, best and worst rivalries throughout time."
      },
      {
        "id": "tvmaze:2767753",
        "title": "Radical Renaissance",
        "season": 10,
        "episode": 7,
        "released": "2024-02-16",
        "overview": "Legendary artists Da Vinci and Michelangelo are the guides for a journey through one of history's most creative, and sometimes weirdest, periods."
      },
      {
        "id": "tvmaze:2779607",
        "title": "Gory Greek Myths",
        "season": 10,
        "episode": 8,
        "released": "2024-02-23",
        "overview": "From the Trojan Horse, to Jason and his Argonauts going to find the Golden Fleece, and Zeus going on historical first dates as an ant, Horrible Histories presents mythical mayhem, Greek style!"
      },
      {
        "id": "tvmaze:2780772",
        "title": "The Chaotic Civil War",
        "season": 10,
        "episode": 9,
        "released": "2024-03-01",
        "overview": "Take a journey through one of the weirdest, wildest periods in English history, featuring the only time that a king has been tried and executed for treason!"
      },
      {
        "id": "tvmaze:2780775",
        "title": "Bewitching Books",
        "season": 10,
        "episode": 10,
        "released": "2024-03-07",
        "overview": "Comedian and children's author Rosie Jones is here to help Rattus choose his World Book Day outfit, and discover the gory details behind some favourite children's books!"
      },
      {
        "id": "tvmaze:2831290",
        "title": "Terrifying Tower of London",
        "season": 10,
        "episode": 11,
        "released": "2024-04-19",
        "overview": "Famous inmates, botched escapes and thefts, and Henry VIII's favourite executions - they're all here in a terrifying history of the Tower of London."
      },
      {
        "id": "tvmaze:2831291",
        "title": "Rotten Romans in Britain",
        "season": 10,
        "episode": 12,
        "released": "2024-04-26",
        "overview": "Everything from roads to baths to pies, hosts Emperor Nero and warrior queen Boudicca are here to show what the Romans did while they were here in Britain."
      },
      {
        "id": "tvmaze:2838043",
        "title": "Loo Man's Gross Guide to History",
        "season": 10,
        "episode": 13,
        "released": "2024-05-03",
        "overview": "From bottom complaints to snot, bird poo and farts, Loo Man provides a guided tour through some of history's grossest things."
      },
      {
        "id": "tvmaze:2851445",
        "title": "Songtastic Musical Special",
        "season": 10,
        "episode": 14,
        "released": "2024-05-10",
        "overview": "Rattus has enlisted the help of Richie - the Horrible Histories songwriter - to help him present a special song-filled show by making every one of Rattus' bits a song too!"
      },
      {
        "id": "tvmaze:2895968",
        "title": "Kings & Queens-A Right Royal Special",
        "season": 10,
        "episode": 15,
        "released": "2024-06-14",
        "overview": "Featuring a new sketch with Elizabeth I searching for a successor in her show England's Got Monarchs."
      },
      {
        "id": "tvmaze:3140477",
        "title": "Brilliant Brainboxes",
        "season": 11,
        "episode": 1,
        "released": "2025-02-07",
        "overview": "From taking man to the moon to figuring out how to get rid of a poo in a submarine, Mark Labbett joins Rattus for a look at some of history's most brilliant brainboxes."
      },
      {
        "id": "tvmaze:3140478",
        "title": "Ridiculous Rules",
        "season": 11,
        "episode": 2,
        "released": "2025-02-14",
        "overview": "From William the Conqueror making rules about chopping off body parts to Elizabeth I in court over some swan-related mischief, Horrible Histories takes a look at some history's most ridiculous rules."
      },
      {
        "id": "tvmaze:3149140",
        "title": "Ludicrous Landmarks",
        "season": 11,
        "episode": 3,
        "released": "2025-02-21",
        "overview": "How long does it take to build a pyramid? Why didn't people like the Statue of Liberty? Why are there pineapples on St Paul's? Horrible Histories takes a tour of the world's greatest landmarks."
      },
      {
        "id": "tvmaze:3149139",
        "title": "Terrible Transport",
        "season": 11,
        "episode": 4,
        "released": "2025-02-28",
        "overview": "From camels to space rockets, via Dandy Horses, actual horses, royal train rides, cars, balloons and planes, it's the Horrible History of travel."
      },
      {
        "id": "tvmaze:3154382",
        "title": "Twisted Technology",
        "season": 11,
        "episode": 5,
        "released": "2025-03-07",
        "overview": "The watch! The mobile phone! The microwave! The vibrating poo platform! Thomas Edison stage diving! It's all here as Horrible Histories takes a journey through the history of tech."
      },
      {
        "id": "tvmaze:3162343",
        "title": "Enormous Empires",
        "season": 11,
        "episode": 6,
        "released": "2025-03-14",
        "overview": "With everything from mid-battle diarrhoea to a warlord taking over a geography class, take a journey charting the rise and fall of some of history's biggest empires."
      },
      {
        "id": "tvmaze:3188273",
        "title": "Monstrous Mothers",
        "season": 11,
        "episode": 7,
        "released": "2025-03-28",
        "overview": "From terrifying Spartan mums to hidden Victorian mums, via Queen Victoria and Cleopatra, Horrible Histories looks at some of history's most monstrous mothers."
      },
      {
        "id": "tvmaze:3323449",
        "title": "Rat-o-Vision Song Contest",
        "season": 11,
        "episode": 8,
        "released": "2025-05-16",
        "overview": "If you watch one Song Contest this year, then make sure it's the Eurovision Song Contest! But if you watch two, then look no further than this Rat-o-vision special, as Rattus dons his sparkly golden waistcoat for a glittering affair that brings you a host of Historical bangers from around the world, as our International acts battle it out to win the glittering Ratovision trophy… ok ‘glittering' might be a strong word. Anyway, along the way we'll see Thomas Edison rock out for America, Poland's entry also try and achieve world peace as well as a win, a bunch of Renaissance men sing an Italian power ballad, German Nun Hildegard von Bingen seeking to inspire everyone, Greece's entry aim for the stars, Elizabeth I somehow representing both England and Spain, and three Egyptian Pharaohs sing a song from beyond the grave! Who'll win the coveted* trophy? Tune in to find out… *coveted by Rattus – we're not sure about anyone else."
      },
      {
        "id": "tvmaze:3423740",
        "title": "Putrid Pirates and Salty Seadogs",
        "season": 11,
        "episode": 9,
        "released": "2025-11-07",
        "overview": "Captain Ratbeard takes to the high seas and sets sail on his maiden voyage, taking a look at everything from who not to kidnap if you're a pirate to the dangers of pooing inside a submarine."
      },
      {
        "id": "tvmaze:3435064",
        "title": "The Roaring 1920s!",
        "season": 11,
        "episode": 10,
        "released": "2025-11-14",
        "overview": "General strikes! Surplus women! Deadly mummy's curses! Winston Churchill fangirling over Charlie Chaplin! Take a trip to the Roaring Twenties!"
      },
      {
        "id": "tvmaze:3435065",
        "title": "Hair-raising Holiday",
        "season": 11,
        "episode": 11,
        "released": "2025-11-21",
        "overview": "Horrible Histories takes a short trip through the history of holidays, including Queen Victoria by the sea, Napoleon the tourist attraction and deadly sweet treats."
      },
      {
        "id": "tvmaze:3439877",
        "title": "Barmy Battles Special",
        "season": 11,
        "episode": 12,
        "released": "2025-11-28",
        "overview": "An enormous pillow fight has broken out in the sewer between Rattus and his siblings. With that in mind, he brings us a special battle-themed show, chock-full of fight-filled history. It includes the English Armada, William the Conqueror getting schooled by a rival's mum, invading Romans and scary Spartans, state-of-the-art weapons and warring pigeons. Loo Man proves to be an unwelcome visitor in a submarine, and loving mum Lady Harley writes a letter to her son while her home is under siege during the English Civil War!"
      },
      {
        "id": "tvmaze:3449598",
        "title": "Phiendish Pharaohs",
        "season": 11,
        "episode": 13,
        "released": "2025-12-05",
        "overview": "From preparing for the afterlife to having your own butt doctor, Tutankhamun, Cleopatra, Ramesses II and more are here to reveal what life was like as a fiendish pharaoh."
      }
    ]
  }
}