{
  "meta": {
    "id": "tvmaze:12135",
    "type": "series",
    "name": "Home Town",
    "description": "Erin and Ben Napier love their small Home Town of Laurel, Mississippi, especially the old historical houses. Using found materials and old textiles; they're keeping the character of these classic homes, but giving them modern and affordable updates. From Erin's imaginative hand sketches to Ben's custom handiwork, this couple is bringing Laurel's homes back to life, and making sure their small town's future is as bright as its past.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373674.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373674.jpg",
    "videos": [
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      },
      {
        "id": "tvmaze:1101572",
        "title": "A Town to Call Home",
        "season": 1,
        "episode": 1,
        "released": "2017-03-21",
        "overview": "A military couple looks to settle down and have a place their children can call home. Ben and Erin get to work on creating the ultimate family home and include a study area, play space and a stunning new kitchen."
      },
      {
        "id": "tvmaze:1101573",
        "title": "Homecoming",
        "season": 1,
        "episode": 2,
        "released": "2017-03-28",
        "overview": "Kyle and Brooke want their \"someday children\" to grow up in a small town like they did, so they're leaving Nashville and heading back to their childhood hometown in Mississippi. They want a house with history and room to grow. Ben and Erin show the couple two Craftsman homes: a character-rich cottage in need of an update, and a quirky but roomy home with a cramped kitchen. Both houses come at a similar price, leaving Kyle and Brooke to decide where their all-in, $200,000 budget will go the furthest."
      },
      {
        "id": "tvmaze:1101574",
        "title": "History in the Making",
        "season": 1,
        "episode": 3,
        "released": "2017-04-04",
        "overview": "After moving to New York City to pursue his architect career, Bill is ready to settle down with his fiance Jody in the small town he's loved since childhood. Ben and Erin show the couple two very different homes -- a dilapidated historic house with character that requires a ton of work, and a Craftsman that needs updates and a personality. With an all-in budget of $200,000, Ben and Erin transform the couple's pick into a dream home with a gorgeous kitchen and custom millwork."
      },
      {
        "id": "tvmaze:1101575",
        "title": "A House with History",
        "season": 1,
        "episode": 4,
        "released": "2017-04-11",
        "overview": "Will, Courtney and their boys have outgrown their starter home, so they enlist Ben and Erin to help them find their forever house. On their wish list is a sizeable, historic house that's rich in character and small town charm. Ben and Erin show the couple two homes: a large house that is short on personality, and a smaller house with loads of character but a long list of necessary repairs. With an all-in budget of $200,000, Will and Courtney have to weigh out what matters most."
      },
      {
        "id": "tvmaze:1101576",
        "title": "Cottage Charm",
        "season": 1,
        "episode": 5,
        "released": "2017-04-18",
        "overview": "Coy and Kenya are moving to town to be close to their children and grandchildren. As empty nesters, they want to downsize into a historic cottage with an all-in budget of $125,000. Ben and Erin show the couple two cottages: a small, dated house with exterior charm, and a cottage that makes up for its lack of character with an attractive asking price."
      },
      {
        "id": "tvmaze:1101577",
        "title": "Porch Dreams",
        "season": 1,
        "episode": 6,
        "released": "2017-04-25",
        "overview": "Amanda is returning to Mississippi after seven years of living in San Antonio, Texas, and she's looking for a historic home with a front porch and room for entertaining for $150,000. Ben and Erin show her two homes and after Amanda makes her pick, they create a dream space dripping with Southern charm and a to-die-for kitchen."
      },
      {
        "id": "tvmaze:1160869",
        "title": "Military Family Finds Small Town Charm in Mississippi",
        "season": 1,
        "episode": 7,
        "released": "2017-05-02",
        "overview": "A well-traveled serviceman and his wife settle down after finding a job in small town Mississippi. Ben and Erin have been given an all-in budget and are tasked with satisfying the couple's wish list that includes a historic home with a chef's kitchen. They come back with two choices: a cozy Cape Cod-style house with a small kitchen and a charmless exterior or a slightly larger home with interesting architectural details and a welcoming front porch. Ben and Erin make the couple's dreams come true by creating a home dripping in charm that includes a French provincial chef's kitchen and a handcrafted work table."
      },
      {
        "id": "tvmaze:1160870",
        "title": "Small Town Life for a Growing Family",
        "season": 1,
        "episode": 8,
        "released": "2017-05-09",
        "overview": "A Chicago woman moves her family from the big city to a small town in Mississippi. She's looking for a family-friendly house for her kids and future grandchild with room to entertain and a private oasis for herself. With a comfortable budget, Ben and Erin show her two homes: one with an unwelcoming exterior and an interior that's a bit dated, and another home that's smaller with very little character. Despite the limitations, Ben and Erin overcome their obstacles and wow the family with the home of their dreams."
      },
      {
        "id": "tvmaze:1160871",
        "title": "So Long Loft, Hello Home",
        "season": 1,
        "episode": 9,
        "released": "2017-05-16",
        "overview": "A family of four has outgrown their loft and is ready to use their all-in budget of $200,000 to move into an family home with a yard. Ben and Erin show the parents two family-friendly houses -- a dated, boxy home with 14 acres of property and a split-level ranch with a problem layout. Ben and Erin then transform the family's pick into the ultimate home with an open concept and outdoor space complete with an arbor."
      },
      {
        "id": "tvmaze:1160872",
        "title": "Country Singer Moves from the Big City to a Small Town",
        "season": 1,
        "episode": 10,
        "released": "2017-05-23",
        "overview": "After living in Nashville for the last 15 years, this country music singer is looking to put down roots in small town Mississippi. She has set her budget and has provided Ben and Erin with a wish list that includes a historic home with a space for entertaining and a spa-like master bath. She's presented with two homes: a classic Craftsman bungalow with a large but rough backyard and a large, dated house with no kitchen. Ben and Erin deliver a stunning home that includes a manicured outdoor entertainment space and a luxury spa master bath."
      },
      {
        "id": "tvmaze:1386471",
        "title": "Banquette Dreams",
        "season": 2,
        "episode": 1,
        "released": "2018-01-08",
        "overview": "Virginia newlyweds look for a new place to call home in Mississippi. They have an all-in budget and a wish list that includes a banquette, a master bedroom and a spacious front porch. After showing the couple two houses, Ben and Erin begin work creating a warm, welcoming cottage with never-before-seen porch swings and a beautiful kitchen banquette that reminds the happy couple of home."
      },
      {
        "id": "tvmaze:1386472",
        "title": "An Island for All",
        "season": 2,
        "episode": 2,
        "released": "2018-01-15",
        "overview": "A long-time local teacher looks for a house where she can entertain her large family. She has an all-in budget and a wish list that includes a large kitchen and family living area to host her big family get-togethers. Once Ben and Erin have shown her two possible homes that need a little love, the work begins transforming one of them into a stylish, welcoming oasis where the whole family will be comfortable. Even better, they're able to use beams and cabinets from the original house to build a stunning custom table and kitchen island."
      },
      {
        "id": "tvmaze:1395134",
        "title": "Countryside in the City",
        "season": 2,
        "episode": 3,
        "released": "2018-01-22",
        "overview": "A couple is ready for a different pace after living in the country for years. Erin and Ben create a haven in the city for them complete with handmade print wallpaper made by a local artist and a set of dining room buffets created entirely from one of the house's demolished rooms."
      },
      {
        "id": "tvmaze:1400938",
        "title": "Southern Italianate Charm",
        "season": 2,
        "episode": 4,
        "released": "2018-01-29",
        "overview": "Ben and Erin Napier get the opportunity to find and restore a home for some longtime friends. They're hoping to find a historical house with a porch and cozy charm. Ben and Erin show them two houses: The Thompson House where the Italian style potential is masked by bad design and The Carmichael House whose mix of 1920s and 1990s styles will be expensive to redo. Ben and Erin then use creative solutions to convert mismatched design elements into a beautiful historical house complete with a custom-built ottoman and a unique outdoor entryway cabinet."
      },
      {
        "id": "tvmaze:1401003",
        "title": "A Quiet Place to Call Home",
        "season": 2,
        "episode": 5,
        "released": "2018-02-05",
        "overview": "After renting his whole life, a local pastor is ready to settle down in a house that will give him enough space for his cooking and gardening hobbies. Ben and Erin show him two options -- The Lindsey House shows a lot of potential with its charming, brick exterior and spacious kitchen, but the low-priced McRae House gives them a lot of room for imagination. Ben and Erin give the house a Creole cottage makeover, adding bright colors and a cozy study as well as a spectacular chef's kitchen and a custom-built gardening bench."
      },
      {
        "id": "tvmaze:1409265",
        "title": "Move It or Lose It?",
        "season": 2,
        "episode": 6,
        "released": "2018-02-12",
        "overview": "Robyn and Cassidy want to move Robyn's great-grandmother's house to a new plot of land, but Ben and Erin are skeptical that the home could survive the move. With a budget of $100,000, Ben and Erin transform a cozy cottage in town into a dream home to present the couple with a safer option."
      },
      {
        "id": "tvmaze:1409266",
        "title": "Colorful Custom Cottage",
        "season": 2,
        "episode": 7,
        "released": "2018-02-19",
        "overview": "A local restaurant owner and grandmother chooses a cottage that Ben and Erin inject with her shining personality, adding unique touches like a custom-built rolling island in the kitchen and a handmade raised garden bed."
      },
      {
        "id": "tvmaze:1418025",
        "title": "A Little Bit Rough, A Little Bit Refined",
        "season": 2,
        "episode": 8,
        "released": "2018-02-26",
        "overview": "Caroline and her husband, Corey, are moving home to follow her dream of opening a men's store. With a budget of $150,000, they're hoping to find a house that matches their authentic, early-century style and has an office worthy of their new business. Ben and Erin Napier show them two houses, and after the couple makes a choice, they use some unique solutions to open up the space and embrace its authentic style. The stunning transformation includes an office reminiscent of an old English library, a hand-cut brick backsplash and a piece of art from the home's history."
      },
      {
        "id": "tvmaze:1409267",
        "title": "Room to Grow",
        "season": 2,
        "episode": 9,
        "released": "2018-03-05",
        "overview": "A couple with two kids are in desperate need of more space and hope to find a home with a big yard and studio for his work with an all-in budget of $200,000. After showing them two great options, Ben and Erin transform their choice into a modern, spacious farmhouse that includes a chicken coop made from a dilapidated children's playhouse."
      },
      {
        "id": "tvmaze:1409268",
        "title": "Small Town Sophistication",
        "season": 2,
        "episode": 10,
        "released": "2018-03-12",
        "overview": "A couple that's moving back to Mississippi is looking for a spacious home for under $260,000 where they can host friends and throw parties. They have their heart set on one of the options, but it's out of their range, leaving them to either negotiate or settle on the home they can afford. In the end, Ben and Erin create the ultimate gathering place complete with a custom table for outdoor dining and a pergola party area."
      },
      {
        "id": "tvmaze:1583387",
        "title": "A Vacation Every Day",
        "season": 3,
        "episode": 1,
        "released": "2019-01-14",
        "overview": "Toy and Cory are moving their family of five inland from the Mississippi coast for Toy's new job as school district superintendent. They call on Erin and Ben to help them find a large home with architectural details and plenty of space for their three kids. Their budget goes a long way as they consider a 5,000-square-foot brick beauty and a 3,600-square-foot home with a pond and gazebo. Along with a new kitchen and living room, a spa-like bathroom is high priority for these professionals to relax in after a busy day."
      },
      {
        "id": "tvmaze:1592969",
        "title": "Everybody Wants a Porch",
        "season": 3,
        "episode": 2,
        "released": "2019-01-21",
        "overview": "A couple moves from Arizona to Mississippi in search of a slower pace of life and their forever home. They have an all-in budget of $250,000 and a wish list that includes a home with historic Southern architecture and a spacious kitchen. Ben and Erin inject their new home with a deluxe kitchen, a classic Southern Mississippi porch and find unique ways to highlight the original architecture."
      },
      {
        "id": "tvmaze:1592970",
        "title": "Small Town Life Awaits",
        "season": 3,
        "episode": 3,
        "released": "2019-01-28",
        "overview": "A Canadian couple looks to purchase a vacation home that will one day become their retirement home. With an all-in budget of $140,000, Ben and Erin show them two Craftsman cottages. Fans of Craftsman design, Ben and Erin restore the classic architectural features and charm to give these out-of-towners a true Southern experience."
      },
      {
        "id": "tvmaze:1592971",
        "title": "Leaving the Nest",
        "season": 3,
        "episode": 4,
        "released": "2019-02-04",
        "overview": "Newlyweds are ready to move out of a parents' garage apartment and into their first home together. With an all-in budget, these two local artists hope to find a house with a master suite, large open kitchen and plenty of room for entertaining. Ben and Erin show them three unique homes with a variety of amenities hoping to help them make their decision. Once a home has been chosen, Ben and Erin design a luxury open-concept kitchen and deluxe master suite for it that leaves the happy couple speechless."
      },
      {
        "id": "tvmaze:1592972",
        "title": "A Doctor in the House",
        "season": 3,
        "episode": 5,
        "released": "2019-02-11",
        "overview": "Ben and Erin are eager to welcome a new pediatrician that hopes to settle down with his wife and work in the beautiful community. The couple wants a historical charmer with room to grow and a spacious outdoor area for entertaining. Along with a complete interior transformation, Erin creates a beautiful outdoor living room while Ben builds a custom grilling station for the ultimate barbecue experience."
      },
      {
        "id": "tvmaze:1592973",
        "title": "A Modern Millennial Makeover",
        "season": 3,
        "episode": 6,
        "released": "2019-02-18",
        "overview": "An engaged couple is ready to buy a home of their own so they can start the next chapter in their lives together. With the help of their families, they have an all-in budget and a wish list that includes a master bathroom with a soaking tub and a place where they can read and study. After helping the couple find the perfect home, Ben and Erin give the home a colorful millennial makeover that includes a charming book nook and stunning master suite."
      },
      {
        "id": "tvmaze:1614788",
        "title": "Home Is Where the Art Is",
        "season": 3,
        "episode": 7,
        "released": "2019-02-25",
        "overview": "An artist wants to raise her teenage son in the small town near their friends and family. With a budget of up to $200,000, her wish list includes plenty of room to welcome visitors and a dedicated art studio. Erin embraces the opportunity to design for a fellow artist by designing a home with bold patterns balanced with a calm color palette. They dedicate an entire room to an art studio customized with thoughtful furniture built by Ben and dip-dyed drop cloth curtains created by Erin."
      },
      {
        "id": "tvmaze:1615431",
        "title": "Sweet Home Laurel",
        "season": 3,
        "episode": 8,
        "released": "2019-03-04",
        "overview": "A Laurel, MS, native is ready to plant roots in the place her family has called home for generations. With her all-in budget of $100,000, Erin and Ben create a beautiful transformation that includes a quaint home office and a master bedroom and bathroom fit for a queen."
      },
      {
        "id": "tvmaze:1615432",
        "title": "An Old Familiar Place",
        "season": 3,
        "episode": 9,
        "released": "2019-03-11",
        "overview": "After being away for 30 years, a woman dreams of retiring in the small town where she has fond memories of her childhood. With her all-in budget of $120,000, Erin designs an elegant, airy home while Ben creates some unique builds including a laundry chute and a custom screen door."
      },
      {
        "id": "tvmaze:1615433",
        "title": "Small Budget, Big Style",
        "season": 3,
        "episode": 10,
        "released": "2019-03-18",
        "overview": "A local business owner is looking to buy a starter home within walking distance to town with character, has plenty of space for her dog and fits her thrifty all-in budget. Ben and Erin Napier narrow her search down to two homes -- one is on the historical Bush dairy farm with a sizable yard and lake view, the other is a well-kept cottage with great bones and a small yard. Once a decision is made, the duo creates a jaw-dropping transformation complete with a covet-worthy kitchen and a dreamy outdoor patio."
      },
      {
        "id": "tvmaze:1628713",
        "title": "Southern Coastal Style",
        "season": 3,
        "episode": 11,
        "released": "2019-03-25",
        "overview": "A couple is ready to move back home to Mississippi and put down roots after years of moving for work. They need help finding a home with charm and character in a small town. With an all-in budget of $300,000, Ben and Erin infuse their new home with coastal charm and create a gorgeous kitchen and breathtaking outdoor entertaining space using reclaimed cedar from the home."
      },
      {
        "id": "tvmaze:1628714",
        "title": "Putting Down Roots",
        "season": 3,
        "episode": 12,
        "released": "2019-04-01",
        "overview": "After falling in love with the small-town energy and hospitality, a couple that was recently recruited by the local hospital looks for a place to live as they start their new jobs as doctors. They have an all-in budget of $200,000 and a wish list that includes a historic home and a place to entertain as they make new friends. Ben and Erin's dazzling makeover includes a new kitchen and a stunning open-concept entertainment space."
      },
      {
        "id": "tvmaze:1628715",
        "title": "Moving to Main Street",
        "season": 3,
        "episode": 13,
        "released": "2019-04-08",
        "overview": "A woman wants to downsize and move into town to be closer to friends and work. With her all-in budget of $125,000, she hopes to find a small home with a maintenance-free yard, a master bathroom, and space for her son. Ben and Erin give her house a colorful makeover that includes a whimsical kitchen, stunning master bathroom and dedicated music room."
      },
      {
        "id": "tvmaze:1756447",
        "title": "From Los Angeles to Laurel",
        "season": 4,
        "episode": 1,
        "released": "2020-01-20",
        "overview": "Actor Richard T. Jones and his wife, Nancy, fell in love with Mississippi and want to invest in the community. Their wish list includes a historical home with good bones, so Ben and Erin give it a classic Craftsman front porch and a colorful makeover."
      },
      {
        "id": "tvmaze:1792662",
        "title": "The Littlest House",
        "season": 4,
        "episode": 2,
        "released": "2020-01-27",
        "overview": "A business owner that's been living with her mom is ready to find a place she can call her own. With an all-in budget of $100,000, she's looking for a small home with a porch. Ben and Erin transform the house using breathtaking Americana charm."
      },
      {
        "id": "tvmaze:1792663",
        "title": "The Church House",
        "season": 4,
        "episode": 3,
        "released": "2020-02-03",
        "overview": "A minister and his wife are offered a clergy house, but the home is cramped with their family of seven. Ben and Erin share their vision for updating the space and show the couple The Collins House to give them a second, larger option."
      },
      {
        "id": "tvmaze:1797923",
        "title": "Can This House Be Saved?",
        "season": 4,
        "episode": 4,
        "released": "2020-02-09",
        "overview": "When she turned 18, a young woman inherited her family home that had been sitting abandoned for years. Now 21, she comes to Ben and Erin to see if the house can be saved with her $120,000 budget or if her money is better spent on another property."
      },
      {
        "id": "tvmaze:1797924",
        "title": "Inspired by the Sea",
        "season": 4,
        "episode": 5,
        "released": "2020-02-10",
        "overview": "A woman who has been renting for years is ready to buy a home, and her wish list includes a master bathroom with a big bathtub. Ben and Erin capitalize on the charm of the house and design a Nantucket-inspired kitchen and a stunning master suite."
      },
      {
        "id": "tvmaze:1800412",
        "title": "The Sky's the Limit",
        "season": 4,
        "episode": 6,
        "released": "2020-02-16",
        "overview": "A man who has always moved around and loves to travel and meet new people is looking for a large home. Ben and Erin can't believe their luck when he gives them a limitless budget to design a gorgeous retreat with a Spanish-style kitchen and master suite."
      },
      {
        "id": "tvmaze:1801173",
        "title": "Restoring a Craftsman",
        "season": 4,
        "episode": 7,
        "released": "2020-02-17",
        "overview": "A couple from Alabama is excited to settle down in a small town for the next phase of their lives. Ben and Erin help them choose a forever home and give it a historic renovation complete with a gorgeous master suite, custom kitchen and screened-in porch."
      },
      {
        "id": "tvmaze:1807844",
        "title": "Home Away from Home",
        "season": 4,
        "episode": 8,
        "released": "2020-03-02",
        "overview": "A couple wants a vacation home that's big enough to entertain but manageable to maintain. After showing them a 1920s cottage and a 1912 Craftsman, Ben and Erin create the perfect getaway for them with a large chef's kitchen."
      },
      {
        "id": "tvmaze:1814689",
        "title": "Bachelor's Paradise",
        "season": 4,
        "episode": 9,
        "released": "2020-03-09",
        "overview": "After years of traveling, a bachelor is ready to buy a home where his family has lived for five generations. Ben and Erin find a cottage with good resale potential, and their design includes a stunning master bedroom and a quaint front porch."
      },
      {
        "id": "tvmaze:1814691",
        "title": "There's Just Something About a Porch",
        "season": 4,
        "episode": 10,
        "released": "2020-03-16",
        "overview": "A couple is looking for a historic home in the country with a porch and plenty of green space. Ben and Erin transform their new home into a classic, dogtrot-style house full of historic charm and Southern touches."
      },
      {
        "id": "tvmaze:1827361",
        "title": "A House with History",
        "season": 4,
        "episode": 11,
        "released": "2020-03-23",
        "overview": "Jay and Rhonda are professors interested in historic preservation, and now they're looking for an old home of their own. Erin and Ben revive a 1920s craftsman cottage that stays true to its character, including original woodwork."
      },
      {
        "id": "tvmaze:1827097",
        "title": "Termite Terror",
        "season": 4,
        "episode": 12,
        "released": "2020-03-30",
        "overview": "A school teacher misses small town life and looks to make a fresh start in a historic home. Ben and Erin come up with big plans to update her home, but they encounter an unexpected problem that could derail the entire renovation."
      },
      {
        "id": "tvmaze:1833620",
        "title": "A Southern Dream",
        "season": 4,
        "episode": 13,
        "released": "2020-04-06",
        "overview": "A woman inherits her mom's house, but it's far too small for her growing family; Ben and Erin come up with an ambitious plan to double the size of the house, adding a master suite and two additional bedrooms upstairs."
      },
      {
        "id": "tvmaze:1839117",
        "title": "Fire and Water",
        "season": 4,
        "episode": 14,
        "released": "2020-04-13",
        "overview": "A couple is looking for a house where they can entertain friends in a walkable neighborhood. Ben and Erin give their pick a complete facelift by adding a coastal color scheme, built-in banquet and a back patio that's perfect for entertaining."
      },
      {
        "id": "tvmaze:1868002",
        "title": "The Cafe House",
        "season": 4,
        "episode": 15,
        "released": "2020-06-01",
        "overview": "Young restaurateur brothers want to open a cafe near downtown with an apartment on the property. Ben and Erin give their choice a functioning cafe kitchen, beautiful cafe dining rooms and an incredibly efficient home."
      },
      {
        "id": "tvmaze:1989696",
        "title": "A New Beginning",
        "season": 5,
        "episode": 1,
        "released": "2021-01-03",
        "overview": "A photographer and close friend of the Napier's is looking for a traditional home with a touch of modern style. After deciding on a classic mansion in need of a complete makeover, Ben and Erin transform the tired house into a show-stopping home."
      },
      {
        "id": "tvmaze:1995949",
        "title": "Color Psychology",
        "season": 5,
        "episode": 2,
        "released": "2021-01-10",
        "overview": "A couple who runs a non-profit is investing in a property that provides transitional housing for women recovering from difficulties. Ben and Erin get scrappy and turn a neglected building into an uplifting oasis where new beginnings can flourish."
      },
      {
        "id": "tvmaze:1995950",
        "title": "A Musician's Retreat",
        "season": 5,
        "episode": 3,
        "released": "2021-01-17",
        "overview": "A recording producer is back in Laurel looking for an artist's retreat. He received a dilapidated cabin from his late father, and while Ben and Erin are up for the risky restoration challenge, they think he'll get a better return with a bungalow in town."
      },
      {
        "id": "tvmaze:2006561",
        "title": "From the Big Apple to the Little Catfish",
        "season": 5,
        "episode": 4,
        "released": "2021-01-24",
        "overview": "A surgeon and his wife are moving to Laurel from New York City, and their all-in budget goes a long way in the Mississippi town. Ben and Erin pay homage to the historic property's original elements and peculiar charm to design an amazing family home."
      },
      {
        "id": "tvmaze:2012455",
        "title": "A Laurel Hug",
        "season": 5,
        "episode": 5,
        "released": "2021-01-31",
        "overview": "A woman is moving back to Laurel to be close to family after the sudden passing of her husband. Ben and Erin thoughtfully bring their design to life and create a gorgeous, sun-filled home as a soft landing to help get her through this difficult time."
      },
      {
        "id": "tvmaze:2022275",
        "title": "All in the Family",
        "season": 5,
        "episode": 6,
        "released": "2021-02-14",
        "overview": "Erin's uncle, Danny, likes to go big when it comes to restoring old houses, and he's not concerned about the budget. Together with his son, Jim, Ben and Erin try to convince him that bigger isn't always better in a historical home renovation."
      },
      {
        "id": "tvmaze:2022276",
        "title": "Closer to Mom",
        "season": 5,
        "episode": 7,
        "released": "2021-02-21",
        "overview": "A New Orleans couple is looking for a vacation home in Laurel to be closer to her mom, and their ideal house needs space for hosting crawfish boils. Ben and Erin transform a dated home into a modern oasis complete with two kitchens and a spectacular pool."
      },
      {
        "id": "tvmaze:2022277",
        "title": "Clean Lines, Open Spaces",
        "season": 5,
        "episode": 8,
        "released": "2021-02-28",
        "overview": "After living in temporary situations after a tornado destroyed his house, a man is ready to find a home with clean lines and open spaces. Ben and Erin give his new place a complete facelift, creating an awesome midcentury modern home with a cozy study."
      },
      {
        "id": "tvmaze:2033467",
        "title": "Woodland Wonderland",
        "season": 5,
        "episode": 9,
        "released": "2021-03-07",
        "overview": "A couple trading in Oregon's cold weather for Laurel's humid climate is looking for a house with nature-inspired whimsy and historic Southern charm. Ben and Erin rise to the challenge of creating a storybook-style home that's truly one of a kind."
      },
      {
        "id": "tvmaze:2048164",
        "title": "Retreat Yourself",
        "season": 5,
        "episode": 10,
        "released": "2021-03-21",
        "overview": "Angie took a huge leap of faith when she quit her New York job to work as a producer on Home Town. After falling in love with Laurel, Mississippi, she's ready to make it her permanent address, and Ben and Erin help their boss find her dream home."
      },
      {
        "id": "tvmaze:2048165",
        "title": "Design for Living",
        "season": 5,
        "episode": 11,
        "released": "2021-03-28",
        "overview": "An interior designer wants to buy a starter home in Laurel, and Ben and Erin are up for the challenge. Whether she picks the quaint cottage or the former rental, Erin is excited to flex her design muscles with a boho/mid-modern style her colleague loves."
      },
      {
        "id": "tvmaze:2054569",
        "title": "Thanks for the Memories",
        "season": 5,
        "episode": 12,
        "released": "2021-04-04",
        "overview": "With their daughters leaving the nest, a couple must decide between renovating their high-maintenance home or moving into a clean slate. Ben and Erin aim to mark everything off their wish list and save Laurel's first family of hospitality's reputation."
      },
      {
        "id": "tvmaze:2065044",
        "title": "Family Values",
        "season": 5,
        "episode": 13,
        "released": "2021-04-11",
        "overview": "Ben's baby brother Jesse and his wife Lauren are buying their first house, and the Napiers are there to guide them every step of the way. Using their love of eclectic style and bold colors, Ben and Erin create a fun-filled home ready for new memories."
      },
      {
        "id": "tvmaze:2073530",
        "title": "Country House, City House",
        "season": 5,
        "episode": 14,
        "released": "2021-04-18",
        "overview": "A Georgia couple who love the outdoors are in need of a home with a big kitchen and lots of yard space for entertaining; Ben and Erin are determined to bring this couple's outdoorsy ways into the design of their home."
      },
      {
        "id": "tvmaze:2076853",
        "title": "Grand Style",
        "season": 5,
        "episode": 15,
        "released": "2021-04-25",
        "overview": "A woman moving back to Laurel wants a place big enough to accommodate her parents, kids and grandkids if they visit all at once; Erin can't wait to deliver on her ideal design plan: blue and white in the French provincial style."
      },
      {
        "id": "tvmaze:2244252",
        "title": "First Time's the Charm",
        "season": 6,
        "episode": 1,
        "released": "2021-12-26",
        "overview": "One of the kids that Ben advised as a youth minister is all grown up and working as a mentor for the next generation. Now, this athlete is ready to buy his first home, and Ben and Erin have $150,000 to find one that fits into his industrial/modern style."
      },
      {
        "id": "tvmaze:2152234",
        "title": "Bones and Bugs",
        "season": 6,
        "episode": 2,
        "released": "2022-01-02",
        "overview": "A couple is trading in their small apartment in a big city for a big house in a small town. Ben and Erin work to find them a home that blends a love of eclectic color with a need for simplicity and has a space to showcase an unusual collection!"
      },
      {
        "id": "tvmaze:2235028",
        "title": "Pumped About Laurel",
        "season": 6,
        "episode": 3,
        "released": "2022-01-09",
        "overview": "A couple loves Laurel so much, they've decided to buy a vacation home there. Now, Ben and Erin are set to find a place big enough for their family of six (and counting) that shows off their traditional style and has plenty of space for hanging out."
      },
      {
        "id": "tvmaze:2235029",
        "title": "One Space at a Time",
        "season": 6,
        "episode": 4,
        "released": "2022-01-16",
        "overview": "The city inspector who works with Ben and Erin has a $60,000 reno budget but is in need of some design help. The Napiers pitch two different plans, leaving her to decide if she wants to overhaul the kitchen and living room or create a private main suite."
      },
      {
        "id": "tvmaze:2265217",
        "title": "Grand Millennial",
        "season": 6,
        "episode": 5,
        "released": "2022-01-30",
        "overview": "Rebekah comes from one of the biggest families in Laurel, and she wishes to return from the big city of Jackson to regrow her roots using Ben and Erin's expertise; whatever Rebekah's choice, Erin hopes to flex her new \"Grand Millennial\" design."
      },
      {
        "id": "tvmaze:2265216",
        "title": "The Zen Room",
        "season": 6,
        "episode": 6,
        "released": "2022-02-06",
        "overview": "A couple who want to settle in Laurel and never move again are looking for a home with a Zen-style room for relaxation and a porch for entertaining; Ben and Erin set out to create a Mexican-inspired home that will check everything off their list."
      },
      {
        "id": "tvmaze:2268893",
        "title": "Campy Cabin Vibes",
        "season": 6,
        "episode": 7,
        "released": "2022-02-27",
        "overview": "After being a travel nurse, Luke wants his home base to be in his hometown; Ben and Erin transform his starter house into a comfortable home featuring a cozy cabin design that includes his grandma's mementos."
      },
      {
        "id": "tvmaze:2286657",
        "title": "Sweet Tea Dreams",
        "season": 6,
        "episode": 8,
        "released": "2022-03-06",
        "overview": "A couple of tea farmers want to turn their historic, sixth-generation farmhouse into an event space; Ben and Erin take on the challenge of renovating this century-old residence into a party venue that will welcome people from all over."
      },
      {
        "id": "tvmaze:2286658",
        "title": "Wraparound Porch",
        "season": 6,
        "episode": 9,
        "released": "2022-03-13",
        "overview": "In preparation for future grandchildren, a couple looks for a big, historic home with a wraparound porch and shower room; Ben and Erin face annoying plumbing reroutes and termite damage to turn a problem-filled property into their dream home."
      },
      {
        "id": "tvmaze:2286659",
        "title": "Architect's Linear Loft",
        "season": 6,
        "episode": 10,
        "released": "2022-03-27",
        "overview": "An architect is looking to expand his business, so he's headed downtown to find the perfect combination of work and living space; Ben and Erin show him two buildings with plenty of room and opportunity for both a growing business and his Great Dane."
      },
      {
        "id": "tvmaze:2298279",
        "title": "A House for Mom and Dad",
        "season": 6,
        "episode": 11,
        "released": "2022-04-03",
        "overview": "A couple is looking to set her parents and grandmother up in style with a renovated home in Laurel; Ben and Erin will have to find a property where they can design a perfect porch for Dad, a nice bathroom for Mom and a private suite for Grandma."
      },
      {
        "id": "tvmaze:2425956",
        "title": "The Country House",
        "season": 7,
        "episode": 1,
        "released": "2022-12-04",
        "overview": "Inspired by their childhoods, the Napiers buy a country retreat where they can slow down and watch their daughters run free. Ben and Erin roll up their sleeves to transform their new place into a classic English country house with a kid-friendly design."
      },
      {
        "id": "tvmaze:2439638",
        "title": "The Family Tree",
        "season": 7,
        "episode": 2,
        "released": "2022-12-11",
        "overview": "After a family tragedy strikes, a native of Laurel reevaluates his priorities and moves back to be closer to loved ones. Ben and Erin find him a fixer-upper, but serious demo problems become a tough decision of saving the house or bulldozing it down."
      },
      {
        "id": "tvmaze:2446509",
        "title": "The Mullet House",
        "season": 7,
        "episode": 3,
        "released": "2022-12-18",
        "overview": "A newly engaged couple looks to put down roots in Laurel and has an opportunity to buy her grandmother's house, but the property comes with an unusual set of rules. All about options, Ben and Erin also show them a place they can truly make their own."
      },
      {
        "id": "tvmaze:2454049",
        "title": "Ginkgos and Gondolas",
        "season": 7,
        "episode": 4,
        "released": "2023-01-01",
        "overview": "A California couple fell in love with the Mississippi small-town vibe and look to relocate to Laurel. Ben and Erin show them a classic Victorian with an unusual backyard vault and a Prairie-style home known for its Ginkgo tree in the front yard."
      },
      {
        "id": "tvmaze:2454050",
        "title": "A Solid Foundation",
        "season": 7,
        "episode": 5,
        "released": "2023-01-08",
        "overview": "After facing tough times, a young family is ready to plant roots and be part of the vibrant community of Laurel. Ben and Erin show them two houses in two very different neighborhoods, one in the country and a larger place in the city."
      },
      {
        "id": "tvmaze:2457676",
        "title": "From Windy City to City Beautiful",
        "season": 7,
        "episode": 6,
        "released": "2023-01-15",
        "overview": "After living on the outskirts of Chicago for the last 30 years, a couple looks to return to his Mississippi roots for a quieter life. Ben and Erin present them with two houses, and one has something special that Erin thinks they won't be able to resist."
      },
      {
        "id": "tvmaze:2457677",
        "title": "The Buzzard's Roost",
        "season": 7,
        "episode": 7,
        "released": "2023-01-22",
        "overview": "A young entrepreneur wants to bring the tradition of hotels, bars and entertainment back to downtown Laurel with a four-bedroom boutique inn. Ben and Erin look to create an experience like no other, and it's one of their most ambitious projects yet."
      },
      {
        "id": "tvmaze:2473495",
        "title": "A Colorful Match",
        "season": 7,
        "episode": 8,
        "released": "2023-01-29",
        "overview": "Young entrepreneurs are excited to embark on a new chapter with the purchase of their first home. They want to incorporate bright colors into their design, and while Ben and Erin look to maximize space, it may also mean a bit of compromise."
      },
      {
        "id": "tvmaze:2473496",
        "title": "Mississippi Made",
        "season": 7,
        "episode": 9,
        "released": "2023-02-05",
        "overview": "A woman is thrilled to move to Laurel and wants a house that speaks to her feminine and eclectic style. Ben and Erin present her with two options, and whichever she chooses, they're on a mission to bring a little bit of local Mississippi into her home."
      },
      {
        "id": "tvmaze:2473497",
        "title": "A Drop of Sunshine",
        "season": 7,
        "episode": 10,
        "released": "2023-02-19",
        "overview": "California transplants look for a simpler small-town feel in Laurel and they're hoping to find a house with architectural charm. Ben and Erin present them with two home options, and the one they choose gives Erin a few design surprises along the way."
      },
      {
        "id": "tvmaze:2473498",
        "title": "Blue Heaven",
        "season": 7,
        "episode": 11,
        "released": "2023-02-26",
        "overview": "A retired father of six looks for the perfect place in Laurel where all his kids can come together for more quality time. He's looking for a particular blue and white color palette, and his decision between two houses takes Ben and Erin by surprise!"
      },
      {
        "id": "tvmaze:2492354",
        "title": "What's Good for the Goose",
        "season": 7,
        "episode": 12,
        "released": "2023-03-05",
        "overview": "A recent graduate accepts a dream job in Laurel and now she's ready to buy a house. She's known for hosting great parties and wants to entertain, but she has a surprise requirement for Ben and Erin that will be a major factor in the home she chooses."
      },
      {
        "id": "tvmaze:2496853",
        "title": "Second Chances",
        "season": 7,
        "episode": 13,
        "released": "2023-03-12",
        "overview": "With an early life as a troubled youth, a man who has turned his life around wants to reno his small guest cottage into a safe haven for those who need it. Also, Ben and Erin's best pals help them take on a massive project Erin has dreamt of for years."
      },
      {
        "id": "tvmaze:2501511",
        "title": "The Heart of Laurel",
        "season": 7,
        "episode": 14,
        "released": "2023-03-19",
        "overview": "After a tornado destroyed a family's long-time residence nearly three years ago, they still have been unable to return; Ben and Erin rally the entire community to roll up their sleeves and open their hearts to help finally bring the family back home."
      },
      {
        "id": "tvmaze:2504399",
        "title": "The Clock Starts Now",
        "season": 7,
        "episode": 15,
        "released": "2023-03-26",
        "overview": "Ben and Erin have just five weeks to reno a couple's home before Christmas."
      },
      {
        "id": "tvmaze:2511294",
        "title": "Wood, Brick and Clay",
        "season": 7,
        "episode": 16,
        "released": "2023-04-02",
        "overview": "A young graphic designer in love with midcentury design looks to buy her first home; Ben and Erin present two options that will satisfy her love of natural elements, and Erin is determined to make the house feel as creative as its owner."
      },
      {
        "id": "tvmaze:2517678",
        "title": "New-Stalgic Restoration",
        "season": 7,
        "episode": 17,
        "released": "2023-04-09",
        "overview": "Three siblings return to Laurel to find a place large enough to accommodate all their families while visiting their dad. Ben and Erin present them with a historic Victorian that's right in town and a country cabin that boasts six acres and a pond."
      },
      {
        "id": "tvmaze:2517679",
        "title": "The Maui of Mississippi",
        "season": 7,
        "episode": 18,
        "released": "2023-04-16",
        "overview": "A couple who have lived on islands their entire lives are ready to downsize, and they've decided that Laurel is the perfect place to do so. Ben and Erin show them renovation options for two homes they can create into the cozy home to fit their needs."
      },
      {
        "id": "tvmaze:2688155",
        "title": "Left-Hand Man",
        "season": 8,
        "episode": 1,
        "released": "2024-01-07",
        "overview": "A family is moving to Laurel to escape cold Canadian winters, and with four boys, they're looking for big rooms and plenty of outdoor space. Ben and Erin present a rural bungalow on a huge piece of land and a home that boasts a backyard bonus feature."
      },
      {
        "id": "tvmaze:2718436",
        "title": "Chasing Waterfalls",
        "season": 8,
        "episode": 2,
        "released": "2024-01-14",
        "overview": "A civil engineer and artist is moving from Seattle to Laurel to be closer to his dad. He has a generous budget and an outdoor hot tub is a non-negotiable, so Ben and Erin show him two large houses that suit his modern-contemporary vibe."
      },
      {
        "id": "tvmaze:2718437",
        "title": "Homecoming",
        "season": 8,
        "episode": 3,
        "released": "2024-01-21",
        "overview": "Jones College has a special place in Ben and Erin's hearts, and now they've been asked to restore The Old President's House. It's a team effort as students, past and present, step in to help make this house feel less institutional and more like a home."
      },
      {
        "id": "tvmaze:2735503",
        "title": "Everything Can Be Restored",
        "season": 8,
        "episode": 4,
        "released": "2024-01-28",
        "overview": "A woman has completely turned her life around and looks to begin a new chapter with buying her first house. Ben and Erin create a home for her and her son with a big front porch and a laundry room, a luxury she's never had."
      },
      {
        "id": "tvmaze:2748487",
        "title": "From Show Goats to Show Stopper",
        "season": 8,
        "episode": 5,
        "released": "2024-02-04",
        "overview": "A couple who are longtime Laurel business owners recently purchased a historic building downtown, and they want to convert the upper level into their residence. Ben and Erin are tasked with turning a gymnasium-like space into a luxurious downtown loft."
      },
      {
        "id": "tvmaze:2751691",
        "title": "Craftorian",
        "season": 8,
        "episode": 6,
        "released": "2024-02-18",
        "overview": "Restoration enthusiasts want to raise their two kids in a historic home in Laurel, and they know they'll need to settle on a fixer-upper. Ben and Erin show them two Craftsman inspired homes, one that has bay windows and another with an enticing porch."
      },
      {
        "id": "tvmaze:2751693",
        "title": "Tickled Pink",
        "season": 8,
        "episode": 7,
        "released": "2024-02-25",
        "overview": "Erin's favorite odd couple, an aunt and her great niece, are looking for their mutual dream home, but they don't agree on anything. Ben and Erin show them two homes, and Erin has her work cut out for her determining the color story for this contrary pair."
      },
      {
        "id": "tvmaze:2751692",
        "title": "Follow Your Goosebumps",
        "season": 8,
        "episode": 8,
        "released": "2024-03-03",
        "overview": "A couple recently inherited a house that belonged to her parents, and they currently live in the home next door, so they need to decide which one they'll keep and reno. There's strong feelings for both places, but his chill bumps lead them to a decision."
      },
      {
        "id": "tvmaze:2765495",
        "title": "Rustic Renovation",
        "season": 8,
        "episode": 9,
        "released": "2024-03-10",
        "overview": "A couple recently decided to move back to their roots in Laurel and they're looking for a home with a big lot for outdoor living. Ben and Erin show them a rancher that fits their love of modern rustic design and a home with an enticing in-ground pool."
      },
      {
        "id": "tvmaze:2765496",
        "title": "Old World, New Build",
        "season": 8,
        "episode": 10,
        "released": "2024-03-17",
        "overview": "Newlyweds look to upgrade from their tiny house to an older home located on gifted family property. And in a first for Ben and Erin, they decide to bulldoze the place and design a brand-new build tailored to their eclectic, English apothecary style."
      },
      {
        "id": "tvmaze:2773821",
        "title": "Shug and Spice",
        "season": 8,
        "episode": 11,
        "released": "2024-03-24",
        "overview": "A couple lives in a house that once belonged to her grandmother, and with a large family that often visits, they're ready to make big upgrades. Ben and Erin expand the footprint by adding a much needed additional bathroom as well as an outdoor kitchen."
      },
      {
        "id": "tvmaze:2773822",
        "title": "Mediterranean Vibes",
        "season": 8,
        "episode": 12,
        "released": "2024-03-31",
        "overview": "A couple with an appreciation for character homes are looking for something unique with an outdoor kitchen and a pottery studio. Ben and Erin present a more traditional home set across from a park and a ranch-style house with an impressive garden room."
      },
      {
        "id": "tvmaze:2793934",
        "title": "Welcome to Laurel",
        "season": 8,
        "episode": 13,
        "released": "2024-04-07",
        "overview": "Ben and Erin help the City of Laurel and the Laurel Housing Authority to convert a historic building into Laurel's first Visitor's Center. In a reveal like no other, they also take on the restoration of a 1940s public housing unit as part of the exhibit."
      },
      {
        "id": "tvmaze:2793935",
        "title": "Some Like It Hot",
        "season": 8,
        "episode": 14,
        "released": "2024-04-14",
        "overview": "A New Jersey couple looks to relocate to Laurel for the small-town vibes they've always dreamed of. They've never had a laundry room or a dining room before, so Ben and Erin present them two options with plenty of room for everything on their wish list."
      },
      {
        "id": "tvmaze:2793936",
        "title": "English Country Cottage",
        "season": 8,
        "episode": 15,
        "released": "2024-04-21",
        "overview": "A single mom who grew up in New York wants to give her two kids a cozy place like the one she grew up in. Ben and Erin present a home with a huge fireplace that instantly gives warmth and a house on two acres that evokes childhood memories."
      },
      {
        "id": "tvmaze:2793937",
        "title": "Sisters Know Best",
        "season": 8,
        "episode": 16,
        "released": "2024-04-28",
        "overview": "A young woman looks to buy her first home in Laurel where she and her six sisters grew up, and she wants a place where they can all gather for wine nights! Ben and Erin help her turn a bland house into a modern, moody retreat made for entertaining."
      },
      {
        "id": "tvmaze:2842681",
        "title": "Do You Believe in Bradgic?",
        "season": 8,
        "episode": 17,
        "released": "2024-05-05",
        "overview": "Erin's friend and former bandmate is recently divorced and needs to make a new start in his old home. Ben and Erin transform his spartan bachelor pad into the moody, customized house he always dreamed of, and they also look to get the band back together!"
      },
      {
        "id": "tvmaze:2849575",
        "title": "Home Town: Mother's Day",
        "season": 8,
        "episode": 18,
        "released": "2024-05-12",
        "overview": "Ben and Erin celebrate Mother's Day by surprising their close friend with a nursery, and they only have two weeks to complete it. Meanwhile, Ben plans a surprise of his own for Erin by building a greenhouse in their backyard using salvaged materials."
      },
      {
        "id": "tvmaze:2842682",
        "title": "Unfinished Business",
        "season": 8,
        "episode": 19,
        "released": "2024-05-19",
        "overview": "After restoring half of their old Victorian home, Ben and Erin return to help siblings with Phase Two of a renovation. The project unfortunately stalled after their father passed, but now, the Napiers are back to help finish the house."
      },
      {
        "id": "tvmaze:2856013",
        "title": "Cozy-Phobic",
        "season": 8,
        "episode": 20,
        "released": "2024-05-26",
        "overview": "A couple purchased her great grandmother's large property and small house with plans to turn it into a Christmas tree farm. Ben and Erin need to tear down every wall in the house to reno the cramped and quirky rambler into a cheery, functional home."
      },
      {
        "id": "tvmaze:3064452",
        "title": "When Life Gives You Tomatoes",
        "season": 9,
        "episode": 1,
        "released": "2024-12-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3066687",
        "title": "Unlimited Dreams",
        "season": 9,
        "episode": 2,
        "released": "2025-01-05",
        "overview": ""
      },
      {
        "id": "tvmaze:3083096",
        "title": "The Garden Shed",
        "season": 9,
        "episode": 3,
        "released": "2025-01-12",
        "overview": ""
      },
      {
        "id": "tvmaze:3083097",
        "title": "There's No Place Like Home",
        "season": 9,
        "episode": 4,
        "released": "2025-01-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3083098",
        "title": "A Hemingway House",
        "season": 9,
        "episode": 5,
        "released": "2025-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3096130",
        "title": "Woodsy and Whimsical",
        "season": 9,
        "episode": 6,
        "released": "2025-02-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3115763",
        "title": "Work of Art",
        "season": 9,
        "episode": 7,
        "released": "2025-02-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3115764",
        "title": "Making the Nest",
        "season": 9,
        "episode": 8,
        "released": "2025-02-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3096131",
        "title": "Home Town Intervention",
        "season": 9,
        "episode": 9,
        "released": "2025-03-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3157479",
        "title": "Saving The Homestead",
        "season": 9,
        "episode": 10,
        "released": "2025-04-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3202733",
        "title": "Treehouses and Tangled Hair",
        "season": 9,
        "episode": 11,
        "released": "2025-04-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3202734",
        "title": "Blast From the Past",
        "season": 9,
        "episode": 12,
        "released": "2025-05-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3202735",
        "title": "Darlin' Cottage",
        "season": 9,
        "episode": 13,
        "released": "2025-05-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3225331",
        "title": "Let the Good Times Roll",
        "season": 9,
        "episode": 14,
        "released": "2025-05-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3225330",
        "title": "Making a Splash",
        "season": 9,
        "episode": 15,
        "released": "2025-05-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3244034",
        "title": "Everything's Coming Up Roses",
        "season": 9,
        "episode": 16,
        "released": "2025-06-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3459730",
        "title": "TBA",
        "season": 10,
        "episode": 1,
        "released": "2026-01-04",
        "overview": "In the season opener, the Napiers will take on their largest Home Town overhaul yet to fix up one of Laurel's most well-known abodes for the homeowner who has lived there for over five decades. The gigantic transformation, which unfolds across two episodes, will bring much needed updates to the historic property, while preserving the house's original features."
      }
    ]
  }
}