{
  "meta": {
    "id": "tvmaze:79982",
    "type": "series",
    "name": "Fugitives: Caught on Tape",
    "description": "\"Fugitives Caught on Tape\" follows law enforcement officers as they pursue fugitives on the run. With unprecedented access to a multitude of cameras including body and dash cams, security and traffic cams, personal doorbell footage, smartphone cams and more, viewers get a look at how agencies track down fleeing suspects.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/591/1478620.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/591/1478620.jpg",
    "videos": [
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3433488",
        "title": "#217",
        "season": 2,
        "episode": 17,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3433489",
        "title": "#218",
        "season": 2,
        "episode": 18,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3024595",
        "title": "#101",
        "season": 1,
        "episode": 1,
        "released": "2024-10-16",
        "overview": "Law enforcement officers pursue fugitives on the run. L.A.P.D. ground units work with helicopter officers to catch an alleged, multiple hit-and-run suspect; deputies and police in Florida chase an alleged murder suspect across county lines; deputies in New Mexico pursue a naked woman driving recklessly on the highway; and more."
      },
      {
        "id": "tvmaze:3024596",
        "title": "#102",
        "season": 1,
        "episode": 2,
        "released": "2024-10-16",
        "overview": "Law enforcement officers pursue fugitives on the run. Officers in Florida pursue a man who stole two police cars in the same day; shots are fired as deputies engage in a foot chase with an alleged cop killer; police respond to a report of a man attacked with a machete; and more."
      },
      {
        "id": "tvmaze:3030090",
        "title": "#103",
        "season": 1,
        "episode": 3,
        "released": "2024-10-23",
        "overview": "Law enforcement officers pursue fugitives on the run. A man wanted for robbery and carjacking leads sheriff's deputies on a dangerous chase through crowded city streets; police get in a foot chase with an attempted murder suspect; a late night, 145 mile-an-hour highway pursuit; and more."
      },
      {
        "id": "tvmaze:3030091",
        "title": "#104",
        "season": 1,
        "episode": 4,
        "released": "2024-10-23",
        "overview": "Law enforcement officers pursue fugitives on the run. The dangerous pursuit of a convicted felon ends with a head-on collision with a police cruiser; a shoplifting suspect shoots at police and then sets his own house on fire during a standoff; air and ground units coordinate during a high-speed chase and foot pursuit; and more."
      },
      {
        "id": "tvmaze:3030092",
        "title": "#105",
        "season": 1,
        "episode": 5,
        "released": "2024-10-30",
        "overview": "Law enforcement officers pursue fugitives on the run. A truck thief streams his high-speed chase on social media; a man wanted for double murder fires shots at pursuing officers; a man caught sleeping at a traffic light flees police and crashes a high-end sports car; and more."
      },
      {
        "id": "tvmaze:3030093",
        "title": "#106",
        "season": 1,
        "episode": 6,
        "released": "2024-10-30",
        "overview": "Law enforcement officers pursue fugitives on the run. A car thief in New Mexico steals a vehicle from right under the noses of deputies; police in Wisconsin get in a foot chase with a serial evader; L-A-P-D officers engage in the slow-speed highway pursuit of an attempted murder suspect...on a bicycle; and more."
      },
      {
        "id": "tvmaze:3032254",
        "title": "#107",
        "season": 1,
        "episode": 7,
        "released": "2024-11-06",
        "overview": "Law enforcement officers pursue fugitives on the run. A desperate couple hold a truck driver hostage in his own semi; marine patrol deputies chase down smugglers in a high-speed boat chase; officers report a late-night pursuit of a suspect fleeing...in reverse; and more."
      },
      {
        "id": "tvmaze:3032255",
        "title": "#108",
        "season": 1,
        "episode": 8,
        "released": "2024-11-06",
        "overview": "Law enforcement officers pursue fugitives on the run. Police on the ground and in the air pursue suspects as they commit multiple carjackings; officers chase a murder suspect through a crowded big box store; police pursue a convicted felon at speeds over 110 miles-an-hour; and more."
      },
      {
        "id": "tvmaze:3041931",
        "title": "#109",
        "season": 1,
        "episode": 9,
        "released": "2024-11-13",
        "overview": "Law enforcement officers pursue fugitives on the run. A man wanted for assault, burglary and car theft leads state troopers and police on a high-speed chase across 3 states; a woman pulled over for speeding flees the scene but still manages to obey traffic laws; suspected auto thieves flee a hit-and-run to hide on a golf course; and more."
      },
      {
        "id": "tvmaze:3041932",
        "title": "#110",
        "season": 1,
        "episode": 10,
        "released": "2024-11-13",
        "overview": "Law enforcement officers pursue fugitives on the run: Sheriff's Deputies, State Troopers and local police engage in a deadly gun battle at the end of a dangerous, high-speed pursuit; police, K-9 officers and air units track down a car thief who's attempting a water escape in a stolen kayak; State Troopers outwit a fugitive driving recklessly on a motorcycle; and more."
      },
      {
        "id": "tvmaze:3041933",
        "title": "#111",
        "season": 1,
        "episode": 11,
        "released": "2024-11-20",
        "overview": "Law enforcement officers pursue fugitives on the run: an accused car thief jumps off a 36 foot bridge to avoid capture; an armed fugitive on the run breaks into a building full of law school students; a DUI suspect flees by car, by foot and finally by water before being captured by deputies; and more."
      },
      {
        "id": "tvmaze:3041934",
        "title": "#112",
        "season": 1,
        "episode": 12,
        "released": "2024-11-20",
        "overview": "Law enforcement officers pursue fugitives on the run: a wanted felon smashes into a state trooper's car while fleeing from local police and county deputies; police get into a shootout with a man wanted for murdering his roommate; a deputy's PIT maneuver knocks a fugitive's car up on two wheels; and more."
      },
      {
        "id": "tvmaze:3055119",
        "title": "#113",
        "season": 1,
        "episode": 13,
        "released": "2024-11-27",
        "overview": "Law enforcement officers pursue fugitives on the run. A man out on bond for a breaking and entering charge leads police on a high-speed chase down the wrong side of the highway; officers try to engage with a shoplifting suspect during a highway standoff; a convicted child sex abuser steals a Homeland Security vehicle while being detained; and more."
      },
      {
        "id": "tvmaze:3055120",
        "title": "#114",
        "season": 1,
        "episode": 14,
        "released": "2024-11-27",
        "overview": "Law enforcement officers pursue fugitives on the run: deputies race to extract a mother and her daughters from their truck after a fleeing suspect crashes into them; fish and wildlife officers pursue a fugitive attempting to escape by swimming away; deputies attempt a PIT maneuver on a man accused of killing his girlfriend; and more."
      },
      {
        "id": "tvmaze:3055121",
        "title": "#115",
        "season": 1,
        "episode": 15,
        "released": "2024-12-04",
        "overview": "Law enforcement officers pursue fugitives on the run. 911 operators receive a call in the middle of a road rage incident; state troopers pursue a man wanted for domestic assault and fleeing with his 6-year-old son in the car; police attempt multiple PIT Maneuvers on two fugitives wanted for armed robbery; and more."
      },
      {
        "id": "tvmaze:3055122",
        "title": "#116",
        "season": 1,
        "episode": 16,
        "released": "2024-12-04",
        "overview": "Law enforcement officers pursue fugitives on the run. Police exchange gunfire in the streets of Tampa with a man wanted for stabbing his wife; a State Trooper performs a PIT Maneuver on a fleeing hit-and-run suspect, sending his car rolling off the road; police get in a high-speed chase with two men wanted for armed carjacking; and more."
      },
      {
        "id": "tvmaze:3055123",
        "title": "#117",
        "season": 1,
        "episode": 17,
        "released": "2024-12-11",
        "overview": "Law enforcement officers pursue fugitives on the run. Police and Highway Patrol pull a shoplifting suspect to safety after he hangs from a highway overpass; deputies, air units and K-9 officers chase down a suspect on foot and in the water; a man fleeing from police is ejected from his car after crashing; and more."
      },
      {
        "id": "tvmaze:3055124",
        "title": "#118",
        "season": 1,
        "episode": 18,
        "released": "2024-12-11",
        "overview": "Law enforcement officers pursue fugitives on the run. A woman accused of shoplifting rams a police cruiser and leads officers on a dangerous, high-speed chase; State Troopers pursue an alleged, armed carjacker; police chase down a suspect in a stolen SUV; and more."
      },
      {
        "id": "tvmaze:3055125",
        "title": "#119",
        "season": 1,
        "episode": 19,
        "released": "2024-12-18",
        "overview": "Law enforcement officers pursue fugitives on the run. Deputies get in a high-speed chase with a man wanted for shooting a highway patrolman and stealing his cruiser; officers pursue a fugitive who's driving recklessly on a pedestrian only hiking trail; police and K-9 units chase down a suspect who jumped out of his car while it was still moving; and more."
      },
      {
        "id": "tvmaze:3055126",
        "title": "#120",
        "season": 1,
        "episode": 20,
        "released": "2024-12-18",
        "overview": "Law enforcement officers pursue fugitives on the run. A man wanted for carjacking runs out of road during a high-speed chase; an officer climbs on the hood of a car while trying to prevent a fugitive from fleeing; a man arrested for fleeing/eluding and reckless driving screams apologies and declarations of love to his girlfriend; and more."
      },
      {
        "id": "tvmaze:3365085",
        "title": "#201",
        "season": 2,
        "episode": 1,
        "released": "2025-10-08",
        "overview": "A suspect in a box truck causes multiple collisions on the highway before engaging officers in an airport shootout; a K-9 officer chases down a fugitive wanted for Aggravated Battery with a Deadly Weapon; and more."
      },
      {
        "id": "tvmaze:3365086",
        "title": "#202",
        "season": 2,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "After a high-speed chase ends with a horrifying crash on the highway, the suspect shocks officers by attacking one of the accident victims with a knife; and more."
      },
      {
        "id": "tvmaze:3365087",
        "title": "#203",
        "season": 2,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "Officers chase a stolen car with the victim's 1-year-old boy still in the back seat; an armed suspect who claims to be \"C.I.A.\" flees from a traffic stop and rams a police cruiser; and more."
      },
      {
        "id": "tvmaze:3365088",
        "title": "#204",
        "season": 2,
        "episode": 4,
        "released": "2025-10-15",
        "overview": "Law enforcement officers pursue fugitives on the run. Troopers chase a suspect off-road, through wrong-way highway traffic and across busy city streets as dangerous debris falls from the back of his stolen truck; and more."
      },
      {
        "id": "tvmaze:3365089",
        "title": "#205",
        "season": 2,
        "episode": 5,
        "released": "2025-10-22",
        "overview": "Law enforcement officers pursue fugitives on the run. A getaway driver smashes into 3 police cruisers and a bystander's S-U-V while leading officers on a high-speed, parking lot chase; and more."
      },
      {
        "id": "tvmaze:3365090",
        "title": "#206",
        "season": 2,
        "episode": 6,
        "released": "2025-10-22",
        "overview": "A man who tried to run his daughter over with a pick-up truck shoots at officers and rams a police cruiser; and more."
      },
      {
        "id": "tvmaze:3365091",
        "title": "#207",
        "season": 2,
        "episode": 7,
        "released": "2025-10-29",
        "overview": "A convicted felon fleeing from police across a highway nearly gets hit by a semi-truck; and more."
      },
      {
        "id": "tvmaze:3365092",
        "title": "#208",
        "season": 2,
        "episode": 8,
        "released": "2025-10-29",
        "overview": "A man with seven active warrants for his arrest tries to evade officers by throwing chocolate milk at their cruiser; and more."
      },
      {
        "id": "tvmaze:3433140",
        "title": "#209",
        "season": 2,
        "episode": 9,
        "released": "2025-11-05",
        "overview": "A man fleeing from state troopers jumps off Florida's 7-Mile Bridge into the ocean below; a wanted man smashes into multiple cars while trying to flee from police at a gas station; and more."
      },
      {
        "id": "tvmaze:3433141",
        "title": "#210",
        "season": 2,
        "episode": 10,
        "released": "2025-11-05",
        "overview": "An ex-con suspected of drunk driving flees a traffic stop and then tells a 911 operator that he'll shoot at officers if they stop him again; a woman rams into police cruisers with a baby in the backseat of her SUV; and more."
      },
      {
        "id": "tvmaze:3433482",
        "title": "#211",
        "season": 2,
        "episode": 11,
        "released": "2025-11-12",
        "overview": "Police pursue a man driving his truck recklessly while towing a double-wide mobile home; a woman steals an officer's cruiser and rear-ends an SUV; officers engage in a bicycle pursuit for a suspect in a recent machete attack; and more."
      },
      {
        "id": "tvmaze:3433483",
        "title": "#212",
        "season": 2,
        "episode": 12,
        "released": "2025-11-12",
        "overview": "A drunk driver flashes her middle finger while fleeing from troopers; a local Police Chief rolls his cruiser into a ditch after executing a PIT Maneuver; and more."
      },
      {
        "id": "tvmaze:3433484",
        "title": "#213",
        "season": 2,
        "episode": 13,
        "released": "2025-11-19",
        "overview": "Multiple agencies face off against an armed fugitive who's abducted his 7-year-old daughter, a driver who crashed his car while fleeing from police gets tased; and more."
      },
      {
        "id": "tvmaze:3433485",
        "title": "#214",
        "season": 2,
        "episode": 14,
        "released": "2025-11-19",
        "overview": "Two murder suspects fire shots at State Troopers during a high-speed, highway pursuit; police pursue a man driving a baggage trailer he allegedly stole from a local airport; State Troopers chase down a D-U-I suspect in a stolen ambulance; and more."
      },
      {
        "id": "tvmaze:3433486",
        "title": "#215",
        "season": 2,
        "episode": 15,
        "released": "2025-11-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3433487",
        "title": "#216",
        "season": 2,
        "episode": 16,
        "released": "2025-11-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3433488",
        "title": "#217",
        "season": 2,
        "episode": 17,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3433489",
        "title": "#218",
        "season": 2,
        "episode": 18,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3439883",
        "title": "Episode 19",
        "season": 2,
        "episode": 19,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3439884",
        "title": "Episode 20",
        "season": 2,
        "episode": 20,
        "released": "2025-12-10",
        "overview": ""
      }
    ]
  }
}