{
  "meta": {
    "id": "tvmaze:67646",
    "type": "series",
    "name": "The Whole Story with Anderson Cooper",
    "description": "The Whole Story with Anderson Cooper is a collection of unique and immersive single-subject, one-hour episodes from CNN's Emmy®  and Peabody Award-winning long-form storytelling team.  The recurring weekly series will be hosted by Cooper and showcase character-driven stories, special interviews, profiles, and investigative deep dives featuring reporting from CNN's anchors and correspondents.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/457/1142739.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/457/1142739.jpg",
    "videos": [
      {
        "id": "tvmaze:3459164",
        "title": "Justice Defenders: Change Inside Prison",
        "season": 3,
        "episode": 24,
        "released": "2025-12-07",
        "overview": "CNN Anchor Anderson Cooper premieres an unflinching look inside some of Africa's most overcrowded maximum-security prisons, where a groundbreaking program is transforming lives from the inside out.In this episode, Cooper returns to Nairobi, Kenya, to revisit a story he first covered six years ago inside a prison system where overcrowding and severe resource shortages create harsh daily realities for the tens of thousands of people held inside. Without access to an attorney and unable to pay bail, many may remain incarcerated for years before ever standing trial. Cooper catches up with Alexander McLean, founder of Justice Defenders, an innovative nonprofit organization that trains incarcerated people to become paralegals and even earn law degrees, and which has helped more than 69 thousand incarcerated men and women leave prison and return to society.\"It is remarkable to see what Justice Defenders is doing inside these maximum security prisons, where so few people have access to attorneys and many may spend years just waiting for a hearing before a judge,\" said Cooper. \"Justice Defenders find incarcerated people eager to help others and with even a few weeks of paralegal training they can help thousands of others understand their rights and the legal system.\"With unprecedented access inside facilities in Kenya and beyond, the episode traces the journeys of men and women who have gone from death row and overcrowded cells to becoming legal advocates for themselves and others. The reporting expands to the United States, where McLean meets with men incarcerated in New York to explore whether the Justice Defenders model could be used in America, which has one of the world's highest incarceration rates."
      },
      {
        "id": "tvmaze:2510368",
        "title": "The Trek: A Migrant Trail to America",
        "season": 1,
        "episode": 1,
        "released": "2023-04-16",
        "overview": "CNN's Nick Paton Walsh travels with thousands of migrants through the jungles of South and Central America and tells their stories of danger, grit, and determination to make it to America.The journey through the Darien Gap is a perilous jungle crossing between Colombia and Panama that many migrants must face as they head north to seek asylum in the United States. Over five harrowing days, Paton Walsh hikes the entire 66-mile roadless route, documenting the heroism of everyday people, milked for cash by drug cartels and unwanted by any country, as they battle the dense rainforest in search of a better life.  In this episode, Paton Walsh hears the heartbreaking stories of his companions on the passage, from unaccompanied children, Venezuelan university students whose classmates have been killed, and a mother carrying her disabled daughter desperate for the medicine to treat her epileptic convulsions. As they traverse the mud-packed mountain slopes and treacherously opaque riverbeds, the dangerous trek reveals the enduring humanity of those who embark on this expedition together, sharing their already limited resources with the injured and helping the elderly carry heavy cargo."
      },
      {
        "id": "tvmaze:2529578",
        "title": "How to Unscrew a Planet",
        "season": 1,
        "episode": 2,
        "released": "2023-04-23",
        "overview": "CNN's Chief Climate Correspondent Bill Weir marks Earth Day with this captivating adventure, crossing the globe to interact with the most innovative players in the trillion-dollar race to remove carbon from the sea and sky. Since human activity has released a monster made of more than one trillion tons of carbon into the Earth's atmosphere, innovators and investors are joining the global race against time to defeat it. With tools that include everything from Icelandic geysers to humpback whales, they are putting down stakes in the most significant new industry you've never heard of.From Silicon Valley to Cambridge and aboard hot air balloons in the Swiss Alps and fishing boats in Maine, Weir searches for perspective, hope, and ideas. \"If science and stone-cold evidence are telling us that the future is screwed, how do we unscrew a planet?\" Weir said, explaining the show's inspiration. \"I went looking for the biggest, boldest ideas in planetary repair and came back blown away, both by the scale of the challenge and the wave of new ideas being put into action every day.\"Weir analyzes innovative carbon removal techniques that mimic nature itself, including spraying the ocean with artificial whale feces made of volcanic ash, creating synthetic clouds made of seawater mist, and sinking carbon-absorbing seaweed buoys to the bottom of the ocean. He speaks with leading experts in their field, including Swiss explorer and environmentalist Bertrand Piccard who was the first person to complete a non-stop balloon flight around the globe, former Chief Scientific Advisor to the UK Government and founder of the Center for Climate Repair at Cambridge University Sir David King, and Silicon Valley titan Peter Reinhardt, who co-founded and is CEO of carbon removal tech company Charm Industrial®."
      },
      {
        "id": "tvmaze:2530924",
        "title": "The Reign Begins: Charles & Camilla",
        "season": 1,
        "episode": 3,
        "released": "2023-04-30",
        "overview": "CNN Anchor and National Correspondent Erica Hill previews the coronation of King Charles III and Camilla, the Queen Consort. Featuring interviews with the foremost experts on the Royal Family and many close to the Windsors, Hill examines the past, present, and future of these new sovereigns. Hill travels to England to assemble a group of British scholars and journalists, including Kehinde Andrews, Helen Carr, Sarah Hewson, Robert Lacey, Bidisha Mamata, Jack Royston, Camilla Tominey, and Kate Williams, to debate what the monarchy means in 2023, what its new king and queen stand for, and whether this royal institution may be in jeopardy.Former staffers to the royal family, including Press Secretaries to Queen Elizabeth Ailsa Anderson and Charles Anson and Communications Secretary to then Prince Charles Kristina Kyriacou, examine the legacy of King Charles III, from his rebellious youth to his tumultuous first marriage to Princess Diana, and how his defiant nature is reflected in his son, Prince Harry. Together, they consider Camilla's complicated path to the throne and her rising level of influence. And they question whether a new generation of British citizenry will continue to support the pomp and pageantry of the crown."
      },
      {
        "id": "tvmaze:2542554",
        "title": "Shaken: Baby Powder on Trial",
        "season": 1,
        "episode": 4,
        "released": "2023-05-07",
        "overview": "CNN Chief Investigative Correspondent and Anchor Pamela Brown investigates claims made by some of the thousands of women and men who say that Johnson &amp; Johnson's now-discontinued talc baby powder is responsible for their cancers. Johnson &amp; Johnson is an American institution. The corporate behemoth, worth more than 400 billion dollars, is the company behind Tylenol, Band-Aid, and Neutrogena, which can all be found in homes nationwide. Marketed both for use by children and adults, Johnson &amp; Johnson's baby powder became one of the company's most iconic products. When allegations arose that the talc baby powder contained traces of cancerous asbestos, Johnson &amp; Johnson vehemently denied those claims. They have consistently cited the safety of their product and said that it does not contain asbestos or cause cancer. Despite this, based on those allegations, there are nearly 40,000 lawsuits against Johnson &amp; Johnson.In this investigation, Brown hears the powerful stories of several women suing Johnson &amp; Johnson following their cancer diagnoses and speaks with attorneys on both sides of the case – plaintiffs' attorney Jerome Block and attorney for Johnson &amp; Johnson Allison Brown. She also interviews Senator Dick Durbin, Chair of the Senate Judiciary, on Johnson &amp; Johnson's attempt to create a subsidiary for its talc liabilities and limit its exposure to litigation through bankruptcy court."
      },
      {
        "id": "tvmaze:2544452",
        "title": "What Happened to San Francisco?",
        "season": 1,
        "episode": 5,
        "released": "2023-05-14",
        "overview": "One of America's most beloved and beautiful cities struggles with a crisis of homelessness, drugs, and crime. How did it come to this?CNN Anchor Sara Sidner examines the political and social issues plaguing the city of San Francisco, the metropolis at the center of the 1960s counterculture movement that became the center of the modern technological revolution. The City by the Bay is now at the forefront of the nation's homelessness, mental illness, and drug addiction crises. Some residents worry Northern California's largest municipality could become a so-called failed city. In this episode, Sidner goes behind the headlines in the city that she loves to meet the lawmakers and residents on the front lines of this issue. Sidner has a candid conversation with San Francisco Mayor London Breed on some of her most controversial policies and sits down with former Mayor Willie Brown, who discusses the decades-long legacy of homelessness in the Bay Area. She also spends time with mothers who have come together to fight the deadly drug problem there and talks with those struggling with homelessness and drug addiction themselves."
      },
      {
        "id": "tvmaze:2552687",
        "title": "Surviving Uvalde: Inside a School Shooting",
        "season": 1,
        "episode": 6,
        "released": "2023-05-21",
        "overview": "With new, exclusive reporting, CNN Senior Crime and Justice Correspondent Shimon Prokupecz takes an unprecedented look inside the school shooting in Uvalde, Texas, last May as the fight for answers and accountability endures.A year after the shooting at Robb Elementary School, just a handful of the hundreds of officers who responded have been held accountable. Families who lost everything still don't have a full picture of what happened and how it went so wrong. Without answers from officials in Texas, parents of Robb Elementary students who survived 77 minutes trapped with the gunman asked Prokupecz to show them the moments police finally breached the classroom and rescued their children – raw, never-released body cam footage and 911 audio that authorities refused to make public.\"It's hard to put into words how difficult it has been this past year covering the school shooting in Uvalde,\" said Prokupecz. \"It is, without a doubt, one of the toughest stories I've reported on in my career, and it's been a persistent and somber reminder of the devastating impact that gun violence can have on innocent people and communities. I hope our coverage sheds light on the undeniable work that still needs to be done to better protect children—and adults—from mass shootings, and I am humbled and grateful to the victims' families for allowing us to share their stories.\"In this episode, Prokupecz speaks with parents of victims, students who survived, Uvalde Mayor Don McLaughlin,and Texas State Senator Roland Gutierrez. Prokupecz and his reporting team were recently honored with a Peabody Award and a George Polk Award for their groundbreaking reporting in Uvalde."
      },
      {
        "id": "tvmaze:2559756",
        "title": "Indicted: The Case Against Trump",
        "season": 1,
        "episode": 7,
        "released": "2023-06-11",
        "overview": "CNN Chief Investigative Correspondent and Anchor Pamela Brown goes behind the headlines and into the case against former President Donald Trump. This week, Trump was indicted on thirty-seven counts in special counsel Jack Smith's probe into the former President's handling of classified documents since he left office. The indictment is a stunning development that marks the first time a former president has faced federal charges. Brown unravels the twists and turns in this investigation, starting with the day Trump left office to the new details revealed in this indictment.Senior Legal Affairs Correspondent Paula Reid, Senior Justice Correspondent Evan Perez, Senior Reporter for Crime and Justice Katelyn Polantz, and CNN Correspondent Randi Kaye break down the incredible story. CNN Chief Legal Analyst Laura Coates, Former FBI Deputy Director Andrew McCabe, and CNN Legal Analysts Elie Honig and Shan Wu describe the significance of this indictment and what it could mean for the 2024 election. Former Trump attorney Timothy Parlatore reviews the merits of this legal case. Also, CNN Senior Crime &amp; Justice Correspondent Shimon Prokupecz explores the looming threat of violence as law enforcement gathers in Miami ahead of Trump's first court appearance on Tuesday, June 13."
      },
      {
        "id": "tvmaze:2570355",
        "title": "Magic Mushrooms: Can They Change Your Mind?",
        "season": 1,
        "episode": 8,
        "released": "2023-06-18",
        "overview": "CNN Correspondent David Culver travels to Jamaica to explore the therapeutic benefits of medically supervised consumption of psilocybin, also known as magic mushrooms. The naturally stunning landscape of Jamaica is the backdrop for a resort that hosts psychedelic retreats, where it is legal to grow and consume magic mushrooms. While this practice is legal in Jamaica and now Oregon, psilocybin mushrooms for medical use are currently illegal under US federal law. A new wave of research is shifting the narrative around the safety and efficacy of psychedelics, leading to what some call a \"psychedelic renaissance\" and showing promise in treating multiple conditions like depression, anxiety, and substance abuse. However, we still don't know much about how psilocybin affects the brain, and many are asking if it's too soon to offer these treatments. This episode follows a group of everyday Americans who travel to Jamaica to try psilocybin to reconnect with themselves, curb addiction, and find inner healing.\"These retreat participants invited us in on what is a deeply personal and intimate journey aimed to find healing,\" Culver said. \"In hopes of better understanding their mind-altering trips, I also wanted to see if the mushrooms might work their therapeutic magic on me. Having lived and reported through China's relentless ‘Zero-Covid' policies, including harsh and punishing lockdowns, I wondered if the medicine – as they call it – might help me better process my nearly three years isolated from family and loved ones back in the US. The mushrooms took me on a journey I did not expect.\"In this episode, Culver also travels to Oregon, the first state to legalize psilocybin for therapeutic purposes. As more states in the US debate legalization, Culver looks inward and considers the lessons he can learn from his deeply personal experience in Jamaica."
      },
      {
        "id": "tvmaze:2580299",
        "title": "Deadly Adventure: Trip to the Titanic",
        "season": 1,
        "episode": 9,
        "released": "2023-07-02",
        "overview": "CNN National Correspondent Randi Kaye investigates this story that has rapidly captured the world's attention. On June 18, 2023, five passengers on the Titan submersible dived 13,000 feet to view the Titanic on the ocean floor and perished in a \"catastrophic implosion,\" authorities said Thursday, June 22. This bookended an astounding five-day international search operation near the site of the world's most famous shipwreck. Kaye unravels the timeline of events, starting with the Titan's initial descent and their last communication to the surface. As investigators continue to scour the ocean floor for debris trying to establish the circumstances of the Titan's fatal final voyage, Kaye breaks down everything we know now.This episode features interviews with the foremost experts on submersible travel and people close to the passengers, including OceanGate Expeditions investor Aaron Newman, Expedition: Unknown host Josh Gates, CEO of Underwater Forensic Investigators Tom Maddox, senior adviser for strategic initiatives for RMS Titanic Inc. David Gallo, and CBS Correspondent David Pogue."
      },
      {
        "id": "tvmaze:2593485",
        "title": "Wired for Trouble",
        "season": 1,
        "episode": 10,
        "released": "2023-07-09",
        "overview": "CNN Anchor and podcast host Audie Cornish delves into the perils of social media and chronicles the journey of three separate families, united by their efforts to hold social media companies accountable for the content published on their platforms. Cornish's investigation focuses on the experiences of three mothers and their children who have recently filed lawsuits against Meta, Snapchat, and TikTok. Their cases are part of a larger movement, with over five-hundred families currently suing the tech giants. The families claim the companies are exposing kids to harmful content and contributing to a mental health crisis among American adolescents – one that the US Surgeon General says is driven by social media. \"These families are at the forefront of a new way of thinking about the value of social media in our kids' lives,\" said Cornish. \"And their parents are helping to fuel a movement that could shape public opinion about whether tech companies could or should be made to do more to make their product safer.\" Cornish conducts interviews with Matthew Bergman, the attorney representing many of these families, the neuroscientists and psychology experts Mitch Prinstein and Eva Telzer about whether social media \"addiction\" is real, and longtime tech journalist Kara Swisher about the debate over who and how social media use should be regulated among kids."
      },
      {
        "id": "tvmaze:2599497",
        "title": "The Gilgo Beach Killer",
        "season": 1,
        "episode": 11,
        "released": "2023-07-23",
        "overview": "CNN Correspondent Brynn Gingras dives deeply into the 13-year investigation into multiple murders of young women along Gilgo Beach and the man, Rex Heuermann, who has now been charged with these crimes. Last week, Heuermann was arrested and charged with murder in connection with the killings of three of the \"Gilgo Four,\" a group of four women whose remains were found along a short stretch of Long Island's Gilgo Beach in 2010. He is also the prime suspect in the disappearance and killing of the fourth woman but has yet to be charged in that case. The alleged killer had been living a double life in a village a short drive from where their remains were found, prosecutors said.This episode examines the decades-long investigation with the foremost criminology experts, including former FBI Deputy Director Andrew McCabe, CNN Chief Law Enforcement and Intelligence Analyst John Miller, and author and journalist Robert Kolker (Lost Girls: An Unsolved American Mystery). Also featured are interviews with Heuermann's neighbors and local authorities, who unrivaled the mystery, including Suffolk County District Attorney Ray Tierney and Suffolk County Police Commissioner Rodney Harrison."
      },
      {
        "id": "tvmaze:2604744",
        "title": "What Happened in Georgia?: The Trump Investigation",
        "season": 1,
        "episode": 12,
        "released": "2023-07-30",
        "overview": "CNN Political Correspondent Sara Murray examines the case against former President Donald Trump over claims of election fraud and interference in Georgia and the chances of him being indicted again. Three months after the 2020 election, Fani Willis, the district attorney in Fulton County, Georgia, officially opened an investigation into former President Donald Trump's efforts to overturn the state's presidential election results. The sprawling case has involved some of the biggest names in the Trump orbit, and the entire investigation stems back to a single 2021 phone call between then-President Trump and Georgia Secretary of State Brad Raffensperger. Murray takes viewers inside the Georgia fake electors scheme, a secret plot to seize voting data by election deniers, and the extraordinary challenges of indicting a former President.\"As the 2024 election heats up, the investigation into former President Donald Trump and his allies in Georgia continues to drive news cycles and impact the political landscape,\" said Murray. \"We spoke to people who felt the former president's wrath and pushed back on efforts to disenfranchise thousands of voters. This is the behind-the-scenes story of what, exactly, happened in Georgia – beyond the now infamous 2021 phone call.\" Murray added, \"As the cases against Trump stack up, this isn't just a story about what happened during the last presidential race; it's a story about Donald Trump's future as a candidate, juggling his legal perils, and his quest for a second term in the White House.\"Featuring interviews with Georgia Secretary of State Brad Raffensperger, former Georgia Lieutenant Governor Geoff Duncan, former US Attorney Michael Moore, former Georgia State Senator Jen Jordan, Georgia Election Official Gabriel Sterling, and more, this episode zooms in on the high stakes of this investigation amidst an already unprecedented moment in American history."
      },
      {
        "id": "tvmaze:2609453",
        "title": "Weed 7: A Senior Moment",
        "season": 1,
        "episode": 13,
        "released": "2023-08-06",
        "overview": "Dr. Sanjay Gupta's duPont-Columbia Award-winning Emmy® nominated Weed series returns to explore the drug's risks and benefits in treating chronic issues such as pain, anxiety, and Alzheimer's disease in patients over 50. Between 2015 and 2018, cannabis use in seniors over 65 jumped 75%, and this age group now represents the fastest-growing group of cannabis users in the United States. In this episode, Dr. Gupta travels from research facilities in Tel Aviv, Israel – often referred to as \"the holy land of medical marijuana\" – to a senior living community in West Palm Beach running an experimental cannabis treatment pilot program, as he learns more about how seniors are using the drug for pain relief, better sleep, less anxiety, weight gain, and more. In California, he boards a \"cannabus\" providing transport to seniors who cannot otherwise access dispensaries and visits one of the largest cannabis growing operations in the world, where plants are designed with seniors in mind.\"Over the last decade reporting on medical marijuana, time and time again, what has surprised me the most is the optimism, the possibility, and the impact that carefully controlled cannabis can have, even on seniors, for a better quality of life,\" Dr. Gupta said.Featuring interviews with doctors and researchers at the forefront of the field, as well as first-person accounts from seniors about their experience using cannabis, \"Weed 7: A Senior Moment\" explores how the shifting stigma around the drug is impacting a growing number of seniors around the world, decreasing their prescription drug use, and improving their quality of life."
      },
      {
        "id": "tvmaze:2618895",
        "title": "Restaurant Nation: What's Changed?",
        "season": 1,
        "episode": 14,
        "released": "2023-08-13",
        "overview": "Celebrity chef Bobby Flay examines how the pandemic changed the restaurant industry and the unique ways chefs and restaurants across the country have adapted.Flay, whose own New York City restaurant was among the more than 110,000 restaurants that closed in 2020, embarks across the country to meet the restaurants, chefs, and entrepreneurs that pivoted to a new way of serving customers by implementing new digital business models and offering more than just food and drinks. From establishing employee equity plans to the rise of outdoor dining and ghost kitchens, Flay takes viewers into the restaurants that are revolutionizing how we think about dining out and what customers can expect. In this episode, Flay rides with DoorDash to find out how the food delivery giant handled the enormous demand during the pandemic and has since evolved.\"The pandemic altered the restaurant industry forever, ushering technological advances that have changed our habits and how we dine out,\" said Flay. \"This is a seismic shift that deserves the attention that only CNN can bring to it. It is an honor to join The Whole Story, which is producing the most compelling reporting on television, and I am very honored to play a part in sharing this important story.\"This episode features interviews with Chef Chris Bianco of Pizzeria Bianco in Phoenix and Los Angeles; Chef Esther Choi of MokBar in New York City; Chef Cat MacDowell of Downtown Louisville, KY; Chef Bonnie Morales, who owns Kachka in Portland, OR with her husband Israel Morales; and Jason Johnson who runs getREEF, a virtual food hall at the Raleigh/Durham airport in North Carolina."
      },
      {
        "id": "tvmaze:2624405",
        "title": "Trump and the Georgia Conspiracy",
        "season": 1,
        "episode": 15,
        "released": "2023-08-20",
        "overview": "A Fulton County Grand Jury in Georgia indicted former President Donald Trump and 18 co-conspirators with racketeering charges related to the 2020 election. Trump now has four indictments this year. CNN Political Correspondent Sara Murray examines everything that occurred in Georgia and how this led to the indictment. She looks at how strong the case against Trump is and what it could mean for democracy if he is convicted."
      },
      {
        "id": "tvmaze:2632181",
        "title": "Without Roe: The New Abortion Landscape",
        "season": 1,
        "episode": 16,
        "released": "2023-09-03",
        "overview": "A network of pilots and organizers helps women travel to doctors nationwide to access legal abortion procedures. Since the overturning of Roe v. Wade, at least 21 states have banned or restricted abortions, forcing countless women to travel hundreds of miles to seek care. \"Without Roe: The New Abortion Landscape\" examines the ongoing state-by-state struggle over whether abortion should remain accessible in America, featuring advocates coming together to protect access to the procedure while opponents try to restrict it. Th1s episode follows people whose paths had never crossed before coming together to protect access to the procedure: Alamo Women's Clinic moving its practice from Texas; a goat farming reproductive rights organizer with Midwest Access Coalition coordinating funding and logistics for patients; and an underground network of volunteer pilots known as Elevated Access transporting abortion providers and patients on small, private aircraft to ease the burden of their long journeys. Many paths lead to Carbondale in southern Illinois, fast becoming an oasis of abortion access surrounded by a sea of states like Tennessee, Kentucky, and Missouri that have banned or restricted the procedure. With rare access inside the clinic, the documentary also features stories of women seeking care. It chronicles intimate moments of hope and fear, all shrouded in a veil of danger, as the stakes for providers, volunteers, and patients could not be higher, each with lives on the line."
      },
      {
        "id": "tvmaze:2638547",
        "title": "Hard Hits: Can Football be Safe?",
        "season": 1,
        "episode": 17,
        "released": "2023-09-10",
        "overview": "CNN Sports Anchor and Correspondent Coy Wire marks the first week of the NFL season with an investigation into how new developments in the sport aim to make the game safer for players. From peewee leagues to flag football and Friday night lights in high schools across the country, football is a way of life for many Americans in the fall. However, the average professional football player's career is just 3.5 years, and the sport comes with huge risks to both the body and brain. In this episode, Wire, who played in the league for nine seasons, speaks with NFL head coaches Andy Reid and Sean McDermott, XFL co-owners Dwayne \"The Rock\" Johnson and Dany Garcia, and Jeff Miller, who oversees player health and safety for the NFL, about how the game is revolutionizing to prioritize players' well-being.\"This is not the game that I played – it's a whole new NFL,\" said Wire. \"From unprecedented mid-game cancellations after injuries out of respect for players' health and well-being, to the futuristic technology being used to track, analyze, and potentially detect injuries before they happen, this experience has blown me away and has sparked even greater hope for the future of the game I love.\"Wire goes behind the scenes at the 2023 training camps of the New York Giants and the Atlanta Falcons, and the episode features his reporting from the 2023 NFL Draft and XFL Championship Game. Wire also visits Biocore, an NFL-funded research lab, where he personally tests out some of the league's most cutting-edge innovations as they seek to make the game safer."
      },
      {
        "id": "tvmaze:2642910",
        "title": "Ukraine: Dancing in Defiance",
        "season": 1,
        "episode": 18,
        "released": "2023-09-17",
        "overview": "CNN's Chief International Anchor, Christiane Amanpour, covers the remarkable story of Ukrainian ballet dancers who faced the wrenching decision to either leave their homes and show the world the face of Ukrainian culture or stay behind to continue performing in a war zone. This episode follows members of the Holland-based United Ukrainian Ballet Company, composed of dancers displaced from Ukraine in the fastest-growing refugee crisis in Europe since World War II. CNN's cameras capture intimate moments of dancers grappling with survivor's guilt as their families remain on the front lines, all while remaining determined to fight for their culture. The pressure rises as they prepare to perform at the Kennedy Center in Washington, DC – one of the most prestigious stages in a country with the power to determine the fate of their nation. In Kyiv, Amanpour spoke with dancers who have chosen to stay and perform at the National Opera and Ballet Theater in their home country, offering a brief respite from the war to audiences and defending Ukrainian culture from annihilation, even as sirens and air raid alerts ring out. The theater reopened three months after the war broke out and limited its audience to a fifth of its capacity – the maximum its bomb shelter could hold.\"Speaking to this troupe of ballet dancers, we learn that making art during war is a form of resistance and defiance,\" said Amanpour. \"Ukrainians are also cementing their separate cultural heritage in the face of Russia's attempts to deny and wipe out their history.\""
      },
      {
        "id": "tvmaze:2647685",
        "title": "Waiting for JFK: Report from the Fringe",
        "season": 1,
        "episode": 19,
        "released": "2023-09-24",
        "overview": "CNN Correspondent Donie O'Sullivan presents a chilling year-long investigation into the devoted followers of a fringe conspiracy theory rooted in QAnon ideology. O'Sullivan tracks the stories of Americans consumed by a conspiracy theory that John F. Kennedy and John F. Kennedy Jr. are still alive and descended from Jesus Christ. In reporting the documentary, he went to Dallas, where Michael Protzman, then a leader in this conspiracy theory, had convened his followers at the Grassy Knoll, waiting for JFK or JFK Jr. to reappear. Protzman had no solid answers to O'Sullivan's questions. Several months after that interview, Protzman died in a motorcycle accident, a death some of his followers refuse to believe. O'Sullivan casts more light on Protzman and his movement by speaking to his mother about how her son lost himself into the web of conspiracy theories, how it tore their family apart, and whom she blames for it all.\"Every night, an untold number of Americans sit down for dinner and often hear increasingly bizarre conspiracy theories being repeated by a loved one. Confusion and frustration give way to a sense of helplessness as many watch their moms, dads, brothers, or sisters being sucked further and further down the rabbit hole,\" says O'Sullivan. \"With so much focus on the conspiracy theories and the conspiracy theorists, we wanted to show the real impact that this is having on American families – the true victims of our post-truth society.\"O'Sullivan goes beyond the spectacle of the bizarre conspiracy theory and speaks with heartbroken family members of those whose loved ones have left home and waited in Dallas for months for the supposed return of the Kennedys. He also speaks with the founder of a nonprofit helping those leaving cults and hate groups, author Diane Benscoter, who believes this group is a cult."
      },
      {
        "id": "tvmaze:2665863",
        "title": "Terror in Israel",
        "season": 1,
        "episode": 20,
        "released": "2023-10-15",
        "overview": "CNN Anchor Anderson Cooper provides an in-depth look at the devastating attack on The Nova Festival near the Gaza-Israel border.The outdoor music festival was supposed to be an all-night dance party, celebrating the Jewish holiday of Sukkot. The rockets began around 6:30 a.m. as Gaza militants fired at the hundreds of attendees. The Nova Festival was one of multiple locations hit last Saturday morning by the most sustained and coordinated assault inside Israel ever carried out by Hamas militants. At least 260 bodies would later be found at the festival site, and some attendees were taken hostage, seen in social media videos being seized by their armed captors.Featuring new interviews with survivors and eyewitnesses of the attack and family members of kidnapped victims, Cooper breaks down everything we know so far about the deadly assault and how this surprise attack escalated into war."
      },
      {
        "id": "tvmaze:2668596",
        "title": "Inside Hamas",
        "season": 1,
        "episode": 21,
        "released": "2023-10-22",
        "overview": "CNN Anchor and Senior National Correspondent Sara Sidner provides a comprehensive overview of the extremist group Hamas. Sidner explores the origins and philosophy of Hamas, including their current military capabilities and how the organization just inflicted the deadliest attack in Israel's 75-year history, overwhelming the most powerful and advanced military in the Middle East.Featuring archival CNN reporting in the region and interviews with CNN experts, including Chief International Anchor Christiane Amanpour, Senior International Correspondent Sam Kiley, and International Diplomatic Editor Nic Robertson, Sidner unravels the complicated history of Hamas and the catalysts that led to the terrorist attack on Israel."
      },
      {
        "id": "tvmaze:2676034",
        "title": "Hostage to Terror",
        "season": 1,
        "episode": 22,
        "released": "2023-10-29",
        "overview": "CNN Anchor Anderson Cooper provides new reporting on the families of those kidnapped from Nir Oz in Southern Israel. A mile from Gaza, the Nir Oz kibbutz was targeted during the October 7 terrorist attack, and earlier this week, residents Yocheved Lifshitz and Nurit Cooper were two of the hostages released by Hamas. Speaking with survivors and family members, Cooper reveals the devastating details about what happened on that fateful Saturday and how the survivors have been coping as more than a quarter of the people who lived in the kibbutz are dead or missing."
      },
      {
        "id": "tvmaze:2685225",
        "title": "Antisemitism in America",
        "season": 1,
        "episode": 23,
        "released": "2023-11-12",
        "overview": "CNN Anchor and Chief Political Correspondent Dana Bash delivers an in-depth examination of the rise of antisemitism in the United States, following the October 7 attack on Israel. Antisemitism was already on an alarming rise even before October 7 with near 60% of religious hate crimes perpetrated against the Jewish community, despite it making up just 2.4% of the American population according to the FBI. Bash investigates not just what the attacks against Jews are but why they are so pervasive right now.  Antisemitism and its conspiracies and tropes run deep in society and has for millennia, but in modern times it has largely festered beneath the surface. In America, that changed in the last ten years with extremists from the hard right feeling emboldened by the political climate. But antisemitism has also been brewing on the hard left, masquerading as political free speech, especially at America's elite universities.The episode features the emotional testimony of Jewish college students experiencing fear, and even an assault, following the attack on Israel by Hamas last month, as well as interviews with U.S. Ambassador to Monitor and Combat Antisemitism Deborah Lipstadt, Director of the Anti-Defamation League Jonathan Greenblatt, President and CEO of Hillel International Adam Lehman, and Dean of the UC Berkeley School of Law Erwin Chermerinsky and more."
      },
      {
        "id": "tvmaze:2686502",
        "title": "Going Home: The War in Sudan",
        "season": 1,
        "episode": 24,
        "released": "2023-11-19",
        "overview": "CNN Chief International Investigative Correspondent Nima Elbagir reports a deeply personal dispatch from her home country Sudan.Millions of people have fled the country as stories of brutal war crimes leak from the capital. Still, Elbagir was determined to shed light on these atrocities and uncover how the people of Sudan are coping. From a refugee camp near the southern border where nearly 2.8 million people have fled the war, she travels north into war-torn Sudan, making a trek that very few Western media organizations have been allowed to make. Her destination is the capital city of Khartoum, one of two major areas where the fighting is concentrated and where her family home is located. But the journey will not be easy – she must circumnavigate dangerous checkpoints to avoid confrontation with paramilitary groups who do not want her in Sudan.\"To report on my own country, to feel so many of the wounds of those we interviewed on such a visceral level, and to know that the outcome of the war and the consequences of our reporting would impact not only my life but the lives of the people I love, was only possible because so many Sudanese were so generous in allowing us in,\" said Elbagir. \"Whether it's in Sudan or Ukraine or any other seemingly endless conflict, too many of us know what it feels like to wake up not knowing if there will even be a home for us to go back to, with the heartbreak of knowing home is no longer a haven. I hope the audience will walk away feeling like we gave them a glimpse into that reality.\"Elbagir uncovers first-person accounts from survivors and eyewitnesses of horrific war crimes, including ethnic cleansing and sex slavery. She also uncovers critical information about ongoing foreign influences funding and supporting the war."
      },
      {
        "id": "tvmaze:2658088",
        "title": "Seeing Red: Running with the Bulls",
        "season": 1,
        "episode": 25,
        "released": "2023-11-26",
        "overview": "CNN Senior National Correspondent David Culver reports a nail-biting account of the world-renowned and controversial running of the bulls from the streets of Pamplona, Spain.Culver follows a group of runners in the weeks and days leading up to the annual running of the bulls at the San Fermín Festival in Pamplona, a tradition held since 1591. Since record-keeping began in 1910, 16 people have died participating in Pamplona, and the most recent bull run fatality occurred just last week in Valencia, Spain. Culver embeds with the group as they prepare for the perilous event, guided by experienced runners who have entered hundreds of bull runs and even been gored. As the day of the run approaches, Culver decides to suit up in the traditional white garb and red scarf and try it out himself – well aware of the dangers but hoping to understand the thrill some find.\"I was well aware of the dangers – and what some might consider to be the insanity – of running with the bulls,\" said Culver. \"But having met folks so deeply passionate about and protective of this controversial tradition, I wanted to join for one of the eight bull runs, if only to try to better understand the thrill they speak of.\" Culver added, \"Turns out, one run was enough for me!\"Culver also investigates the highly divisive activity of bullfighting, the ritual killing of the bulls following the morning's run. Bullfighting is condemned by animal rights groups and banned in many countries. Still, the tradition persists throughout Spain, with many there considering it an integral part of their heritage and culture."
      },
      {
        "id": "tvmaze:2699273",
        "title": "AI and the Future of Humanity",
        "season": 1,
        "episode": 26,
        "released": "2023-12-03",
        "overview": "CNN National Correspondent Nick Watt presents an enlightening report on both the promises and the dangers of artificial intelligence. The AI revolution is already underway and changing many aspects of human life, from creating art to fighting wars to curing disease. But leading experts warn this powerful technology is advancing at an alarming rate, posing serious risks to humanity itself. Watt takes viewers inside the global race to develop this technology and the attempts to contain it.\"AI is already inside and all over our lives,\" said Watt. \"You can't hide. All of us have to face it and figure out how we'll fit into this inevitable future. I was scared. Now at least I know what's coming.\"Watt crosses the globe, tracking some of the most stunning and innovative uses of AI, from a next-generation Hollywood film studio to a research team in Switzerland making history by restoring a paralyzed man's ability to walk. Watt also speaks with the experts on the cutting edge of these technologies now working to combat AI's threats to society and democracy and who are calling for urgent government regulation of the tech."
      },
      {
        "id": "tvmaze:2716588",
        "title": "Homebirth Journey: Saving Black Moms",
        "season": 1,
        "episode": 27,
        "released": "2023-12-17",
        "overview": "CNN Anchor Abby Phillip details an intimate and heartrending report on Black maternal health and mortality. she delves into why a growing number of Black women are choosing to give birth at home and foregoing the care of a doctor in a hospital. Phillip meets with some of these women and examines the deep distrust that many Black women feel when it comes to hospital care, even celebrities like Serena Williams and Beyonce with access to world class healthcare. Phillip speaks with obstetricians who have watched as the maternal mortality statistics in the US have gone in the wrong direction and she reveals her own personal story of homebirth with the help of a doula.\"The deeply personal journey to this story began with my own pregnancy in 2020,\" said Phillip.  \"Like millions of black women, I simply wanted to feel safe and stay alive when giving birth to my daughter. The women featured are each in their own way changing the face of both the black maternal health crisis and its solutions.\" Phillip added \"this episode is a journey from fear to empowerment with lessons that could help save the lives of ALL women.\"In this episode, Phillip shadows a shift at a midwife-led maternity ward at the MLK Jr. Community Hospital in Los Angeles, where they credit their better-than-national-average statistics to the unusual partnership between their doctors and midwives. She also visits Kindred Space, the only Black-owned birthing center in LA, where midwives are fostering a sense of community and safety for pregnant women."
      },
      {
        "id": "tvmaze:2729384",
        "title": "Miracle on the Hudson: Fifteen Years Later",
        "season": 2,
        "episode": 1,
        "released": "2024-01-07",
        "overview": "Ahead of Flight 1549's anniversary, The Whole Story with Anderson Cooper exclusively sits down with its captain, Ambassador C.B. \"Sully\" Sullenberger, and passengers to reflect on how this extraordinary event has changed their lives forever.On January 15, 2009, Captain Sullenberger and First Officer Jeff Skiles miraculously landed US Airways Flight 1549 safely in the Hudson River after both engines were disabled by a bird strike, saving all 155 people on board. The heroic act, arguably the most famous emergency landing in modern aviation history, captivated the nation and was later dramatized in the 2016 Warner Brothers Pictures film Sully.In a series of intimate interviews with Sullenberger and his wife, Lorrie, and passengers Vallie Collins, Ric Elias, Barry Leonard, Clay Presley, Pam Seagle, and Eric Stevenson, The Whole Story reveals the harrowing details of that fateful day and the psychological effects that continue fifteen years later, leading some to alter the course of their lives drastically."
      },
      {
        "id": "tvmaze:2752444",
        "title": "Superyachts and the Super Rich",
        "season": 2,
        "episode": 2,
        "released": "2024-01-28",
        "overview": "The series returns with an inside look into the exclusive and luxurious world of the ultra-wealthy at sea. CNN Anchor/Correspondent Alisyn Camerota journeys to Monaco, the richest country in the world per capita, during the annual Monaco Yacht Show, one of the greatest concentrations of wealth in the world and a major annual event for the ten billion dollar a year yachting industry. Camerota tours some of the largest superyachts in existence and speaks to owners, captains, crew and industry leaders to examine the appeal of these floating islands, what it takes to build and maintain these symbols of extreme wealth, their environmental impact and the symbolism it holds for the world's economic divide.\"Before this assignment, I couldn't imagine the level of opulence and wealth we'd find – I'd never seen floors made of wood from a 16th Century monastery or wallpaper made of Italian leather,\" said Camerota. \"But what most surprised me was the universal desire for more – bigger, newer, more extravagant yachts – from the richest people in the world, telling us that even huge superyachts aren't enough.\"In this episode, Camerota also reports on how superyachts are now a matter of geopolitical concern. As the U.S. and European countries seized more than a dozen vessels allegedly belonging to Russian oligarchs, leaving American taxpayers on the hook to shell out millions of dollars in maintenance and upkeep."
      },
      {
        "id": "tvmaze:2759259",
        "title": "What Whales Tell Us",
        "season": 2,
        "episode": 3,
        "released": "2024-02-04",
        "overview": "The series returns with a visually stunning dispatch from the far corners of the world, as CNN's Chief Climate Correspondent Bill Weir follows the humpback whale migratory journey from Antarctica all the way to the coast of Colombia. Humpback whales have the longest migration route of any mammal on earth, and in this immersive episode, Weir embeds with a team of researchers as they venture from Antarctic ice to rich South American jungles, hoping to discover the impact of climate change on these magnificent creatures. While humpback whales have made a spectacular comeback in the last fifty years and are considered a beacon of modern conservation, they are now having to face some of the biggest existential threats of all. On this journey, Weir confronts one of the last of the whale hunters in Iceland and while climate change deniers blame offshore wind development for a spate of dead animals washing ashore, he digs for the truth with some of the leading experts in the world. Amid the striking landscapes and diverse coastlines, Weir also learns how whales have the ability to absorb and store carbon, making them one of our greatest allies in the battle against climate change.\"I was a little boy when recordings of humpback songs sparked a movement to save the whales and reversed a manmade extinction,\" said Weir. \"Fifty years later, artificial intelligence could help us understand the lyrics of those songs just as science realizes the enormous ocean repair services provided by whales. They are literally the biggest allies we have in the fight against climate change, and by saving them, we help save ourselves.\""
      },
      {
        "id": "tvmaze:2770262",
        "title": "The United States v. Donald J. Trump",
        "season": 2,
        "episode": 4,
        "released": "2024-02-18",
        "overview": "CNN Anchor and Chief Legal Analyst Laura Coates presents an in-depth examination of former President Donald Trump's federal election subversion trial. In August 2023, less than a year after Attorney General Merrick Garland appointed Jack Smith as special counsel to investigate Trump, the former president was indicted on federal felony charges stemming from his efforts to overturn the 2020 presidential election. Trump has pleaded not guilty to all charges. Time is of the essence with this trial as Trump is far and away the leading Republican candidate for the presidential election in November, and Coates unpacks everything at stake as the case continues to unfold. She examines little-known aspects of the case that have been revealed by court filings and connects the dots between Trump and his cohorts' attempts in court to overturn the election across multiple crucial swing states, the secretive plot to replace Biden electors with those who would vote for Trump, and how these efforts climaxed with one last desperate attempt to stay in office on January 6.  \"Finally – a comprehensive look behind the curtain with everything on the table, and everything on the line,\" said Coates. \"We combine all the puzzle pieces and give you the most complete pre-trial picture of the definitive case for democracy.\"This episode features interviews with Former US Representative and January 6th Committee Member Adam Kinzinger, Former White House Deputy Press Secretary Sarah Matthews, Georgia State Senator Elena Parent, Former Lieutenant Governor of Georgia Geoff Duncan, January 6th Committee Investigator Marcus Childress, Former US Attorney Harry Litman and more."
      },
      {
        "id": "tvmaze:2783802",
        "title": "What Happened to Tennessee? The Battle of Blue and Red",
        "season": 2,
        "episode": 5,
        "released": "2024-03-03",
        "overview": "CNN Political Commentator and former Obama administration official Van Jones delivers an incisive examination of the state of politics in Tennessee. He returns to his home state in the lead-up to the Republican primary election on Super Tuesday. In April 2023, Tennessee's Republican-controlled House of Representatives voted to expel two Black lawmakers a week after they joined a gun reform protest in the chamber prompted by a deadly shooting at a Nashville school. This remarkably rare and emotionally charged decision set the scene for Jones' return to his home state and his former place of employment in the state capitol, where he interned for the House Majority Leader in 1989. Jones unpacks how Tennessee's politics have swung sharply to the right since then by examining how gerrymandered redistricting, racial tensions, and \"culture war\" rhetoric have transformed the state government into a conservative supermajority. The trend set by Tennessee has played out across the southern US.\"In the Tennessee in which I was born and raised, we always had our struggles. But people usually tried to treat each other in a decent and neighborly way.\" said Jones. \"But I returned to find the state legislature that launched my political career transformed beyond recognition — by a ham-fisted, hard-hearted politics of open hostility to minority viewpoints.\"Tennessee represents a national tug-of-war over the direction of the country's politics at large. Jones speaks with politicians on both sides of the aisle to get their take on the tribalism between parties and its implications for the future of governing. This episode features interviews with reinstated Democratic State Representatives Justin Jones and Justin J. Pearson, Republican State Representative Gino Bulso, Republican Sumner County Commissioner Matthew Shoaf, Chair of the Tennessee Democratic Party Hendrell Remus, local organizers, and even members of Jones' family."
      },
      {
        "id": "tvmaze:2797436",
        "title": "The Deputy and the Disappeared",
        "season": 2,
        "episode": 6,
        "released": "2024-03-17",
        "overview": "CNN Anchor and Chief Legal Analyst Laura Coates premieres an in-depth investigation into two missing person cases with one mysterious connection that has drawn national intrigue.In 2003, two men of color, Felipe Santos and Terrance Williams, went missing three months apart in Naples, Florida. Both vanished on the same road after getting in a patrol car driven by the same white deputy sheriff, Steven Calkins, who remains the last known person to have seen either of them alive. Twenty years later, Santos and Williams are presumed dead, the cases are cold, and Calkins has never been arrested or charged and maintains his innocence. The case garnered little media attention until 2018 when filmmaker Tyler Perry enlisted Civil Rights Attorney Ben Crump to file a wrongful death lawsuit against Calkins on behalf of Terrance Williams' mother. Following up on CNN crime reporter Thomas Lake's meticulous reporting, Coates and Lake return to the scene of the disappearances to explore new leads and speak with a witness coming forward for the first time.\"You will be spellbound by this unbelievable story of a mother's determination to find her son in the face of every obstacle,\" said Coates. \"What do you do when you don't know who to trust—even the investigators?\"Coates and Lake uncover disturbing allegations about former deputy sheriff Calkins' background, speaking with investigators on the case and a former colleague of Calkins who comes forward alleging newly revealed details about their time working together. Coates also speaks with Williams' family members, including his son Tarik, who speaks publicly for the first time about his father's disappearance."
      },
      {
        "id": "tvmaze:2801971",
        "title": "Justice Delayed: The Story of C.J. Rice",
        "season": 2,
        "episode": 7,
        "released": "2024-03-24",
        "overview": "This episode follows CNN Anchor and Chief Washington Correspondent Jake Tapper's efforts to shine a light on the harrowing story of C.J. Rice, a Philadelphia man convicted of attempted murder in 2013. Two years before his conviction, Rice, then 17 years old, was shot three times, with a bullet fracturing his pelvis, making it nearly impossible for him to walk. He turned to his childhood physician and Tapper's father, Dr. Theodore Tapper, to help him recover. But just three weeks after Rice was shot, he was accused of shooting four people and fleeing the scene, which, according to Dr. Tapper, would have been virtually impossible to commit in his poor physical state. Despite Dr. Tapper testifying to that fact, Rice was later convicted of these crimes in 2013 and sentenced to 30 to 60 years in prison.After speaking with his father about the case, Jake Tapper published a thorough, long-form investigation in The Atlantic in October 2022 called \"This Is Not Justice: A Philadelphia teenager and the empty promise of the Sixth Amendment,\" diving into what happened the night of the shooting, how little evidence there was against Rice, and revealing how ineffective representation led to his wrongful conviction. Rice's attorneys, Karl Schwartz, Amelia Maxfield of the Exoneration Project, and Nilam Sanghvi of the Pennsylvania Innocence Project, made this precise argument that Rice was denied his Sixth Amendment right to adequate counsel to the Philadelphia District Attorney's Office. District Attorney Larry Krasner's office investigated the matter and agreed. On the morning of Monday, March 18, a Philadelphia judge granted a motion from the Philadelphia District Attorney exonerating Rice. C.J. Rice is a free man after more than twelve years in prison.\"Covering C.J.'s struggle and the efforts of my dad and the amazing lawyers to get him out of prison has been one of the most remarkable and rewarding journalistic experiences of my life,\" Tapper said. \"I'm so glad the story has a happy ending, and I am immensely grateful to The Atlantic and to CNN for giving me the platforms to tell this story.\"In an emotional reunion, Tapper and his father reconnect with Rice, who speaks for the first time in an expansive interview. In \"Justice Delayed: The Story of C.J. Rice,\" Tapper recreates the scene of the shooting and the events that followed to illustrate clearly how the system failed Rice. The episode also follows Rice's time in prison in his own words through the powerful letters Rice sent to Dr. Tapper throughout the years."
      },
      {
        "id": "tvmaze:2805731",
        "title": "Hostages: The Road Home",
        "season": 2,
        "episode": 8,
        "released": "2024-04-07",
        "overview": "CNN Anchor and Senior Global Affairs Analyst Bianna Golodryga marks the six-month anniversary of the deadliest attack in Israel's 75-year history with an emotional episode.Six months after Hamas militants launched a surprise attack on Israel, Golodryga speaks with family members of some of the over 250 men, women, and children kidnapped on October 7, 2023. She speaks with parents who have seen the capture of their children in footage released on social media by Hamas and a woman who survived by barricading herself in a safe room, only to find that her children, who had been staying in their father's home nearby, had been taken. Frustrated by little movement towards a hostage deal, one of the families set up a protest station near IDF headquarters in Tel Aviv. In the past six months, some have since reunited with their missing family members, and some continue fighting.\"It is important to remember that the hostages are people with brothers and sisters, spouses, children and parents,\" said Golodryga. \"What these families have endured is unimaginable, and I'm honored they shared their stories with CNN and the world.\"Golodryga also speaks directly with released hostages about the conditions of their captivity and their emotional messages for those that they were forced to leave behind upon their release."
      },
      {
        "id": "tvmaze:2836792",
        "title": "Elephant Vs. Man",
        "season": 2,
        "episode": 9,
        "released": "2024-04-21",
        "overview": "CNN Chief International Security Correspondent Nick Paton Walsh takes an inside look at the fatal conflict playing out between elephants and mankind in Sri Lanka. In Sri Lanka, it's an all-out war between man and the Asian elephant. As the human population surges and their territories expand, the habitats for elephants are rapidly shrinking, leading to daily confrontations between the people who are trying to protect their homes, and the elephants who are losing theirs. Paton Walsh embeds with locals on overnight patrols who risk their lives to protect their crops from being trampled and villages from being charged by elephants during the night.\"This is not just a story about us taking away the spaces and greenery elephants have existed upon for centuries: be in no doubt, we are forcing them into tinier spaces so we can have more and more for ourselves, all the time, in the name of growth. It is a story about every fight for space happening on the planet now,\" said Paton Walsh. \"Wars, migration, land disputes – they are all a symptom of our species' ravenous need to expand. In Sri Lanka, it is visually writ large. Elephants and people do not naturally interact, but here they scrap over a pumpkin. This conflict, which kills hundreds on both sides every year, is just a very vivid way of seeing the impact of our greed on the natural world that sustains us.\"There are about 6,000 elephants in Sri Lanka and in 2023 humans killed 476 of them; elephants killed 169 people. As both elephants and people continue to die at an alarming rate, this violent struggle may be an ominous sign of what's in store for other wildlife across the globe impacted by climate change and human expansion."
      },
      {
        "id": "tvmaze:2839545",
        "title": "MisinfoNation: The Trump Faithful",
        "season": 2,
        "episode": 10,
        "released": "2024-04-28",
        "overview": "CNN Correspondent Donie O'Sullivan investigates the surge of misinformation on Americans' social media feeds, in their churches, and in their homes. Just over six months out from the next presidential election, a battle for facts, decency, and democracy is playing out far from debate stages and TV studios. O'Sullivan dives deep into this undercurrent of viral misinformation by speaking directly to those who believe in conspiracy theories and those trying to battle them.\"Conspiracy theories that might have been considered fringe in the past are having an increasingly important effect on the American political mainstream,\" said O'Sullivan. \"The convincing of millions of Americans to falsely believe the 2020 election was stolen has opened a gateway to an alternate reality of more conspiracy theorists – a world where it wasn't really Trump supporters that attacked the Capitol on January 6 and a world where Taylor Swift can rig the Super Bowl.\"In \"MisinfoNation,\" O'Sullivan visits a church where scripture competes with QAnon, meets a January 6 felon who is now running for Congress, spends a day in the alternate reality of the Trump social media universe, goes behind the viral Taylor Swift Super Bowl conspiracy theory, and speaks to a Neo-Nazi skinhead turned pastor who has a warning for America about Christian Nationalism."
      },
      {
        "id": "tvmaze:2845640",
        "title": "Warning To The World: Australia's Climate Disasters",
        "season": 2,
        "episode": 11,
        "released": "2024-05-05",
        "overview": "CNN Senior International Correspondent Ivan Watson takes a sweeping look at the numerous natural disasters plaguing Australia, and how its changing climate could be a cautionary tale for countries across the globe.  On Watson's journey off the coast of Australia, he learns about the death and destruction being caused by human activity both on land and under the water. Apocalyptic forest fires, storms and floods exacerbated by climate change at an unprecedented scale are threatening communities and Australia's most iconic species. In the Great Barrier Reef, a global record-breaking marine heat wave is causing the temperature of the water to rise, resulting in coral bleaching and dying. Watson speaks with the people trying to reverse the damage and prepare for the future.\"Australia is a country- a continent- on the front lines of climate change, with entire communities and eco-systems threatened by increasingly unpredictable natural disasters,\" says Watson. \"On this journey, I was so lucky to see amazing natural treasures worth fighting to protect and save.\"In this episode, Watson traverses the rugged and remote Kangaroo Island, scubas in the Great Barrier Reef, explores the protected oasis of Lady Elliott Island and more of Australia's diverse panorama."
      },
      {
        "id": "tvmaze:2856916",
        "title": "The Playing Field: The Battle Over Transgender Athletes",
        "season": 2,
        "episode": 12,
        "released": "2024-05-12",
        "overview": "The series returns with immersive reporting on transgender student-athletes, a community finding themselves at the center of a culture war. At least 24 states in the US have already passed some form of ban on trans student-athletes. This episode deeply examines the stories of those targeted by this legislation, following them for more than a year. The episode follows the emotional journey of a trans high school softball player who advocates for her right to play on her school's girls' softball team all the way to the Ohio State Senate. It also features the story of a trans college swimmer in New Jersey hoping to successfully petition the NCAA to allow her to switch from competing on the men's team to the women's team.\"The Playing Field\" also features reporting from inside the annual meeting of an advocacy group calling for a ban on transgender women in women's sports divisions, arguing that transgender athletes have an unfair competitive advantage. Although a 2017 Sports Medicine study concluded there is \"no direct or consistent research\" showing that transgender people have an athletic advantage, psychologists, medical doctors, and former and current athletes gather to argue otherwise."
      },
      {
        "id": "tvmaze:2863296",
        "title": "The Last Alzheimer's Patient",
        "season": 2,
        "episode": 13,
        "released": "2024-05-19",
        "overview": "CNN Chief Medical Correspondent Dr. Sanjay Gupta takes a groundbreaking look at the latest medical research showing that symptoms of Alzheimer's disease can be prevented, slowed, and potentially even reversed. In a report spanning five years, Dr. Gupta follows Alzheimer's patients through their courses of treatment and explains why so many experts are calling it the \"most hopeful\" era for dementia patients and their loved ones. A practicing neurosurgeon, Dr. Gupta also evaluates the pros and cons of the latest tests designed to measure an individual's risk for the disease. He even undergoes the battery of tests himself, weighing his own risk for the world's most common neurodegenerative disorder.\"Preventing problems down the road is health care, instead of sick care,\" said Dr. Gupta. \"Today, getting off the road to Alzheimer's disease and other dementias is so much simpler than we previously thought. The decisions we make every day – to eat healthy, to move more, to learn new skills, and to spend time with loved ones – sounds easy, but the evidence is clear. It can, and it will, lead to better brain health.\"Today, nearly 7 million Americans are living with Alzheimer's disease. In \"The Last Alzheimer's Patient,\" Dr. Gupta also details what viewers can do in their everyday lives that could help drive down their own risk for developing the devastating disease."
      },
      {
        "id": "tvmaze:2891419",
        "title": "D-Day: Why We Still Fight for Democracy",
        "season": 2,
        "episode": 14,
        "released": "2024-06-02",
        "overview": "This episode premieres with CNN Anchor and Chief Washington Correspondent Jake Tapper days before the 80th anniversary of D-Day with an incisive analysis of how the fight for democracy continues across the world today featuring insight from World War II veterans.80 years after the Allied invasion of Normandy laid the foundation for the defeat of Germany in World War II, Tapper reflects on the sacrifices made to save democracy then, and how democratic governance is now diminishing across the globe. This year more than half of the world's population will vote in elections as democratic ideals and norms in the United States and many countries are being undermined.\"As we face the disturbing reality that democracy has been diminishing across the globe for 17 straight years, it's important to remember a time when the largest amphibious invasion in history was executed to, above all, advance the fight for democracy,\" said Tapper. \"In the midst of a worldwide erosion of democratic institutions, I wanted to speak with veterans and military generals who most understand the human cost of protecting democracy.\"\"D-Day: Why We Still Fight for Democracy\" features interviews with World War II veterans and generals including former US Secretary of Homeland Security General John F. Kelly, former US Secretary of Defense General James N. Mattis, and former US Chairman of the Joint Chiefs of Staff General Mark A. Milley."
      },
      {
        "id": "tvmaze:2900212",
        "title": "Drag War",
        "season": 2,
        "episode": 15,
        "released": "2024-06-09",
        "overview": "CNN National Correspondent Randi Kaye presents a colorful examination of how the art of drag performance has become a major target for the political right through the lens of local drag queens based in Florida.Drag queens have fascinated audiences for centuries, establishing drag as a popular art form with extravagant balls in Harlem during the roaring ‘20s. The award-winning RuPaul's Drag Race has helped bring drag back into the spotlight in the modern day, launching franchises in more than a dozen countries and making drag performances more popular than ever. At the same time, drag queens are facing intense political backlash as right-wing lawmakers across the country are trying to push through legislation restricting their performances.\"I've reported live from festivities involving drag queens for years, like the annual New Year's Eve celebration in Key West, Florida. I'm now wondering how this campy form of entertainment has become such a target for the political right in my home state of Florida,\" Kaye said.Kaye reports from Miami to Tallahassee, Florida, speaking with state politicians on both sides of the issue about why drag has become a political target and why local drag queens fight for their right to perform. Featuring insight from winner of RuPaul's Drag Race and Fulbright Scholar Sasha Velour, \"Drag War\" explores the history of drag and the cycles of acceptance and backlash that have repeated throughout history."
      },
      {
        "id": "tvmaze:2917396",
        "title": "The James Webb Telescope: Are We Alone?",
        "season": 2,
        "episode": 16,
        "released": "2024-06-16",
        "overview": "CNN Space and Defense Correspondent Kristin Fisher hosts an inside look at the most powerful telescope ever built and the discoveries it has revealed.The James Webb Space Telescope was built with the efforts and cooperation of more than 10,000 individuals, three space agencies, many countries, and ten billion dollars. Two years after its launch, the Webb Telescope is acting as a time machine, shedding light on deep space and dark matter that may even allow us to rewrite the first chapters of the history of the universe.\"Webb is one of the most incredible things ever built by humans. But it's only as good as the scientists that get to use it,\" said Fisher. \"It's up to them to come up with the questions that the telescope will then try to answer, and these are questions that cut to the core of why we're all here and what it all means.\"While the Webb facility is open to the public and anyone can submit a proposal for observation time with the telescope, Fisher speaks with some lucky astronomers that mission control first approved to further their research with some granted mere minutes. Fisher also sits down with NASA Administrator Bill Nelson, who speaks on the telescope's potential to answer two of science's most intriguing questions – where do we come from, and are we alone?"
      },
      {
        "id": "tvmaze:2917897",
        "title": "Deep Dive: The Shark Wars",
        "season": 2,
        "episode": 17,
        "released": "2024-06-30",
        "overview": "CNN Anchor Boris Sanchez returns with a descent into the heightening conflict between an ancient predator and their modern-day competition for prey.Humans kill 100 million sharks worldwide each year, threatening one-third of shark species with extinction. Despite warnings that sharks are endangered globally, some fishermen say the shark population in the US is out of control, and the rate at which sharks are feasting on their catch is crippling the fishing industry. However, some scientists disagree, arguing that depredation may be due to overfishing and depleting prey sources. Sanchez speaks with parties on both sides of the issue, bringing their concerns to government regulators and even free dives with the sharks himself.\"Despite their deadly reputation, sharks are sophisticated and intelligent creatures that merit recognition as critical partners in maintaining a healthy ocean,\" said Sanchez. \"Our story aims to dismantle horror-movie tropes while highlighting the very real challenges fishermen face. The relationship between humans and apex predators is central to developing a sustainable future.\"Sanchez travels from Nova Scotia to The Bahamas to speak with marine biologists studying shark populations and dives with them to see these magnificent creatures firsthand on the ocean floor. Off the coast of Florida, he speaks with anglers organizing controversial shark hunting tournaments and notorious shark hunter Mark \"The Shark\" Quartiano."
      },
      {
        "id": "tvmaze:2932147",
        "title": "Political Violence: America's Bloody History",
        "season": 2,
        "episode": 18,
        "released": "2024-07-27",
        "overview": "CNN Anchor and Senior National Correspondent Sara Sidner presents an urgent examination of the history of political violence in the United States.  In the wake of the attempted assassination of former President Donald Trump on July 13, The Whole Story analyzes America's long held history of political violence. From the nation's revolutionary beginnings to the violent unrest of the 60s, to recent years which have seen mass shootings driven by political issues and the attempted murders of politicians on both sides of the aisle, this hour unpacks how we got to a place where more and more Americans have expressed support for using force to enact political change.The episode features interviews with American political figures directly impacted by these acts of violence including Patrick J. Kennedy, Patti Davis, George Wallace Jr., Martin Luther King III and Arndrea Waters King."
      },
      {
        "id": "tvmaze:2956082",
        "title": "Kamala Harris: Making History",
        "season": 2,
        "episode": 19,
        "released": "2024-07-28",
        "overview": "Both \"Kamala Harris: Making History\" and \"Joe Biden Passes the Torch\" deep-dive into the shocking recent events that have redefined the political landscape for the Democratic party in the United States.As Vice President Harris kicks off her presidential campaign, \"Kamala Harris: Making History\" reintroduces the presumptive Democratic nominee to a nation gearing up for one of the most consequential elections in US history. From her upbringing as the daughter of immigrants in Berkeley, California, to becoming the first woman to hold the office of vice president, CNN Anchor Abby Phillip traces Harris's personal and professional journey defined by breaking boundaries and disrupting the political status quo."
      },
      {
        "id": "tvmaze:2956083",
        "title": "Joe Biden Passes the Torch",
        "season": 2,
        "episode": 20,
        "released": "2024-07-28",
        "overview": "Both \"Kamala Harris: Making History\" and \"Joe Biden Passes the Torch\" deep-dive into the shocking recent events that have redefined the political landscape for the Democratic party in the United States.In \"Joe Biden Passes the Torch,\" CNN Anchor and Chief Investigative Correspondent Pamela Brown scrutinizes the shocking turn of events that led to President Biden ending his reelection bid. The episode examines Biden's four years in office, initially intended to be a transitional leadership, and how whispered concerns about Biden's age culminated in a crescendo of calls for him to resign his campaign after the CNN presidential debate in June."
      },
      {
        "id": "tvmaze:2972756",
        "title": "MisinfoNation Part 2: Patriots, Pillows and Paper Ballots",
        "season": 2,
        "episode": 21,
        "released": "2024-08-11",
        "overview": "CNN Senior Correspondent Donie O'Sullivan presents a new chapter in his investigation into the pervasive surge of misinformation targeting American elections.In the months before the Republican National Convention, O'Sullivan crosses the country to see how plans to cause chaos and subvert November's presidential election are already well underway. He digs deep into how chaos agents like Steve Bannon and other influencers are utilizing a massive network of alternative media and social organizing to undermine American democracy.\"The conspiracy theories about the 2020 election that led to the storming of the US Capitol took most Americans by surprise, but these viral lies have not gone away and neither have the people who are promoting them,\" said O'Sullivan. \"Conspiracy theories about America's elections are being seen everyday by millions of Americans. It is undermining faith in the democratic process and could cause all kinds of confusion and chaos in November.\" O'Sullivan added, \"MisinfoNation 2 lays bare a world of election misinformation and the people who are empowering and promoting it.\"In this episode, O'Sullivan speaks with salesman and renowned election denier Mike Lindell at his factory in Minnesota, where he churns out pillows and conspiracy theories. He also talks with MAGA influencers - many of them funded by Lindell and his ubiquitous advertisements - from the border at Southern California to the RNC in Milwaukee, Wisconsin."
      },
      {
        "id": "tvmaze:2985588",
        "title": "Close Encounters: Tourists in the Wild",
        "season": 2,
        "episode": 22,
        "released": "2024-08-25",
        "overview": "CNN Senior National Correspondent Ed Lavandera premieres an exploration into Yellowstone National Park, where tourists push precarious boundaries with the native wildlife to dangerous effect.Lavandera ventures through America's oldest national park – 3,500 square miles with a large population of bison, grizzly bears, and wolves, plus more than 10,000 hydrothermal features, including geysers and hot springs. He witnesses firsthand how the lure of admiring wildlife up close can lead to hazardous outcomes and discovers how tourists misbehaving is a longstanding issue at Yellowstone.\"This assignment into Yellowstone National Park was an absolute rush of excitement and fascination,\" said Lavandera. \"It reminded me of the words by the iconic environmental activist, John Muir, who wrote, ‘you will remember these fine, wild views and look back with joy to your wanderings in the blessed old Yellowstone Wonderland.' On our journey, we met fascinating people who live their lives on the edges of the wild, constantly exploring their curiosity of the natural world. It's a perfect reminder of how deeply rejuvenating and intense it feels to answer the call of the wild.\"Lavandera rides along with a nature filmmaker in the park and speaks with two survivors of harrowing wildlife attacks. Wildlife experts show Lavandera how to safely observe all the magnificent wilderness the park offers as he encounters grizzly bears, a herd of bison, rocky mountain elk, bald eagles, and more."
      },
      {
        "id": "tvmaze:2989511",
        "title": "Fight for the White House: Where Harris Stands",
        "season": 2,
        "episode": 23,
        "released": "2024-09-02",
        "overview": "The series returns with two hourlong deep dives into each presidential candidate's proposed policies, allowing for a direct comparison of how their platforms stack up against each other. Each hour examines the candidate's records and current positions on the economy, reproductive rights, immigration and the border, foreign policy, and the tradition of democracy in the United States.CNN Anchor and Correspondent Audie Cornish takes on Vice President Kamala Harris's platform in \"Fight for the White House: Where Harris Stands.\""
      },
      {
        "id": "tvmaze:2989512",
        "title": "Fight for the White House: Where Trump Stands",
        "season": 2,
        "episode": 24,
        "released": "2024-09-02",
        "overview": "The series returns with two hourlong deep dives into each presidential candidate's proposed policies, allowing for a direct comparison of how their platforms stack up against each other. Each hour examines the candidate's records and current positions on the economy, reproductive rights, immigration and the border, foreign policy, and the tradition of democracy in the United States.CNN Anchor Abby Phillip surveys the policies supported by former President Donald Trump in \"Fight for the White House: Where Trump Stands.\""
      },
      {
        "id": "tvmaze:3000085",
        "title": "MisinfoNation: The Lost Left",
        "season": 2,
        "episode": 25,
        "released": "2024-09-22",
        "overview": "CNN Senior Correspondent Donie O'Sullivan returns with a new chapter in his Emmy®-nominated investigation into the American political wilderness and those caught up in a maelstrom of misinformation.In this episode, O'Sullivan meets former \"Bernie Bros,\" whose disillusionment with politics has led them to embrace far-right extremism. Some of them spend most of their waking hours online playing video games, say they feel left behind in the United States, and are now embracing conspiracy theorists, white supremacists, and even Vladimir Putin.\"So much of the hate and extremism we see across American politics today is appealing to and being promoted by young men who, rightly or wrongly, feel aggrieved,\" said O'Sullivan. \"In ‘MisinfoNation: The Lost Left' we begin to explore how political opportunists are using social media to play on these men's insecurities and radicalize them.\"O'Sullivan visits a rally of so-called MAGA Communists in Michigan and speaks with 24-year-old Jackson Hinkle, an emerging and charismatic young leader of the movement. He speaks with protestors outside of the Democratic National Convention and joins up with one of Twitch's biggest political stars, Hasan Piker, who is trying to fight online hate and misinformation."
      },
      {
        "id": "tvmaze:3012495",
        "title": "The Latino Vote: Ana Navarro's American Tour",
        "season": 2,
        "episode": 26,
        "released": "2024-09-29",
        "overview": "CNN Political Commentator Ana Navarro presents a cross-country examination of the nuanced impact of the Latino vote in the 2024 presidential election.The Latino vote could be crucial to the election, but it's not the homogenous monolith that some talking heads might make it out to be. Latinos are now the second largest group of voting-age Americans, and an estimated 36 million Latinos are eligible to vote this year, an increase of nearly 4 million in the last four years.\"So often on I get asked, ‘How can any Latino, how can any immigrant possibly vote for Trump?'. Well, many are doing just that,\" said Navarro. \"On TV, political experts are constantly talking about Latino voters. We wanted to talk to Latino voters. We put names and faces and personal stories to the statistics and poll-numbers and explored the issues and perceptions driving Latinos to the polls this year.\"Navarro, a Republican well known for criticizing former President Donald Trump, is now an active supporter of Vice President Kamala Harris. In this episode, she explores the issues that matter most to the different Latino communities across the country on both sides of the aisle. She visits immigrant communities in her hometown of Miami, where Cuban Americans have historically primarily supported Trump at the polls. Navarro meets up with CNN Senior National Correspondent Ed Lavandera at the southernmost tip of Texas, widely considered a Democratic stronghold where the population is 90% Latino. She finds out in both places that those assumptions can be deceiving, and some Latino voters are being swayed on a number of issues to change course.She also visits with Latino voters in two cities in critical swing states: Cumming, Georgia, where 10% of the state population is Latino and 22% of those Latinos will be voting in their first presidential election; and Bethlehem, Pennsylvania, a state with the third largest Puerto Rican community in the US."
      },
      {
        "id": "tvmaze:3016180",
        "title": "The First Spouse: Melania and Doug",
        "season": 2,
        "episode": 27,
        "released": "2024-10-06",
        "overview": "CNN Anchor Kaitlan Collins takes a closer look at the history of the office of the First Lady and who may redefine it for the next generation. In an unprecedented election full of historic firsts, the spouses of the candidates are breaking the mold in their own right. Former First Lady Melania Trump may become only the second woman in US history to return to the East Wing for a second nonconsecutive term, and Second Gentleman Doug Emhoff could become the first man to ever serve in that role. In this episode, Collins examines the historically high-pressure and thankless position of the First Spouse, unpaid and ill-defined yet filled with scrutiny.\"The job description of the first spouse has always been ill-defined, given it really has no definition at all,\" Collins said. \"Melania Trump pushed the boundaries of how first ladies in the modern era defined it. And we could be on the verge of seeing how Doug Emhoff upends the title once again by becoming the first man to occupy the role. Either way, we are in for a fascinating look at the East Wing in 2025.\"In this episode, Collins breaks down how Melania Trump blazed a new path as First Lady, delaying moving into the White House and enduring reporting of alleged extramarital affairs by her husband. She was the nation's only First Lady to grow up speaking a language other than English, and her tumultuous tenure in the position was marked by fashion missteps and shirking tradition. Collins also explores the story of Doug Emhoff, the country's first-ever Second Gentleman, who hopes to become America's inaugural First Gentleman as well. Emhoff made a name for himself at this year's Democratic National Convention as a relatable everyman supporting his wife's career. He also represents a nontraditional family structure, having two children from a prior marriage who call the Vice President \"Mamala.\""
      },
      {
        "id": "tvmaze:3025267",
        "title": "Why Springfield?",
        "season": 2,
        "episode": 28,
        "released": "2024-10-13",
        "overview": "CNN Correspondent Omar Jimenez premieres a deeper look at the consequences of a right-wing conspiracy theory given a national platform playing out in Southwestern Ohio.  Since 2020, roughly 12,000 Haitian immigrants have moved to Springfield, a city once struggling to find workers. Republican presidential nominee Donald Trump and running mate J.D. Vance have spent a large portion of their campaign targeting these legal immigrants, spreading misinformation and threatening to deport them if elected. In \"Why Springfield?\" Jimenez takes viewers inside this community, speaking with lifetime residents, business owners, local authorities, and the immigrants who are now facing harassment and threats to their safety. Haitian immigrants describe the horrific conditions they fled in Haiti and the new threats they now face in Ohio. Community members reveal how Haitian immigrants have revitalized the local economy, allowing businesses' workforces to expand, housing development to grow, and retail to thrive. Jimenez also speaks with Republican Governor of Ohio Mike DeWine about the impact of Haitian immigrants on the state and what could happen if they were to leave."
      },
      {
        "id": "tvmaze:3090665",
        "title": "K-Pop: A Star Is Made",
        "season": 3,
        "episode": 1,
        "released": "2025-01-05",
        "overview": "CNN Senior Investigative Correspondent Kyung Lah presents an in-depth look at the unusual star-making K-Pop industry in South Korea. K-Pop idol bands have fan bases all over the globe, hugely popular musicians and songs originating from South Korea.  But these bands are molded and created in a way unlike anything else in the music industry. Aspiring young stars take on rigorous vocal, dance and fitness training from early morning to late at night, some even leaving school and living in dorms away from their families. In \"K-Pop: A Star is Made\" Lah embeds in the strenuous training process of seven aspiring K-Pop stars in a small studio in the heart of Seoul, South Korea when they are just one week away from auditioning for the studio's premiere idol group.\"As a Korean American growing up in Chicago, I never imagined my native language would be streamed across platforms in the US as a multi-billion-dollar industry,\" said Lah. \"It still shocks me to this day. What I wanted CNN's audience is to see and experience how this happened, through the intimacy of the struggle of the K-pop trainees you'll meet in our hour. They're more than perfect young men and women of the TikTok era — they're utterly human, some as young as 14, and as vulnerable as the young fans who listen to them.\"The episode features interviews with Amber Liu, Megan Moon and Min who talk about the global impact of this explosive industry, which also comes with international scrutiny for its stars. Lah also speaks with the trainees about the pressure to maintain a certain appearance, and how extreme dieting and plastic surgery are common amongst K-Pop hopefuls."
      },
      {
        "id": "tvmaze:3105395",
        "title": "LA Burning",
        "season": 3,
        "episode": 2,
        "released": "2025-01-12",
        "overview": "CNN Anchor Anderson Cooper returns with a timely special report on the wildfires ravaging Los Angeles County.This week in Los Angeles, whole neighborhoods have been devastated, and tens of thousands of residents have been forced to evacuate since the blazes began. Building on CNN's comprehensive reporting on the ground throughout the week, Cooper traces the origins of these deadly wildfires, examining the conditions that led to this outbreak and the stories of those who have lost everything. Millions are living in trying conditions with dangerous air quality and the threat of new windstorms and fires ahead. Cooper also examines how the state of California and the city of Los Angeles have handled this unprecedented emergency and how this week will impact the future of life in the state."
      },
      {
        "id": "tvmaze:3117733",
        "title": "Operation Panda",
        "season": 3,
        "episode": 3,
        "released": "2025-01-26",
        "overview": "Senior National Correspondent David Culverhas exclusive special access to the return of giant pandas to America, an important symbol of conservation and friendship between the United States and China.Timed to this week's grand reopening of the panda exhibit at Washington's Smithsonian National Zoo, \"Operation Panda\" has exclusive behind-the-scenes footage from the journey of Bao Li and Qing Bao, two giant pandas who became the first of their kind China has sent to Washington in 24 years. Culver reports from Dujiangyan Panda Base, where CNN was the sole US based media present to witness their departure, and he also gets an early look at how the pandas are settling into their new home in the nation's capital. \"Returning to China for this story felt both deeply personal and profoundly unique\", said Culver. \"The exclusive access – from the meticulous planning for the giant pandas' send-off to trekking into the wild to explore the landscapes they call home – revealed a side of this journey few ever see. It's a story that goes beyond borders, capturing the remarkable efforts, cultural ties, and raw beauty that these iconic animals inspire. I'm excited for viewers to experience these rare, unforgettable moments firsthand.\"In \"Operation Panda,\" Culver also explores the Sichuan Mountains of southwest China, where researchers are focused on reintroducing pandas to their natural habitat. He unearths the history of panda diplomacy starting with President Nixon in 1972 and speaks with researchers, Chinese citizens and American panda fanatics about why these animals inspire such widespread devotion around the world."
      },
      {
        "id": "tvmaze:3133913",
        "title": "Flight Risk",
        "season": 3,
        "episode": 4,
        "released": "2025-02-02",
        "overview": "CNN Anchor Anderson Cooper returns with a timely special report on the current state of aviation safety.\"Flight Risk\" examines the circumstances leading up to and tragic aftermath following the collision of Flight 3452 with a US military black hawk helicopter at Reagan National Airport in Washington, DC and the failed Learjet angel flight mission which crashed in the suburbs of Philadelphia. The special report surveys the bigger safety issues plaguing the airline industry in recent years, from human error to environmental and mechanical issues, and explores how an understaffed workforce and record numbers of travelers continue to strain the U.S. air travel system.\"Flight Risk\" features notable aviation experts including CNN correspondent Pete Muntean, former National Transportation Safety Board Chair Peter Goelz, CNN Aviation analyst Miles O'Brien, former Inspector General of the United States Department of Transportation Mary Schiavo, former American Airlines pilot Les Abend, CNN Safety Analyst David Soucie, and former black hawk pilot Elizabeth McCormick."
      },
      {
        "id": "tvmaze:3152126",
        "title": "Bill Gates",
        "season": 3,
        "episode": 5,
        "released": "2025-02-23",
        "overview": "CNN Anchor Anderson Cooper returns with a special one-on-one interview with Microsoft founder and philanthropist Bill Gates.In this wide-ranging sit-down, Gates tells Cooper about the moments that shaped him, from his childhood in Seattle to co-founding Microsoft at age 20, fueling the personal computer revolution that has become part of our everyday lives. Gates unpacks the stories revealed in his new book Source Code: The Origin Story of Bill Gates.Gates speaks with emotion about the influence of his parents on his life and his unique way of thinking as a child. He visits his alma mater, Lakeside School, an elite all-boys private institute at the time of Gates's enrollment, and a place he credits with his transformation into an engaged student and fanatical computer programmer by the age of 13. It would also be the place where he would befriend his Microsoft co-founder, Paul Allen. After reflecting on his past, Gates discusses his thoughts on the future, including his recent meeting with President Donald Trump, Elon Musk intervening with USAID, and the potential impact of artificial intelligence."
      },
      {
        "id": "tvmaze:3177797",
        "title": "Adaptation Nation: A Climate Crisis Survival Guide",
        "season": 3,
        "episode": 6,
        "released": "2025-03-23",
        "overview": "Chief Climate Correspondent Bill Weir returns with an exploration into how human life as we know it is adapting to our changing climate. He seeks answers to how humankind can survive and thrive in an age of heat, drought, flood, and fire. His quest to find the heroes and innovators on the frontlines of this issue takes him across the globe, where he finds heroes building happier, healthier, and stronger communities built to withstand extreme weather in any form it takes.\"When I became a new dad in 2020,\" Weir said, \"I looked down at my son and thought ‘Where will he be safe? 'What kind of shelter will he need? Who is building the smartest, safest, and most resilient communities?' His arrival helped spark this worldwide hunt for inspiration and in the end, I returned with a lot more hope than fear.\"From a new \"policy of shade\" in scorching Phoenix to a floating neighborhood outside of Amsterdam to the rise of disaster-proof construction, Weir finds those on the cutting edge of adapting our way of life. With visits to London and Silicon Valley, he reveals the inventions and startups that have the investment blessing of Bill Gates and Tom Steyer.He returns to Paradise, California, five years after the deadliest mainland fire in the last century and gets lessons from survivors on how to build a fireproof town with stronger shelter but an even stronger community. And he tours Florida's first solar-powered town, built in harmony with nature and to withstand modern storms. Babcock Ranch has now survived two major hurricanes without flooding or losing power and their design secrets are more relevant than ever."
      },
      {
        "id": "tvmaze:3184611",
        "title": "Fentanyl in America: A Way Out",
        "season": 3,
        "episode": 7,
        "released": "2025-03-30",
        "overview": "The result of over two years of on-the-ground reporting, Bolduan embeds with those most impacted by America's opioid overdose epidemic. As the crisis enters its \"third wave,\" Bolduan engages with emergency medical technicians, physicians at treatment centers and people struggling with addiction themselves, all seeking new solutions to a decades-old problem. \"These past two years have been a uniquely powerful and educational experience for our team. I am grateful to all our interviewees who bravely allowed us in and shared their stories,\" said Bolduan. \"We witnessed first-hand the extraordinary challenges that come with breaking free from the cycles of addiction, and I am hopeful this project will illuminate the human element of the crisis and encourage others who are struggling to seek treatment.\" \"Fentanyl in America\" features remarkably candid and intimate interviews with people struggling with addiction. Pregnant women, families, and even drug dealers reveal to Bolduan the harsh realities of illicit fentanyl, a crisis that has propelled new treatment programs. She rides along with the first emergency medical service in the nation to carry buprenorphine, a treatment for fentanyl withdrawal that a study has associated with a nearly sixfold increase in the odds of engagement with addiction treatment. Bolduan also visits a center providing methadone treatments, where some people must visit every day for their daily dose."
      },
      {
        "id": "tvmaze:3200551",
        "title": "MisinfoNation: Extreme America",
        "season": 3,
        "episode": 8,
        "released": "2025-04-13",
        "overview": "CNN Senior Correspondent Donie O'Sullivan returns with a new installment in his Emmy® nominated MisinfoNation series as he investigates the rise of extremism in \"MisinfoNation: Extreme America.\"Over the last two years, O'Sullivan has traveled the country investigating the pervasive surge of misinformation targeting Americans and has reported everywhere from the Republican and Democratic national conventions to Mike Lindell's pillow factory, a QAnon church, and a JFK conspiracy convention. In his new report on the 30-year anniversary of the Oklahoma City bombing, O'Sullivan looks at the changing face of extremism in the United States. Thirty years ago, radical ideas and the search for like-minded extremists took time and effort, but now – with just a click – hate and paranoia is served to millions of Americans every day through algorithms and social media.\"From the pardoning of January 6 rioters to the celebrating of the murder of a healthcare CEO, how Americans are talking about violence is changing,\" O Sullivan said.  \"In this episode we look at how the media we are consuming is radicalizing us.\"In \"MisinfoNation,\" O'Sullivan travels across the country meeting far-right extremists with a long history of hate, talks to pardoned January 6 rioters, and encounters a new generation of radicalized Americans justifying the murder of healthcare CEO Brian Thompson.  He examines how the ongoing revolution in technology and information consumption is radicalizing us, meets a UFC fighter turned podcaster who platforms white supremacists, and visits a Texas man helping people print 3D guns at home."
      },
      {
        "id": "tvmaze:3213364",
        "title": "100 Days of Trump",
        "season": 3,
        "episode": 9,
        "released": "2025-04-27",
        "overview": "CNN Anchor Abby Phillip premieres a deep dive into the first 100 days of President Trump's administration. In Trump's second term, he has moved with astonishing speed to issue a record number of executive actions, impacting immigration, the economy, and empowering the newly formed Department of Government Efficiency. As he approaches his first 100 days back in office, Phillip takes a closer look at these actions, the extraordinary number of legal challenges his administration faces, and the real-world impact of his decisions on Americans today."
      },
      {
        "id": "tvmaze:3219826",
        "title": "The Wired Amazon",
        "season": 3,
        "episode": 10,
        "released": "2025-05-04",
        "overview": "CNN Chief International Security Correspondent Nick Paton Walsh returns with a rare glimpse at a world deep in the Amazon jungle as it gets its first experience of the internet. In a remote corner where the protected indigenous lands of Brazil meet the volatile borderlands of Peru, he embeds with a group of activists as they introduce space-based internet via Elon Musk's Starlink satellite dishes to the indigenous Kanamari community for the first time. The full force of a technology that over decades has transformed every part of Western life is suddenly unleashed on this village – with all the benefits and dangers that come along with it.\"We were taken aback by how fast these communities realized the damaging nature of the internet on their lives,\" said Paton Walsh. \"Yes, the jump from their time-honoured ways to an online world was huge. But they wasted no time in realizing there had to be an off button to keep their kids safe – something the urban world doesn't really see yet. It was a remarkable learning experience. I am old enough to remember a world without cellphones, and seeing that sense of calm – the ability to be still and disconnected again – really hammers home how much our lives have been accelerated and invaded by a technology we now all depend on for nearly everything.\"As Paton Walsh watches the transformative effect on village life as the young quickly take to WhatsApp, Facebook and especially a Chinese Tiktok-like app called Kwai, he also bears witness as the elder community members try to control the internet's seductive grasp on its youth by switching it off. Paton Walsh also observes the benefits of being online, as they can report illegal fishermen who poach on their protected lake, prohibited loggers and miners. The team also fly over gold miners as they ravage the rainforest, leaving a trail of devastation in which little natural can survive."
      },
      {
        "id": "tvmaze:3233526",
        "title": "Saving Venice",
        "season": 3,
        "episode": 11,
        "released": "2025-05-11",
        "overview": "CNN Anchor and National Correspondent Erica Hill takes a deep dive into the future of Venice, a city threatened by rising sea levels and the millions of tourists desperate to visit while they still can. Much of the world fears that climate change and rising sea levels will soon sink the ancient city of Venice, a misconception that is causing millions of tourists to visit each year while they still can. In \"Saving Venice,\" Hill discovers that the more imminent threat to Venetians' way of life is this overwhelming flood of tourists, transforming the city's culture, housing and local economy. Hill speaks with a collective of locals interested in promoting a more ethical tourism industry with respect for Venice's unique and delicate environment. She learns about the innovative ways a new generation of Venetians are working to preserve the city's traditions, mitigate the effects of climate change, and taper the city's dependance on massive amounts of tourists.\"The rich history of Venice is one of innovation, evolution and entrepreneurship,\" said Hill. \"That legacy is being tested now more than ever, but there are sustainable, thoughtful solutions to save this beautiful city, its culture, and most importantly, its community. With unique access to the Venice many visitors don't see, I am hopeful this hour will introduce audiences to a city - and a story - that is also a critical wake-up call for others around the world.\"The episode features interviews with local Venetian restauranteurs, artisans, oceanographers, city planners and more. Hill even gets a rowing lesson in the canals of Venice from a competitive rower whose family has been competing in the city for generations."
      },
      {
        "id": "tvmaze:3295026",
        "title": "The Case Against Diddy",
        "season": 3,
        "episode": 12,
        "released": "2025-07-06",
        "overview": "CNN Anchor and Chief Legal Analyst Laura Coates examines the rise and fall of Sean \"Diddy\" Combs, who established himself not only as a hip hop artist but a legendary entrepreneur and media mogul in the 1990s.  Behind his huge success were a string of controversial incidents and legal issues, culminating in the allegations from dozens of women of violence and rape.  Coates, who has covered the trial since the beginning, explores the key moments from the prosecution and the defense, and speaks with an alternate juror in the case."
      },
      {
        "id": "tvmaze:3295027",
        "title": "The Idaho Murders",
        "season": 3,
        "episode": 13,
        "released": "2025-07-06",
        "overview": "CNN Chief Law Enforcement and Intelligence Analyst John Miller uses his investigative experience to dive into the murders of four University of Idaho college students in November of 2022.  The brutal killings of Madison Mogen, Kaylee Goncalves, Xana Kernodle and Ethan Chapin shocked the community and the world, especially since there was no known motive for the attacks. Miller examines the evidence in the case and unpacks how investigators tracked the crime to Bryan Kohberger, who had been fighting the charges for two years before finally pleading guilty this week. With unanswered questions about the case still lingering, Miller goes behind the headlines to explore the loose ends that remain."
      },
      {
        "id": "tvmaze:3304650",
        "title": "Change Amplified: Live Music and the Climate Crisis",
        "season": 3,
        "episode": 14,
        "released": "2025-07-20",
        "overview": "CNN Chief Climate Correspondent Bill Weir returns with a look at some of the biggest stars working to revolutionize the eco footprint of live music. Featuring Billie Eilish and her mother Maggie Baird, Bonnie Raitt, Jack Johnson, AJR's Adam Met and Perry Farrell formerly of Jane's Addiction, Weir traces the legacy of stars who are working to reform a live music industry that demands massive amounts of energy and produces tons of waste. From refillable water stations, plastic-free shows and even kinetic dance floors that turn the crowd's energy into electricity, eco-conscious musicians are leading a movement to make caring about the climate cool. Their influence is catching on, with Lollapalooza now operating its main stage with a battery-powered hybrid system that gets cleaner every year, and Coachella implementing their first zero carbon stage.\"As so many politicians and corporate leaders slink away from leadership on climate issues while the cultural influence of live music explodes, I set out to understand how a handful of devoted artists have managed to clean and green their industry in astounding ways,\" Weir said. \"A music festival is like a temporary, disposable city so the lessons learned can be applied across society, and the connections being made with fellow fans have sparked a surprising new wave of grass roots connection and action.\"Weir speaks with Billie Eilish behind-the-scenes during her stadium tour where she implements several eco-friendly initiatives, and meets up with her and Maggie Baird in the hills of Los Angeles where nonprofit Tree People plants shade in underserved communities and after wildfires. He also visits with Jack Johnson on his Kokua Learning Farm in Hawaii, created to connect kids with nature and fresh, healthy food."
      },
      {
        "id": "tvmaze:3323405",
        "title": "Ecuador: The Narco Superhighway",
        "season": 3,
        "episode": 15,
        "released": "2025-08-10",
        "overview": "CNN Senior National Correspondent David Culver returns with an immersive dispatch from inside the brutal cocaine trafficking system which has made Ecuador the deadliest country in Latin America. Since 2018, Ecuador's homicide rate has surged by 580%, with 2025 on track to be Ecuador's deadliest year on record. With roughly 70% of the world's cocaine moving through Ecuador, gangs are at war for control of an underground global economy worth tens of billions of dollars a year. In \"Ecuador: The Narco Superhighway,\" Culver goes deep inside a system that pulls in the poor, empowers the brutal and protects the powerful, all to indulge the habit of a global addiction with local Ecuadorians caught in the undertow.\"We spent more than two weeks in fishing villages, border towns, major cities and ports… places where the violence isn't just a headline, it's part of daily life. We met grieving families, fishermen pulled into the trade, even gang members who claim they had no other option but to commit horrific acts, which they openly admit to,\" said Culver. \"This isn't just a story about drugs. It's about how power, poverty, and global demand collide in Ecuador.\"From coastal villages and jungle borderlands to banana plantations and bustling ports, and even to the Galapagos islands, Culver follows the chain of smuggling, extortion and violence. He rides along with Ecuador's navy as they train to chase down drug runners off the vast Pacific coast and speaks with a high-ranking gang commander reflecting on the impact of his trade on his community."
      },
      {
        "id": "tvmaze:3335013",
        "title": "Sports Betting: America's Big Gamble",
        "season": 3,
        "episode": 16,
        "released": "2025-08-24",
        "overview": "CNN National Correspondent Nick Watt premieres an incisive look at the now booming sports gambling industry in America.Last year, Americans bet around 150 billion dollars on sports. Point spreads, prop bets and parlays have entered the vernacular of a burgeoning new generation of young gamblers, a group particularly susceptible to addiction. In states where sports betting has become legalized, overall credit scores have gone down and bankruptcy filings have gone up, and athletes are facing harassment and threats from losing gamblers. Now, attorneys are filing a class action lawsuit claiming that sports betting apps were designed to create and feed addiction.\"I'm not a gambler, so diving into this world is fascinating,\" said Watt. \"We see the pleasure and the pain, and I'm blown away by how far this industry has come since the Supreme Court unleashed the beast and legalized this back just seven years ago. This isn't your grandad dropping a couple of bucks at the horse track.\"In \"Sports Betting: America's Big Gamble,\" Watt seeks answers from those at the forefront of America's sports betting industry, including President of the American Gaming Association Bill Miller, President of the NCAA Charlie Baker, Executive Vice President of NFL Communications, Public Affairs and Policy Jeff Miller, and more. He also speaks with the everyday people who have been impacted by the legalization of sports betting, including professional sports gamblers and recovering gambling addicts."
      },
      {
        "id": "tvmaze:3273429",
        "title": "The Simril(l)s: A Family in Black and White",
        "season": 3,
        "episode": 17,
        "released": "2025-09-21",
        "overview": "CNN Anchor/Senior National Correspondent Sara Sidner returns with a powerful portrait of a multi-racial Southern family  that confronts and explores its painful shared history— and comes together in spite of it. In York County, South Carolina, two halves of the Simril(l) family exist: the white side, descended from slave holders, and the Black side, descended from people enslaved on the Simril plantation. The two were segregated for over a century— unaware of their shared background— until Spenser Simrill began reaching out to others with the same last name 11 years ago, in the hopes of learning more about his family's clouded history. What he and his newfound relatives uncovered was a complicated legacy built around slavery, Reconstruction Era racial terrorism, and the unbelievable villains and heroes at the center of it.  As they prepare for their 2025 reunion celebration, Spenser Simrill and Michael Simril continue their search to unearth more of the Simril(l) story. They investigate their ancestors' violent run-ins with Klansmen in the county, as well as their family's 1871 migration to Liberia in pursuit of economic prosperity.  Together, the Simril(l)s of today consider how their blended families can share resources moving forward, enrich each other's lives, and serve as a blueprint for racial healing.  \"The Simril(l) lineage is full of remarkable characters who were unafraid to challenge power at fraught times in our nation's history,\" said Sidner.  \"I was so taken not only with their story, but also their ability to embrace it with such grace and dignity. As we look to the Juneteenth holiday, I see this family as a model for how we can all reckon with our pasts to forge a better, more united future.\""
      },
      {
        "id": "tvmaze:3379121",
        "title": "No Laughing Matter: Free Speech Under Attack",
        "season": 3,
        "episode": 18,
        "released": "2025-09-28",
        "overview": "CNN Anchor and Chief Washington Correspondent Jake Tapper returns with an examination of how Jimmy Kimmel ignited a fiery First Amendment debate across the country. In this episode, Tapper traces the extraordinary events that led to this precarious moment for free speech in America. The episode centers around the murder of Charlie Kirk, which shocked a nation. Tapper explores how the Trump administration's reaction to Kirk's death culminated in comedian Jimmy Kimmel's multi-day suspension from the air; and he explains the lesser-known business considerations at play that may have contributed to the decision. Tapper helps viewers make sense of this moment: examining the history of political comedy in late night, how both parties have made attempts to censor the media and control the narrative, and what President Trump's unprecedented actions could spell for the future of the First Amendment."
      },
      {
        "id": "tvmaze:3374908",
        "title": "The United States vs Harvard",
        "season": 3,
        "episode": 19,
        "released": "2025-09-28",
        "overview": "CNN Anchor and Correspondent Omar Jimenez premieres an inside look at how the Trump administration's crackdown on academic institutions came to a head at Harvard University.Harvard, a monument to America's higher education system and the oldest, wealthiest, and most influential American university, has become a figurehead for an emerging conservative focus on reshaping academia in recent years. DEI policies, critical race theory, and affirmative action became partisan rallying cries against universities like Harvard.\"This is really a battle between two of the world's most powerful institutions in their respective categories,\" Jimenez said. \"What happens with Harvard will likely set the tone for what other universities do if faced with similar headwinds. That's why this story is so important,\" Jimenez added.In this episode, Jimenez reports on the ground from Harvard's campus, finding a range of perspectives among the student body and faculty, tracing how the political drama has unfolded on campus and its impact. He investigates how Harvard quietly made changes aligning with the conservative agenda, even as they publicly fought what they considered government overreach into a private university. Jimenez also uncovers why the world's richest university needs federal funding, and the devastating consequences on potentially life-saving scientific research when that funding was cut off."
      },
      {
        "id": "tvmaze:3363349",
        "title": "Bad Sports: When Fans Turn Violent",
        "season": 3,
        "episode": 20,
        "released": "2025-10-11",
        "overview": "CNN Senior National Correspondent Ed Lavandera returns with a harrowing look at the rise in violent incidents at sporting events around the world. 70% of professional stadium security officials surveyed said they felt sports fan behavior is worse now than it was five years ago. Lavandera investigates how the adrenaline and frustration of sports, combined with the extreme hive mentality that comes with team fandom, can lead to violent conflict.\"There's nothing quite like finding yourself in the middle of an exhilarating sports drama. The passion. The energy. But all too often there is a dark side to these moments,\" said Lavandera. \"This journey explores the violent consequences when the action spills off the field.\"In \"Bad Sports: When Fans Turn Violent,\" Lavandera speaks with sports lovers, local authorities, and stadium officials who have been impacted by poor fan behavior across the country, from AT&amp;T Stadium in Arlington, Texas, to Gillette Stadium in Foxborough, Massachusetts. He reports from Detroit during the NFC Divisional Round of the 2024 NFL playoffs, and even crosses the pond to London, the most notorious city in the world for rabid fans."
      },
      {
        "id": "tvmaze:3426400",
        "title": "The Hidden Homeless",
        "season": 3,
        "episode": 21,
        "released": "2025-11-02",
        "overview": "\"The Hidden Homeless\" provides an intimate portrait of the forgotten victims of New York City's worst housing shortage in half a century – homeless youth. In 2024, 1 in 8 New York City public school students experienced housing instability — approximately 146,000 students. This episode traces the daily lives of some of the 70% of people in shelters who are families with children, most led by single, working women who earn too little to afford the city's high costs of rent, groceries, and childcare. As affordability continues to be a key issue in the NYC mayoral election, \"The Hidden Homeless\" delivers perspectives directly from the public schools, shelters, and streets most impacted by this crisis, showcasing the constant grit and determination of young families and teens trying to change their circumstances against near-impossible odds."
      },
      {
        "id": "tvmaze:3440742",
        "title": "MisinfoNation: White Genocide",
        "season": 3,
        "episode": 22,
        "released": "2025-11-16",
        "overview": "CNN Senior Correspondent Donie O'Sullivan returns with a new chapter in his Emmy®-nominated series of investigations into the pervasive surge of misinformation and its impact on American politics.O'Sullivan investigates why the narrative of an alleged \"White genocide\" in South Africa has gained traction among some Americans who fear changing demographics that are projected to soon make White people a minority in the U.S. The claim has even reached the White House, where President Trump cited it as justification for granting refugee status to White South Africans. Traveling to South Africa himself, O'Sullivan seeks out local voices to explore the country's deep-seated racial tensions and reveal the more complex reality behind the sensationalized rhetoric.\"The mainstreaming of White nationalist talking points in American discourse in recent years has centered on the conspiracy theory that White people in the U.S. are being deliberately 'replaced,'\" said O'Sullivan. \"Claims about purported White persecution in South Africa have played a major role in stoking these fears and have been used as an attempted justification for major changes in the U.S. refugee program. We wanted to separate fact from fiction in what Americans are being told about post-apartheid South Africa and to understand what it means for all of us.\"In this episode, O'Sullivan meets a cross-section of South Africans grappling with their nation's legacy of apartheid and the racial inequalities that endure today. Among them is Errol Musk, Elon Musk's father, whose outspoken views mirror themes that have surfaced in American political discourse. O'Sullivan also travels to two communities built exclusively for White residents: one in South Africa's Orania and another in the Ozark Mountains of the United States, uncovering how these parallel movements reflect a shared ideology across continents."
      },
      {
        "id": "tvmaze:3445954",
        "title": "The Exorcists",
        "season": 3,
        "episode": 23,
        "released": "2025-11-23",
        "overview": "Senior National Correspondent David Culver captures a revealing exploration of modern exorcisms in America.In \"The Exorcists,\" Culver travels to Arizona, where he sits down with one Catholic exorcist who has never spoken out publicly about the rite before. He witnesses deliverances across Christian faiths, capturing rituals taking place in garage sanctuaries overflowing with worshippers, family churches hosting deliverance nights, and pastors offering one-on-one sessions, sometimes for a fee. Speaking with Catholic leaders, including Bishops John Dolan of the Diocese of Phoenix and Gerald Frederick Kicanas of the Diocese of Tucson, Culver examines the ongoing debate over how mental health treatment and spiritual healing can coexist.\"After months of reporting, this felt less like a story about demons and more like a story about the human desire to feel seen, supported, and healed,\" said Culver. \"Every minister and exorcist we spoke with told us the same thing: more people are showing up, asking for help. The rise is anecdotal, but the desperation we saw was unmistakable.\"The episode features rare footage of deliverance rituals, interviews with those who have undergone the rites, and an unflinching look at the line between psychological distress and the belief of spiritual possession. Through these accounts, \"The Exorcists\" probes how centuries-old rituals of religious cleansing are being reinterpreted in modern America, often as a last resort for people seeking relief from trauma and abuse."
      }
    ]
  }
}