{
  "meta": {
    "id": "tvmaze:58375",
    "type": "series",
    "name": "Snapped: Behind Bars",
    "description": "Step behind prison walls to meet the convicted murderers featured from SNAPPED.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/367/918085.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/367/918085.jpg",
    "videos": [
      {
        "id": "tvmaze:3461390",
        "title": "Rebecca Keller",
        "season": 3,
        "episode": 6,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454458",
        "title": "Cameo Clines",
        "season": 3,
        "episode": 5,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2195787",
        "title": "Sabrina Zunich",
        "season": 1,
        "episode": 1,
        "released": "2021-02-14",
        "overview": "In a brand-new jailhouse interview, Sabrina Zunich tells the chilling story behind her foster mother's murder and describes the salacious secrets that led to it. In her own words, she details why she snapped and how she feels about it now, behind bars."
      },
      {
        "id": "tvmaze:2195788",
        "title": "Misook Wang",
        "season": 1,
        "episode": 2,
        "released": "2021-09-25",
        "overview": "Convicted killer Misook Wang sits down to detail her mother-in-law's murder. In a twist never before seen on Snapped, Wang's ex-lover comes forward to discuss his daughter's death, the reason he is behind bars. And why he thinks Wang was involved."
      },
      {
        "id": "tvmaze:2195789",
        "title": "Teresa Kotomski",
        "season": 1,
        "episode": 3,
        "released": "2021-10-02",
        "overview": "Serving a life sentence for a murder she claims she didn't commit, Teresa Kotomski talks on camera for the first time, sharing the intimate secrets of her rocky marriage and detailing what she now alleges caused her husband's painful poisoning death."
      },
      {
        "id": "tvmaze:2195790",
        "title": "Traci Wolfe",
        "season": 1,
        "episode": 4,
        "released": "2021-10-09",
        "overview": "In an exclusive jailhouse interview, Traci Wolfe reveals the catalyst that sparked an uncontrollable rage and ended in her husband's gruesome death. Holding nothing back, she now reflects on the stunning crime that landed her in prison for life."
      },
      {
        "id": "tvmaze:2195791",
        "title": "Taylor Marks",
        "season": 1,
        "episode": 5,
        "released": "2021-10-16",
        "overview": "Serving a life sentence for the brutal stabbing of her own mother, Taylor Marks discusses the murder on camera for the first time ever. She claims she wasn't the mastermind behind the crime, but she knows who is."
      },
      {
        "id": "tvmaze:2195792",
        "title": "Jamie Grachek",
        "season": 1,
        "episode": 6,
        "released": "2021-10-23",
        "overview": "Haunted by the events leading up to her conviction, Jamie Grachek is ready to tell her story for the first time after eight years behind bars and explains her version of what happened the night a violent home invasion left her ex-husband dead."
      },
      {
        "id": "tvmaze:2207501",
        "title": "Celeste Beard Johnson",
        "season": 1,
        "episode": 7,
        "released": "2021-10-30",
        "overview": "Featured in the first-ever episode of Snapped, Celeste Beard Johnson returns 18 years later to reveal new details surrounding the murder of her millionaire husband and speaks out against those who support her conviction - including her own daughters."
      },
      {
        "id": "tvmaze:2987409",
        "title": "Pandora Zan",
        "season": 2,
        "episode": 1,
        "released": "2024-09-01",
        "overview": "Pandora returns to offer remorse for the murder of her husband. For the first time, her son Cody Henderson speaks out, revealing why he took part in a crime that landed him in prison for life and how he feels about the mother who turned on him."
      },
      {
        "id": "tvmaze:2987410",
        "title": "Crystal Mangum",
        "season": 2,
        "episode": 2,
        "released": "2024-09-08",
        "overview": "In a new jailhouse interview, Crystal Mangum shares her side of the story, revealing what she alleges caused her then-boyfriend's death and the effect it has had on her to this day."
      },
      {
        "id": "tvmaze:2987411",
        "title": "Tausha Morton",
        "season": 2,
        "episode": 3,
        "released": "2024-09-15",
        "overview": "In a never-before-seen interview, Tausha Morton sits down to clarify what led to her ex-husband's death. She speaks out against the triggerman alleging that there was never a murder conspiracy and discusses how she feels being behind bars for life."
      },
      {
        "id": "tvmaze:2987412",
        "title": "Lucille Duncan",
        "season": 2,
        "episode": 4,
        "released": "2024-09-22",
        "overview": "After spending 20 years in prison for a crime in which she claims no involvement, Lucille Duncan breaks her silence for the first time. She details the harrowing events that led to the shooting of her ex-boyfriend and her hopes of freedom."
      },
      {
        "id": "tvmaze:2987413",
        "title": "Tabitha Messina",
        "season": 2,
        "episode": 5,
        "released": "2024-09-29",
        "overview": "Serving a life sentence for the murders of her father and his girlfriend, Tabitha Messina explains what happened for the first time on camera. She claims she wasn't the mastermind and shifts blame onto her convicted co-conspirator."
      },
      {
        "id": "tvmaze:2987414",
        "title": "Cristina Rodriguez",
        "season": 2,
        "episode": 6,
        "released": "2024-10-06",
        "overview": "In an exclusive interview, Cristina Rodriguez shares her experience watching her then-lover beat her boyfriend to death, and how it felt when he testified against her. A second convicted killer reveals his side of the story with new details."
      },
      {
        "id": "tvmaze:3424328",
        "title": "Afton Ferris and Michael Schallert",
        "season": 3,
        "episode": 1,
        "released": "2025-11-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3424329",
        "title": "Gloria Aiken",
        "season": 3,
        "episode": 2,
        "released": "2025-11-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3440590",
        "title": "Coty Martinez",
        "season": 3,
        "episode": 3,
        "released": "2025-11-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3449204",
        "title": "Angelina O'Mara",
        "season": 3,
        "episode": 4,
        "released": "2025-11-30",
        "overview": ""
      }
    ]
  }
}