{
  "meta": {
    "id": "tvmaze:524",
    "type": "series",
    "name": "Moonshiners",
    "description": "The secret and illegal world of moonshining stretches all across Appalachia raking in a pretty penny for those who choose to shine. Moonshiners will go to unprecedented extremes in their efforts to hide their still sites and cloak their distribution networks, some can hide in plain sight. With new styles of shine being tested and sold there is a king's ransom waiting for those bold enough to grab it. But those who enforce the law are wise to shiner deceptions and more determined than ever to catch them red handed and in the act of making Moonshine. The day of reckoning may be around the corner, but don't sell the Moonshiners short. Each has a keen understanding of how to stay one step ahead of the law in their region, and in this ongoing cat and mouse game you never know who will end up in the trap.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361733.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361733.jpg",
    "videos": [
      {
        "id": "tvmaze:3470041",
        "title": "TBA",
        "season": 15,
        "episode": 1,
        "released": "2026-01-06",
        "overview": ""
      },
      {
        "id": "tvmaze:47438",
        "title": "Moonshine Season Starts",
        "season": 1,
        "episode": 1,
        "released": "2011-12-06",
        "overview": "As the season approaches, moonshiner Tim and his partner Tickle search Appalachia for the perfect site to set up his operation. Law enforcement agent Jesse Tate is on the hunt for his first big arrest, but runs into a dangerous web of counter-surveillance."
      },
      {
        "id": "tvmaze:47439",
        "title": "Point of No Return",
        "season": 1,
        "episode": 2,
        "released": "2011-12-07",
        "overview": "Moonshiner Tim and his partner 'Tickle' perform a sacred rite that is rarely captured on film - firing up their still for the first time. Everything goes smoothly, until an emergency hits. Meanwhile, law enforcement agent Jesse Tate pursues a hot tip."
      },
      {
        "id": "tvmaze:47440",
        "title": "The Law Comes Knockin'",
        "season": 1,
        "episode": 3,
        "released": "2011-12-14",
        "overview": "Equipment failure and an intruder threaten Moonshiner Tim and his partner Tickle's first run of moonshine. Law enforcement agent Jesse Tate busts a nip joint. Moonshining legend Popcorn Sutton runs some 'shine the old-fashioned way."
      },
      {
        "id": "tvmaze:47441",
        "title": "Outlaw Brotherhood",
        "season": 1,
        "episode": 4,
        "released": "2011-12-21",
        "overview": "Moonshiner Tim and his partner Tickle soup up Tim's hot rod when they are forced into a daring, daytime bootlegging run. Meanwhile, a hurricane threatens the still site. Then, a new bootlegging biker legend sets out on an 800 mile run."
      },
      {
        "id": "tvmaze:47442",
        "title": "A Price to Pay",
        "season": 1,
        "episode": 5,
        "released": "2011-12-28",
        "overview": "With the leaves falling, Moonshiner Tim makes a risky move and adds a second pot to the still site to double his profits. Tickle has a bad accident - and Agent Jesse prepares for the mother lode of all busts."
      },
      {
        "id": "tvmaze:47443",
        "title": "A Moonshiner's Farewell",
        "season": 1,
        "episode": 6,
        "released": "2012-01-04",
        "overview": "In this season finale, one moonshiner will come to an untimely end. Tim and Tickle risk it all, running 'shine day and night, making more money than Tim's ever made. Agent Jesse makes his biggest move of the season when he ambushes an active still site."
      },
      {
        "id": "tvmaze:47444",
        "title": "Cannonball Run",
        "season": 1,
        "episode": 7,
        "released": "2012-04-18",
        "overview": "Winter means the ‘shine has gone cold and the stills aren't in operation. But, that doesn't mean Tim and Tickle stop doing their thing. Curious to see what they are up to? Then this is your lucky day because Moonshiners returns on Wednesday, April 18th with Moonshiners: Cannonball Run. Tim and Tickle are back and this time it's not about making ‘shine but about making the rounds. On the go and not taking it slow Moonshiners: Cannonball Run welcomes the boys back in a big way."
      },
      {
        "id": "tvmaze:47445",
        "title": "Rise 'n Shine!",
        "season": 2,
        "episode": 1,
        "released": "2012-11-07",
        "overview": "Moonshine season in Appalachia has begun. Tim and Tickle are back, as we are introduced to some old school shiners -­ all looking to grab a piece of a $100 million dollar jackpot – tax free. But with a new lawman in town, everyone will be watching their backs."
      },
      {
        "id": "tvmaze:47446",
        "title": "Moonshine Goldmine",
        "season": 2,
        "episode": 2,
        "released": "2012-11-14",
        "overview": "A breakthrough is made on Josh and Bill's underground still; Mark and Jeff build a copper still."
      },
      {
        "id": "tvmaze:47447",
        "title": "Moonshiner vs. Hogzilla",
        "season": 2,
        "episode": 3,
        "released": "2012-11-21",
        "overview": "Jim Tom helps Mark and Jeff repair a broken still; Mark hunts a wild hog."
      },
      {
        "id": "tvmaze:47448",
        "title": "Storm's a Brewing",
        "season": 2,
        "episode": 4,
        "released": "2012-11-28",
        "overview": "A storm threatens Josh and Bill's underground still; Tickle goes rogue."
      },
      {
        "id": "tvmaze:47449",
        "title": "A Shiner's Last Stand",
        "season": 2,
        "episode": 5,
        "released": "2012-12-05",
        "overview": "Tickle recruits a new partner and tries to find a new site after splitting from Tim; Mark, Jeff and Jim Tom start work on a second still; deputy sheriff Chuck infiltrates a moonshine operation."
      },
      {
        "id": "tvmaze:47450",
        "title": "Prophecy Fulfilled",
        "season": 2,
        "episode": 6,
        "released": "2012-12-12",
        "overview": "Tickle builds a new still. Josh gets angry when he damages the nearly completed underground still site. Mark and Jeff make a risky move when they sell some of their product in town. Jim Tom teaches Jeff's son Lance how to measure the alcohol by volume concentration of moonshine."
      },
      {
        "id": "tvmaze:47451",
        "title": "A Moonshiners Christmas",
        "season": 2,
        "episode": 7,
        "released": "2012-12-19",
        "overview": "Josh and Bill find mold in their underground still; Jeff's wife and son set up a second still."
      },
      {
        "id": "tvmaze:47452",
        "title": "Troubled Waters",
        "season": 2,
        "episode": 8,
        "released": "2013-01-02",
        "overview": "Tickle gets busted by an angry landowner, while Tim devises an ingenious new hiding spot for his back-up stash of shine. Then, Josh &amp; Bill get into a bone-breaking fight at their new still site. Also, Mark bootlegs moonshine by canoe in the dead of night."
      },
      {
        "id": "tvmaze:47453",
        "title": "Adios, Mr. Still",
        "season": 2,
        "episode": 9,
        "released": "2013-01-09",
        "overview": "Gunfire erupts in the bamboo patch just as Josh &amp; Bill fire up their still for the first time this season. Meanwhile, Jeff, Mark &amp; Jim Tom run a batch of President George Washington's rye whiskey. Then, Tickle hits the skids when his still is sabotaged."
      },
      {
        "id": "tvmaze:47454",
        "title": "Moonshine Treasure Hunt",
        "season": 2,
        "episode": 10,
        "released": "2013-01-16",
        "overview": "Tim searches for 200 gallons of moonshine in a lake; Tickle finds his former helper; Jeff protects his still from an intruder; Mike uses horse manure for something other than gardening."
      },
      {
        "id": "tvmaze:47455",
        "title": "Hat in Hand",
        "season": 2,
        "episode": 11,
        "released": "2013-01-23",
        "overview": "Tickle asks Tim for help; Jeff, Mark and Jim Tom battle a swarm of yellow jackets; and Josh rescues Cutie Pie."
      },
      {
        "id": "tvmaze:47456",
        "title": "Last Shiner Standing",
        "season": 2,
        "episode": 12,
        "released": "2013-01-30",
        "overview": "In this season finale, one moonshiner will go down. Tickle devises a bold but risky plan to sell Tim's shine. Then, Josh &amp; Bill's still site is compromised while Jeff, Mark &amp; Jim Tom brazenly run three stills. Finally, Deputy Sheriff Chuck makes his move."
      },
      {
        "id": "tvmaze:47457",
        "title": "Secret Summit (1)",
        "season": 2,
        "episode": 13,
        "released": "2013-02-06",
        "overview": "At a secluded location, the moonshiners meet with executive producer Matthew Ostrom to talk about their encounters with law enforcement, the reasons why they let cameras film them, how they make dynamite, and time-tested proofing methods."
      },
      {
        "id": "tvmaze:47458",
        "title": "Secret Summit (2)",
        "season": 2,
        "episode": 14,
        "released": "2013-02-13",
        "overview": "In Part Two of this special, the moonshiners rendezvous in a secluded cabin for an interview with executive producer Matthew Ostrom. They talk about the moonshiners code, leading double lives, obsessive fans, and the perils of life at the still site."
      },
      {
        "id": "tvmaze:47459",
        "title": "Time to 'Shine",
        "season": 3,
        "episode": 1,
        "released": "2013-11-05",
        "overview": "It's the start of moonshine season! Moonshiners Jeff and Mark, and partners Josh and Bill hit the ground running. Meanwhile, veteran shiner Tim Smith will make a life-changing move, and Tickle is forced to realize that his time to shine has just begun."
      },
      {
        "id": "tvmaze:47460",
        "title": "A Shiner in Kentucky",
        "season": 3,
        "episode": 2,
        "released": "2013-11-12",
        "overview": "Mark and Jeff clear their remote North Carolina still site, while an argument between Josh and Bill threatens to destroy their partnership. Tim has a tough time adjusting to moonshining in a legal Kentucky distillery, and Tickle takes a road trip."
      },
      {
        "id": "tvmaze:47461",
        "title": "Swamp Shiners",
        "season": 3,
        "episode": 3,
        "released": "2013-11-19",
        "overview": "Mark and Jeff struggle to set up their remote still site, while Josh and Bill are desperate for cash to build a new copper still. Tensions run high in the Kentucky distillery with Tim and his partner Steve, and a new moonshiner appears in Mississippi."
      },
      {
        "id": "tvmaze:47462",
        "title": "More Shiners, More Problems",
        "season": 3,
        "episode": 4,
        "released": "2013-11-26",
        "overview": "Tim Smith hires a person with a checkered past to help at the distillery in Kentucky. Tickle learns how to make moonshine in a copper pot still from one of the best. In North Carolina, Jeff and Mark are surprised by an unexpected visitor."
      },
      {
        "id": "tvmaze:47463",
        "title": "Hush Money",
        "season": 3,
        "episode": 5,
        "released": "2013-12-03",
        "overview": "In North Carolina, Jeff and Mark must pay hush money to the property owner of their still site, while veteran shiner Jim Tom helps Wayne perfect his moonshine recipe. In Virginia, Tickle encounters bad luck when he starts bootlegging his own shine."
      },
      {
        "id": "tvmaze:47464",
        "title": "First Run",
        "season": 3,
        "episode": 6,
        "released": "2013-12-10",
        "overview": "Tickle bootlegs at night, while Wayne comes up with an ingenious drop-off plan for his own bootleggers. Equipment failure threatens the production of Tim Smith's legal moonshine, and Josh and Bill finally begin their first run of strawberry brandy."
      },
      {
        "id": "tvmaze:47465",
        "title": "Blue Moonshine",
        "season": 3,
        "episode": 7,
        "released": "2013-12-17",
        "overview": "Josh and Bill are forced back to their day jobs after their shine runs blue. Chico, under financial stress, makes a hard decision that could risk it all. Tickle struggles to keep Tim's old territory supplied. Mark and Jeff move their liquor."
      },
      {
        "id": "tvmaze:47466",
        "title": "Rival Shiners",
        "season": 3,
        "episode": 8,
        "released": "2013-12-24",
        "overview": "Tim reaches a milestone with his first bottled batch of shine. Jeff and Mark suspect a rival in their territory. Chico takes a risk that could cost him everything. Josh and Bill's only hope at financing their shine operation is to consider bootlegging."
      },
      {
        "id": "tvmaze:47467",
        "title": "Bootlegging Blowups",
        "season": 3,
        "episode": 9,
        "released": "2013-12-31",
        "overview": "Tim enlists Tickle's help to investigate his new still hand, Chico. Josh and Bill take on new risks as they try to stay alive in the moonshine game, as bootleggers. Jeff, Mark and Lance look to take out the competition."
      },
      {
        "id": "tvmaze:47468",
        "title": "Moonshine War",
        "season": 3,
        "episode": 10,
        "released": "2014-01-07",
        "overview": "Tickle goes undercover to learn what Chico has been doing; Josh and Bill travel to a music festival; Mark and Lance seek to eliminate the competition."
      },
      {
        "id": "tvmaze:47469",
        "title": "Firewater",
        "season": 3,
        "episode": 11,
        "released": "2014-01-14",
        "overview": "Josh and Bill suffer the consequences of bootlegging. Darlene goes against her best instinct and lights up her still indoors. Jeff, Mark, and Lance find their competition is still out there. Tim takes final measures to protect his legal shine business."
      },
      {
        "id": "tvmaze:47470",
        "title": "Aftershock",
        "season": 3,
        "episode": 12,
        "released": "2014-01-28",
        "overview": "Jeff and Mark look to cash in on one final run of the season. Tickle and Chico's still site is compromised. Mike is desperate to complete his New Orleans order, and turns to Darlene. Josh and Bill might get to sell some of their own liquor after all."
      },
      {
        "id": "tvmaze:47471",
        "title": "Liquid Courage",
        "season": 3,
        "episode": 13,
        "released": "2014-02-04",
        "overview": "Jeff and Mark reach a roadblock; Deputy Chuck is in hot pursuit; Mike travels to finish off his biggest sale of the season; Tickle attracts unwanted attention."
      },
      {
        "id": "tvmaze:47472",
        "title": "Shine On",
        "season": 4,
        "episode": 1,
        "released": "2014-11-04",
        "overview": "Tim is on the run after his operation was set on fire. Jim Tom prepares for his second coming as a moonshiner. Tickle &amp; Tyler take their partnership to a new level. Josh &amp; Bill sell last year's surplus shine. Jeff &amp; Mark survey an indoor still site."
      },
      {
        "id": "tvmaze:47473",
        "title": "Moonshine Cascade",
        "season": 4,
        "episode": 2,
        "released": "2014-11-11",
        "overview": "Tickle and Tyler need to fix a bad feed line and get back to work at the moonshine cave. Jim Tom and Roy build the still that will carry them to greatness. Josh and Bill are sidelined with a crushed still. Sheriff's Deputy Chuck gains ground on Lance."
      },
      {
        "id": "tvmaze:47474",
        "title": "Bullet Proof",
        "season": 4,
        "episode": 3,
        "released": "2014-11-18",
        "overview": "Josh &amp; Bill pick up the pieces of their broken still. Lance tries to brew a moonshine game changer as Sheriff's Deputy Chuck closes in. Tickle gets stranded miles from civilization. Tim sets out from Kentucky in search of greener pastures."
      },
      {
        "id": "tvmaze:57323",
        "title": "Risky Whiskey",
        "season": 4,
        "episode": 4,
        "released": "2014-11-25",
        "overview": "Josh and Bill rebuild bigger and better. Lance takes a risk on a new kind of whiskey, while Jeff and Mark prep their indoor still site. Tickle and crew battle the elements in Kentucky. Tim gives the North Carolina distillery a backwoods makeover."
      },
      {
        "id": "tvmaze:57563",
        "title": "Tennessee Rising",
        "season": 4,
        "episode": 5,
        "released": "2014-12-02",
        "overview": "Tim learns a tough lesson; Mark and Jeff have a brush with the law."
      },
      {
        "id": "tvmaze:58217",
        "title": "Moonshine Takedown",
        "season": 4,
        "episode": 6,
        "released": "2014-12-09",
        "overview": "Tickle nails down a stash spot. Josh and Bill butt heads in the backwoods. Jim Tom and Roy are back in action. Mark and Digger's still goes from old school to state-of-the-art. And Mark and Jeff put the bells and whistles on their new shine spot."
      },
      {
        "id": "tvmaze:61040",
        "title": "White Lightning Wars",
        "season": 4,
        "episode": 7,
        "released": "2014-12-16",
        "overview": "Mark and Jeff feel the heat as the law closes in. Tim's plan to give a backwoods makeover to Troy's distillery will cost him big. The law cracks down on Josh and Bill. Tickle flirts with disaster as he tries to sell his Kentucky made white lightning."
      },
      {
        "id": "tvmaze:98973",
        "title": "Liquid Assets",
        "season": 4,
        "episode": 8,
        "released": "2014-12-23",
        "overview": "Tickle has his hands full keeping track of his liquor and Chico and Tyler are becoming suspicious. Bill and Josh build an underground bunker to hide their shine. Tennessee shiners, Mark and Digger, test an invention that could revolutionize moonshining."
      },
      {
        "id": "tvmaze:108513",
        "title": "Shine Jacked",
        "season": 4,
        "episode": 9,
        "released": "2014-12-30",
        "overview": "Josh and Bill have a close call with authorities; a new lawman visits two shiners in Tennessee; Tickle learns a lesson the hard way."
      },
      {
        "id": "tvmaze:108514",
        "title": "Moonshine River",
        "season": 4,
        "episode": 10,
        "released": "2015-01-06",
        "overview": "Josh and Bill have a triple batch run; Tickle makes a sacrifice to save his partnership; Tim is ready to see if the Asheville distillery can produce his moonshine."
      },
      {
        "id": "tvmaze:117739",
        "title": "Shine Overboard",
        "season": 4,
        "episode": 11,
        "released": "2015-01-13",
        "overview": "The final weeks of shine season are here. Josh &amp; Bill's liquor gets stuck six feet under. Chico &amp; Tyler brew a sweet &amp; sticky moonshine game-changer. Tickle gets trumped by his old buddy. And Mark &amp; Jeff's first sale on the water ends in disaster."
      },
      {
        "id": "tvmaze:120760",
        "title": "Bootleg or Bust",
        "season": 4,
        "episode": 12,
        "released": "2015-01-20",
        "overview": "Josh and Bill secretly sell their shine; Tim returns to Virginia to fill an order; Mark tries to make a delivery by boat; Tickle's deal nearly breaks down."
      },
      {
        "id": "tvmaze:124022",
        "title": "Bros Before Hooch",
        "season": 4,
        "episode": 13,
        "released": "2015-01-27",
        "overview": "Tickle takes risks to stay true to his old partner; Josh and Bill make a last run in the woods; Mark and Digger's season is in danger when their deal backfires."
      },
      {
        "id": "tvmaze:124023",
        "title": "The Shining",
        "season": 4,
        "episode": 14,
        "released": "2015-02-03",
        "overview": "It's last call in shine country. Deputy Chuck takes to the water to catch Mark red-handed. Tim &amp; Tickle work together to make a rush delivery of 2,000 cases of liquor in their home state. The cops close in on Josh &amp; Bill with shocking consequences."
      },
      {
        "id": "tvmaze:431935",
        "title": "American Spirits",
        "season": 5,
        "episode": 1,
        "released": "2015-11-17",
        "overview": "Moonshine season is in session; Tim faces a dilemma that could jeopardize his legal business; Jeff, Mark and Lance want to double their profits."
      },
      {
        "id": "tvmaze:471134",
        "title": "Whiskey Burn",
        "season": 5,
        "episode": 2,
        "released": "2015-11-24",
        "overview": "The outlaws want to turn a profit before the law closes in on them; Josh and Bill have their first run; Jeff, Mark and Lance check out the competition; Mark and Digger design a still."
      },
      {
        "id": "tvmaze:471135",
        "title": "Gone A-Rye",
        "season": 5,
        "episode": 3,
        "released": "2015-12-01",
        "overview": "The shiners attempt to stay off the grid; Tim breaks the news about the fate of Climax Moonshine; Jeff, Mark and Lance search for a new site."
      },
      {
        "id": "tvmaze:486042",
        "title": "Still Life",
        "season": 5,
        "episode": 4,
        "released": "2015-12-08",
        "overview": "Josh and Bill find themselves without a still; Mark and Digger get help from a whiskey legend; Mark, Jeff and Lance start an ambitious construction project."
      },
      {
        "id": "tvmaze:486043",
        "title": "Rain or Shine",
        "season": 5,
        "episode": 5,
        "released": "2015-12-15",
        "overview": "Weeks into moonshine season, Josh &amp; Bill race to finish their still site and make their first run. Intruders interrupt Mark &amp; Digger's rye test. A deadly disaster leaves Tim rattled and rethinking his plans to expand."
      },
      {
        "id": "tvmaze:773617",
        "title": "Rise 'n Shine!",
        "season": 5,
        "episode": 6,
        "released": "2012-12-22",
        "overview": "Christmas in Appalachia finds the shiners embracing the Yuletide spirit as they gather with friends and loved ones, wrap themselves with new traditions and create new flavors of liquor."
      },
      {
        "id": "tvmaze:504702",
        "title": "Scotch on the Rocks",
        "season": 5,
        "episode": 7,
        "released": "2015-12-29",
        "overview": "Josh and Bill are nearly finished with the bunker; Jeff, Mark and Lance lose a batch of mash and are in the red when they begin making the highland scotch."
      },
      {
        "id": "tvmaze:541887",
        "title": "Six Feet Undercover",
        "season": 5,
        "episode": 8,
        "released": "2016-01-05",
        "overview": "Mark and Digger, with help from Jim Tom, craft 150 gallons of brandy using their revolutionary still pot design. Now, it's just a matter of getting their shine into the hands of their eager customers."
      },
      {
        "id": "tvmaze:541888",
        "title": "Out on a Limb",
        "season": 5,
        "episode": 9,
        "released": "2016-01-12",
        "overview": "A behemoth threatens Josh and Bill's construction; a nocturnal prowler invades Patti and David's operation; battle lines are drawn in Kentucky."
      },
      {
        "id": "tvmaze:541889",
        "title": "Trouble Brewing",
        "season": 5,
        "episode": 10,
        "released": "2016-01-19",
        "overview": "In North Carolina a behemoth threatens to undo months of construction for Josh and Bill. A nocturnal prowler threatens Patti and David's clandestine operation and battle lines are drawn in Kentucky as Chico and Tyler clash over creative differences."
      },
      {
        "id": "tvmaze:541890",
        "title": "Caved In",
        "season": 5,
        "episode": 11,
        "released": "2016-01-26",
        "overview": "Patti and David work on a fiery, new brew. Elsewhere, the feud continues between Josh and Bill."
      },
      {
        "id": "tvmaze:585626",
        "title": "Cherry Bounce",
        "season": 5,
        "episode": 12,
        "released": "2016-02-02",
        "overview": "Tim works to fill a large international order. Elsewhere, Tickle goes to court in Virginia."
      },
      {
        "id": "tvmaze:597174",
        "title": "Shine 'Til You Drop",
        "season": 5,
        "episode": 13,
        "released": "2016-02-09",
        "overview": "Mark and Digger set up a new still site. Elsewhere, Patti and David try their jalapeño whiskey in an untested market."
      },
      {
        "id": "tvmaze:597175",
        "title": "Still Regretting",
        "season": 5,
        "episode": 14,
        "released": "2016-02-16",
        "overview": "Josh is missing his help; production is stopped at Snags' distillery; Chico and Sandra go mountain shining; Patti and David hurry their run as the hunting season starts."
      },
      {
        "id": "tvmaze:622472",
        "title": "Virgin Whiskey",
        "season": 5,
        "episode": 15,
        "released": "2016-02-23",
        "overview": "Chico and Sandra are eager to make their first run; Tim's tank may not enable him to fulfill the Poland order; Josh churns out a family heritage spirit."
      },
      {
        "id": "tvmaze:627643",
        "title": "Presidential Shine",
        "season": 5,
        "episode": 16,
        "released": "2016-03-01",
        "overview": "Patti and David rush to sell off their stash before a local fracking operation ends their season in a bust. Jeff, Mark and Lance hope that a classic recipe will save their season. A calling card from the law may bring Mark &amp; Digger's season to an end."
      },
      {
        "id": "tvmaze:627644",
        "title": "End of an Era",
        "season": 5,
        "episode": 17,
        "released": "2016-03-08",
        "overview": "Tim is thousands of cases off from delivering his order; Mark and Digger are surprised at a sale; and Josh makes amends."
      },
      {
        "id": "tvmaze:644514",
        "title": "Need for Speed",
        "season": 5,
        "episode": 18,
        "released": "2016-03-15",
        "overview": "Josh gets some help from a pro with his dirt track skills. Elsewhere, Tyler searches for a bootlegging car while Mark and Huck make a delivery over state lines."
      },
      {
        "id": "tvmaze:984238",
        "title": "Whiskey Rebellion",
        "season": 6,
        "episode": 1,
        "released": "2016-11-15",
        "overview": "Josh hits the ground running but working solo risks catastrophic results; former outlaw Tim Smith trains his son JT to help run his legal outfit."
      },
      {
        "id": "tvmaze:988625",
        "title": "Take Me to the River",
        "season": 6,
        "episode": 2,
        "released": "2016-11-22",
        "overview": "Patti and David scramble to locate a clean water source for their operation; Mark Rogers ventures into unfamiliar territory to secure new buyers; Mark and Digger use an old moonshiner's trick to spook intruders from their still site."
      },
      {
        "id": "tvmaze:988626",
        "title": "Hard Start",
        "season": 6,
        "episode": 3,
        "released": "2016-11-29",
        "overview": "A catastrophe leaves Josh desperately in need of a helping hand; Chico and Sandra's moonshine partnership puts strain on their relationship; Mark and Digger furnish still with an innovation, but their operation has attracted an unwanted visitor."
      },
      {
        "id": "tvmaze:988627",
        "title": "Luck of the Irish",
        "season": 6,
        "episode": 4,
        "released": "2016-12-06",
        "overview": "Rookie mistake could leave Josh and Chuck's operation dead in the water; Tim Smith travels across the Atlantic to teach an old Irish distillery a thing or two about making moonshine; Mark and Digger's mash test is interrupted by an unwanted visitor."
      },
      {
        "id": "tvmaze:988628",
        "title": "Big River Redemption",
        "season": 6,
        "episode": 5,
        "released": "2016-12-13",
        "overview": "Mark and Digger struggle to get a special recipe run for a shine legend. Big Chuck attempts to redeem himself after destroying Josh's operation. Chico and Sandra continue work on their still site but disaster strikes on the road to riches."
      },
      {
        "id": "tvmaze:1028751",
        "title": "Making Spirits Bright",
        "season": 6,
        "episode": 6,
        "released": "2016-12-20",
        "overview": "It's Christmas time in shine country! Mark &amp; Digger get in the holiday spirit by playing Santa Claus for kids in need. Patti &amp; David prepare special treats for a festive holiday feast. Bill and friends prepare for Christmas caroling the Carolina way."
      },
      {
        "id": "tvmaze:1016037",
        "title": "Whiskey Time Machine",
        "season": 6,
        "episode": 7,
        "released": "2016-12-27",
        "overview": "Tim needs to rescue his operation, challenging the laws of nature and time. Mark and Digger implement a high tech addition to their operation that could double their output, if it doesn't blow them up. Jeff and Lance make a once banned liquor."
      },
      {
        "id": "tvmaze:1067706",
        "title": "Dog Days of Shining",
        "season": 6,
        "episode": 8,
        "released": "2017-01-03",
        "overview": "Josh and Big Chuck find a new still site in hopes of reviving their season; and Mark and Digger test their still design. Later, Mark and Mike check out new territory."
      },
      {
        "id": "tvmaze:1024046",
        "title": "Smokey Mountain Gin",
        "season": 6,
        "episode": 9,
        "released": "2017-01-10",
        "overview": "Tim Smith aims to put a whiskey time machine to the test; Chico and Sandra switch gears with a new recipe in hopes of jump-starting their stalled season; Mark and Digger opt to experiment with distilling an old classic on their high-speed rig."
      },
      {
        "id": "tvmaze:1024047",
        "title": "Green Dragon",
        "season": 6,
        "episode": 10,
        "released": "2017-01-17",
        "overview": "Josh and Chuck work to reclaim their place at the top. Later, money threatens an old partnership for Jeff, Mark and Lance; and Mark and Digger craft a special brew for a high-rolling customer."
      },
      {
        "id": "tvmaze:1016036",
        "title": "Big City Bootleg",
        "season": 6,
        "episode": 11,
        "released": "2017-01-24",
        "overview": "With liquor stockpiled, Carolina shiners Josh and Big Chuck start digging for a new stash site. The pressure's on as backwoods distillers Mark and Digger haul 60 gallons of premium gin to Nashville the sale of their career. In the Louisiana swamplands, father/daughter duo Patti and David follow nature's harvest to make a sweet new brew."
      },
      {
        "id": "tvmaze:1033033",
        "title": "Big Wheels Keep on Turning",
        "season": 6,
        "episode": 12,
        "released": "2017-01-31",
        "overview": "Mark and Digger bring in a moonshine legend to rev-up production; Josh and Chuck turn to an old power source to prolong their operation; Chico and Sondra gear up for their first big sale of the season; Tim puts money on the line."
      },
      {
        "id": "tvmaze:1033034",
        "title": "The Green Devil",
        "season": 6,
        "episode": 13,
        "released": "2017-02-07",
        "overview": "Jeff and Lance attempt to salvage their absinthe recipe; Mark puts his new partner to the test; backbreaking labor and a lack of profit threaten to leave Josh up the creek without a paddle or a partner; Patti and David lack their key ingredient."
      },
      {
        "id": "tvmaze:1061715",
        "title": "Thunder Pumpkins",
        "season": 6,
        "episode": 14,
        "released": "2017-02-14",
        "overview": "An ingredient has Josh and Chuck ready to quit the business; Mark and Digger band together with JB to run their signature spirit; Tim puts his turbo-aged whiskey to the test; Chico and Sondra have their sights on a new brew."
      },
      {
        "id": "tvmaze:1061716",
        "title": "Two Pot Bang Bang",
        "season": 6,
        "episode": 15,
        "released": "2017-02-21",
        "overview": "Josh and Chuck struggle to finish winterizing their site; Mark and Digger bring their two-pot still out of retirement; and Mark and Mike have enjoyed a string of successful runs, but delivering the goods could land them in the crosshairs of the law."
      },
      {
        "id": "tvmaze:1086633",
        "title": "Intruder Alert",
        "season": 6,
        "episode": 16,
        "released": "2017-03-07",
        "overview": "Winter closes in and shiners aim to finish their seasons strong. Mark and Digger clash with the law. A breach from an intruder leaves Josh and Chuck deep in debt. Chico and Sondra's operation is burned."
      },
      {
        "id": "tvmaze:1061718",
        "title": "Last Call",
        "season": 6,
        "episode": 17,
        "released": "2017-03-14",
        "overview": "Winter hot on their heels, shiners aim to cash in. A legendary partnership comes to a bittersweet end as Jeff, Mark and Lance head their separate ways. Tim gets to spend time with and old friend. Patti and David end their season with a boatload of shine."
      },
      {
        "id": "tvmaze:1104775",
        "title": "Tale of Tickle",
        "season": 6,
        "episode": 18,
        "released": "2017-03-28",
        "overview": "Pittsylvania County's most wanted, Steven Ray Tickle, takes a trip down memory lane remembering the people and events that shaped his life and led him to become the model backwoods shiner and outlaw he is today."
      },
      {
        "id": "tvmaze:1104776",
        "title": "The Fast and the Fearless",
        "season": 6,
        "episode": 19,
        "released": "2017-03-28",
        "overview": "While tinkering on a 1950 Packard, Mark and Digger reminisce about the automobile's affect on the moonshining business. Their conversation is a walk down Moonshiners memory lane as we revisit some of the series' greatest hits as related to the automobile."
      },
      {
        "id": "tvmaze:1347553",
        "title": "Snake Bitten",
        "season": 7,
        "episode": 1,
        "released": "2017-11-14",
        "overview": "Moonshine season is back and the demand for white lightning is higher than ever. Tim Smith has a visitor from his outlaw past, Mark and Digger get a sign from above in Tennessee, and Josh's favorite still hand has a brush with death."
      },
      {
        "id": "tvmaze:1347554",
        "title": "Shine in the Sky",
        "season": 7,
        "episode": 2,
        "released": "2017-11-21",
        "overview": "Moonshine season is underway &amp; shiners are eager to get to market. Josh mashes in while awaiting Cutie Pie's fate. Mark and Digger struggle with materials building an experimental 3-Pot still. Chico and Sondra build a still high in the trees."
      },
      {
        "id": "tvmaze:1347555",
        "title": "Lightning Strikes",
        "season": 7,
        "episode": 3,
        "released": "2017-11-28",
        "overview": "Josh hopes to take on a partner; Mark and Digger erect the cornerstone of their massive 3-pot still; Patti and David hunt for clean swamp water; Mike works solo to fulfill and order."
      },
      {
        "id": "tvmaze:1347556",
        "title": "Pony Express",
        "season": 7,
        "episode": 4,
        "released": "2017-12-05",
        "overview": "Mark and Digger are ready to test out their 3-pot still; Chico and Sondra employ a four-legged still hand; Josh rides under the radar in South Carolina; Tim hopes to teach JT about his backwoods roots."
      },
      {
        "id": "tvmaze:1347557",
        "title": "Second Chances",
        "season": 7,
        "episode": 5,
        "released": "2017-12-12",
        "overview": "Mark and Digger seek redemption on their 3-pot still; Tim enlists Tickle as JT's moonshine mentor; Patti and David build a second still in hopes of doubling their production; Lance tries to regain Jeff's trust."
      },
      {
        "id": "tvmaze:1347558",
        "title": "Legends of the Shine",
        "season": 7,
        "episode": 6,
        "released": "2017-12-19",
        "overview": "Mark and Digger test yeast strains to get the most out of a new shine recipe; Tim and JT visit moonshine legends; Mark Rodgers sets up a new still site; Chico and Sondra start their season with a run of strawberry banana brandy."
      },
      {
        "id": "tvmaze:1364812",
        "title": "Pass the Juice",
        "season": 7,
        "episode": 7,
        "released": "2017-12-26",
        "overview": "Mike brings back an old family shine recipe in North Carolina; JT is eager to start running on his own; Mark and Digger try to troubleshoot a stalled fermentation; Patti and David deal with a deadly intruder at their still site."
      },
      {
        "id": "tvmaze:1378911",
        "title": "Stash and Grab",
        "season": 7,
        "episode": 8,
        "released": "2018-01-02",
        "overview": "Mark and Digger recruit a retired shiner; Josh and Chuck run an old family recipe; Lance enlists the help of a bootlegger to move his product; Sondra has to think fast."
      },
      {
        "id": "tvmaze:1379003",
        "title": "Arrested Development",
        "season": 7,
        "episode": 9,
        "released": "2018-01-09",
        "overview": "Moonshiners go to extremes to illegally produce and distribute white lightning. There's a king's ransom waiting for those bold enough to grab it, but the police are more determined than ever to catch them red handed. The day of reckoning may be just around the bend."
      },
      {
        "id": "tvmaze:1379004",
        "title": "Skins in the Game",
        "season": 7,
        "episode": 10,
        "released": "2018-01-16",
        "overview": "Moonshiners go to extremes to illegally produce and distribute white lightning. There's a king's ransom waiting for those bold enough to grab it, but the police are more determined than ever to catch them red handed. The day of reckoning may be just around the bend."
      },
      {
        "id": "tvmaze:1387612",
        "title": "Curse of the Blown Cover",
        "season": 7,
        "episode": 11,
        "released": "2018-01-23",
        "overview": "Mark and Digger prepare for the first run of hillbilly grappa; Patti and David bootleg on the bayou; an experimental shine recipe; Mike seeks out a new still hand."
      },
      {
        "id": "tvmaze:1402635",
        "title": "Highway to Hell",
        "season": 7,
        "episode": 12,
        "released": "2018-02-06",
        "overview": "Josh embarks on a harrowing cross-country delivery; rain threatens the final run of a special seasonal shine recipe; America's first Shiner in Chief inspires a top dollar batch of malted rye whiskey."
      },
      {
        "id": "tvmaze:1402636",
        "title": "From the Flames",
        "season": 7,
        "episode": 13,
        "released": "2018-02-13",
        "overview": "Josh must make good with a biker gang after a trailer fire leaves them empty handed; Tickle's first run of legal rye whisky tempts him to return to the illegal side; in Louisiana."
      },
      {
        "id": "tvmaze:1414181",
        "title": "High and Dry",
        "season": 7,
        "episode": 14,
        "released": "2018-02-20",
        "overview": "Approaching a massive season sale, Josh becomes a mad moonshine scientist. Mark and Digger scramble to complete a technically challenging run while Mark risks a solo run of sour mash whiskey. Patti and David hit the Gulf for their biggest sale yet."
      },
      {
        "id": "tvmaze:1414936",
        "title": "Lighted Up",
        "season": 7,
        "episode": 15,
        "released": "2018-03-06",
        "overview": "Mark and Digger confront a shiner who's been edging into their territory. Red and blue lights flash, and Josh makes a split second decision. Lance hopes a big sale could rectify past bootlegging blunders while Mike risks his sale, reputation and freedom."
      },
      {
        "id": "tvmaze:1424490",
        "title": "Not a Crook",
        "season": 7,
        "episode": 16,
        "released": "2018-03-13",
        "overview": "Tim considers a permanent role for Tickle at the Distillery, while Sondra convinces Chico that a unique recipe will seal their season. Lance surprises Jeff with an unorthodox moonshine ingredient, and Patti and David risk a supersized mega run."
      },
      {
        "id": "tvmaze:1424491",
        "title": "Foraging for a Long Winter Ahead",
        "season": 7,
        "episode": 17,
        "released": "2018-03-20",
        "overview": "In Tennessee, Mike sets himself up for a career high with a run of specialty liquor but faces a devastating setback. In the last run of the season, Sondra takes the reigns, and Rodgers tampers with his final run in an attempt to cash out."
      },
      {
        "id": "tvmaze:1430064",
        "title": "Last Nail in the Coffin",
        "season": 7,
        "episode": 18,
        "released": "2018-03-27",
        "overview": "In this explosive season finale, backwoods rivalries reach the breaking point! Cops stop Mark and Digger during their last big bootleg. Josh risks a $20K sale with an unreliable biker gang, and Mike lights the fuse on an Appalachian turf war."
      },
      {
        "id": "tvmaze:1581341",
        "title": "Legacy on the Line",
        "season": 8,
        "episode": 1,
        "released": "2019-01-02",
        "overview": "Moonshine season is on and the shiners must step it up to stay ahead of big liquor and the law. A 100mph wipeout puts Josh's operation in jeopardy, Tim takes a risk on rye, and Mark and Digger are hell-bent on backwoods justice after Mike's betrayal."
      },
      {
        "id": "tvmaze:1586235",
        "title": "Backwoods Justice",
        "season": 8,
        "episode": 2,
        "released": "2019-01-09",
        "overview": "Tensions boil over in Tennessee as Mike must answer for blowing up Mark and Digger's still. With Tickle in jail, JT answers the call when two outlaw shiners show up looking for help in the woods. Josh faces more bad news in the form of a bear."
      },
      {
        "id": "tvmaze:1586287",
        "title": "Wrong Side of the Law",
        "season": 8,
        "episode": 3,
        "released": "2019-01-16",
        "overview": "Legal shiner Tim finds himself on the wrong side of the law after son JT spots an agent near a still site. Mike designs a unique still to make high-dollar shine. Mark and Digger make an in-town run and Josh discovers what bears do in the woods."
      },
      {
        "id": "tvmaze:1586319",
        "title": "Popcorn's Secret Stash",
        "season": 8,
        "episode": 4,
        "released": "2019-01-23",
        "overview": "Ten years after Popcorn Sutton's death, his widow reveals a clue that could lead Mark and Digger to a hidden stash; Mike must gin up his brandy game to pay off his debt to Mark and Digger; Donnie and Teresa build a still site in a Kentucky cave."
      },
      {
        "id": "tvmaze:1586320",
        "title": "Burden of Proof",
        "season": 8,
        "episode": 5,
        "released": "2019-01-30",
        "overview": "Booted off his backwoods still site, Josh turns to his stock-car racing roots to invent a whole new way of making moonshine. Old-timer JB comes to the rescue as Mark and Digger fall short on a run. Mark Rogers faces a close encounter with the law."
      },
      {
        "id": "tvmaze:1593173",
        "title": "Breaking the Laws",
        "season": 8,
        "episode": 6,
        "released": "2019-02-06",
        "overview": "When their still site gets compromised, shiners Henry and Kenny enlist the help of bootlegging legend, Amos Law; to pay off his debt to Mark and Digger, Mike runs his still to the breaking point; Tim doubles down on JT and Tickle's double rye."
      },
      {
        "id": "tvmaze:1593174",
        "title": "Moonshiner's Apprentice",
        "season": 8,
        "episode": 7,
        "released": "2019-02-13",
        "overview": "Mark and Digger's new apprentice proves talent can't be taught. Josh tempts fate converting a new race car trailer into a mobile moonshining masterpiece. Mark Rogers enlists a retired lawman to bootleg 30 gallons of shine into a music festival."
      },
      {
        "id": "tvmaze:1610123",
        "title": "Hillbilly Ingenuity",
        "season": 8,
        "episode": 8,
        "released": "2019-02-20",
        "overview": "As Josh gets set to fire up his hidden mobile still at a biker rally, law enforcement gets wise to his illicit plan. Mark &amp; Digger's backwoods potato vodka hits a sweet spot. Short on payback cash, Mike and Daniel invent a new way to get out of debt."
      },
      {
        "id": "tvmaze:1610109",
        "title": "Bootlegger's Bounty",
        "season": 8,
        "episode": 9,
        "released": "2019-02-27",
        "overview": "Tracking down an old-time bootlegger, Mark and Digger uncover treasures Popcorn Sutton left behind. In debt, Mike and Daniel engineer a split pot still to upgrade their shine, and its price. Patti and David convert pontoons into a bayou still site."
      },
      {
        "id": "tvmaze:1616388",
        "title": "Full Throttle Throwdown",
        "season": 8,
        "episode": 10,
        "released": "2019-02-27",
        "overview": "Fast cars collide with backwoods tradition as Moonshiner Josh Owens puts pedal to the metal on the Carolina Dragway. Gasser rules mean vintage cars and parts only, but in skilled hands heritage pays off in horsepower. These gearheads race for glory."
      },
      {
        "id": "tvmaze:1616815",
        "title": "Mobile Moonshine Madness",
        "season": 8,
        "episode": 11,
        "released": "2019-03-06",
        "overview": "Josh debuts his mobile still at a North Carolina biker rally. In the Great Smoky Mountains, Mike gets burned by a taste of his own medicine. There's a reason Franklin County, VA is the Moonshine Capital of America, and someone there is above the law."
      },
      {
        "id": "tvmaze:1620056",
        "title": "100 Proof Heritage",
        "season": 8,
        "episode": 12,
        "released": "2019-03-06",
        "overview": "Mark and Digger's first run of barrel-aged bourbon gets interrupted by a bear. Scaling up Tickle's double rye tests Tim's backwoods engineering. Mark Rogers builds a malt house to make corn whiskey. In Kentucky, Donnie and Theresa come up short."
      },
      {
        "id": "tvmaze:1621901",
        "title": "Whiskey Deception",
        "season": 8,
        "episode": 13,
        "released": "2019-03-13",
        "overview": "When a dead drop goes sideways, Mark Rogers deploys backwoods justice to straighten out a thief. Kelly's massive sorghum haul puts Mark and Digger's pot stills to the test. Mike &amp; Daniel's clear apple pie has buyers calling from across county lines."
      },
      {
        "id": "tvmaze:1623288",
        "title": "Free Tickle",
        "season": 8,
        "episode": 14,
        "released": "2019-03-20",
        "overview": "A year behind bars, Tickle transfers to Culpeper County, and Tim concocts a plan to get him out. Breaking the shiner code can come at a steep price for Mark Rogers. Mark &amp; Digger's handmade vodka is on a hot streak until a cold snap puts profits at risk..."
      },
      {
        "id": "tvmaze:1623510",
        "title": "Breaking the Code",
        "season": 8,
        "episode": 15,
        "released": "2019-03-20",
        "overview": "Mark and Digger's handmade vodka is on a hot streak until a cold snap threatens their run. For Mark Rogers, breaking the moonshiner code can come at a steep price. Tim Smith risks a big run of Tickle's double rye to put the woods back into his shine."
      },
      {
        "id": "tvmaze:1628818",
        "title": "Hillbilly Hack",
        "season": 8,
        "episode": 16,
        "released": "2019-03-27",
        "overview": "Mark and Digger build a hillbilly hack to save their handmade vodka. Pam may know more than she thinks about Popcorn's lost shine. Nothing but trouble for Josh running a still outside of the woods. Patti and David risk a seaplane bootleg on the bayou."
      },
      {
        "id": "tvmaze:1629646",
        "title": "Risky Whiskey",
        "season": 8,
        "episode": 17,
        "released": "2019-03-27",
        "overview": "Tickle gets out of jail and Tim must keep him busy, but Tickle has ideas of his own. Mark and Digger make a discovery at Popcorn's boyhood home. On a midnight bootleg, Mark Rogers finds having the law on your side doesn't make you less of an outlaw."
      },
      {
        "id": "tvmaze:1630170",
        "title": "The Trouble with Tickle",
        "season": 8,
        "episode": 18,
        "released": "2019-04-03",
        "overview": "Tickle returns to Tim's legal distillery and discovers he's traded one prison for another. Mark and Digger unearth a trove of Popcorn's shine. Josh finds an untapped market at a biker rally, but learns the cost of entry is more than the ticket price."
      },
      {
        "id": "tvmaze:1748557",
        "title": "Back to the Woods",
        "season": 9,
        "episode": 1,
        "released": "2019-11-19",
        "overview": "When Tickle returns to the outlaw side, even Tim can't resist the call of the backwoods; Mark and Digger rediscover a lost recipe from a legend; Mike finds the ultimate secret mountain still site, if only he can build a way to access it."
      },
      {
        "id": "tvmaze:1755144",
        "title": "Proof is in the Payoff",
        "season": 9,
        "episode": 2,
        "released": "2019-11-26",
        "overview": "Tim joins Tickle on a journey through the backwoods of Virginia to rekindle their fiery passion for the outlaw life; Josh Owens dives headlong into the season hoping to make bank while leaving law enforcement none the wiser."
      },
      {
        "id": "tvmaze:1760421",
        "title": "Tickle's Big Run",
        "season": 9,
        "episode": 3,
        "released": "2019-12-03",
        "overview": "Tickle mashes in his first large scale run of outlaw shine in years. Mark and Digger scramble to save their Popcorn legacy mash from runaway livestock. Mike ditches Daniel for a new full-time partner. Mark and Huck double their proof and their price."
      },
      {
        "id": "tvmaze:1767845",
        "title": "Enemy at the Gates",
        "season": 9,
        "episode": 4,
        "released": "2019-12-10",
        "overview": "Teaming up with a former competitor, Mark and Digger sell their legacy shine in a neighboring county. Mike and Jerry double their shine output only to find customers are getting their shine from another source. Mountain man Mark tracks an intruder."
      },
      {
        "id": "tvmaze:1761137",
        "title": "Wedding Cake Shine",
        "season": 9,
        "episode": 5,
        "released": "2019-12-17",
        "overview": "Mark and Digger attempt their first backwoods miracle, turning wedding cake into moonshine. Tickle scrambles for cover when aerial surveillance threatens a return to jail. And Appalachia's most accident-prone shiner is back operating heavy machinery."
      },
      {
        "id": "tvmaze:1780587",
        "title": "Drone vs. Shotgun",
        "season": 9,
        "episode": 6,
        "released": "2019-12-31",
        "overview": "Josh breaks into his secret stash to build a new still site, and breaks out his shotgun when a drone invades his airspace. Daniel hits the jackpot selling for Mark and Digger, while Mike finds his steady customers mysteriously less thirsty than usual."
      },
      {
        "id": "tvmaze:1780588",
        "title": "Busted by the Law",
        "season": 9,
        "episode": 7,
        "released": "2020-01-07",
        "overview": "Mark and Digger go across county lines to bootleg their triple-grain shine. Mark Huck uses bear scent to track down an intruder while Mike and Jerry fire up the 24-jar rig and discover the downside of backpressure."
      },
      {
        "id": "tvmaze:1785172",
        "title": "Toxic Work Environment",
        "season": 9,
        "episode": 8,
        "released": "2020-01-14",
        "overview": "Tickle's carpentry skills shine as Virginia outlaws plan a risky modification to their still; Mark and Digger take a big swing on a small ingredient that can't pass the sniff test; Josh uncovers the worst way to foster a toxic work environment."
      },
      {
        "id": "tvmaze:1790948",
        "title": "Tickle to the Rescue",
        "season": 9,
        "episode": 9,
        "released": "2020-01-21",
        "overview": "Tickle answers the call when Josh needs help salvaging an abandoned submarine still and his season. Mark and Digger take on a specialty bourbon made from Indian corn. Facing jail time, Van and Ewok gamble their freedom for another run."
      },
      {
        "id": "tvmaze:1790949",
        "title": "Run for the Hills",
        "season": 9,
        "episode": 10,
        "released": "2020-01-28",
        "overview": "Mark and Digger attempt to rescue a former apprentice from a moonshine calamity; an unknown competitor invades Mike's turf, forcing him to change his shine strategy; Mark and Huck bank on backwoods survival skills to fuel their high-proof run."
      },
      {
        "id": "tvmaze:1795448",
        "title": "Say Yes to the Mess",
        "season": 9,
        "episode": 11,
        "released": "2020-02-04",
        "overview": "Tickle announces his engagement, and Tim discovers why his best friend can't quit the outlaw side; unable to sell any shine, Mike attempts a long-distance bootleg that puts him in the cross-hairs of the law; Josh thinks Sin City needs one more vice."
      },
      {
        "id": "tvmaze:1795487",
        "title": "Murphy's Law for Outlaws",
        "season": 9,
        "episode": 12,
        "released": "2020-02-11",
        "overview": "Tickle and Tim put fire to their first backwoods run in a decade; with 250 gallons of mash on the brink of expiring, Mark and Digger torpedo their own operation; a minor oversight for Josh triggers a domino effect that threatens his entire site."
      },
      {
        "id": "tvmaze:1798304",
        "title": "Rolling Down the Mountain",
        "season": 9,
        "episode": 13,
        "released": "2020-02-18",
        "overview": "A young outlaw with an old pot still earns an apprenticeship with Mark and Digger; Mountain man Mark tackles a week-long run to hit an $18K order that includes special delivery; in a desperate attempt to fix his worm barrel, Josh dives in headfirst."
      },
      {
        "id": "tvmaze:1800971",
        "title": "Hemp Shine",
        "season": 9,
        "episode": 14,
        "released": "2020-02-25",
        "overview": "Tickle and the Laws infuse a batch of shine with anxiety-reducing CBD, Josh digs into a secret stash to cure his blues and a mystery bootlegger encroaches on Mike's turf."
      },
      {
        "id": "tvmaze:1808346",
        "title": "Georgia on My Shine",
        "season": 9,
        "episode": 15,
        "released": "2020-03-03",
        "overview": "Mark and Digger heads to Georgia to visit an old-time shiner and restore an important piece of Popcorn Sutton history; Tim and Tickle plan on how to sell their new shine; Mike finds out about a rival on his turf."
      },
      {
        "id": "tvmaze:1811964",
        "title": "Unexpected Offer",
        "season": 9,
        "episode": 16,
        "released": "2020-03-10",
        "overview": "Mike and Jerry confront Daniel about how their rival's liquor is invading their territory; Tickle, Henry and Kenny scale up their CBD-infused moonshine operation; a new bootlegger makes Mark and Digger an offer they can't refuse."
      },
      {
        "id": "tvmaze:1812708",
        "title": "The Marvelous Mrs. Tickle",
        "season": 9,
        "episode": 17,
        "released": "2020-03-17",
        "overview": "In the season finale, Tickle gets a life sentence -- to the marvelous Mrs. Tickle. Mark and Digger risk delivering both moonshine and justice."
      },
      {
        "id": "tvmaze:1963866",
        "title": "Hard Times Make the Best Shine",
        "season": 10,
        "episode": 1,
        "released": "2020-11-24",
        "overview": "With national supply chains disrupted, Mark and Digger unearth a ton of free ingredients, Tickle helps Josh build a submarine still farm and Mike designs a first-ever backwoods column still, perfect for endless runs of high-quality low-cost liquor."
      },
      {
        "id": "tvmaze:1968320",
        "title": "Interstate Alliance",
        "season": 10,
        "episode": 2,
        "released": "2020-12-01",
        "overview": "When Josh lands a windfall of peaches, he and Tickle forge a peach brandy-making alliance. Mark and Digger's plans dry up when their surplus corn supply mysteriously disappears, and Mike and Jerry's column still spews ethanol vapor, causing a panic."
      },
      {
        "id": "tvmaze:1975069",
        "title": "Mark and Digger's Big Test",
        "season": 10,
        "episode": 3,
        "released": "2020-12-08",
        "overview": "With his partner in quarantine, Digger has much more on the line than shine. Mike and Jerry's moonshine Frankenstein turns on its creators. After decades in the backwoods, mountain man Mark Rogers enlists his dad to run with him for the first time."
      },
      {
        "id": "tvmaze:1977955",
        "title": "Backwoods is Booming",
        "season": 10,
        "episode": 4,
        "released": "2020-12-15",
        "overview": "Mark and Digger deploy an old-world innovation to bring their barrel-aged reserves to market, while Tim attempts to make Tickle's CBD moonshine on a commercial scale. Josh puts himself at the mercy of the mountains' greatest peril -- a rookie shiner."
      },
      {
        "id": "tvmaze:1984027",
        "title": "No Ordinary Run",
        "season": 10,
        "episode": 5,
        "released": "2020-12-22",
        "overview": "Tickle and the Laws unleash a 700-gallon run on a whisper-quiet steamer still. Mark and Huck traverse Appalachia's roughest terrain to run liquor with moonshine legend Jim Tom. Mike and Jerry engineer a high-tech solution to a backwoods problem."
      },
      {
        "id": "tvmaze:1986948",
        "title": "Single Malt Moonshine",
        "season": 10,
        "episode": 6,
        "released": "2020-12-29",
        "overview": "Mark and Digger's plan to employ an out of work friend backfires on payday. Tim invents a low-cost way to make his first single-malt moonshine. With their backwoods column still cranking out liquor, Mike discovers Jerry isn't carrying his own weight."
      },
      {
        "id": "tvmaze:1990418",
        "title": "Overproof and Under the Gun",
        "season": 10,
        "episode": 7,
        "released": "2021-01-05",
        "overview": "Mark and Digger attempt oatmeal raisin shine for a high-flying Nashville customer; Mike and Jerry find themselves under the gun when they over deliver on proof to a biker gang; Mark and Huck forge a lifeline to old-time shiners deep in the mountains."
      },
      {
        "id": "tvmaze:1997753",
        "title": "Too Much of a Good Thing",
        "season": 10,
        "episode": 8,
        "released": "2021-01-12",
        "overview": "As Tickle and the Laws start a massive rye run, a mysterious tip results in too much of a good thing. Jerry gets rushed to the hospital and Mike finds himself shorthanded. Tim innovates a backwoods process for his single-malt shine."
      },
      {
        "id": "tvmaze:2003895",
        "title": "Sweet Corn Revenge",
        "season": 10,
        "episode": 9,
        "released": "2021-01-19",
        "overview": "After Mike asks the wrong shiner for help, Mark and Digger land a skilled new partner. On a mountain run, Mark and Huck nearly meet the barrel of a gun. Jerry attempts a comeback as a land sale forces him and Mike to abandon their column still site."
      },
      {
        "id": "tvmaze:2004574",
        "title": "Smoke to the Fire",
        "season": 10,
        "episode": 10,
        "released": "2021-01-26",
        "overview": "Facing more rye and apples than the Laws can run, Josh moves his steamer still to Virginia and Tickle adds smoke to the fire. Mark and Huck help Jim Tom turn cherries into shine. Mike and Jerry risk a huge run in the barn of an unsuspecting farmer."
      },
      {
        "id": "tvmaze:2008547",
        "title": "Mason Jar Shortage",
        "season": 10,
        "episode": 11,
        "released": "2021-02-02",
        "overview": "A Mason jar shortage puts a lid on Mark and Digger's distribution plans. Mike and Jerry must return to land they've been warned off. Tim's scheme to repurpose a massive tank as an oversized pot still pushes his steam boiler to the breaking point."
      },
      {
        "id": "tvmaze:2016654",
        "title": "Caught Red-Handed",
        "season": 10,
        "episode": 12,
        "released": "2021-02-09",
        "overview": "Tickle and the Laws recruit Josh to build a winter-proof still site. Mountain man Mark converts a free load of sugar beets into high-proof moonshine. Mike and Jerry crack a few nuts to turn their column-distilled liquor into southern pecan liquor."
      },
      {
        "id": "tvmaze:2018085",
        "title": "Hog Heaven",
        "season": 10,
        "episode": 13,
        "released": "2021-02-16",
        "overview": "Mark and Digger find a solution to the jar shortage but the juice may not be worth the squeeze. Tim enlists Tickle's friend Howard to help recreate the first whiskey made in America. Mike and Jerry distill vodka from surplus restaurant supplies."
      },
      {
        "id": "tvmaze:2018086",
        "title": "Ice Shine",
        "season": 10,
        "episode": 14,
        "released": "2021-02-23",
        "overview": "Mark and Digger invent a new recipe turning hundreds of jars of expired mandarin oranges into marketable liquor. Tickle and the Laws face headaches in their attempt to produce freeze-distilled apple liquor. Mike and Jerry make birch bark moonshine."
      },
      {
        "id": "tvmaze:2018087",
        "title": "Another Man's Mash",
        "season": 10,
        "episode": 15,
        "released": "2021-03-02",
        "overview": "Tickle and the Laws invent a new recipe with master distiller Richard Landry. Mark and Digger crack their thousand jar problem while mashing in their most profitable run in years. Tim and Howard make a ceramic still to rediscover a colonial whiskey."
      },
      {
        "id": "tvmaze:2018088",
        "title": "Basement Bust",
        "season": 10,
        "episode": 16,
        "released": "2021-03-09",
        "overview": "Trouble arises after Josh gains access to a cellar still site. Mark and Digger find a new way to cut costs and bayou shiner Richard makes medical moonshine."
      },
      {
        "id": "tvmaze:2018089",
        "title": "Tennessee Whiskey",
        "season": 10,
        "episode": 17,
        "released": "2021-03-16",
        "overview": "A new limestone source helps Mark and Digger make Tennessee Whiskey while the Laws pull Tim back in to cross state lines for a key ingredient. Later, Richard makes moonshine from cotton candy."
      },
      {
        "id": "tvmaze:2037122",
        "title": "Two Tons of Fun",
        "season": 10,
        "episode": 18,
        "released": "2021-03-23",
        "overview": "Josh drives a tractor trailer full of stills across state lines to help Tickle and the Laws run two tons of malted corn. Mark and Digger christen their own secret Tennessee Whiskey distillery. Richard builds a copper Virginia-style submarine still."
      },
      {
        "id": "tvmaze:2037123",
        "title": "Moonshine Capital Returns",
        "season": 10,
        "episode": 19,
        "released": "2021-03-30",
        "overview": "Josh, Tickle and the Laws build a still farm the likes of which Virginia hasn't seen since the heyday of Amos Law. Jerry misses a day of work and Mike lets down his guard. Mark and Digger discover a rival moonshiner faces a reckoning with the law."
      },
      {
        "id": "tvmaze:2052080",
        "title": "Backwoods Bonanza",
        "season": 10,
        "episode": 20,
        "released": "2021-04-06",
        "overview": "In the season finale, with eight stills running full tilt, Tickle enlists Mrs. Tickle to stash too much shine. Mark and Digger devise a way to age their Tennessee whiskey at sea. Tim gets drawn into an epic bootleg, while Mike and Jerry face the law."
      },
      {
        "id": "tvmaze:2188256",
        "title": "Boom Time for Moonshine",
        "season": 11,
        "episode": 1,
        "released": "2021-10-27",
        "overview": "Mark and Digger get raided by cops forcing them to flee across state lines. Tickle and the Laws assemble a new mega operation as Josh heads their way with a truckload of fruit. Mike and Jerry build the courage to return to the scene of their own crime."
      },
      {
        "id": "tvmaze:2198142",
        "title": "Holy Grail of Moonshine",
        "season": 11,
        "episode": 2,
        "released": "2021-11-03",
        "overview": "JB leads Mark and Digger to the secret site of Popcorn Sutton's infamous last run. Mike and Jerry's attempt to make a still from a used whiskey barrel blows up in their faces. Tickle, Josh and the Laws get ambushed, forcing them to run for the hills."
      },
      {
        "id": "tvmaze:2203684",
        "title": "Oh Josh, Where Art Thou?",
        "season": 11,
        "episode": 3,
        "released": "2021-11-10",
        "overview": "Tickle and the Laws escape from a raid on their still site only to discover that Josh is missing. Tim and Howard tackle a gas shortage with a high-proof solution. Mike and Jerry rebuild their oak barrel pot still after blowing up their first attempt."
      },
      {
        "id": "tvmaze:2207516",
        "title": "Backwoods Old Fashioned",
        "season": 11,
        "episode": 4,
        "released": "2021-11-17",
        "overview": "Mark and Digger hit a wall transporting Tennessee water to Popcorn's North Carolina still site. Mark and Huck attempt to make fortified wine the old-fashioned way - with their feet. Richard tries to summon the green fairy for a New Orleans absinthe buyer."
      },
      {
        "id": "tvmaze:2207517",
        "title": "Like Water for Moonshine",
        "season": 11,
        "episode": 5,
        "released": "2021-11-24",
        "overview": "When Mark and Digger ask to run on commercial property, the answer is as shocking as the results. Mike and Jerry turn blueberries into top shelf brandy, but it's the mash that's worth celebrating. Richard chases the green fairy to make backwoods absinthe."
      },
      {
        "id": "tvmaze:2213979",
        "title": "Champagne or Shine Pain?",
        "season": 11,
        "episode": 6,
        "released": "2021-12-01",
        "overview": "Mark and Digger attempt to reroute a limestone creek over a mountain and onto private property. Mike drops a bombshell on Jerry while making backwoods blueberry champagne. Mark and Huck experiment with making moonshine from a surplus of raspberry syrup."
      },
      {
        "id": "tvmaze:2222725",
        "title": "Bottle Shock",
        "season": 11,
        "episode": 7,
        "released": "2021-12-08",
        "overview": "Mark and Digger retrieve their sea-aged whiskey only to discover how easily it slips through their fingers. Richard and Craig run into trouble upsizing absinthe production. Tickle and the Laws look to moonshine history to get their season on track."
      },
      {
        "id": "tvmaze:2227795",
        "title": "Mountain Mayhem",
        "season": 11,
        "episode": 8,
        "released": "2021-12-15",
        "overview": "Mark and Digger search in an unlikely location for the ideal spot to sea-age their Tennessee Whiskey. A wrong turn earns Josh his next broken bone. When Jerry gets rushed to the ER, his partner is forced to figure out a complex recipe without him."
      },
      {
        "id": "tvmaze:2234546",
        "title": "Young Guns",
        "season": 11,
        "episode": 9,
        "released": "2021-12-22",
        "overview": "Mark and Digger revisit the abandoned theme park of their misspent youth and convert a carnival ride into a whiskey-aging machine. Mark Rogers invites young-gun Amanda to trade knowledge for wisdom. Mike's blueberry champagne is the toast of his wedding."
      },
      {
        "id": "tvmaze:2240559",
        "title": "Appalachian Ambrosia",
        "season": 11,
        "episode": 10,
        "released": "2022-01-05",
        "overview": "Mark and Digger make a high-proof version of a favorite Southern dessert. Tim takes a backwoods ritual into the lab and onto store shelves. Amanda lends Mark and Huck her cutting edge process for infusing flavor into their old-school corn whiskey."
      },
      {
        "id": "tvmaze:2245818",
        "title": "Hard Seltzer",
        "season": 11,
        "episode": 11,
        "released": "2022-01-12",
        "overview": "When Josh devises a formula for a profitable hard seltzer, he must convince Tickle and the Laws to contribute their valuable peach brandy to a risky enterprise. Mark and Digger attempt to turn a windfall of scuppernong grapes into Appalachian cognac."
      },
      {
        "id": "tvmaze:2248298",
        "title": "Under Pressure",
        "season": 11,
        "episode": 12,
        "released": "2022-01-19",
        "overview": "Amanda helps Mark and Huck use science to infuse fresh-picked pears into their traditional corn shine. Richard teams up with Mark and Digger to make cherry cognac. Jerry returns from his close call to help Mike build a waterfall still site in Tennessee."
      },
      {
        "id": "tvmaze:2255738",
        "title": "Moonshine of Mexico",
        "season": 11,
        "episode": 13,
        "released": "2022-01-26",
        "overview": "Tim treks to the town of Tequila in search of the legendary moonshine of Mexico. Tickle, Josh and the Laws build an assembly line of submarine stills for a large-scale run of pricey cherry shine. Mark and Digger take backwoods rye to a whole new level."
      },
      {
        "id": "tvmaze:2260762",
        "title": "Sweet Home Appalachia",
        "season": 11,
        "episode": 14,
        "released": "2022-02-02",
        "overview": "Mark and Digger break the sound barrier finishing a run of straight rye for a Southern Rock customer. Richard makes a Big Easy classic for a demanding New Orleans chef. Jerry gets his shine groove back helping Mike reinvent a taste of the South."
      },
      {
        "id": "tvmaze:2266149",
        "title": "Tennessee Royalty",
        "season": 11,
        "episode": 15,
        "released": "2022-02-09",
        "overview": "Mark and Digger team up with Danielle Parton to run the first moonshine in decades on her legendary family property. Tim heads to the highlands of Jalisco to harvest blue agave to run Tequila. Richard invents a flammable recipe for a New Orleans chef."
      },
      {
        "id": "tvmaze:2272570",
        "title": "High Proof Highlands",
        "season": 11,
        "episode": 16,
        "released": "2022-02-23",
        "overview": "When Josh moves into a remote farmhouse, Tickle and the Laws help devise an underground transport operation. In the highlands of Mexico, Tim gets hands-on turning 7-year-old agave into age-worthy tequila. Mike and Jerry attempt a sweet corn shine recipe."
      },
      {
        "id": "tvmaze:2273242",
        "title": "Broken Spanish",
        "season": 11,
        "episode": 17,
        "released": "2022-03-02",
        "overview": "Tim heads south to Oaxaca to uncover centuries-old secrets of making Mezcal. With costly sweet corn mash about to expire, Jerry jury rigs auto parts to help accelerate the flow of liquor. Richard and Craig attempt a crystal-clear Bloody Mary moonshine."
      },
      {
        "id": "tvmaze:2284092",
        "title": "Moo Shine",
        "season": 11,
        "episode": 18,
        "released": "2022-03-09",
        "overview": "When Digger scores a tank of fresh milk, he and Mark attempt to solve the mystery of turning milk into moonshine. Tickle and Josh ramp up underground operations at the Law's rental house, while hunting dogs invade Mike and Jerry's mountain still site."
      },
      {
        "id": "tvmaze:2287994",
        "title": "It Takes Amanda",
        "season": 11,
        "episode": 19,
        "released": "2022-03-16",
        "overview": "Amanda returns to the mountains to help Mark and Huck crack the recipe for making shine from a rare breed of corn. Tim gets hands-on making old-school mezcal with volcanic rock and a horse-drawn stone wheel. Mike and Jerry attempt to make gin from quinoa."
      },
      {
        "id": "tvmaze:2291655",
        "title": "Spirit in the Sky",
        "season": 11,
        "episode": 20,
        "released": "2022-03-23",
        "overview": "Digger enlists Daniel to attempt the first large-scale run of his innovative milk-based liquor recipe. Richard combines Digger's sea aging with his own award-winning recipe to attempt his best liquor yet. Mike and Jerry upgrade their backwoods column still."
      },
      {
        "id": "tvmaze:2297988",
        "title": "Burning Down the House",
        "season": 11,
        "episode": 21,
        "released": "2022-03-30",
        "overview": "In the season finale, just as Mark and Digger undertake their large-scale bootleg to Nashville, the law makes an unwelcome return. Tim gets a shock when Mexican moonshiners make him liquor with meat. Josh sparks a conflagration at Henry's rental house."
      },
      {
        "id": "tvmaze:2417487",
        "title": "High Price of Success",
        "season": 12,
        "episode": 1,
        "released": "2022-11-09",
        "overview": "It's the season 12 premiere and prices are going nuts. Mark and Digger discover they're under investigation by the law. Mike and Jerry recruit Popcorn Sutton's son and Josh goes into hiding when a fire marshal tracks the source of his house fire."
      },
      {
        "id": "tvmaze:2424975",
        "title": "The Harder They Fall",
        "season": 12,
        "episode": 2,
        "released": "2022-11-16",
        "overview": "After losing their water source, Mark and Digger attempt to dig out a centuries-old spring. Confounded by lumber prices, Josh tells Tickle and the Laws he can fell big timber for a 1000 gallon still. Richard and Daniel form a Master Distiller dream team."
      },
      {
        "id": "tvmaze:2428739",
        "title": "More Cops Less Copper",
        "season": 12,
        "episode": 3,
        "released": "2022-11-23",
        "overview": "Mark and Digger skirt the law and make scotch in a pot still designed by Popcorn Sutton. Mark, Huck and Amanda have their copper stolen while Richard and Daniel use game cameras to protect their stills."
      },
      {
        "id": "tvmaze:2433546",
        "title": "Long Arm of Kenny Law",
        "season": 12,
        "episode": 4,
        "released": "2022-11-30",
        "overview": "Fed up with canned food and hiding in the woods, Josh gets into trouble with Kenny Law. Popcorn's son proves as unpredictable as his notorious dad. Tim and Howard rediscover a lost recipe for log still whiskey invented by a Kentucky teenager in 1836."
      },
      {
        "id": "tvmaze:2436758",
        "title": "Hell-Bent Detective",
        "season": 12,
        "episode": 5,
        "released": "2022-12-07",
        "overview": "A police detective confronts Mark and Digger at the pump and doesn't mince words about his intent. Tickle and the Laws attempt to help as Josh's sanity erodes surviving in the woods. Tim and Howard construct a 19th century wood still from a giant log."
      },
      {
        "id": "tvmaze:2444810",
        "title": "Rock Out While the Cop's Out",
        "season": 12,
        "episode": 6,
        "released": "2022-12-14",
        "overview": "Mark and Digger score ten tons of sugar only to find a tracking device on their truck. Richard and Daniel devise a rum recipe to dominate the outlaw market. Mike and Jerry hit the jackpot with sweet-smelling mimosa liquor but catch wind of a new rival."
      },
      {
        "id": "tvmaze:2453178",
        "title": "The Weevils in the Details",
        "season": 12,
        "episode": 7,
        "released": "2023-01-04",
        "overview": "When weevils infest Mark and Digger's pricey grain, they must get rid of the bugs without killing their malt process. Tim and Howard fire up a log still with explosive consequences. Josh breaks out of his backwoods prison only to find himself up a creek."
      },
      {
        "id": "tvmaze:2466519",
        "title": "Still Imploder",
        "season": 12,
        "episode": 8,
        "released": "2023-01-11",
        "overview": "In a rare lapse of judgment, Richard implodes Daniel's $3,000 copper still. As the fire marshal ramps up his investigation, Josh makes a tough decision to flee the country. Tim's solution to a centuries-old still build is going to sting a bit for Howard."
      },
      {
        "id": "tvmaze:2466520",
        "title": "Caffeinated Moonshine",
        "season": 12,
        "episode": 9,
        "released": "2023-01-18",
        "overview": "Josh searches for a recipe for caffeinated moonshine in the Brazilian highlands. Mark and Digger help Richard salvage the copper still he destroyed before Daniel returns."
      },
      {
        "id": "tvmaze:2466522",
        "title": "Foreign Exchange",
        "season": 12,
        "episode": 10,
        "released": "2023-01-25",
        "overview": "Josh gets a hands-on lesson in quickly turning sugar cane into high-proof liquor in Brazil. Mike and Jerry prepare to retaliate after Richard and Craig start a backwoods turf war."
      },
      {
        "id": "tvmaze:2468673",
        "title": "Brazilian Bootleg",
        "season": 12,
        "episode": 11,
        "released": "2023-02-01",
        "overview": "Josh feels the heat when a Brazilian moonshiner pressures him to attempt an illegal bootleg run far from home. Law enforcement ambushes Mark Ramsey in his own garage. In Maggie Valley, Mike"
      },
      {
        "id": "tvmaze:2478413",
        "title": "Above the Law",
        "season": 12,
        "episode": 12,
        "released": "2023-02-08",
        "overview": "As the Maggie Valley moonshine market shifts in favor of Richard and Craig's recipes, Mike and Jerry devise a plot to push the newcomers out of town. Mark and Digger convince Killer Beaz to take on the riskiest parts of Mark's illicit activities."
      },
      {
        "id": "tvmaze:2483290",
        "title": "Mystery Moonshiner",
        "season": 12,
        "episode": 13,
        "released": "2023-02-15",
        "overview": "Josh learns a method of making liquor that breaks all the rules in Brazil. Richard and Craig protect their operation from bears while Mike and Jerry dabble in elderberry moonshine and sabotage."
      },
      {
        "id": "tvmaze:2490970",
        "title": "Party Like It's 1999",
        "season": 12,
        "episode": 14,
        "released": "2023-03-01",
        "overview": "To beat inflation, Mark and Digger attempt an old-school run of liquor they can sell at a 1990s price. Danielle Parton teams up with Henry and Kenny to make legendary Franklin County moonshine. Richard and Craig discover a rival's stash house."
      },
      {
        "id": "tvmaze:2495302",
        "title": "On the Road Again",
        "season": 12,
        "episode": 15,
        "released": "2023-03-08",
        "overview": "Tickle asks Tim to help convert a bus into a mobile moonshine rig; Digger and Beaz scramble to save a big sale for a rising country star who happens to be Willie Nelson's granddaughter; Richard and Craig abandon their still site."
      },
      {
        "id": "tvmaze:2498573",
        "title": "Hard Evidence",
        "season": 12,
        "episode": 16,
        "released": "2023-03-15",
        "overview": "Josh returns from Brazil only to discover an emboldened fire marshal with pressing questions. Amanda convinces Mark and Huck to make rye whiskey without using sugar. Digger and Beaz race to make a $15,000 whiskey run for Nashville royalty."
      },
      {
        "id": "tvmaze:2501537",
        "title": "Maggie Valley Mayhem",
        "season": 12,
        "episode": 17,
        "released": "2023-03-22",
        "overview": "Josh and the Laws get permission from 95-year-old moonshine legend Cecil Love to retrieve a hidden still and recreate his oldtime Franklin County moonshine recipe. Richard and Craig jury rig a fix for their missing still arm, with disastrous results."
      },
      {
        "id": "tvmaze:2509393",
        "title": "Disappearing Act",
        "season": 12,
        "episode": 18,
        "released": "2023-03-29",
        "overview": "Digger enlists a combat veteran to run his supernatural rye apple recipe, then pulls his own disappearing act; Richard and Craig struggle to keep their mash warm in cold weather; Jerry engineers some backwoods tech to keep making shine into winter."
      },
      {
        "id": "tvmaze:2514090",
        "title": "The Box From Brazil",
        "season": 12,
        "episode": 19,
        "released": "2023-04-05",
        "overview": "A Pittsburgh shiner convinces Digger and Beaz to cash in on a whole new market; Josh gets a special delivery and convinces the Laws to attempt the high-speed moonshine he witnessed in Brazil."
      },
      {
        "id": "tvmaze:2514499",
        "title": "Shine for End Times",
        "season": 12,
        "episode": 20,
        "released": "2023-04-12",
        "overview": "When Killer Beaz closes a sixty-gallon sale, Digger opens the door to his partner's secret; Tickle completes his mobile still build only to learn the law will stop a school bus; Mike digs in his heels and possibly, his own grave."
      },
      {
        "id": "tvmaze:2712850",
        "title": "Moonshine is a Miracle",
        "season": 13,
        "episode": 1,
        "released": "2024-01-02",
        "overview": "Tickle launches a campaign to legalize home distilling, while Mark and Digger devise a plan to distill pallets of unsold light beer into liquor. Hobbled by racing injuries, Josh plots his return to making shine. Then, Digger makes a shocking revelation."
      },
      {
        "id": "tvmaze:2719066",
        "title": "Try That in a Shine Town",
        "season": 13,
        "episode": 2,
        "released": "2024-01-09",
        "overview": "An unshackled Digger leads Amanda to where he last saw Popcorn Sutton's stainless steel still. Richard and Mike's uneasy alliance faces a common threat when an extortionist shine boss demands payment. Josh modifies a vehicle, returning to the woods."
      },
      {
        "id": "tvmaze:2719067",
        "title": "Beer Before Liquor",
        "season": 13,
        "episode": 3,
        "released": "2024-01-16",
        "overview": "Digger and Amanda's plan to distill beer in Popcorn Sutton's old still hits a wall. Jerry designs an innovative still that combines multiple shine recipes in a single run. Josh's mission to surprise his partners leaves him trapped in a vanload of peaches."
      },
      {
        "id": "tvmaze:2719068",
        "title": "The Drunkest President",
        "season": 13,
        "episode": 4,
        "released": "2024-01-23",
        "overview": "Tickle unearths an exceptional source of spring water for Josh's peach brandy. Tim sets out to resurrect a spirit that fueled America's most intoxicated president. Mike convinces Richard to ignore an extortion attempt and risk angering a local mob boss."
      },
      {
        "id": "tvmaze:2744207",
        "title": "Quarter Ton of Backwoods Fun",
        "season": 13,
        "episode": 5,
        "released": "2024-01-30",
        "overview": "Amanda and Kelly attempt to re-invent an Appalachian apple brandy made famous by a 500-pound woman. Mark and Digger lend Popcorn Sutton's condenser to an ambitious new team of shiners. Richard and Jerry find a common cause, putting Mike in the hot seat."
      },
      {
        "id": "tvmaze:2749951",
        "title": "Tennessee Spirit",
        "season": 13,
        "episode": 6,
        "released": "2024-02-06",
        "overview": "When Amanda tracks down a lost apple variety once famous for making outlaw brandy, she and Kelly turn out an extraordinary liquor that Mark and Digger find themselves too deep in the bottle. Tim and Howard invent a novel double-distilling device."
      },
      {
        "id": "tvmaze:2757382",
        "title": "Legalize It!",
        "season": 13,
        "episode": 7,
        "released": "2024-02-13",
        "overview": "Accident-prone Josh attempts a solo fix to his still site, while Tickle heads to the West Virginia State House to launch his legalization campaign. Arkansas double cousins Big Chuk and Joe Boy risk bootlegging their shine by boat downriver to Louisiana."
      },
      {
        "id": "tvmaze:2765436",
        "title": "Highway Robbery",
        "season": 13,
        "episode": 8,
        "released": "2024-02-20",
        "overview": "On the mid-season finale, after losing $11,000 in stolen liquor, Mark and Digger surveil their bootlegger on a second delivery to Memphis. Tickle preps to open his own restaurant, but outlaw habits die hard as he makes it a distribution hub for shine."
      },
      {
        "id": "tvmaze:2775843",
        "title": "Tickle's Restaurant",
        "season": 13,
        "episode": 9,
        "released": "2024-04-02",
        "overview": "On the midseason premiere, Tickle and Carol open their new restaurant while Tickle contends with conflicting priorities. Mark and Digger enlist Amanda to improve their wildly popular hazelnut rum. Back on his own two feet, Josh shocks his outlaw partners."
      },
      {
        "id": "tvmaze:2803402",
        "title": "Boldest Bootleg",
        "season": 13,
        "episode": 10,
        "released": "2024-04-09",
        "overview": "Under cover of Tickle's new restaurant and Josh's new towing business, the Virginia boys attempt a 500-gallon bootleg. When the creek runs dry, Jerry designs what he hopes will be a revolutionary waterless still. Tim and Howard make rum from corn stalks."
      },
      {
        "id": "tvmaze:2812350",
        "title": "The Grapes of Grappa",
        "season": 13,
        "episode": 11,
        "released": "2024-04-16",
        "overview": "Mark and Digger challenge Amanda to distill brandy and grappa from the same grapes. After Jerry's copper still vanishes, the Maggie Valley trio scours the scrapyards. The Ozark double cousins track a Hot Springs water source to make Prohibition shine."
      },
      {
        "id": "tvmaze:2823980",
        "title": "Carolina Crash Course",
        "season": 13,
        "episode": 12,
        "released": "2024-04-23",
        "overview": "Mark and Digger invent a patriotic corn whiskey recipe using red, white and blue corn. Jerry's stolen still threatens to drive a wedge between partners. Accident-prone Josh returns to the safety of his home, only to crash his minivan into his own house."
      },
      {
        "id": "tvmaze:2831107",
        "title": "Shine Pods",
        "season": 13,
        "episode": 13,
        "released": "2024-04-30",
        "overview": "When their bootlegger suggests putting shine in pods, Mark and Digger enlist Amanda to innovate a product they can sell for $5 a shot. Jerry confronts the thief who stole his waterless still. Big Chuk and Joe Boy price themselves out of their own market."
      },
      {
        "id": "tvmaze:2838270",
        "title": "Don't Call it Crapple",
        "season": 13,
        "episode": 14,
        "released": "2024-05-07",
        "overview": "When kitchen trouble forces Tickle to shut down his restaurant, Josh proposes they make carrot-apple moonshine to raise the $8000 needed to reopen. Mike, Jerry, and Richard secure a secretive location to run apple pomace brandy in their waterless still."
      },
      {
        "id": "tvmaze:2839615",
        "title": "Cowboy Legacy",
        "season": 13,
        "episode": 15,
        "released": "2024-05-14",
        "overview": "Mark and Digger invent a high-proof thump keg. When news breaks that their friend Cowboy has been killed, they hurry to retrieve a barrel he was tending. Tickle puts faith in an unproven recipe to save his restaurant. Jerry designs a solar mash fermenter."
      },
      {
        "id": "tvmaze:2849578",
        "title": "The Curse of Oaked Bourbon",
        "season": 13,
        "episode": 16,
        "released": "2024-05-21",
        "overview": "After tasting their best barrel yet, Mark and Digger make a run to rival $2,000 bourbon in the season finale. Tickle makes a daring deal selling shine at a wrestling match to reopen his restaurant. Mike faces the daunting prospect of Richard's revenge."
      },
      {
        "id": "tvmaze:3037939",
        "title": "Backlash From the Backwoods",
        "season": 14,
        "episode": 1,
        "released": "2024-11-12",
        "overview": "After Mark and Digger sell a $20,000 barrel of whiskey, they realize someone has been siphoning their liquor for years. Mark Rogers plots backwoods justice after finding Mike on his turf. Josh lands a lucrative deal, but Tickle and Henry have other ideas."
      },
      {
        "id": "tvmaze:3044458",
        "title": "Code Enforcement",
        "season": 14,
        "episode": 2,
        "released": "2024-11-19",
        "overview": "Mark and Digger spot their liquor thief on camera as Tickle, Josh and Henry strike gold in Philadelphia with their Peach-Rye recipe. Mike adds insult to injury when he buys out Mark Rogers' sugar supplier, pushing the backwoods shiner to the brink."
      },
      {
        "id": "tvmaze:3050056",
        "title": "Knockout Punch",
        "season": 14,
        "episode": 3,
        "released": "2024-11-26",
        "overview": "Backwoods shiner Mark Rogers delivers a decisive blow to Mike and Jerry, forcing them to rethink their strategy from a distance. Tim Smith faces a crisis and recruits Howard to help revive his flagging sales. Mark and Digger identify their liquor thief."
      },
      {
        "id": "tvmaze:3058819",
        "title": "Bootleg Bottleneck",
        "season": 14,
        "episode": 4,
        "released": "2024-12-03",
        "overview": "Tickle's crew resurrects a 400-mile bootleg route from the 1980s, but a shine spill puts them face-to-face with the law. Richard attempts a risky liquor that uses mold to aid in fermentation. Tim turns to honey to get his shine sales buzzing."
      },
      {
        "id": "tvmaze:3067248",
        "title": "Vengeance is Shine",
        "season": 14,
        "episode": 5,
        "released": "2024-12-10",
        "overview": "Mark and Digger corner a man who stole 175 gallons of their barrel-aged liquor. Mike and Jerry retreat to Mississippi to raise cash for their vengeful return. Amanda and Kelly's cinnamon roll moonshine fails the taste test until Mark proposes a solution."
      },
      {
        "id": "tvmaze:3075383",
        "title": "Unintended Consequences",
        "season": 14,
        "episode": 6,
        "released": "2024-12-17",
        "overview": "Mark and Digger recruit Patti Bryan to help make hot pepper moonshine and nearly blind themselves in the process. When Tickle over-orders blueberries for his restaurant, he has some explaining and shine-making to do. Mark and Huck build a bootleg boat."
      },
      {
        "id": "tvmaze:3088547",
        "title": "Respect Your Elderberries",
        "season": 14,
        "episode": 7,
        "released": "2025-01-07",
        "overview": "Mark and Digger task Amanda and Kelly to find a poisonous berry they can turn into tasty, safe-to-drink shine. Tickle builds a \"dead man's\" still to keep himself out of the doghouse. A bootleg river journey takes Mark and Huck into uncharted waters."
      },
      {
        "id": "tvmaze:3095442",
        "title": "Bolt Action",
        "season": 14,
        "episode": 8,
        "released": "2025-01-14",
        "overview": "Mark and Digger recruit a young Kentucky moonshiner to help craft a profitable outlaw bourbon. After tracking Mark and Huck to their mountain still site, Mike and Jerry initiate their revenge plan until a well-aimed shot unexpectedly turns the tables."
      },
      {
        "id": "tvmaze:3105429",
        "title": "Smokin' Barrels",
        "season": 14,
        "episode": 9,
        "released": "2025-01-21",
        "overview": "Mark and Digger shop for new oak barrels, but after spotting an unmarked vehicle surveilling their barrel house, the duo must devise an alternative way to sell their bourbon. A friendly liquor run with Big Chuk lands Josh back in a high-risk environment."
      },
      {
        "id": "tvmaze:3112102",
        "title": "Floodwater Runs Deep",
        "season": 14,
        "episode": 10,
        "released": "2025-01-28",
        "overview": "After Hurricane Helene flooded Appalachia, Mike and Jerry found their new submarine still washed away. Tickle attempts to persuade accident-prone Josh not to return to racing. Richard gets a special order, but tracking the fruit proves a thorny problem."
      },
      {
        "id": "tvmaze:3117327",
        "title": "Strange Brew",
        "season": 14,
        "episode": 11,
        "released": "2025-02-04",
        "overview": "After discovering a strange barrel of mash, Mark and Digger scramble to reproduce a game-changing liquor run. Tickle and the Laws employ an old moonshiner tactic as cold weather stalls their apple brandy mash. Mike and Jerry rebuild after flood damage."
      },
      {
        "id": "tvmaze:3126149",
        "title": "Spousal Privilege",
        "season": 14,
        "episode": 12,
        "released": "2025-02-11",
        "overview": "Fearing the law is targeting them, Mark and Digger enlist a new team member who can't testify to do the dirty work. Tickle and the Laws get their hands on a field of free sorghum seeds but must rely on an unproven recipe to turn them into shine."
      },
      {
        "id": "tvmaze:3135550",
        "title": "Poaching Pumpkins",
        "season": 14,
        "episode": 13,
        "released": "2025-02-18",
        "overview": "Desperate to save his low-cost sorghum seed liquor, Tickle poaches pumpkins from his wife's patch. When a hippie commune requests a large quantity of hard kombucha, backwoods shiners Mike and Jerry find they still have a lot to learn about fermentation."
      },
      {
        "id": "tvmaze:3144608",
        "title": "Persons of Interest",
        "season": 14,
        "episode": 14,
        "released": "2025-02-25",
        "overview": "Realizing that they may be targets of a police stakeout, Mark and Digger prepare their outlaw distilling teams for the worst. Howard drinks the last bottle of decades-old rye elixir, forcing Tim to recreate his dad's unwritten recipe or lose it forever."
      },
      {
        "id": "tvmaze:3151465",
        "title": "Imposter Syndrome",
        "season": 14,
        "episode": 15,
        "released": "2025-03-04",
        "overview": "Desperate to discover who is surveilling them, Mark and Digger set a trap. Tim and Howard attempt a new path to recreating the family's high-proof elixir recipe. When Big Chuk arrives in Franklin County unexpectedly, Tickle and Henry have concerns."
      },
      {
        "id": "tvmaze:3158089",
        "title": "Resisting Arrest",
        "season": 14,
        "episode": 16,
        "released": "2025-03-11",
        "overview": "In the season finale, Mark and Digger scramble to clear evidence of outlaw activity -- only to discover the law is one step ahead. Mike and Jerry build a column still that runs two proofs at once. In his final run, Kenny lends a hand to a legend in need."
      }
    ]
  }
}