{
  "meta": {
    "id": "tvmaze:34182",
    "type": "series",
    "name": "Love & Hip Hop: Miami",
    "description": "As bold, edgy, gorgeous, and diverse as the city it's set in, Love &amp; Hip Hop: Miami turns up the heat and doesn't hold back in making the 305 the place to be. Multi-platinum selling hip-hop legend Trick Daddy is back in the studio collaborating with his longtime musical ally and rap icon, \"The Diamond Princess\" Trina. Afro-Latina singer, Amara La Negra, faces roadblocks on her journey to cross over to the American music market while Jojo Zarur is an entrepreneur and celebrity stylist whose dreams of dominating the fashion industry might be derailed by family issues. Meanwhile Christopher \"Prince\" Michael Harty and DJ Michelle Pooch are enmeshed in a rivalry to claim party supremacy in the hot and competitive Miami nightlife scene. Miami street legend and rapper signed to Rick Ross' Maybach Music Group, Gunplay, has returned to Miami to stage a musical comeback but he finds himself sucked back into the temptations and vices of the \"real\" Miami, where his demons threaten the fate of both his career and his relationship.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/595/1489987.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/595/1489987.jpg",
    "videos": [
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3455535",
        "title": "Identity Crisis",
        "season": 7,
        "episode": 6,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:1383194",
        "title": "Welcome to Miami",
        "season": 1,
        "episode": 1,
        "released": "2018-01-01",
        "overview": "Trick Daddy and Trina reunite for a long-awaited album. Amara La Negra has big dreams of crossing over into the American music market. Gunplay is back in Miami, ready to face the demons from his past. Boy band sensation, Pretty Ricky, has reunited."
      },
      {
        "id": "tvmaze:1383195",
        "title": "Forbidden Fruit",
        "season": 1,
        "episode": 2,
        "released": "2018-01-08",
        "overview": "Pleasure P and Shay try to pick up the pieces of their relationship. Trick's estranged wife, Joy, comes looking for closure. Veronica Vega and Steph Lecor seek out Young Hollywood to apologize to Amara."
      },
      {
        "id": "tvmaze:1390554",
        "title": "Hey Stranger",
        "season": 1,
        "episode": 3,
        "released": "2018-01-15",
        "overview": "Veronica brings a surprise guest to meet with Amara. Prince's nightlife takeover hits a snag. Jojo deals with family turmoil. Bobby and Jeffrey work on their relationship. An old friend pops up on Pleasure P."
      },
      {
        "id": "tvmaze:1390555",
        "title": "Fashion Victims",
        "season": 1,
        "episode": 4,
        "released": "2018-01-22",
        "overview": "Jeffrey and Malik take their affair to the next level. Amara confronts Veronica Vega over her association with Young Hollywood. Jojo switches teams. Keyara gets payback on Gunplay. Liz and Prince fall out, and Shay faces off with Gabby."
      },
      {
        "id": "tvmaze:1395135",
        "title": "Good Hair",
        "season": 1,
        "episode": 5,
        "released": "2018-01-29",
        "overview": "Amara claps back at her haters. Prince seeks revenge. Pleasure P faces the music with Gabby and Shay. Malik takes the next step in his relationship with Jeffrey, but an unexpected pop-up derails his plans."
      },
      {
        "id": "tvmaze:1405549",
        "title": "Saints & Sinners",
        "season": 1,
        "episode": 6,
        "released": "2018-02-05",
        "overview": "Bobby and Malik vie for Jeffrey's love. Veronica airs out her grievances with Jojo. Trina gets in the middle of Joy and Trick Daddy's divorce, and a sudden loss leads Gunplay into a downward spiral."
      },
      {
        "id": "tvmaze:1410331",
        "title": "I'm Done",
        "season": 1,
        "episode": 7,
        "released": "2018-02-12",
        "overview": "Amara receives career help from an unlikely source. Shay discovers Scrappy's extracurricular activities. Gunplay struggles to overcome his demons. Trick Daddy celebrates a marriage that isn't over, while Joy takes her divorce into her own hands."
      },
      {
        "id": "tvmaze:1413829",
        "title": "Real Talk",
        "season": 1,
        "episode": 8,
        "released": "2018-02-19",
        "overview": "Keyara struggles to cope, while Gunplay grapples with his recent life choices. Trina and Joy double date. Jojo's family drama reaches a fever pitch. Baby Blue finds himself in the middle of more drama. Veronica and Amara's friendship ends in flames."
      },
      {
        "id": "tvmaze:1413830",
        "title": "Crossroads",
        "season": 1,
        "episode": 9,
        "released": "2018-02-26",
        "overview": "Bobby's comments cause a rift in his relationship with Trina. Scrappy and Shay question each other's loyalty. Prince crashes Michelle Pooch's event. Malik and Jeffrey come to a crossroads in their relationship."
      },
      {
        "id": "tvmaze:1413831",
        "title": "TNT",
        "season": 1,
        "episode": 10,
        "released": "2018-03-05",
        "overview": "Trick and Trina throw a backyard barbeque. Keyara leaves Gunplay with an ultimatum. A final face off between Amara and Veronica leaves Young Hollywood and Steph Lecor choosing sides. Shay seeks answers from Joy. Malik and Bobby have a long exchange."
      },
      {
        "id": "tvmaze:1417332",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 11,
        "released": "2018-03-12",
        "overview": "The cast of Love &amp; Hip Hop Miami come together for their first reunion. Trina finds herself in the middle of Bobby and Alvin's drama, and Malik delivers jaw dropping news. Young Hollywood reveals some info about Amara La Negra."
      },
      {
        "id": "tvmaze:1417333",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 12,
        "released": "2018-03-19",
        "overview": "Love &amp; Hip Hop Miami The Reunion continues as host, Nina Parker, gets to the bottom of Young Hollywood's claims. Will the feud between Veronica, Steph, Jojo and Amara end? Prince has problems to deal with when a deleted scene surfaces."
      },
      {
        "id": "tvmaze:1570574",
        "title": "Take It to the House",
        "season": 2,
        "episode": 1,
        "released": "2019-01-02",
        "overview": "Trina and Trick take the stage as TNT to perform a classic. Amara deals with struggles at home and the price of fame. Gunplay and Keyara hit a crossroads in their relationship. Newcomer Jessie Woo arrives on the scene."
      },
      {
        "id": "tvmaze:1588672",
        "title": "Family Matters",
        "season": 2,
        "episode": 2,
        "released": "2019-01-09",
        "overview": "Spectacular returns to Miami on a mission to make things right with his family and Pretty Ricky. Trina gets real with Trick about TNT. Jessie gets welcomed on the scene with an icy reality check."
      },
      {
        "id": "tvmaze:1592755",
        "title": "Familiar Feuds",
        "season": 2,
        "episode": 3,
        "released": "2019-01-16",
        "overview": "Romance blooms amongst an unlikely pair. Shay attempts to get the keys to Miami back from the Diamond Princess. Veronica Vega gets a wake-up call about her career."
      },
      {
        "id": "tvmaze:1593481",
        "title": "Nada, Nada Empanada",
        "season": 2,
        "episode": 4,
        "released": "2019-01-23",
        "overview": "Amara's blossoming friendship with Shay poses a problem for her bestie Jojo. Jessie struggles with her music. Bobby seeks a deal from Trina who is clearing house."
      },
      {
        "id": "tvmaze:1599405",
        "title": "Girl Talk",
        "season": 2,
        "episode": 5,
        "released": "2019-01-30",
        "overview": "Amara and Jessie come face to face again. Trick and Veronica clear the air about the \"word\". Bobby's mom pays him a visit as he decides what to do about his music. Baby Blue ropes his dad in to help get the band backtogether."
      },
      {
        "id": "tvmaze:1604842",
        "title": "Family Treason",
        "season": 2,
        "episode": 6,
        "released": "2019-02-04",
        "overview": "Prince and Bobby's friendship implodes, as Bobby also deals with the ramifications of signing behind Trina's back. Baby Blue and Spec discuss issues plaguing the family."
      },
      {
        "id": "tvmaze:1604843",
        "title": "Me Too",
        "season": 2,
        "episode": 7,
        "released": "2019-02-11",
        "overview": "Jessie shares a haunting secret about her past. Trina lends a hand to help her find a voice. Tarana Burke guest appears, championing victims of abuse. Joy struggles to gain financial freedom due to her ties to Trick."
      },
      {
        "id": "tvmaze:1611962",
        "title": "To Serve and Protect",
        "season": 2,
        "episode": 8,
        "released": "2019-02-18",
        "overview": "Khaotic finds himself in trouble with the law. Pleasure hits the group with news that will affect their reunion. Bobby seeks forgiveness from his \"real\" friends."
      },
      {
        "id": "tvmaze:1615435",
        "title": "Petty Hurts",
        "season": 2,
        "episode": 9,
        "released": "2019-02-25",
        "overview": "Social media gets the best of the frenemy camps. Trick challenges Khaotic to a cook-off."
      },
      {
        "id": "tvmaze:1616872",
        "title": "Performance Anxiety",
        "season": 2,
        "episode": 10,
        "released": "2019-03-04",
        "overview": "Prince performs for the first time. Trick crushes on Amara. Khaotic has a face to face with his estranged father."
      },
      {
        "id": "tvmaze:1618048",
        "title": "Rockstarrs and Reflections",
        "season": 2,
        "episode": 11,
        "released": "2019-03-11",
        "overview": "The cast reacts to Bobby Lytes's request to Trina, Amara La Negra's misunderstanding with Trick Daddy, and Khaotic, Young Hollywood and Joy's discussion about gun violence."
      },
      {
        "id": "tvmaze:1625398",
        "title": "Ready, Set, Release",
        "season": 2,
        "episode": 12,
        "released": "2019-03-18",
        "overview": "Pleasure returns from Australia and goes on a solo, press tour which presses Pretty Ricky to the limit. All gather for Spectacular's bachelor party. Khaotic and Prince go head to head over salacious comments. Trina hits the stage solo."
      },
      {
        "id": "tvmaze:1625399",
        "title": "Reunion Part 1",
        "season": 2,
        "episode": 13,
        "released": "2019-03-18",
        "overview": "On part one of the Love and Hip Hop Miami Reunion, Pretty Ricky tries to put their differences behind them. Joy serves a dish of papers that Trick has no interest in cooking. TNT explodes when Trick and Trina speak their minds."
      },
      {
        "id": "tvmaze:1628787",
        "title": "Reunion Part 2",
        "season": 2,
        "episode": 14,
        "released": "2019-03-25",
        "overview": "On the conclusion of the Love and Hip Hop Miami Reunion, JoJo fends off her haters while Khaotic keeps it 100 with Prince about his attraction to Liz. Bobby and Prince finally reveal the truth about their relationship."
      },
      {
        "id": "tvmaze:1785674",
        "title": "There's No Way",
        "season": 3,
        "episode": 1,
        "released": "2020-01-06",
        "overview": "Miami mourns alongside Trina as she says goodbye to her mother. Amara unveils her new single and her new relationship. Trick Daddy finds new love. Amara's career plans begins to unravel. Joseline Hernandez heads back to town."
      },
      {
        "id": "tvmaze:1785675",
        "title": "On the Record",
        "season": 3,
        "episode": 2,
        "released": "2020-01-13",
        "overview": "Amara confronts the allegations that her manager, Jullian, stole money from Trina head on. Trina decides to pursue an all girls tour. Trick asks Trina to consider his woman for the tour. Joseline Hernandez lands in Miami."
      },
      {
        "id": "tvmaze:1792665",
        "title": "Trick or Treat",
        "season": 3,
        "episode": 3,
        "released": "2020-01-20",
        "overview": "Trina confronts her ex business partner Jullian about her album situation. Emjay pushes Amara to have kids. Joseline tries to stay out of the Miami drama and focus on music. A welcome home party for Brisco goes left."
      },
      {
        "id": "tvmaze:1794478",
        "title": "Blurred Lines",
        "season": 3,
        "episode": 4,
        "released": "2020-01-27",
        "overview": "Amara makes a shocking decision about her manager, Jullian. Miami Tip tries to calm the escalating drama between Sukihana and Nikki Natural. Joseline decides she can't let Premadonna back into Miami without a welcome home gift."
      },
      {
        "id": "tvmaze:1795657",
        "title": "Overstepping Boundaries",
        "season": 3,
        "episode": 5,
        "released": "2020-02-03",
        "overview": "Amara makes a drastic choice about her relationship with Jullian. Joy sets Trick up on a blind date. Trina organizes a bootcamp for the girls tour but everything goes left when Nikki Natural arrives."
      },
      {
        "id": "tvmaze:1795658",
        "title": "Apology Tour",
        "season": 3,
        "episode": 6,
        "released": "2020-02-10",
        "overview": "Trina's bootcamp ends in chaos. PreMadonna decides to take the high road in getting revenge on Joseline. Amara reaches out to old friends. Brisco attempts to make up for lost time. A night out ends behind bars for Trick Daddy."
      },
      {
        "id": "tvmaze:1803814",
        "title": "One Call Away",
        "season": 3,
        "episode": 7,
        "released": "2020-02-17",
        "overview": "Trina and Joy plan an intervention for Trick in the aftermath of his arrest. Amara gets ready for her first major concert without management from Jullian. Sukihana, Hoodbrat and crew decide to go on tour without Trina."
      },
      {
        "id": "tvmaze:1807847",
        "title": "The Ugly Truth",
        "season": 3,
        "episode": 8,
        "released": "2020-02-24",
        "overview": "The newly minted BAPS tour searches for a road manager. Trina and Joy convince Trick to sweat it out. An argument between Miami Tip and Saucy Santana puts Sukihana in the middle. Premadonna gets some information about Amara's man from an old friend."
      },
      {
        "id": "tvmaze:1811135",
        "title": "Take a Bow",
        "season": 3,
        "episode": 9,
        "released": "2020-03-02",
        "overview": "Amara learns some troubling information about Emjay. Trina and Joy plan a family trip to honor Trina's late mother. The girls head out for their first spot date on the forthcoming BAPs tour."
      },
      {
        "id": "tvmaze:1814637",
        "title": "Homecoming",
        "season": 3,
        "episode": 10,
        "released": "2020-03-09",
        "overview": "Trina heads back to her hometown of the Bahamas to celebrate her late mother's birthday. A relaxing spa date for Amara ends in drama as she and Shay reach a boiling point over Emjay. Hood Brat uncovers some disturbing information about her boyfriend."
      },
      {
        "id": "tvmaze:1816919",
        "title": "Pressing Forward",
        "season": 3,
        "episode": 11,
        "released": "2020-03-16",
        "overview": "Sukihana holds a brunch to discuss the issue of colorism, but tensions between Amara and Premadonna serve as a distraction. Trick, Joy, and Bobby join Trina in the Bahamas as they all celebrate Trina's mother. Trick and Joy revisit their relationship"
      },
      {
        "id": "tvmaze:1822261",
        "title": "Full Circle",
        "season": 3,
        "episode": 12,
        "released": "2020-03-23",
        "overview": "Trick and Joy consider rekindling their romantic relationship. Suki's children visit from Atlanta. Trick and Trina throw a party to celebrate the launch of their radio show, but tensions between Amara and Premadonna threaten to wreck the event."
      },
      {
        "id": "tvmaze:1826497",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 13,
        "released": "2020-03-30",
        "overview": "The cast joins host, Claudia Jordan, to dish on a season full of drama. We get to the bottom of Amara and Emjay's relationship woes, Miami Tip and Santana come face to face, and Nikki Natural tests Trina for the last time!"
      },
      {
        "id": "tvmaze:1827117",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 14,
        "released": "2020-04-06",
        "overview": "On the conclusion of the Love and Hip Hop Miami Reunion, Brisco and Chello's relationship is put to the ultimate test, Trick Daddy and Joy rekindle a flame, and we take a look back at some of the best moments of this season."
      },
      {
        "id": "tvmaze:2155312",
        "title": "Miami Is the Moment",
        "season": 4,
        "episode": 1,
        "released": "2021-08-23",
        "overview": "Neri asks N.O.R.E. to step up at home, Trina celebrates the 20th anniversary of her debut album, and Sukihana clashes with her \"momager,\" Lori, over the rapper's desire to have more kids."
      },
      {
        "id": "tvmaze:2155899",
        "title": "Island Time",
        "season": 4,
        "episode": 2,
        "released": "2021-08-30",
        "overview": "Amara considers a new life in the Dominican Republic, emotions run high for Trina on the anniversary of her brother's death, and Shelah Marie and Ace host an awkward Mother's Day brunch."
      },
      {
        "id": "tvmaze:2164083",
        "title": "Thicker Than Water",
        "season": 4,
        "episode": 3,
        "released": "2021-09-06",
        "overview": "Amara is conflicted about staying in the D.R. with Allan, Ray J and Princess come to Miami in search of married friends, and Florence focuses on work while her husband acts suspiciously."
      },
      {
        "id": "tvmaze:2169424",
        "title": "Keep It Nasty",
        "season": 4,
        "episode": 4,
        "released": "2021-09-13",
        "overview": "Suki deals with her arrest, Ray J gets a much-needed cooking lesson, Amara reconnects with her dad and learns an upsetting secret, and Florence channels her anger at Marlon into her music."
      },
      {
        "id": "tvmaze:2171698",
        "title": "Banned in the M.I.A.",
        "season": 4,
        "episode": 5,
        "released": "2021-09-20",
        "overview": "Suki's Instagram ban creates trouble with her grand opening, Florence confronts Marlon over his cheating, and babysitting gets Trina thinking about motherhood."
      },
      {
        "id": "tvmaze:2179336",
        "title": "Tiger Queen",
        "season": 4,
        "episode": 6,
        "released": "2021-09-27",
        "overview": "Trina reconsiders her management team after a bungled photo shoot, Shelah Marie gets advice on how to communicate with her mother-in-law, and Miami Tip steps in to protect Suki from J Kelly."
      },
      {
        "id": "tvmaze:2186683",
        "title": "Wrong Way",
        "season": 4,
        "episode": 7,
        "released": "2021-10-04",
        "overview": "Shelah takes an impromptu trip without Ace, Amara gets tough about her mom's health, Trina Day plans go off the rails, and business matters interfere with Sukihana's relationship."
      },
      {
        "id": "tvmaze:2192588",
        "title": "The Harder They Fall",
        "season": 4,
        "episode": 8,
        "released": "2021-10-11",
        "overview": "Trina gets a wellness wake-up call after following a busy schedule, Trick performs at the Seminole Hard Rock Hotel &amp; Casino, and Suki and Bill see a pastor for premarital counseling."
      },
      {
        "id": "tvmaze:2196927",
        "title": "Show Up and Show Out",
        "season": 4,
        "episode": 9,
        "released": "2021-10-18",
        "overview": "Princess walks the runway, Trina forgets to invite Trick Daddy to her VERZUZ battle, Marlon comes clean to Florence, and Amara tells her mom she's pregnant."
      },
      {
        "id": "tvmaze:2200377",
        "title": "Line In the Sand",
        "season": 4,
        "episode": 10,
        "released": "2021-10-25",
        "overview": "Amara shares sad news with her parents, Ace showcases his new music, Bobby and Joy's relaxing getaway for Trina goes left, and Shelah's Black women retreat has Neri feeling left out."
      },
      {
        "id": "tvmaze:2207256",
        "title": "Indecent Proposal",
        "season": 4,
        "episode": 11,
        "released": "2021-11-01",
        "overview": "Florence makes peace with her sisters after they accuse Marlon of cheating, Kill Bill contemplates his future with Sukihana, and Amara opens up about miscarrying to Princess and Neri."
      },
      {
        "id": "tvmaze:2212288",
        "title": "Bottoms Up",
        "season": 4,
        "episode": 12,
        "released": "2021-11-08",
        "overview": "Amara confronts Allan for not being there during her miscarriage, Bobby Lytes reconnects with his father, and devastating news from Haiti brings Florence and Marlon closer together."
      },
      {
        "id": "tvmaze:2365742",
        "title": "Make Some Noise",
        "season": 4,
        "episode": 13,
        "released": "2022-08-08",
        "overview": "Trina performs at the Legendz of the Streetz Tour, Sukihana is furious at her cousin Isaiah over his mismanagement of the Good Cat Boutique, and Amara loses her cool at her baby shower."
      },
      {
        "id": "tvmaze:2374413",
        "title": "Blessings and Curses",
        "season": 4,
        "episode": 14,
        "released": "2022-08-15",
        "overview": "Sukihana clashes with Isaiah and Kill Bill, Florence and Marlon seek otherworldly support for their Caribbean festival performance, and Shay stuns her friends and family with exciting news."
      },
      {
        "id": "tvmaze:2377985",
        "title": "Grab the Mic",
        "season": 4,
        "episode": 15,
        "released": "2022-08-22",
        "overview": "Noreaga interviews Trina for his \"Drink Champs\" podcast, Bobby Lytes and Raymond sit down for a heated discussion, and Amara flies to Arizona for an event against her doctor's orders."
      },
      {
        "id": "tvmaze:2377986",
        "title": "Stomping Grounds",
        "season": 4,
        "episode": 16,
        "released": "2022-08-22",
        "overview": "Ray J and Princess go their separate ways as their divorce finalizes, N.O.R.E. meets up with old friends from the hip-hop scene, and Florence has a tense sit-down with her nemesis."
      },
      {
        "id": "tvmaze:2382976",
        "title": "Throw That Thang",
        "season": 4,
        "episode": 17,
        "released": "2022-08-29",
        "overview": "Ray J spirals after Kanye West claims a second sex tape with Kim Kardashian exists, Sukihana gets hype for her first stadium show, and Florence meets with a new manager."
      },
      {
        "id": "tvmaze:2383417",
        "title": "Secret Sauce",
        "season": 4,
        "episode": 18,
        "released": "2022-09-05",
        "overview": "Joy is overwhelmed by the divorce process, Ray J is determined to set the record straight about the infamous Kim Kardashian sex tape, and Gaelle's bombshell ruins Florence's big victory."
      },
      {
        "id": "tvmaze:2391991",
        "title": "A Thin Line Between Love and Haiti",
        "season": 4,
        "episode": 19,
        "released": "2022-09-12",
        "overview": "Amara urges Allan to be by her side when she goes into labor, Sukihana works with celebrity choreographer Richy Jackson, and Shay regrets opening up to her mom about an abusive relationship."
      },
      {
        "id": "tvmaze:2397022",
        "title": "Nothing's Sacred",
        "season": 4,
        "episode": 20,
        "released": "2022-09-19",
        "overview": "Trick Daddy promotes his anniversary concert on The Breakfast Club, Amara gives birth prematurely to her twins, and Emjay turns Shay's baby shower into a drama-filled affair."
      },
      {
        "id": "tvmaze:2399919",
        "title": "Return of the Hat",
        "season": 4,
        "episode": 21,
        "released": "2022-09-26",
        "overview": "Trina's caught in the middle of Trick and Joy's feud, Shay wants to break a \"generational curse,\" Amara launches her pop-up shop, and Florence hears yet another shocking rumor about Marlon."
      },
      {
        "id": "tvmaze:2409247",
        "title": "Bad Connection",
        "season": 4,
        "episode": 22,
        "released": "2022-10-03",
        "overview": "Allan and his brother confront Emjay about his treatment of Amara, Bobby makes amends with his family just in time for Trina Day, Trick mentors Kill Bill, and Shay welcomes her daughter."
      },
      {
        "id": "tvmaze:2403261",
        "title": "Deep Cuts",
        "season": 4,
        "episode": 23,
        "released": "2022-10-10",
        "overview": "Suki's surgery brings her closer to Bill, Florence and Marlon's marriage seems beyond repair, Ray J directs a sexy music video, and Amara sits down with estranged ex-manager Jullian."
      },
      {
        "id": "tvmaze:2410527",
        "title": "Beyond Repair",
        "season": 4,
        "episode": 24,
        "released": "2022-10-17",
        "overview": "Shay and her mom seek professional advice, Florence takes drastic action against Gaelle, Ray J is not ready to let Princess go, and Suki and Bill's engagement party ends in disaster."
      },
      {
        "id": "tvmaze:2417910",
        "title": "Reunion",
        "season": 4,
        "episode": 25,
        "released": "2022-10-24",
        "overview": "Host Tamar Braxton mediates Florence and Gaelle's feud, Trina calls out Trick's sexist behavior, Shay reflects on single parenthood, and an on-and-off couple discusses reconciliation."
      },
      {
        "id": "tvmaze:2610117",
        "title": "Out With the Gold",
        "season": 5,
        "episode": 1,
        "released": "2023-08-14",
        "overview": "Amara and Safaree send shockwaves through the 305; Ray J. and Princess clash over their next move; Sukihana's rebrand gets off to a bumpy start; Trick debuts a new look; Trina launches a prestigious new era."
      },
      {
        "id": "tvmaze:2623942",
        "title": "Don't Read the Comments",
        "season": 5,
        "episode": 2,
        "released": "2023-08-21",
        "overview": "Amara and Safaree confront social media backlash; Shay stirs the pot as her relationship hits a snag; an ambitious new artist chases a co-sign from Trina; Gunplay squares off against his new mother-in-law."
      },
      {
        "id": "tvmaze:2624541",
        "title": "Fight for Your Wife",
        "season": 5,
        "episode": 3,
        "released": "2023-08-28",
        "overview": "Ray J. puts it all on the line for Princess. Trina's ex-fiancé fights for a second chance. A shocking reveal threatens to derail Florence's next chapter. Gunplay and Vonshae court controversy."
      },
      {
        "id": "tvmaze:2632161",
        "title": "Caribbean Rhapsody",
        "season": 5,
        "episode": 4,
        "released": "2023-09-04",
        "overview": "Drama erupts at Trina and Flo's single release party; Amara and Safaree seek religious counsel; Bobby and Trick clash; Zoey tries to bridge the gap with her family; controversy consumes Gunplay and Vonshae."
      },
      {
        "id": "tvmaze:2632913",
        "title": "Red Flags",
        "season": 5,
        "episode": 5,
        "released": "2023-09-11",
        "overview": "Suki and Momma Dee's social media beef spills into real life; Ray J. and Trick Daddy plot a pull-up on Marlon; Amara and Safaree hit rough seas; a family feud explodes at Shay Johnson's party."
      },
      {
        "id": "tvmaze:2638320",
        "title": "Mean Girls",
        "season": 5,
        "episode": 6,
        "released": "2023-09-18",
        "overview": "Bobby's reinvention party goes terribly wrong. Zoey Brinxx tries to make a second first impression on Trina. Fabo presses Shay to confront Momma Dee. Eliza Reign comes back outside... and clashes with Miami Tip."
      },
      {
        "id": "tvmaze:2643245",
        "title": "Purseholders",
        "season": 5,
        "episode": 7,
        "released": "2023-09-25",
        "overview": "Zoey faces blowback after her confrontation with Trina's entourage. Princess hosts a dramatic poker night. Vonshae accuses Amara of ghosting her. Florence and Gaelle attempt to work through their issues. Eliza struggles."
      },
      {
        "id": "tvmaze:2647146",
        "title": "Dog Eat Dog",
        "season": 5,
        "episode": 8,
        "released": "2023-10-02",
        "overview": "A trip sparks conflict between Amara and Safaree; Shay brings Fabo and Sandra together, with disastrous results; Trick Daddy's nieces arrive in Miami ready to take the music industry by storm; Gunplay faces down his mother-in-law."
      },
      {
        "id": "tvmaze:2653328",
        "title": "Claws Out",
        "season": 5,
        "episode": 9,
        "released": "2023-10-09",
        "overview": "Amara gathers the ladies to figure out who her real friends are; everything goes wrong on the biggest day of Florence's career; Trina and Zoey cross paths at Sukihana's event; Emjay pulls up as rumors swirl around Fabo."
      },
      {
        "id": "tvmaze:2658622",
        "title": "No-Shows and Low Blows",
        "season": 5,
        "episode": 10,
        "released": "2023-10-16",
        "overview": "After a disastrous festival performance, Florence makes a life-changing decision; a radio interview sends Sukihana into a tailspin; Ray J. and Princess get caught up in Amara and Safaree's drama."
      },
      {
        "id": "tvmaze:2658707",
        "title": "Falling Out",
        "season": 5,
        "episode": 11,
        "released": "2023-10-23",
        "overview": "Florence confronts Trina over the missed performance. Fabo takes on Momma Dee and the Johnson family at Shay's event. Sukihana leaves Zoey high and dry at a critical moment. Vonshae exacts her revenge on Amara."
      },
      {
        "id": "tvmaze:2662818",
        "title": "What We're Not Gonna Do",
        "season": 5,
        "episode": 12,
        "released": "2023-10-30",
        "overview": "Trina collides with Florence and Gaelle at Amara's cosmetics launch; Amara seeks Safaree's support amid public backlash; Zoey gets a co-sign from an industry icon; Sukihana has words with Supa Cindy; The cast reacts to Gunplay's arrest."
      },
      {
        "id": "tvmaze:2749053",
        "title": "Unfinished Business",
        "season": 5,
        "episode": 13,
        "released": "2024-01-22",
        "overview": "After denying their relationship, Amara comes face to face with Safaree. Trina addresses Florence. Shay reveals an emotional secret. Zoey's listening session goes left. Eliza questions her friendships and loyalties."
      },
      {
        "id": "tvmaze:2749118",
        "title": "Watch Yourself",
        "season": 5,
        "episode": 14,
        "released": "2024-01-29",
        "overview": "Shay and Eliza's friendship ends in a confrontation; the father of Amara's children goes off on social media; Gaelle reignites a war with Trina's camp; Florence tells Marlon she's moving forward with their divorce."
      },
      {
        "id": "tvmaze:2749119",
        "title": "Guess Who's Back",
        "season": 5,
        "episode": 15,
        "released": "2024-02-05",
        "overview": "Safaree hooks up with a surprising new flame; Amara fires back at the father of her children."
      },
      {
        "id": "tvmaze:2752291",
        "title": "All of the Lytes",
        "season": 5,
        "episode": 16,
        "released": "2024-02-12",
        "overview": "Bobby's birthday party descends into chaos; accusations fly as Amara confronts the father of her children; Brooke Valentine pulls up in Miami; Shay grapples with an unspeakable tragedy; Trick Daddy raises concerns about his son's rap career."
      },
      {
        "id": "tvmaze:2764878",
        "title": "Get Out",
        "season": 5,
        "episode": 17,
        "released": "2024-02-19",
        "overview": "A scandalous twist and an act of revenge torpedo Florence's cosmetics launch. Amara and Bobby link up to confront the opp. An unexpected guest pulls up on an emotional day for Shay Johnson. Eager for a reset, Trina performs at an HBCU."
      },
      {
        "id": "tvmaze:2768757",
        "title": "Keep It on the Low",
        "season": 5,
        "episode": 18,
        "released": "2024-02-26",
        "overview": "Safaree swears Eliza to secrecy. Trick struggles to get on the same page with Trina as he spearheads plans for Hip-Hop's 50th Anniversary. Florence faces the music with Claudia. Ray J. and Princess make their way back to Miami."
      },
      {
        "id": "tvmaze:2774688",
        "title": "My Messy Valentine",
        "season": 5,
        "episode": 19,
        "released": "2024-03-04",
        "overview": "Brooke and Marcus grapple with culture shock amid the 305's over-the-top drama. Estelita arrives in Miami with reconciliation and revenge on her mind. The truth comes out about Safaree and Eliza. Amara reveals a shocking musical collab."
      },
      {
        "id": "tvmaze:2783232",
        "title": "Safaree Ride",
        "season": 5,
        "episode": 20,
        "released": "2024-03-11",
        "overview": "Amara and Eliza confront each other after all the recent bombshells. Marcus schools Safaree about his behavior towards women. Estelita gets close to Emjay as she pursues a sit-down with Shay. Trick and Trina reach a breaking point. Eliza makes a dramatic decision about her love life."
      },
      {
        "id": "tvmaze:2790508",
        "title": "Hopeless Romantics",
        "season": 5,
        "episode": 21,
        "released": "2024-03-18",
        "overview": "A steamy music video turns up the heat between Amara and Safaree, just as she reconnects with the father of her twins; when Shay publicizes her reunion with Fabo, Gaelle exposes her spiritual machinations."
      },
      {
        "id": "tvmaze:2795368",
        "title": "Island Inferno",
        "season": 5,
        "episode": 22,
        "released": "2024-03-25",
        "overview": "Amara loses control of her girls' trip to the DR. Brooke faces backlash when she invites a controversial cast member. Trina insists on bringing her man to the ladies' getaway. Sandra confronts Shay over her spiritual practices."
      },
      {
        "id": "tvmaze:2800170",
        "title": "A Slap in the Face",
        "season": 5,
        "episode": 23,
        "released": "2024-04-01",
        "overview": "As the cast trip continues, Amara has a dramatic altercation with the father of her twins; Gaelle makes her messiest move yet; Estelita demands an apology from Shay; Trina begs Trick to pull up in the DR."
      },
      {
        "id": "tvmaze:2806023",
        "title": "Stunt Queen",
        "season": 5,
        "episode": 24,
        "released": "2024-04-08",
        "overview": "As the DR trip continues, a surprise pop-up stuns the entire cast. Amara and Allan's relationship hits a disrespectful new low. Marcus and Safaree have a breakthrough. Gaelle's antics trigger a blowout between Florence and Zoey. After refusing to go home, Shay posts a video that has the ladies up in arms. Eliza struggles to come to terms with her daughter's pregnancy."
      },
      {
        "id": "tvmaze:2812299",
        "title": "Nasty Work",
        "season": 5,
        "episode": 25,
        "released": "2024-04-15",
        "overview": "Back in Miami, bombshells threaten to derail one couple's happy ending; Trick and Swurv nearly come to blows at a music festival; Shay makes a choice; Princess spills the tea on her marriage to Ray J."
      },
      {
        "id": "tvmaze:3046284",
        "title": "Blac & White",
        "season": 6,
        "episode": 1,
        "released": "2024-11-18",
        "overview": "Angela \"Blac Chyna\" White makes a bicoastal move with boyfriend Derrick Milano; Amara takes Florence and Eliza to task for ruining her engagement; rumors spread as Trina celebrates a milestone."
      },
      {
        "id": "tvmaze:3049998",
        "title": "Stand On Business",
        "season": 6,
        "episode": 2,
        "released": "2024-11-25",
        "overview": "Shay Johnson gets a nasty surprise at Florence's Grand Opening. Trina's boyfriend drops a bomb on her brother Snoop. Florence and Gaelle go toe to toe with Eliza and Estelita. Zoey's sister reveals a shocking secret."
      },
      {
        "id": "tvmaze:3049999",
        "title": "Lovesick",
        "season": 6,
        "episode": 3,
        "released": "2024-12-02",
        "overview": "Amara and Marlon make an unexpected connection. Shay investigates the allegations about Fabo. Derrick hosts a party that tests Angela. Trick Daddy deals with the after-effects of a near-death experience. Bobby accuses Trina of infidelity."
      },
      {
        "id": "tvmaze:3050552",
        "title": "Blinded By The Lies",
        "season": 6,
        "episode": 4,
        "released": "2024-12-09",
        "overview": "Shay Johnson makes a discovery about Fabo; Trina checks Bobby for spreading rumors; Hawt Topic confronts a mysterious email; Trick Daddy spins the block; the Hollywood Twins are divided."
      },
      {
        "id": "tvmaze:3060478",
        "title": "Breaking Point",
        "season": 6,
        "episode": 5,
        "released": "2024-12-16",
        "overview": "Shay and Fabo seek Marcus Black's help for their relationship; Trina confronts Hawt Topic; Amara takes swimming lessons from Florence's husband; Zoey doubts a new friend's motives."
      },
      {
        "id": "tvmaze:3064327",
        "title": "Take the Cake",
        "season": 6,
        "episode": 6,
        "released": "2024-12-23",
        "overview": "Florence discovers that Amara and Marlon have been spending time together; Angela and Derrick struggle through creative differences in the studio; Trick grows suspicious of his new love interest; Zoey confronts a friend."
      },
      {
        "id": "tvmaze:3080222",
        "title": "Somebody's Husband",
        "season": 6,
        "episode": 7,
        "released": "2024-12-30",
        "overview": "Ray J. and Amara's business meeting takes an unexpected turn; Florence embarks on a seductive quest for revenge; Shay's family celebrates her breakup; Trick's new romance leads to a social media uproar; Brooke and Marcus bump heads."
      },
      {
        "id": "tvmaze:3084724",
        "title": "Lashing Out",
        "season": 6,
        "episode": 8,
        "released": "2025-01-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3084727",
        "title": "Sound & Fury",
        "season": 6,
        "episode": 9,
        "released": "2025-01-13",
        "overview": "Chaos consumes Estelita's event. Ray J. drops a shocking new bombshell. Amara plots revenge on Princess. Marlon pulls up on Florence and Allan. Zoey and Chyng find common ground."
      },
      {
        "id": "tvmaze:3107246",
        "title": "Tea N' Tea",
        "season": 6,
        "episode": 10,
        "released": "2025-01-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3113995",
        "title": "Certified Hater",
        "season": 6,
        "episode": 11,
        "released": "2025-01-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3119268",
        "title": "Curse Control",
        "season": 6,
        "episode": 12,
        "released": "2025-02-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3128191",
        "title": "Screaming, Crying, Thwowing Up",
        "season": 6,
        "episode": 13,
        "released": "2025-02-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3136259",
        "title": "Small Fry",
        "season": 6,
        "episode": 14,
        "released": "2025-02-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3145666",
        "title": "Throw The Book At Him",
        "season": 6,
        "episode": 15,
        "released": "2025-02-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3160029",
        "title": "Acting Up",
        "season": 6,
        "episode": 16,
        "released": "2025-03-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3160030",
        "title": "Want That Old Thing Back",
        "season": 6,
        "episode": 17,
        "released": "2025-03-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3165998",
        "title": "He Loves Me Not",
        "season": 6,
        "episode": 18,
        "released": "2025-03-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3177983",
        "title": "Secret Agenda",
        "season": 6,
        "episode": 19,
        "released": "2025-03-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3177984",
        "title": "Fights & Feelings",
        "season": 6,
        "episode": 20,
        "released": "2025-03-31",
        "overview": ""
      },
      {
        "id": "tvmaze:3177985",
        "title": "Chaos in Curacao",
        "season": 6,
        "episode": 21,
        "released": "2025-04-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3185187",
        "title": "Heaven Is A Place On Earth",
        "season": 6,
        "episode": 22,
        "released": "2025-04-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3213359",
        "title": "Paradise Lost",
        "season": 6,
        "episode": 23,
        "released": "2025-04-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3211051",
        "title": "Uncharted Waters",
        "season": 6,
        "episode": 24,
        "released": "2025-04-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3406555",
        "title": "The Last Laugh",
        "season": 7,
        "episode": 1,
        "released": "2025-11-04",
        "overview": "Michael Blackson gets ready for a big move to Miami, while hiding a big secret from his pregnant fiancée Rada. Amara checks Miami Tip for stirring the pot with the wife of her children's father. Women from Trick Daddy's past thr."
      },
      {
        "id": "tvmaze:3429850",
        "title": "Sister Circle",
        "season": 7,
        "episode": 2,
        "released": "2025-11-11",
        "overview": "Michael Blackson arrives in Miami as pressure builds over his secret; Trick Daddy's past and present collide at a dinner party; Shay, Eliza and Amara attempt to find common ground with the help of Samantha."
      },
      {
        "id": "tvmaze:3431431",
        "title": "Wife On The Line",
        "season": 7,
        "episode": 3,
        "released": "2025-11-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3431432",
        "title": "Mama's Baby, Daddy's Maybe",
        "season": 7,
        "episode": 4,
        "released": "2025-11-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3431433",
        "title": "Scorned",
        "season": 7,
        "episode": 5,
        "released": "2025-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3455535",
        "title": "Identity Crisis",
        "season": 7,
        "episode": 6,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3466360",
        "title": "Ten Toes Down",
        "season": 7,
        "episode": 7,
        "released": "2025-12-16",
        "overview": ""
      }
    ]
  }
}