{
  "meta": {
    "id": "tvmaze:79839",
    "type": "series",
    "name": "Harry Potter: Wizards of Baking",
    "description": "Harry Potter: Wizards of Baking invites fans to mix, whisk and glaze their way to success, with professional pastry chefs competing against each other to create enchanting sweet treats, themed around the Harry Potter stories. Will the bakers be able to channel their inner Mrs Weasley? Or will their attempts be as successful as one of Seamus Finnigan's exploding cauldrons?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/543/1359464.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/543/1359464.jpg",
    "videos": [
      {
        "id": "tvmaze:3434125",
        "title": "The Goblet of Fire",
        "season": 2,
        "episode": 6,
        "released": "2025-12-07",
        "overview": "The final teams create showpieces celebrating the Goblet of Fire."
      },
      {
        "id": "tvmaze:3014409",
        "title": "Platform 9 3/4",
        "season": 1,
        "episode": 1,
        "released": "2024-11-14",
        "overview": "Hosts James and Oliver Phelps welcome nine pairs of gifted professional pastry chefs and cake artists to Warner Bros. Leavesden Studios, home to the iconic sets of the Harry Potter films. For their first challenge, the bakers must create an edible showpiece that is at least 2 feet tall, includes at least one magical effect, and tells the story of their shared love of Harry Potter. Plus, each team member must make a tasting element that showcases their individual specialty. Expert culinary judges Carla Hall and Jozef Youssef decide which bakers will earn a ticket to board the Hogwarts Express train to the next challenge!"
      },
      {
        "id": "tvmaze:3027814",
        "title": "Gringotts Wizarding Bank",
        "season": 1,
        "episode": 2,
        "released": "2024-11-21",
        "overview": "The remaining teams enter the breathtaking world of Gringotts Wizarding Bank to face off in three head-to-head battles. Hosts James and Oliver Phelps ask the bakers to create 3-foot showpieces inspired by the resplendent main hall, the network of tunnels and carts, and the underground vaults. The creations must also include at least one enchanting effect and two tasting elements, plus a surprise hidden treasure! Judges Carla Hall and Jozef Youssef are joined by Harry Potter alumnus Warwick Davis to decide the winner, and one team will be sent home."
      },
      {
        "id": "tvmaze:3031276",
        "title": "Diagon Alley",
        "season": 1,
        "episode": 3,
        "released": "2024-11-28",
        "overview": "In a salute to the famed Diagon Alley, hosts James and Oliver Phelps ask each team to create fifty identical handheld desserts, inspired by one of the many different shops, and feed them to a crowd of eager Harry Potter fans on the actual set. The bakers must present their desserts in a way that highlights an interactive, magical effect. The Potter fans will vote for a winner, while judges Carla Hall and Jozef Youssef decide which team must leave the competition."
      },
      {
        "id": "tvmaze:3041683",
        "title": "The Forbidden Forest",
        "season": 1,
        "episode": 4,
        "released": "2024-12-05",
        "overview": "Inspired by the legendary Forbidden Forest outside Hogwarts, hosts James and Oliver Phelps challenge the baking teams to create a 3-foot-tall grand showpiece that celebrates the dark arts. Plus, one of the two tasting elements must have at least 10 layers and feature an enchanting effect that appears to defy gravity! Judges Carla Hall and Jozef Youssef are joined by Harry Potter alumna Evanna Lynch."
      },
      {
        "id": "tvmaze:3041684",
        "title": "Dumbledore's Office",
        "season": 1,
        "episode": 5,
        "released": "2024-12-12",
        "overview": "It's the semi-finals, and the remaining teams must draw inspiration from the office of headmaster Albus Dumbledore's office, which houses many iconic items from Harry Potter lore. And since the office is also home to Fawkes the Phoenix, hosts James and Oliver Phelps request that part of each team's 4-foot-tall showpiece should appear to be transforming from one thing to another. Plus, the tasting elements must highlight two of the four pillars of flavor: sweet, sour, spicy and salty. Harry Potter alumna Bonnie Wright joins judges Carla Hall and Jozef Youssef to decide which teams will go on to the final showdown."
      },
      {
        "id": "tvmaze:3046814",
        "title": "The Great Hall",
        "season": 1,
        "episode": 6,
        "released": "2024-12-19",
        "overview": "It's the final showdown in the illustrious Great Hall, and hosts James and Oliver Phelps challenge the teams to create a showpiece that reaches at least 6 feet tall and commemorates at least one event that takes place in the Great Hall. The bakers must also include two enchanting culinary effects and incorporate at least two tasting elements. Surprises unfold throughout the finale, including the return of guest judges Warwick Davis, Evanna Lynch and Bonnie Wright, who join judges Carla Hall and Jozef Youssef to crown the first-ever Wizards of Baking champions among a crowd of ecstatic Harry Potter fans."
      },
      {
        "id": "tvmaze:3353072",
        "title": "The House Duels",
        "season": 2,
        "episode": 1,
        "released": "2025-11-02",
        "overview": "In the two-hour premiere, eight teams of two start their journey in The Great Hall where they are sorted by the Sorting Hat into one of the four Hogwarts houses – Gryffindor, Hufflepuff, Ravenclaw, and Slytherin. The first challenge is to craft captivating, edible showpieces inspired by moments from the Harry Potter series and each teams' respective Hogwarts house."
      },
      {
        "id": "tvmaze:3384738",
        "title": "Wizard's Journey",
        "season": 2,
        "episode": 2,
        "released": "2025-11-09",
        "overview": "The remaining six teams create magical transportation-inspired showpieces."
      },
      {
        "id": "tvmaze:3406629",
        "title": "The Edible Artifacts",
        "season": 2,
        "episode": 3,
        "released": "2025-11-16",
        "overview": "The bakers make Polyjuice Potion-inspired hyperrealistic edible showpieces."
      },
      {
        "id": "tvmaze:3406630",
        "title": "Up to No Good",
        "season": 2,
        "episode": 4,
        "released": "2025-11-23",
        "overview": "The bakers create supersized iconic Harry Potter artifacts."
      },
      {
        "id": "tvmaze:3406631",
        "title": "Magical Beasts, Beings, and Creatures",
        "season": 2,
        "episode": 5,
        "released": "2025-11-30",
        "overview": "The bakers create showpieces that bring a Harry Potter creature to life."
      },
      {
        "id": "tvmaze:3434125",
        "title": "The Goblet of Fire",
        "season": 2,
        "episode": 6,
        "released": "2025-12-07",
        "overview": "The final teams create showpieces celebrating the Goblet of Fire."
      }
    ]
  }
}