{
  "meta": {
    "id": "tvmaze:12222",
    "type": "series",
    "name": "National Memorial Day Concert",
    "description": "The National Memorial Day Concert features uplifting musical performances, documentary footage, and dramatic readings that honor the military service of all our men and women in uniform and their families at home. One of PBS' highest-rated programs, featuring an all-star lineup, the multi-award-winning television event has become an American tradition.The concert unites the country in remembrance and appreciation of those who gave their lives for our nation and serves those who are grieving through the mission put forward by Abraham Lincoln in his second inaugural address, \"Let us strive on to finish the work we are in; to bind up the nation's wounds; to care for him who shall have borne the battle, and for his widow, and his orphan.\"The National Memorial Day Concert airs live from the U.S. Capitol to an audience of hundreds of thousands, millions at home, and American troops around the world.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/409/1023083.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/409/1023083.jpg",
    "videos": [
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:2877840",
        "title": "Episode 1",
        "season": 1989,
        "episode": 1,
        "released": "1989-05-28",
        "overview": ""
      },
      {
        "id": "tvmaze:585984",
        "title": "1st Annual National Memorial Day Concert",
        "season": 1990,
        "episode": 1,
        "released": "1990-05-27",
        "overview": ""
      },
      {
        "id": "tvmaze:585985",
        "title": "26th Annual National Memorial Day Concert",
        "season": 2015,
        "episode": 1,
        "released": "2015-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:585986",
        "title": "27th Annual National Memorial Day Concert",
        "season": 2016,
        "episode": 1,
        "released": "2016-05-29",
        "overview": "On the eve of Memorial Day, a star-studded lineup will grace the stage for one of PBS' highest-rated programs. For over 25 years, this multiple-award-winning television event has honored the military service and sacrifice of all our men and women in uniform, their families at home, and those who have made the ultimate sacrifice for our country. The program will be hosted by Tony Award winner Joe Mantegna and Emmy Award winner Gary Sinise."
      },
      {
        "id": "tvmaze:1188867",
        "title": "28th Annual National Memorial Day Concert",
        "season": 2017,
        "episode": 1,
        "released": "2017-05-28",
        "overview": "The annual concert honoring the U.S. military features performances by Auli'i Cravalho, Renée Fleming, Vanessa Williams, Scotty McCreery, John Ondrasik, Ronan Tynan and Russell Watson; Gary Sinise leads a tribute to World War II's Doolittle Raiders. Hosted by actors Joe Mantegna and Laurence Fishburne."
      },
      {
        "id": "tvmaze:1473399",
        "title": "29th Annual National Memorial Day Concert",
        "season": 2018,
        "episode": 1,
        "released": "2018-05-27",
        "overview": "On the 150th anniversary of Memorial Day, the 2018 concert will share the story of Korean War veterans Joe Annewllo and Hiroshi \"Hershey\" Miyamura – dear friends now for 68 years – who helped each other survive deadly combat during the Korean War, endured the unimaginable as POWs and became American heroes. To mark the 70th anniversary of the Women's Armed Services Integration Act, the concert will also pay tribute to the contributions of women in our military throughout history, including the story of Silver Star recipient Leigh Ann Hester, the 1st woman to receive the Silver Star for combat. In recognition of the 50th anniversary of the Battle of Khe Sanh, the show will feature the story of Bill Rider, who was part of the Marine battalion known as \"The Walking Dead.\" As a part of the healing process, Bill found a way to pay it forward by dedicating his life to helping generations of service men and women who have experienced the trauma of war.The all-star line-up also features distinguished American leader General Colin L. Powell, USA (Ret.) and performances by Academy Award, Golden Globe and Emmy Award-winning actress Allison Janney; three-time Grammy Award nominee Leona Lewis; Academy Award nominated actor Graham Greene; Tony-nominated actress Mary McCormack; Emmy, Golden Globe and SAG Award-nominated actor John Corbett; film and television actor Brian Tee; actor and country singer Charles Esten; Tony, Grammy and Emmy Award-winning actress and singer Cynthia Erivo; Tony-nominee Megan Hilty; acclaimed tenor and Broadway star Alfie Boe; and Gary Sinise &amp; The Lt. Dan Band, marking 15 years and over 400 concerts entertaining our troops, veterans and military families; in performance with the National Symphony Orchestraunder the direction of top pops conductor Jack Everly. \"The Voice\" Season 14 finalist Spensha Baker will open the show with a special performance of the national anthem. The program will be hosted by Tony Award winner Joe Mantegna and Emmy Award winner Gary Sinise.Also participating in the event are the U.S. Joint Chiefs of Staff with The U.S. Army Herald Trumpets, The U.S. Army Chorus and Army Voices, The Soldiers' Chorus of the U.S. Army Field Band, The U.S. Navy Band Sea Chanters, The U.S. Air Force Singing Sergeants, The Armed Forces Color Guard and Service Color Teams provided by the Military District of Washington, D.C."
      },
      {
        "id": "tvmaze:1473428",
        "title": "30th Annual National Memorial Day Concert",
        "season": 2019,
        "episode": 1,
        "released": "2019-05-26",
        "overview": "The National Memorial Day Concert returns live from the West Lawn of the U.S. Capitol for a special 30th-anniversary broadcast hosted by Tony Award-winner Joe Mantegna and Tony-nominated actress Mary McCormack.A 30-year tradition, unlike anything else on television, America's national night of remembrance takes us back to the real meaning of the holiday. 2019 marks the 75th anniversary of the D-Day invasion. Through the eyes of a highly-decorated combat medic who landed in the first wave on Omaha Beach, the concert will pay tribute to the heroes who sacrificed and died in service to our nation and the world. The concert will share the story of two infantrymen who formed a brotherhood while serving in Vietnam and now meet each year at the Wall. A special 50th-anniversary commemoration honors the service and sacrifice of veterans of the Vietnam War. For Gold Star families, every day is Memorial Day. This year, the concert will share one widow's journey, beginning with the day her worst fears came true. While she could never \"move on\" from this devastating loss, she knew that for the sake of her daughter, she would have to learn to move forward. Along the way, she found solace and empowerment in helping other widows and widowers.The all-star line-up also features: distinguished American leader General Colin L. Powell USA (Ret.); Academy Award-nominated actor Sam Elliott; Grammy Award-winning legend Patti LaBelle; multi-platinum selling singer, performer and songwriter Gavin DeGraw; acclaimed actor Dennis Haysbert; Broadway and television star Christopher Jackson (Hamilton,Bull); multi-Grammy Award-winning bluegrass icon Alison Krauss; SAG and Olivier Award-winning and Grammy Award-nominated actress and singer Amber Riley(Glee, Dreamgirls); platinum-selling country music star Justin Moore; television star Jaina Lee Ortiz; and Patrick Lundy &amp; The Ministers of Music; in performance with the National Symphony Orchestra under the direction of top pops conductor Jack Everly. American Idol Season 17 finalist Alyssa Raghu will open the show with a special performance of the national anthem.Also participating in the event are the U.S. Joint Chiefs of Staff with The U.S. Army Herald Trumpets, The U.S. Army Chorus and Army Voices, The Soldiers' Chorus of the U.S. Army Field Band, The U.S. Navy Band Sea Chanters, The U.S. Air Force Singing Sergeants, The Armed Forces Color Guard and Service Color Teams provided by the Military District of Washington, D.C."
      },
      {
        "id": "tvmaze:1661157",
        "title": "31st Annual National Memorial Day Concert",
        "season": 2020,
        "episode": 1,
        "released": "2020-05-24",
        "overview": ""
      },
      {
        "id": "tvmaze:1871391",
        "title": "32nd Annual National Memorial Day Concert",
        "season": 2021,
        "episode": 1,
        "released": "2021-05-30",
        "overview": ""
      },
      {
        "id": "tvmaze:2125290",
        "title": "33rd Annual National Memorial Day Concert",
        "season": 2022,
        "episode": 1,
        "released": "2022-05-29",
        "overview": "Joe Mantegna and Gary Sinise will host the Concert.Dennis Haysbert: Will pay tribute to the late General Colin Powell.Gil Birmingham: In a tribute to soldiers who lost their lives in the Vietnam War, he shares the story of Lakota combat medic Francis Whitebird.Mary McCormack: She honors women of World War II in this year's event.Jack Everly and the National Symphony Orchestra will perform.In addition, there are performances from the armed services' own ensembles: The U.S. Army Herald Trumpets, The U.S. Army Chorus, The Soldiers' Chorus of the U.S. Army Field Band, The U.S. Navy Band Sea Chanters, The U.S. Air Force Singing Sergeants, the Armed Forces Color Guard and Service Color Teams provided by the Military District of Washington, D.C."
      },
      {
        "id": "tvmaze:2336585",
        "title": "34th Annual National Memorial Day Concert",
        "season": 2023,
        "episode": 1,
        "released": "2023-05-28",
        "overview": "Joe Mantegna and Gary Sinise host the 34th National Memorial Day Concert on PBS. With all-star performances and tributes from Washington, D.C., the annual concert and remembrance will continue to honor our men and women in uniform, their families at home, and all those who have given their lives for our country. There will also be performances and appearances by Megan Hilty and Jack Everly conducting the National Symphony Orchestra, the Military District of Washington (MDW), the U.S. Army Herald Trumpets, the U.S. Army Chorus, the U.S. Navy Band Sea Chanters, the U.S. Air Force Singing Sergeants, and the Soldiers' Chorus of the United States Army Field Band. General Mark A. Milley, Chairman of the Joint Chiefs of Staff, and the Joint Chiefs of Staffl participate along with the Armed Forces Color Guard and Service Color Teams.Those scheduled to appear include Trace Adkins, S. Epatha Merkerson, John Slattery, Dulé Hill, Yolanda Adams, Mary McCormack, Jo Dee Messina, The War And Treaty, Chosen Jacobs, Phillip Phillips, and Patrick Lundy and the Ministers of Music."
      },
      {
        "id": "tvmaze:2559748",
        "title": "35th Annual National Memorial Day Concert",
        "season": 2024,
        "episode": 1,
        "released": "2024-05-26",
        "overview": "Hosted by award-winning actors Joe Mantegna and Gary Sinise, this national night of remembrance returns live to the West Lawn of the U.S. Capitol. Featuring all-star performances and tributes, the 35th annual event will honor those in uniform, their families at home, and all those who have given their lives for our country."
      },
      {
        "id": "tvmaze:2885694",
        "title": "36th Annual National Memorial Day Concert",
        "season": 2025,
        "episode": 1,
        "released": "2025-05-25",
        "overview": "America's national night of remembrance live from the West Lawn of the U.S. Capitol brings us together as one family of Americans to honor the service of generations of our men and women in uniform, our military families, and to pay tribute to all those who have given their lives for our country. Hosted by Tony Award-winner Joe Mantegna and Emmy Award-winner Gary Sinise, the 2025 concert features personal stories and tributes interwoven with musical performances by world-renowned artists and the National Symphony Orchestra to commemorate the real meaning of the holiday."
      },
      {
        "id": "tvmaze:3257807",
        "title": "37th Annual National Memorial Day Concert",
        "season": 2026,
        "episode": 1,
        "released": "2026-05-24",
        "overview": ""
      }
    ]
  }
}