{
  "meta": {
    "id": "tvmaze:16791",
    "type": "series",
    "name": "Below Deck Mediterranean",
    "description": "With a new boat, new location, and new faces, the excitement, drama, and adventure of life aboard a private luxury yacht is taken to another level in the Mediterranean. Providing unparalleled service to wealthy and uncompromising guests is made even more difficult as the team faces everything from love triangles to seeing fellow crew members shockingly cross the line with guests. Voyaging from Santorini, Mykonos, and many of the Greek islands, each episode features a new group of elite clientele who present a new set of challenges, all while offering the crew a glamorous lifestyle and exotic perks that most people only dream of experiencing. For these young, attractive, and adventurous yachties, the \"work hard, play harder\" nature of the job combined with the pressure of working in the most exclusive yachting scene in the world pushes the team close to the breaking point on Below Deck Mediterranean.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472947.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472947.jpg",
    "videos": [
      {
        "id": "tvmaze:3468432",
        "title": "The Forbidden Kiss",
        "season": 10,
        "episode": 12,
        "released": "2025-12-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3450099",
        "title": "Crossing Lines",
        "season": 10,
        "episode": 11,
        "released": "2025-12-08",
        "overview": ""
      },
      {
        "id": "tvmaze:773461",
        "title": "It's All Greek to Me",
        "season": 1,
        "episode": 1,
        "released": "2016-05-03",
        "overview": "Join Chef Ben Robinson and eight new crew members as they prepare the luxury yacht, the Ionian Princess, for a new charter season around the glittering Greek Islands. Fresh faces present new challenges as the crew learns to work and live together while preparing to welcome their first charter guests. Bosun Bryan gets an unexpected promotion, while chief steward Hannah has her hands full with her ambitious third stew. As Ben tries to wow the guests with a traditional Greek meal, the new crew scrambles to keep up appearances. Trying to meet the guests' one non-negotiable, they run into an unforeseen obstacle: streaming a live football game in the middle of the Mediterranean."
      },
      {
        "id": "tvmaze:773462",
        "title": "Game Time",
        "season": 1,
        "episode": 2,
        "released": "2016-05-10",
        "overview": "The crew's effort to stream a football game in the middle of the Mediterranean doesn't go as planned, but their efforts don't go unnoticed by the charter guests. Ben redeems himself after the previous night's Moussaka mishaps. Bobby crushes on Julia, and meanwhile a homesick Jen feels like she's getting assigned all of the tedious tasks by Bryan and is being underutilized. And after staying up all night with the Primary's husband, Tiffany breaks down after Hannah confronts her for not finishing her duties."
      },
      {
        "id": "tvmaze:773463",
        "title": "Model Deckhands",
        "season": 1,
        "episode": 3,
        "released": "2016-05-17",
        "overview": "After the crew's first night off, Hannah puts her foot down when Bobby and Danny bring girls back to the yacht. Bryan attempts to smooth things over with the captain, but the boys are given their first strike. When an all-female group charters the yacht for their upcoming calendar shoot, the Ionian Princess crew struggles to keep up with their demands. As the crew assist the charter guests with their photo shoot, Danny breaks yachtie rule number one and drama ensues."
      },
      {
        "id": "tvmaze:773464",
        "title": "Lovesick Danny",
        "season": 1,
        "episode": 4,
        "released": "2016-05-24",
        "overview": "Danny disobeys a direct order from Captain Mark when he decides to give a love poem to a charter guest. Julia calls her boyfriend in England, while Bobby's feelings for her grow stronger. Ben and Hannah's work relationship has reached smooth sailing, while Tiffany works harder on her stew skills in hopes of Hannah noticing. On their night off, Ben is torn between two stews, but is shocked when he finds one of them in his bunk with Bryan."
      },
      {
        "id": "tvmaze:781515",
        "title": "My Big Fat Greek Threesome",
        "season": 1,
        "episode": 5,
        "released": "2016-05-31",
        "overview": "After Ben apologizes for shutting down Bryan and Tiffany's fun, the crew prepares for their next charter hailing from Oklahoma. The stews are tasked with putting together a country hoedown complete with bales of hay. Meanwhile, the deck crew unravels when Danny accuses Bobby for not being part of the team. After hours, the charter guests seem to have a threesome in the jacuzzi and once again, Danny is in hot water for overstepping his boundaries."
      },
      {
        "id": "tvmaze:783886",
        "title": "Entrée-vous",
        "season": 1,
        "episode": 6,
        "released": "2016-06-07",
        "overview": "New charter guests come aboard to celebrate their seven-month dating anniversary, and the crew must provide the romantic trip of their lives. Ben takes Hannah on a date, but a major galley miscommunication during the guests' dinner could tarnish any romantic hope for the two. And, when a nearby vessel begins to sink, the Ionian Princess crew has to spring into action to help save it."
      },
      {
        "id": "tvmaze:783905",
        "title": "Who's Got Game",
        "season": 1,
        "episode": 7,
        "released": "2016-06-14",
        "overview": "Hannah experiences the ultimate betrayal when Ben goes to the Captain about their galley miscommunication. After back-to-back charters, the crew finally enjoys a much deserved day off until Bryan decides to give Danny a lesson in deckie etiquette. And, when an all-male bachelor charter group comes on board, Danny and Bobby are tasked with finding the guests arm candy in Mykonos."
      },
      {
        "id": "tvmaze:783916",
        "title": "Charter King",
        "season": 1,
        "episode": 8,
        "released": "2016-06-21",
        "overview": "Hannah's migraine explodes when the charter guests bring back a large group of girls on board. Upon their exit, the bachelors anoint Danny as the charter MVP, much to the chagrin of Bobby and Bryan. And, Danny continues to lose the respect of his crew by breaking yet another yachtie code and inserting himself into Hannah and Ben's business."
      },
      {
        "id": "tvmaze:783931",
        "title": "Fever Pitch",
        "season": 1,
        "episode": 9,
        "released": "2016-06-28",
        "overview": "Hannah and Ben redefine their relationship, while Bobby realizes he can't shut off his feelings for Julia. After the crew pulls off a beach BBQ without a hitch, Ben is tasked with making American S'mores in Greece. Meanwhile, Bryan takes the captain's orders to heart when he confronts Julia about not completing her duties. And Danny falls ill as Bryan turns up the heat on his performance."
      },
      {
        "id": "tvmaze:838304",
        "title": "Charter from Heaven, Charter from Hell?",
        "season": 1,
        "episode": 10,
        "released": "2016-07-05",
        "overview": "While Danny is away, the crew revels in his absence. And when Bryan confronts Jen, she finally stands up to him. Meanwhile, Tiffany's feelings for Ben increase, while Bobby continues to be sidelined by Julia. As one easy-going charter leaves, the crew is blindsided with a new group of highly demanding guests."
      },
      {
        "id": "tvmaze:860250",
        "title": "They Hate Us Cuz They Ain't Us",
        "season": 1,
        "episode": 11,
        "released": "2016-07-12",
        "overview": "The demanding charter guests extend their stay, and Hannah puts on her best stew face to regain their trust. Julia and Ben have a class war after a miscommunication goes awry. Meanwhile, the Captain gives Danny his phone back, putting Bryan on high-alert. And Ben's friendship with Hannah deepens when he confides in her about his deep-seated issues."
      },
      {
        "id": "tvmaze:866698",
        "title": "The Beautiful Thing About Subpar",
        "season": 1,
        "episode": 12,
        "released": "2016-07-19",
        "overview": "As the guests finally prepare to leave the yacht after their extended stay, Hannah hopes her charm wins them over with a generous tip. Meanwhile, Captain Mark is left with a big decision that will shake up the dynamic of the entire crew after things escalate between Danny, Bobby, and Bryan. On the crew's night off, Ben and Tiffany take their flirtation to the next level, unbeknownst to Hannah. And Bobby's plan to bring a date back on the boat backfires in more ways than one."
      },
      {
        "id": "tvmaze:870349",
        "title": "That Was Very Greek of Us",
        "season": 1,
        "episode": 13,
        "released": "2016-07-26",
        "overview": "For the final charter, an all-male group brings their own set of demands, and an exhausted crew must struggle to keep up. After weeks of building frustration, the girls band together to confront their First Mate Bryan. Everyone prepares to say goodbye to the Ionian Princess, but not before last minute feelings are revealed and the charter season goes out with a bang."
      },
      {
        "id": "tvmaze:1112927",
        "title": "Who's the Boss?",
        "season": 2,
        "episode": 1,
        "released": "2017-05-02",
        "overview": "The crew of the luxury yacht Sirocco sets sail in the waters off of Croatia. Hannah and Bobby are joined by seven new shipmates. Hannah is used to running the interior her way, but suddenly finds herself at odds with a seasoned new leader - Captain Sandy. Bobby is once again looking for love while also working in close quarters with his ex. Chef Adam brings a chilled-out surfer vibe to the galley, as deckhand Malia finds herself the center of attention with the guys. When Captain Sandy interferes with a picnic, Hannah is left wondering if she will make it through the season."
      },
      {
        "id": "tvmaze:1157367",
        "title": "Three's Company",
        "season": 2,
        "episode": 2,
        "released": "2017-05-09",
        "overview": "Hannah continues to struggle with working under the close eye of Captain Sandy. After a mishap with the anchor, Sandy realizes her new deck crew has a lot to learn if they are going to have a successful charter season. Bobby develops a crush on Malia and rushes to her aid when she suffers a freak accident. As the guests enjoy a uniquely themed dinner, a slip of the tongue by Adam threatens to ruin a carefully planned surprise. And, a wild night of partying leads to a major argument as Bobby clashes with Hannah over interfering with his past relationships."
      },
      {
        "id": "tvmaze:1157368",
        "title": "Chefs, Lies, and FaceTime",
        "season": 2,
        "episode": 3,
        "released": "2017-05-16",
        "overview": "The rift between Bobby and Hannah grows even wider when Lauren is dragged into a heated debate about the past. A frustrated Bobby calls out Lauren for having an affair with one of his close friends, leaving an emotional Lauren feeling ostracized. Meanwhile, a group of revealing charter guests shed their clothes while the deck crew tries to remain professional. Bugsy learns of a devastating loss back home and must decide whether she should go home or work through her pain. And, a challenging stern tie goes awry as the boat starts drifting into the cliffside potentially leaving the guests safety in jeopardy."
      },
      {
        "id": "tvmaze:1157369",
        "title": "All Chained Up and No Place to Go",
        "season": 2,
        "episode": 4,
        "released": "2017-05-23",
        "overview": "The naked guests distract the crew as they try to stay focused on their jobs. As Hannah and Bobby hash out their differences, Lauren struggles as the tension mounts between her and Bobby. Meanwhile, Bugsy maintains a stiff upper lip as she deals with the loss of her grandmother. And when Captain Sandy joins the guests for dinner, Adam feels the heat as he strives to deliver the perfect meal. On the last day of charter, a massively twisted anchor chain leaves the crew and guests stranded at sea and threatens to sideline the Sirocco for the rest of the charter season."
      },
      {
        "id": "tvmaze:1157370",
        "title": "Double Trouble",
        "season": 2,
        "episode": 5,
        "released": "2017-05-30",
        "overview": "Captain Sandy becomes frustrated when the deck crew makes a dangerous mistake. While Adam's working relationship with Bugsy grows stronger, tension mounts between him and Hannah. When a guest is involved in a serious accident, Bobby springs to action with his Firefighter/EMT skills. Meanwhile, an overwhelmed Lauren struggles with her responsibilities and questions her future on the boat. And, an argument between two guests has the crew worried about their tip. Finally, a wild night out sparks romance, leaving Malia in the middle of a complicated love triangle between crew members."
      },
      {
        "id": "tvmaze:1199801",
        "title": "Don't Cry Over Cut Onions",
        "season": 2,
        "episode": 6,
        "released": "2017-06-06",
        "overview": "Malia, Wes, and Adam find themselves in uncharted emotional territory as news of their love triangle spreads below deck. The Oklahomans return as charter guests keeping the interior on their toes as they struggle to keep up with their demanding requests. Max misses his girlfriend, while Lauren continues to feel the heat as her duties mount. When Adam deliberately goes against a guest's food preferences and his food is sent back, tempers flare in the galley. And, a low blow from Adam about Hannah's job performance puts Bugsy in the middle of their growing animosity towards each other."
      },
      {
        "id": "tvmaze:1199802",
        "title": "Mo' Onions, Mo' Problems",
        "season": 2,
        "episode": 7,
        "released": "2017-06-13",
        "overview": "Malia and Adam share a romantic moment, but complications arise when she continues to flirt with Wes. The charter guests play dirty as they challenge the Sirocco crew to a relay race. When Hannah finds out Adam intentionally decided to go against the guests' food preferences, the two butt heads once again. Meanwhile, Bugsy feels alienated from the stews as Hannah and Lauren give her the cold shoulder. And when Hannah informs Captain Sandy about Adam's food sabotage, the rebellious chef finds himself in hot water."
      },
      {
        "id": "tvmaze:1208147",
        "title": "Flirting with Danger",
        "season": 2,
        "episode": 8,
        "released": "2017-06-20",
        "overview": "When a hot bachelor charters the Sirocco, a smitten Hannah attempts to keep it professional. Wes struggles with his growing feelings for Malia as fireworks ignite between her and Adam. Bugsy and Hannah's relationship gets further strained as they question each other's job performance. Meanwhile, Max anxiously awaits a visit from his girlfriend and Bobby gets special attention from a charter guest. And, with Adam's job on the line, he tries to redeem himself to Captain Sandy by delivering a challenging 7-course meal."
      },
      {
        "id": "tvmaze:1212819",
        "title": "iCloudy with a Chance of Secrets",
        "season": 2,
        "episode": 9,
        "released": "2017-06-27",
        "overview": "Wes declares his feelings for Malia, while her relationship with Adam takes a shocking turn. Max's girlfriend visits during the crew's day off as they explore the historic Fortress of Klis. And when Bugsy makes a startling discovery that Hannah has broken yachtie code, Hannah faces Captain Sandy and must live with the consequences of her actions. A lively group of tequila-loving guests charter Sirocco, while Hannah questions whether Adam's abilities as a chef are up to Med standards, causing further tension between the two."
      },
      {
        "id": "tvmaze:1232490",
        "title": "Kissing Up",
        "season": 2,
        "episode": 10,
        "released": "2017-07-11",
        "overview": "When Hannah and Adam continue to clash about the quality of his service, a frustrated Captain Sandy insists that Adam step up his game. Despite trying to keep their relationship professional, Wes and Malia share an intimate moment while on the job. Max is excited to prove his worth by taking the boat off the dock for the first time, as Hannah and Bugsy try to work together despite their increasingly tense relationship. Meanwhile, the crew is under pressure to perform to the highest standard of excellence when an influential charter broker arrives onboard that could make or break their careers in yachting. Finally, Captain Sandy puts Wes in a difficult situation by forcing him to choose a lead deckhand."
      },
      {
        "id": "tvmaze:1248959",
        "title": "The Dubrovnik Wedgie",
        "season": 2,
        "episode": 11,
        "released": "2017-07-18",
        "overview": "When bad weather keeps Sirocco at port, the crew scrambles to keep a VIP charter broker and her friends happy. Wes announces his choice for lead deckhand, causing tension to erupt. Despite their differences, Hannah and Bugsy attempt to work peacefully alongside each other. Meanwhile, word gets out that Wes and Malia exchanged a kiss during anchor watch leaving their crew mates outraged about crossing professional boundaries. And frustrated by watching the romance grow between Malia and Wes, a heartbroken Adam reveals to Bugs that he and Malia have a secret past. Finally, on the crew's day off in the historical city of Dubrovnik, Adam pulls a prank on Wes that goes a little too far for Wes' liking."
      },
      {
        "id": "tvmaze:1248960",
        "title": "Swing Shift",
        "season": 2,
        "episode": 12,
        "released": "2017-07-25",
        "overview": "Adam's wedgie prank goes awry, and Wes does everything he can to avoid Adam. A one day charter quickly feels like an eternity when a group of eccentric Texans board Sirocco and keep the demands flowing more than the drinks. Meanwhile, Malia gets on Sandy's bad side when she jeopardizes a routine anchor drop. Bugsy and Lauren become disgruntled about the lack of work that Hannah contributes to the interior. And while Bobby and Malia clash over their responsibilities as deckhands, an unexpected and flirtatious friendship develops between former interior rivals."
      },
      {
        "id": "tvmaze:1259465",
        "title": "Stew the Right Thing",
        "season": 2,
        "episode": 13,
        "released": "2017-08-01",
        "overview": "Bugsy's frustration with Hannah reaches critical mass when she calls Hannah out for not pulling her weight. On the final charter of the season, a former guest returns, this time flanked by six beautiful women who test Bobby's willpower when he matches with one on a dating app. Finally, Wes is blindsided when Adam reveals shocking details of a text message exchange between him and Malia, putting Wes and Malia's future in question."
      },
      {
        "id": "tvmaze:1259466",
        "title": "Con-Text is Everything",
        "season": 2,
        "episode": 14,
        "released": "2017-08-08",
        "overview": "As the charter season comes to an end, the Sirocco crew struggles to resolve their complicated relationships before they go their separate ways. Bobby finally finds romance in Croatia, but tensions build between him and the primary guest when Bobby takes things too far. Hannah and Bugsy air their grievances and Lauren must choose which side she's on. Finally, Adam has one more shocking salacious detail for Wes, leaving Wes and Malia's relationship on the chopping block yet again."
      },
      {
        "id": "tvmaze:1447673",
        "title": "Ciao, Napoli!",
        "season": 3,
        "episode": 1,
        "released": "2018-05-15",
        "overview": "Another charter season in the Mediterranean gets under way as Captain Sandy Yawn and the crew of Motor Yacht Talisman Maiton cruise the legendary Italian coast. Chef Adam returns and is ready to redeem himself with Sandy after nearly getting fired last season, and he's determined to stay in the galley and out of love triangles. Meanwhile, returning chief stew Hannah enters her eighth season in yachting and finds herself at a crossroads on whether she should continue her yachtie life or look to settle down and start a family. Bosun Conrad is only 23, but wise beyond his years, and when fellow deckhand Joao questions his age, he quickly has to establish who's in charge. Third stew, and former beauty queen, Kasey comes aboard teeming with confidence, but is quickly sidelined with a sudden illness causing Hannah and second stew Brooke to pick up the slack. When the first charter guests of the season arrive full of demands and criticisms about the food and service, Sandy quickly wonders whether she made a mistake bringing back Adam and Hannah."
      },
      {
        "id": "tvmaze:1464979",
        "title": "A Perfect Storm",
        "season": 3,
        "episode": 2,
        "released": "2018-05-22",
        "overview": "The crew must fend off demanding charter guests in order to keep Captain Sandy at bay after receiving complaints from the primary charter guest. A guest excursion to Capri allows Joao and Kasey to get to know each other on a deeper level, and Kasey shares shocking information about her personal life. Meanwhile, an intense storm strikes leaving Conrad, Hannah, and Jamie scrambling to save their season from ending before it's fully begun. Then, when a charter guest blatantly lies to Hannah at the dinner table, Captain Sandy makes a decision as to whom to trust. Looking to relieve stress from a difficult first charter, the crew has a wild night of partying which leads to an argument between Joao and Hannah."
      },
      {
        "id": "tvmaze:1464980",
        "title": "Bad Vibrations",
        "season": 3,
        "episode": 3,
        "released": "2018-05-29",
        "overview": "After a tumultuous night out arguing with Hannah and professing his attraction to Brooke, Joao must deal with the consequences of his alcohol-fueled alter ego, Jezabob. Brooke confides in her mother that she's torn between being single and jumping right back into the dating pool. Sandy's good friend comes aboard, and the entire crew is on high alert to make sure the Captain's friend is well taken care of. But when bad weather keeps Talisman docked, the pressure intensifies for Adam and the Stewardesses. As Conrad and Hannah get closer, Conrad gets in hot water with Sandy when he forgets a critical task."
      },
      {
        "id": "tvmaze:1464981",
        "title": "Demand & Supply",
        "season": 3,
        "episode": 4,
        "released": "2018-06-05",
        "overview": "Sandy comes down hard on the interior leaving Adam to defend himself by blaming the stews' lack of communication. After weeks of back and forth flirting, Hannah puts her feelings on the line with Conrad. Meanwhile, Joao gets tough on Jamie after she accidentally oversleeps. Now that Kasey's seasickness is under control, Hannah turns her focus and frustrations to her third stew's slow-moving pace. And a new charter begins that has everyone on the crew barely keeping up to fulfill the requests of the extremely demanding guests."
      },
      {
        "id": "tvmaze:1464982",
        "title": "Can I Get Fries with That?",
        "season": 3,
        "episode": 5,
        "released": "2018-06-12",
        "overview": "The primary and her guests continue to turn up the heat on the crew causing tension between Adam and Hannah over communication. Sad about missing her sister's wedding, Brooke tries to remain professional while still on charter. Meanwhile, Kasey and Joao continue to elevate their game of flirting as Brooke develops a crush on Adam. And during the crew night out, Hannah attempts to take her relationship with Conrad public, putting him to the test. As Conrad gets closer to Hannah, Captain Sandy begins to notice he's distracted."
      },
      {
        "id": "tvmaze:1464983",
        "title": "Hasta Barista, Baby!",
        "season": 3,
        "episode": 6,
        "released": "2018-06-19",
        "overview": "Hannah's ongoing struggle with her underperforming Third Stew comes to a head when she learns Kasey lied on her resume. Meanwhile, Captain Sandy is concerned by Conrad's growing feelings for Hannah when their romance results in distractions from Conrad's duties. On the heels of a dining charter from hell, Adam is overjoyed when he learns he has free reign in the galley with his new charter guests. And, much to Conrad's dismay, Joao's strong work ethic is rewarded by Captain Sandy."
      },
      {
        "id": "tvmaze:1466059",
        "title": "Walking on Broken Glass",
        "season": 3,
        "episode": 7,
        "released": "2018-06-26",
        "overview": "The love triangle intensifies as Joao continues to send mixed messages to both Brooke and Kasey, which prompts them to confront him. A night out at a Michelin-starred restaurant inspires Adam to step up his culinary game for the rest of the season. Conrad's feelings for Hannah grow stronger while his relationship with Sandy continues to become more strained. Sandy dishes out high praise to Kasey much to the chagrin of Hannah. Meanwhile, the next charter guests send the stews into a frenzy when one of their crucial requests are not fulfilled, and Joao and Hannah go at it again forcing an even greater divide between the crew."
      },
      {
        "id": "tvmaze:1482528",
        "title": "Bizarre Love Triangle",
        "season": 3,
        "episode": 8,
        "released": "2018-07-10",
        "overview": "While the crew works hard to pull off a magical picnic for the guests on the island of Capri, Joao earns the praise of Captain Sandy for putting out all the water toys as the solo deckie. Later, rough seas force Captain Sandy to maneuver the boat during dinner service to help a sea sick charter guest. After the guests depart, Captain Sandy announces a crew day off and Brooke throws Hannah a fake 30th birthday dock party. During the celebration, the love triangle appears to be tipping in Kasey's favor forcing Brooke to either take a chance and go for Joao or risk missing out forever."
      },
      {
        "id": "tvmaze:1490680",
        "title": "Panic at the Deck-O",
        "season": 3,
        "episode": 9,
        "released": "2018-07-17",
        "overview": "Joao solidifies the love triangle, leaving Kasey confused. On the crew day off, Hannah feels slighted by Brooke when she pursues a relationship with Joao. Meanwhile, Adam gets ready for his chance at redemption as he goes foraging for food fretting the return of charter guests from last season. Tensions rise when Hannah doesn't feel supported by Conrad leaving her stricken with anxiety. And, Jamie becomes very ill and Captain Sandy must pull together a charter with one deckhand quarantined and her chief stew down for a mental health day."
      },
      {
        "id": "tvmaze:1501513",
        "title": "Hannah, Hannah, Sandy?",
        "season": 3,
        "episode": 10,
        "released": "2018-07-24",
        "overview": "With both Hannah and Jamie down, Captain Sandy steps in to support her crew. Adam feels like his chance at redemption is foiled when charter guest Kenny requests an impromptu beach picnic. As Brooke and Kasey step up to fill the void for being down a stew, they notice that it's smoother sailing. Meanwhile, Conrad is torn between being a shoulder to lean on for Hannah and assuring Sandy that he's fulfilling his job on deck. And Hannah crosses a line with Sandy that could end her charter season a lot sooner than she thought."
      },
      {
        "id": "tvmaze:1502734",
        "title": "Mo' Euros, Mo' Problems",
        "season": 3,
        "episode": 11,
        "released": "2018-07-31",
        "overview": "Captain Sandy's patience is tested when Hannah disobeys a direct order. Meanwhile, Adam concentrates on delivering another onion-less dinner to complete his redemption with Charter Guests Kenny and Amber. Joao feels betrayed when he overhears Kasey warning Brooke about his flirtatious ways. An argument erupts between Hannah and Conrad over their polar opposite lifestyles."
      },
      {
        "id": "tvmaze:1502735",
        "title": "Take This Job and Stew It",
        "season": 3,
        "episode": 12,
        "released": "2018-08-07",
        "overview": "Hannah and Conrad re-evaluate whether their opposite outlooks on life will be able to coexist off the boat. Brooke and Kasey start to air their grievances over Hannah's work ethic, while Jamie's hard work gets recognition. Kasey and Joao resume their friendship, leading Brooke to question his intentions. And when a group of Sandy's friends charter the yacht, its make or break for Hannah as she puts on her best stew face."
      },
      {
        "id": "tvmaze:1507391",
        "title": "We Used to Be Friends",
        "season": 3,
        "episode": 13,
        "released": "2018-08-14",
        "overview": "Hannah and Joao's contempt for one another grows even stronger when Joao ruffles Hannah's feathers. And, on the first day of charter, strong winds leave the boat stuck at the dock, and Adam must do everything in his power to keep the guests distracted with his cuisine. Meanwhile, Hannah's leadership skills are challenged by Brooke and Kasey. And Colin finally gets the nerve to reveal his season-long feelings for Brooke."
      },
      {
        "id": "tvmaze:1510505",
        "title": "Stew Coup",
        "season": 3,
        "episode": 14,
        "released": "2018-08-21",
        "overview": "Hannah confronts Kasey and Brooke about the hierarchy of the interior. The primary charter guest asks the crew to participate in a trust exercise involving arrows that leaves everyone concerned for their safety. Adam not cooking for the crew finally comes to a head, while Colin gets a surprise visit that leaves him in tears. Hannah and Conrad's relationship hits a tipping point, and Joao finds himself in hot water with Brooke when he gets called out for flirting."
      },
      {
        "id": "tvmaze:1513748",
        "title": "One Million Percent",
        "season": 3,
        "episode": 15,
        "released": "2018-08-28",
        "overview": "Adam rises to the occasion with his crew meals putting all the chatter to rest. And, on the final charter of the season, a group of self-proclaimed \"Daddy's Girls,\" come on board, but the stews sense awkward tension with Daddy's girlfriend. Hannah and Conrad deal with the stages of a boat break up, while Joao makes a shocking admission to Kasey that could complicate everything."
      },
      {
        "id": "tvmaze:1516368",
        "title": "Definitely Not Prague",
        "season": 3,
        "episode": 16,
        "released": "2018-09-04",
        "overview": "On the season finale, the Talisman crew pull out all the stops to end the season on a high note. Hannah picks a fight with Joao and Brooke, causing the mild mannered Brooke to fight back. Adam delivers a final dinner that leaves the guests speechless. Joao's feelings for Brooke are solidified after his shocking confession to Kasey. And Conrad's mission to avoid Hannah backfires when she gives him a proposition he can't refuse."
      },
      {
        "id": "tvmaze:1641047",
        "title": "Pardon Your French",
        "season": 4,
        "episode": 1,
        "released": "2019-06-03",
        "overview": "Captain Sandy embarks on another season in the Mediterranean out of the world famous yachting hub, the French Riviera. Hannah returns as chief stew determined to put her head down, focus on her work and her relationship with Captain Sandy. After enduring heartbreak, Joao returns with a promotion as Bosun hoping to prove to Captain Sandy he can lead a deck team that includes his best friend and partner-in-crime, Colin. Cordon Bleu trained chef Mila takes control of the galley, but immediately falls ill on day one, forcing the crew to rally and help get the boat in shape in time for the first charter. When the first guests arrive and chef Mila, who is a department of one, is still battling illness, Sandy and the crew wonder if she'll be able to perform her most basic duties."
      },
      {
        "id": "tvmaze:1659893",
        "title": "Recipe for Disaster",
        "season": 4,
        "episode": 2,
        "released": "2019-06-10",
        "overview": "The crew's first beach picnic of the season gets off to a very rocky start, ultimately leaving Colin shattered and empty-handed. Meanwhile, Chef Mila faces her biggest challenge yet, baking. And Hannah realizes Mila may not be up to the standard she's used to. Joao continues to have growing pains in his new leadership position as he attempts to get his deckhand Jack in line. After surviving their first charter, the crew heads out for their first night out when one crew member's shocking revelation leaves a lasting impression."
      },
      {
        "id": "tvmaze:1659894",
        "title": "Cannes You Cook?",
        "season": 4,
        "episode": 3,
        "released": "2019-06-17",
        "overview": "The Sirocco crew comes to terms with Mila's controversial views. Captain Sandy's good friend, Dr. Jennifer Berman, returns with the expectation of actually leaving the dock this year. Hannah's on high alert making sure Sandy's friends are taken care of and Sandy's toast is butter free. Meanwhile, Joao continues to struggle to motivate Jack. Colin wonders if this new crew might be a little too bawdy for him, and Chef Mila's redemption charter gets off to a choppy start forcing Sandy to think outside the box with a unique plan."
      },
      {
        "id": "tvmaze:1659895",
        "title": "Too Many Cooks in the Kitchen",
        "season": 4,
        "episode": 4,
        "released": "2019-06-24",
        "overview": "Joao confides in Captain Sandy about his heartbreak while promising not to let his emotions get in the way of his work. Chef Mila continues to struggle in the galley, forcing Captain Sandy to make a temporary adjustment. Hannah finds herself in familiar territory as she takes on double duty trying to please unhappy charter guests. Meanwhile, the guests lose more than just their patience, and teach Travis a valuable lesson - that there are no pants in the South of France!"
      },
      {
        "id": "tvmaze:1659896",
        "title": "99 Problems But a Chef Ain't One",
        "season": 4,
        "episode": 5,
        "released": "2019-07-01",
        "overview": "A recording artist charters Sirocco with her family to shoot a music video and uses the crew as her production assistants. Jack begins to develop feelings for Aesha after growing a little closer on the dance floor, and Joao feels the workload pile up. Meanwhile, Colin has a bout with the anchor chain that could leave Sirocco stranded."
      },
      {
        "id": "tvmaze:1659897",
        "title": "Knot Today, Anchors",
        "season": 4,
        "episode": 6,
        "released": "2019-07-08",
        "overview": "With Anastasia filling the role as Temp Chef and Lead Deckhand Travis helping as her sous chef, the exhausted crew continues to work a person down in each department. Teenage popstar-in-the-making, Ashley continues to have a \"Good Mawnin'\" as she completes the filming of her new music video. Joao acts quickly in a dangerous situation, involving Captain Sandy's nemesis, the Sirocco anchors."
      },
      {
        "id": "tvmaze:1677528",
        "title": "All Hail the Queen",
        "season": 4,
        "episode": 7,
        "released": "2019-07-15",
        "overview": "Motor yacht Sirocco braces for its most exclusive charter guest yet: The Queen of Versailles. Joao faces his old demons after a drunken night out as well as an increasingly defiant deck crew. A new third stew joins the boat who has Colin swooning, and Hannah hoping she can fill Anastasia's shoes."
      },
      {
        "id": "tvmaze:1677529",
        "title": "What Eze the Problem?",
        "season": 4,
        "episode": 8,
        "released": "2019-07-22",
        "overview": "Hannah and Joao have a miscommunication over a guest excursion. In the galley, Anastasia is forced to prepare foods that go against her vegan lifestyle to please the charter guest, the ‘Queen of Versailles.' June continues to struggle to impress Hannah, leaving her unsettled through the crew night out."
      },
      {
        "id": "tvmaze:1677530",
        "title": "A Whole Different Ball Game",
        "season": 4,
        "episode": 9,
        "released": "2019-07-29",
        "overview": "Baseball legend Johnny Damon comes on board with a group of his rowdiest friends making the crew work double-time. June struggles to keep her radio on, which leaves Hannah frustrated. And Jack and Travis get in hot water with Captain Sandy when they fail to respond to an alarm. As Anastasia gets more comfortable in the galley, questions arise about her food. Jack takes Aesha on a romantic date. Travis and Joao end up on a dangerous mission to rescue the anchor."
      },
      {
        "id": "tvmaze:1677531",
        "title": "Docked and Loaded",
        "season": 4,
        "episode": 10,
        "released": "2019-08-05",
        "overview": "Captain Sandy continues her on-going battle with Sirocco's anchors, while Joao and Travis continue their deep dive to set the anchors free. Baseball star, Johnny Damon along with his family and friends not only go against the bad weather, but also a feisty neighboring yacht owner. Meanwhile, Aesha and June bond over their mutual losses. And as the guests depart, Sandy is faced with a big complaint making her second guess her decisions."
      },
      {
        "id": "tvmaze:1691016",
        "title": "Monte Car-loco",
        "season": 4,
        "episode": 11,
        "released": "2019-08-12",
        "overview": "The crew enjoys a day off at an exclusive resort in Monte Carlo, but some of them are faced with more than they bargained for. Joao and Hannah have a heart to heart, while June tries to open herself up to Hannah with not so favorable results. Meanwhile, Travis confronts Joao over his treatment of Aesha. A new group of energetic charter guests come on board, and with Anastasia's confidence shaken by poor reviews from the previous charter, she tries to regain her swagger. But when the guests complain about cold food, Sandy begins to wonder whether Anastasia has what it takes"
      },
      {
        "id": "tvmaze:1692895",
        "title": "Don't Cry for Me, Sirocco",
        "season": 4,
        "episode": 12,
        "released": "2019-08-19",
        "overview": "Captain Sandy finds one of the crew member's positions redundant. Joao finally confronts Jack on his lack of work ethic giving him an ultimatum. An overwhelmed Anastasia is pushed to her breaking point in the galley, and when Colin learns that someone will have to leave the boat, he makes a bold move."
      },
      {
        "id": "tvmaze:1697043",
        "title": "It's Ben a Long Time",
        "season": 4,
        "episode": 13,
        "released": "2019-08-26",
        "overview": "Colin faces a tough decision and Anastasia accepts her new role, but Sandy wonders whether if she's now phoning her job in. An all-female group come on board and do their best to flirt with the deck crew. Jack and Aesha move in together making Travis feel isolated. And a familiar face returns that has Hannah on her toes."
      },
      {
        "id": "tvmaze:1701943",
        "title": "Nauti Girls Need Love Too",
        "season": 4,
        "episode": 14,
        "released": "2019-09-02",
        "overview": "Ben's first dinner doesn't wow the guests as much as he had hoped leaving him questioning if he still has his sea legs. Anastasia has a hard time adjusting back to her old third stew role, while Travis continues to have a difficult time losing Jack to Aesha. And when 20 knots of wind strike, the deck team rushes to secure the vessel leaving Colin in a place which could end his season."
      },
      {
        "id": "tvmaze:1705795",
        "title": "Holy Ship!",
        "season": 4,
        "episode": 15,
        "released": "2019-09-09",
        "overview": "Ben is determined to regain his sea legs, but Sirocco's faulty galley has other plans. Travis' latest drunken night has Sandy at the end of her rope. Jack ups his romance game by writing poetry for Aesha, while Anastasia's apathy for her old job is starting make Hannah's life more difficult.  And rough seas puts the boat in a situation that leaves everyone holding on for dear life."
      },
      {
        "id": "tvmaze:1712145",
        "title": "Sweet White Glove o' Mine",
        "season": 4,
        "episode": 16,
        "released": "2019-09-16",
        "overview": "The charter guests request a White Party for their final dinner, and Ben goes to great lengths in creating a menu for the theme. Joao's ego gets him in hot water with Captain Sandy, while Jack enlists the crew to help him ask Aesha to be his girlfriend. And Hannah's leadership skills are called into question after Sandy calls out the interior crew for a subpar performance in service."
      },
      {
        "id": "tvmaze:1713843",
        "title": "Love, Love Me Stew",
        "season": 4,
        "episode": 17,
        "released": "2019-09-23",
        "overview": "The crew prepares for the final charter of the season, and with Joao sidelined with a high fever, Travis is forced to step up. Bad weather rolls into the South of France leaving Sirocco stuck at the dock, adding more pressure on the interior team to perform. And when Anastasia gets on Sandy's bad side, Hannah bares the brunt of the Captain's fury."
      },
      {
        "id": "tvmaze:1713844",
        "title": "Au Revoir, Sirocco",
        "season": 4,
        "episode": 18,
        "released": "2019-09-30",
        "overview": "On the final episode of the season, a boat catches fire in port stranding Sirocco with nowhere to go. The interior team grows resentful of Sandy's harsh criticisms, while Jack and Aesha contemplate their future off the boat. And Sandy calls out Hannah's lack of passion for yachting, which leaves both of them wondering if this will be their last charter together."
      },
      {
        "id": "tvmaze:1863223",
        "title": "I Like Big Boats and I Cannot Lie",
        "season": 5,
        "episode": 1,
        "released": "2020-06-01",
        "overview": "Below Deck Mediterranean returns for its fifth season with Captain Sandy Yawn at the helm of the mega-yacht Wellington, cruising one of the most desired yachting locations in the Mediterranean: Mallorca, Spain. After earning the Lead Deckhand title in season 2, Malia returns as Captain Sandy's first female Bosun, a role she hopes to grow into while commanding respect from her all-male deck team. Brazilian Chef, Kiko, tries to make a good first impression while having to overcome Captain Sandy's skepticism from last charter season's galley struggles. Hannah returns as Chief Stew in a new stage of her life, but immediately finds herself challenged by an experienced Second Stew. When the first guests arrive, cracks begin to surface as Hannah attempts to maintain control of her team."
      },
      {
        "id": "tvmaze:1874225",
        "title": "Can't Touch This",
        "season": 5,
        "episode": 2,
        "released": "2020-06-08",
        "overview": "Hannah struggles to get her Second Stew in line, and tensions reach a boiling point when Lara refuses to take direction from Hannah. In the galley, Kiko finds himself up against guests that are less than satisfied. Malia deals with a green deck crew and is forced to draw the line with Pete."
      },
      {
        "id": "tvmaze:1874226",
        "title": "The Italian's Job",
        "season": 5,
        "episode": 3,
        "released": "2020-06-15",
        "overview": "Romance is in bloom on the crew's first night out of the season, as Pete makes his move while Rob and Jess find themselves connecting on a deeper level. The second charter kicks off when guests with ties to the music industry arrive, but unforeseen circumstances immediately put the Wellington crew behind the eight ball. Meanwhile, Pete's attitude forces Malia into a difficult confrontation, and tensions between Hannah and Lara take a surprising new turn."
      },
      {
        "id": "tvmaze:1874227",
        "title": "Ace of Stew Face",
        "season": 5,
        "episode": 4,
        "released": "2020-06-22",
        "overview": "With bad weather rolling in and down her Second Stew, Hannah scrambles to manage the interior with only Jess to rely on. Captain Sandy and Malia draw a hard line with the deck team when they call the guys out for their questionable behavior. Kiko struggles to prepare a picnic lunch for the first off-boat excursion of the season. After surviving the charter, Hannah is rewarded with a Second Stew, but she quickly realizes the newest addition to her team may be more than she bargained for."
      },
      {
        "id": "tvmaze:1878689",
        "title": "Bringing the Thunder",
        "season": 5,
        "episode": 5,
        "released": "2020-06-29",
        "overview": "A blast from the past returns amidst a massive thunderstorm that threatens to keep The Wellington docked for their next charter. Rob and Jessica deepen their connection, while Pete's attitude continues to frustrate Malia. Meanwhile, Kiko is pushed to the limit by a group of new guests whose requests are incredibly demanding."
      },
      {
        "id": "tvmaze:1889600",
        "title": "Oh Snap!",
        "season": 5,
        "episode": 6,
        "released": "2020-07-06",
        "overview": "Kiko faces his biggest challenge yet when demanding charter guests invite friends to join a 6-course dinner. Hannah confronts Bugsy about their past, while Rob and Jess find their budding relationship threatened by a new revelation. Meanwhile, an unexpected injury threatens to upend the rest of the charter season."
      },
      {
        "id": "tvmaze:1889601",
        "title": "No Mushroom for Error",
        "season": 5,
        "episode": 7,
        "released": "2020-07-13",
        "overview": "An injured Jess fights to maintain her spot on the boat, while another crew member's inappropriate behavior finally catches up to him. Meanwhile, high-maintenance charter guests challenge the interior and expose cracks in Hannah and Bugsy's relationship. And after surviving a 72-plate dinner last charter, Kiko is faced with something equally challenging and he's once again put to the test."
      },
      {
        "id": "tvmaze:1889602",
        "title": "Rise and Don't Shine",
        "season": 5,
        "episode": 8,
        "released": "2020-07-20",
        "overview": "After struggling through the first day of charter, Kiko fights to regain his footing with a demanding set of charter guests. While Hannah leans on an overworked Bugsy to carry an injured Jess, Captain Sandy becomes concerned about the interior's performance. Meanwhile, Malia looks to Rob and Alex to step up after she's forced to make a tough call that changes the exterior's dynamic. And a surprise complaint forces Captain Sandy to issue an ultimatum."
      },
      {
        "id": "tvmaze:1889603",
        "title": "Viva, Loss Vegas",
        "season": 5,
        "episode": 9,
        "released": "2020-07-27",
        "overview": "On a crew night out, Alex reveals his feelings to Bugsy while Hannah struggles to connect with the group. Meanwhile, Captain Sandy comes down on Jess for her performance in the laundry room, and an incident with the water toys forces Malia into an emergency rescue. With his job on the line, Kiko rallies himself for a successful charter, but a Vegas-themed dinner threatens to unravel everything."
      },
      {
        "id": "tvmaze:1906057",
        "title": "Closing Time",
        "season": 5,
        "episode": 10,
        "released": "2020-08-03",
        "overview": "Captain Sandy and Kiko find themselves at a crossroad after a critical dinner, while Hannah fights to maintain control under the weight of a stressful season. On a guest excursion into Valldemossa, Rob and Jess up the ante in their relationship."
      },
      {
        "id": "tvmaze:1906058",
        "title": "Cabin Fever",
        "season": 5,
        "episode": 11,
        "released": "2020-08-10",
        "overview": "The crew enjoys a day off at an exclusive beach club in Mallorca, but concerns arise when Hannah stays behind to nurse an illness. Romance is in the air when Malia's boyfriend Tom arrives for a visit, while Alex takes stock of his relationship with Bugsy, and Jess offers Rob a bold invitation. With Kiko off the boat, Captain Sandy struggles to find a suitable replacement."
      },
      {
        "id": "tvmaze:1906059",
        "title": "There's No Place Like Home",
        "season": 5,
        "episode": 12,
        "released": "2020-08-17",
        "overview": "With Hannah's back against the wall, Captain Sandy faces a difficult decision that could change the trajectory of The Wellington. Bugsy grapples with a new challenge, while Malia worries about Tom's ability to navigate a chaotic first charter."
      },
      {
        "id": "tvmaze:1906060",
        "title": "Welcome Back",
        "season": 5,
        "episode": 13,
        "released": "2020-08-24",
        "overview": "Down a stew in the wake of Hannah's departure, Bugsy fights to keep the interior afloat with a skeptical Jess by her side. Malia struggles to manage a frustrated deck team, while helping Tom navigate his first charter. Finally, the interior team is relieved when a new Second Stew arrives onboard."
      },
      {
        "id": "tvmaze:1906061",
        "title": "Whole New Ballgame",
        "season": 5,
        "episode": 14,
        "released": "2020-08-31",
        "overview": "Baseball legend Johnny Damon returns to charter in Ibiza, putting pressure on Tom to rectify the Damons' poor experience with the food they were served last season. With Aesha onboard, Bugsy ups her expectations for the interior team. Meanwhile, Rob's personal life begins to interfere with his work, and Jess notices some red flags with his behavior."
      },
      {
        "id": "tvmaze:1922867",
        "title": "Shot Through the Heart, and Ibiza's to Blame",
        "season": 5,
        "episode": 15,
        "released": "2020-09-07",
        "overview": "While Jess deals with a scary medical condition, Rob draws Malia's ire by continuing to underperform on deck. Tom looks to polish off a perfect charter for the demanding Damons, while Aesha deals with a bout of homesickness. And during a wild crew night out in Ibiza, one relationship deepens while another goes off the rails."
      },
      {
        "id": "tvmaze:1922868",
        "title": "Cool as a Cucumber",
        "season": 5,
        "episode": 16,
        "released": "2020-09-14",
        "overview": "After a tumultuous night in Ibiza, Rob and Jess struggle to reconcile. A mechanical error during docking has Captain Sandy scrambling to avoid a catastrophic disaster, while the new charter guests arrange a bet with Bugsy that threatens to disrobe the crew. Meanwhile, a guest request sends a sleep-deprived Tom over the edge."
      },
      {
        "id": "tvmaze:1924676",
        "title": "Something's Fishy",
        "season": 5,
        "episode": 17,
        "released": "2020-09-21",
        "overview": "A speedo-clad Bugsy prepares a naughty-themed evening for the guests, while managing the fallout of cucumber-gate. Tensions run high between Captain Sandy and Chef Tom, while Jess becomes wary of Aesha. On a crew night out, Alex questions Bugsy about the direction of their relationship, while Rob and Jess spend a romantic night in the guest cabins. And on the morning of the final charter, a big mistake leaves a crew member ready to walk off the boat."
      },
      {
        "id": "tvmaze:1924677",
        "title": "A Real Handful",
        "season": 5,
        "episode": 18,
        "released": "2020-09-28",
        "overview": "Tom becomes incensed over a provisioning mishap, while Malia and Bugsy struggle to manage the fallout. Rob and Alex find themselves ogled by the final charter guests of the season. Meanwhile, a group photo with Rob and Aesha sends Jess over the edge."
      },
      {
        "id": "tvmaze:1930669",
        "title": "The Bali is in Your Court",
        "season": 5,
        "episode": 19,
        "released": "2020-10-05",
        "overview": "Jess confronts Aesha over the guests' group photo, while the rest of the boat races to mitigate the impending damage. Tom works to keep a lid on his frustrations, as Malia waits for the other shoe to drop. Meanwhile, Aesha makes a decision about her future and Rob is presented with an alternative to traveling with Jess to Bali."
      },
      {
        "id": "tvmaze:1930670",
        "title": "A Mighty Wind",
        "season": 5,
        "episode": 20,
        "released": "2020-10-12",
        "overview": "As the last charter comes to an end, Captain Sandy reckons with a chaotic season while the few remaining chips continue to fall. Rob and Jess struggle to reconcile after a disastrous fight, while Aesha comes to grips with the end of her yachting career. Tom looks to clear his final hurdle, as Alex hopes to leave things with Bugsy on a positive note. On their final night out before parting ways, the crew gets an enormous surprise."
      },
      {
        "id": "tvmaze:2101629",
        "title": "A Yacht in Kneed",
        "season": 6,
        "episode": 1,
        "released": "2021-06-28",
        "overview": "Captain Sandy returns to Croatia at the helm of the mega-yacht Lady Michelle in hopes of guiding a new team through calmer waters along the stunning Dalmatian Coast. Previously a Chef to celebrities and the uber-wealthy, Mathew takes over the galley, where his ambitions quickly conflict with his on-board reality. An exceedingly accomplished yachtie, Katie joins as Captain Sandy's first new Chief Stew in years. Meanwhile, the deck team discovers one of their deckhands is greener than they could imagine. By the time the first charter guests arrive, the team is left in an impossible situation that threatens to derail the season before it can even begin."
      },
      {
        "id": "tvmaze:2121117",
        "title": "It's Not Easy Being Green",
        "season": 6,
        "episode": 2,
        "released": "2021-07-05",
        "overview": "Katie feels the weight of the demanding guests, while Lexi copes with a difficult personal issue. Malia works to get her new deck crew up to speed while preparing a bachelor and bachelorette party, but a very inexperienced deckhand has trouble keeping up. The rest of the charter season hangs in limbo as the crew wonders whether Chef Mat will return to the boat."
      },
      {
        "id": "tvmaze:2122114",
        "title": "It's Like Rain on Your Wedding Day",
        "season": 6,
        "episode": 3,
        "released": "2021-07-12",
        "overview": "As the crew scrambles to get ready for a wedding that may or may not happen, Captain Sandy prepares to officiate for the first time. Meanwhile, Mat hopes to redeem himself after his disastrous first day and Katie sacrifices any breaks to help her team. Later that evening, the group's first night out leaves some crew members feeling the love, while others clash in a big way."
      },
      {
        "id": "tvmaze:2126237",
        "title": "Love at First Night",
        "season": 6,
        "episode": 4,
        "released": "2021-07-19",
        "overview": "Love is in the air during the crew's first night out as Courtney celebrates Mzi's birthday and David becomes smitten with Malia, his supervisor on deck. As the second charter kicks off and a familiar charter guest returns, Katie implements a new stew rotation throwing Courtney into an unfamiliar role. Chef Mat aims to continue his positive momentum, but an accident in the galley threatens to take him back to square one. Meanwhile, the deck crew is put to the ultimate test when they are faced with their first night docking of the season."
      },
      {
        "id": "tvmaze:2132749",
        "title": "Ship Happens",
        "season": 6,
        "episode": 5,
        "released": "2021-07-26",
        "overview": "As the second charter comes to a close, tensions between the crew continue to boil as Chef Mathew takes issue with a request. Courtney and Lexi bond over familial hardships, while the deckhands bond over their developing crushes. Meanwhile, an insult toward the deck team prompts a strong defense, leaving Katie struggling to keep the peace and the crew possibly short-handed."
      },
      {
        "id": "tvmaze:2133441",
        "title": "The Morning After",
        "season": 6,
        "episode": 6,
        "released": "2021-08-02",
        "overview": "After an explosive night out, the crew ponders whether they can forgive and forget. The third charter arrives with high energy and even higher maintenance. Meanwhile, when a crew member has a shocking change of heart, Captain Sandy must decide if she is willing to give one more chance."
      },
      {
        "id": "tvmaze:2136778",
        "title": "Can't Fight This Feeling",
        "season": 6,
        "episode": 7,
        "released": "2021-08-09",
        "overview": "Chef Mathew struggles to please an incredibly difficult charter guest, and Katie tries to reinvigorate Lexi as they try to make amends. Meanwhile, Courtney and Mzi grow closer, and David finally gathers the courage to ask Malia a burning question."
      },
      {
        "id": "tvmaze:2141247",
        "title": "At Your Lack of Service",
        "season": 6,
        "episode": 8,
        "released": "2021-08-16",
        "overview": "After striking out with Malia, his supervisor on deck, David navigates awkward waters. With a new charter underway, it's Courtney's turn on service leaving Lexi in laundry and Katie picking up the slack. Chef Mathew continues to prove he's worth a third chance, while tensions begin to brew between Captain Sandy and Malia."
      },
      {
        "id": "tvmaze:2141248",
        "title": "Brews, Stews & Management Blues",
        "season": 6,
        "episode": 9,
        "released": "2021-08-23",
        "overview": "Chef Mathew hopes to polish off his most successful charter to date, while Lloyd leads an Oktoberfest celebration. Katie struggles to keep the interior afloat leaving her to make a very unusual decision about her team."
      },
      {
        "id": "tvmaze:2141249",
        "title": "Burning Down the House",
        "season": 6,
        "episode": 10,
        "released": "2021-08-30",
        "overview": "A new crew member arrives on Lady Michelle and Katie is left in a bind when she finds out some surprising new information. Chef Mathew faces his most challenging preference sheet yet but is presented with an even bigger hurdle when there is a dangerous incident in the galley. Meanwhile, the biggest storm of the season hits, leaving the crew scrambled and worried."
      },
      {
        "id": "tvmaze:2141250",
        "title": "Should I Stay or Should I Go",
        "season": 6,
        "episode": 11,
        "released": "2021-09-06",
        "overview": "A whiteout storm and continual bad weather forces the crew of Lady Michelle to find creative ways to keep the guests entertained. Meanwhile, David learns a lesson the hard way after making an important error and Katie's aversion to conflict comes to a head when she is forced to make a tough decision about her interior team."
      },
      {
        "id": "tvmaze:2165329",
        "title": "Don't Go Chasing Waterfalls",
        "season": 6,
        "episode": 12,
        "released": "2021-09-13",
        "overview": "The crew enjoys a day off at a Croatian national park. Mzi reveals his feelings for Courtney and David gets closer to Delaney, but a brutal injury threatens to derail one of the budding romances. Meanwhile, old tensions between Lexi and Chef Mathew resurface leading to an explosive stand-off that begins to unravel the close-knit crew."
      },
      {
        "id": "tvmaze:2170691",
        "title": "A Hard Day's Night",
        "season": 6,
        "episode": 13,
        "released": "2021-09-20",
        "overview": "When the crew of Lady Michelle grapples with the fallout of Lexi and Chef Mathew's fight, Captain Sandy steps in to figure out who stays and who goes. Mzi must face Courtney after his romantic gestures fall flat and Katie wrestles with the potential of another crew shakeup. Meanwhile, David's injured leg gets Malia in hot water with Captain Sandy."
      },
      {
        "id": "tvmaze:2172828",
        "title": "All I Need is a Miracle",
        "season": 6,
        "episode": 14,
        "released": "2021-09-27",
        "overview": "A new group of charter guests arrive with high spirits and even higher expectations. As Sandy joins the guests for dinner, Mathew puts extra pressure on himself to impress his Captain. And when Katie voluntarily goes short-handed in the stew department, Malia worries the workload will become overwhelming for the deck crew after rookie mistakes are made."
      },
      {
        "id": "tvmaze:2180022",
        "title": "Three's a Crowd",
        "season": 6,
        "episode": 15,
        "released": "2021-10-04",
        "overview": "While Katie and Courtney celebrate completing a charter down a stew, Malia takes her deck crew to task for a surprising regression and David struggles with his role on deck. Later that evening, the group's night out leaves some crew members frustrated with the Chef. Back on the boat, a medical emergency leaves the crew emotionally shaken and perilously short-handed."
      },
      {
        "id": "tvmaze:2187180",
        "title": "Sleepless in Croatia",
        "season": 6,
        "episode": 16,
        "released": "2021-10-11",
        "overview": "While Lloyd heads to the hospital, the crew tries to manage a group of demanding charter guests with only six people. Katie struggles under the weight of her decision to go down to two stews, while Malia grows frustrated with the pressure interior has placed on the deck crew. In the galley, Mathew grows increasingly insecure after receiving his first complaint of the season leading to a breakfast that threatens to derail the final charter."
      },
      {
        "id": "tvmaze:2187195",
        "title": "Nothing Comes Over Easy",
        "season": 6,
        "episode": 17,
        "released": "2021-10-18",
        "overview": "In a hectic final day, the crew tries to pull off a picnic in an old Croatian fortress, while Mathew struggles to pull himself out of a spiral. Sandy, Malia and the deck crew face a dangerous anchor drag as an increasingly exhausted Katie tries to push through the final charter with only two stews. Meanwhile, the crew prepares to spend a week in Split together after the season."
      },
      {
        "id": "tvmaze:2350937",
        "title": "There's No Place like Home",
        "season": 7,
        "episode": 1,
        "released": "2022-07-04",
        "overview": "Captain Sandy kicks off another charter season in the Mediterranean, this time on the exclusive island of Malta aboard the sleek and ultra-modern motoryacht Home. With all-new department heads, things get off to a tumultuous start when the bosun is left short-handed. When the guests come aboard, the chef struggles to please a guest who's short on compliments and long on complaints. Eyebrows are raised as crew members question the nature of a relationship between two fellow yachties."
      },
      {
        "id": "tvmaze:2357040",
        "title": "I've Got a Sea-cret",
        "season": 7,
        "episode": 2,
        "released": "2022-07-11",
        "overview": "After recovering from the loss of their stabilizers, the crew contends with a guest who isn't quiet about his complaints. Chef Dave is determined to win the guests over with his food, but their approval doesn't come easy. The interior team fires on all cylinders and the deck crew struggles to keep their heads above water. During their first night out, Natalya presses two fellow yachties on the status of their relationship, causing things to get uncomfortable quickly."
      },
      {
        "id": "tvmaze:2357041",
        "title": "A Whole Yacht of Scandal",
        "season": 7,
        "episode": 3,
        "released": "2022-07-18",
        "overview": "Two yachties are forced to confront their complicated past as Natalya pressures them about the status of their relationship. After a night of letting loose, a crew member on the exterior is worse for the wear, forcing others to pick up the slack. When a group of young charter guests come to party, the crew races to keep up with them. The bosun feels the pressure to perform when the deck team struggles to get the toys out in time."
      },
      {
        "id": "tvmaze:2357047",
        "title": "Skeletons in the Cabin",
        "season": 7,
        "episode": 4,
        "released": "2022-07-28",
        "overview": "The Chef and Chief Stew have an icy stand-off. The guests are disappointed when incoming weather forces the boat back to the marina. The guests pile pressure on the interior with hefty rounds of drink orders and Kyle isn't shy about his team carrying the load this charter. Capt. Sandy is faced with a shocking career first after a crew member makes a mistake during the docking."
      },
      {
        "id": "tvmaze:2357048",
        "title": "Break-Ups and Shake-Ups",
        "season": 7,
        "episode": 5,
        "released": "2022-08-01",
        "overview": "Captain Sandy makes a critical decision that impacts the deck team. After the second charter comes to an end, the crew has an eventful night out. Two crew members relationship takes a tumultuous turn causing Captain Sandy to intervene."
      },
      {
        "id": "tvmaze:2357049",
        "title": "Walkie of Shame",
        "season": 7,
        "episode": 6,
        "released": "2022-08-08",
        "overview": "A new crew member joins motor yacht Home, bringing new skills to the group. A surge of bad swells has the guests stuck at the dock and puts the crew under pressure. Natasha reunites with a blast from the past. Storm faces a major challenge when his walkie malfunctions during a docking."
      },
      {
        "id": "tvmaze:2357050",
        "title": "For Tooth's Sake",
        "season": 7,
        "episode": 7,
        "released": "2022-08-15",
        "overview": "The interior team has a disagreement about their priorities. Captain Sandy and the deck crew attempt a tricky night docking. Tasha breaks shocking news to a fellow yachtie. Kyle deals with an aching personal issue that affects his work. Storm and Natalya go on their first date, but things don't go as planned."
      },
      {
        "id": "tvmaze:2357051",
        "title": "Wine Im-Pairing",
        "season": 7,
        "episode": 8,
        "released": "2022-08-22",
        "overview": "Kyle gets friendly with someone on board, potentially putting his job on the line. During a deck dispute about the slide, Jason has some unkind words for Storm. Natasha tries to impress the guests with an elaborate wine pairing that nearly sinks the dinner service."
      },
      {
        "id": "tvmaze:2357052",
        "title": "Let Me Be Frank",
        "season": 7,
        "episode": 9,
        "released": "2022-08-29",
        "overview": "Natasha and Dave deal with the fallout from the Around the World dinner. The crew pulls together an over-the-top Olympic obstacle course for the guests. Special guest \"Bambi\" makes a surprise appearance. Kyle transgresses with a charter guest, seeking the romantic moment for which he has been longing."
      },
      {
        "id": "tvmaze:2357053",
        "title": "Finding the Groove",
        "season": 7,
        "episode": 10,
        "released": "2022-09-05",
        "overview": "Storm adjusts to his new role as Bosun. Natalya vents her frustrations about her Chief Stew's management to another crew member. The crew gets groovy and pulls together a '70s-inspired party for the guests. Natasha shocks the guests with a surprising offering. Captain Sandy and Storm try to unwind an unexpected anchor tangle."
      },
      {
        "id": "tvmaze:2357056",
        "title": "The Bold and the Betrayed",
        "season": 7,
        "episode": 11,
        "released": "2022-09-12",
        "overview": "The deck crew tries to untie a tangled anchor while the guests enjoy paddleboard yoga. Storm comes to the realization that he needs to delegate more and decides to appoint a Lead Deckhand. Natalya grows frustrated over the interior's organization and is sent over the edge when Natasha and Kyle prioritize service over a tidy pantry. Storm struggles to deal with an insubordinate deckhand. Captain Sandy confronts the interior team about their shortcomings."
      },
      {
        "id": "tvmaze:2357057",
        "title": "We Just Don't Clique",
        "season": 7,
        "episode": 12,
        "released": "2022-09-19",
        "overview": "Natasha and Kyle decide to work on their night off in order to organize the pantry, missing out on Mzi's birthday celebration. During the crew day off, the divisions in the team begin to deepen as two clear cliques form. Storm falls harder for Natalya, but the closer he gets, the more she pushes him away. Courtney tearfully confides in Kyle about her father's health issues. Storm tries to confront Jason about his attitude and is surprised when Jason turns the conversation on its head."
      },
      {
        "id": "tvmaze:2357058",
        "title": "Charter of Destiny",
        "season": 7,
        "episode": 13,
        "released": "2022-09-26",
        "overview": "A shortened charter with energetic guests puts pressure on the crew to pull out all the stops, including a surprise visit from a pop star. Tensions on the interior team continue to rise. Things get awkward and heated when Storm makes a pivotal work decision on a night out."
      },
      {
        "id": "tvmaze:2357059",
        "title": "In a Bind",
        "season": 7,
        "episode": 14,
        "released": "2022-10-03",
        "overview": "The deck crew powers through an awkward night out after Courtney is promoted to lead deckhand during off-charter hours. Natasha reels from a dramatic exchange with her boyfriend. A new crew member is welcomed on motor yacht Home. Familiar charter guests return and surprise the crew by requesting some risqué offerings, including a nude photo shoot and a BDSM-themed dinner. Natalya sees red when Kyle doesn't complete a housekeeping task, and the charter boils over into a heated argument."
      },
      {
        "id": "tvmaze:2357060",
        "title": "Brace for Impact",
        "season": 7,
        "episode": 15,
        "released": "2022-10-10",
        "overview": "After a contentious disagreement over housekeeping, Kyle and Natalya reset when Kyle delivers a sincere apology. The charter guests lose control on Jet Skis. Reid has major regrets when he makes a joke that goes too far. The crew looks forward to blowing off steam on a night out, but the positive energy comes to a halt when an explosive argument erupts between two crew members."
      },
      {
        "id": "tvmaze:2412350",
        "title": "Clash Landing",
        "season": 7,
        "episode": 16,
        "released": "2022-10-17",
        "overview": "A fight between the entire interior team erupts and affects the crew on their night out. Storm's support of Natalya causes her to reconsider their romance. Demanding boat-savvy guests put the crew through their paces, and the incoming swell only intensifies the turbulence. When Natasha tries to set boundaries with Dave, he gets angry and the dinner service spirals out of control. The season takes an unexpected tumble when a crew member has a sudden serious injury."
      },
      {
        "id": "tvmaze:2412351",
        "title": "The Fall Guy",
        "season": 7,
        "episode": 17,
        "released": "2022-10-24",
        "overview": "The crew scrambles to help Kyle after a tumble down the stairs and his subsequent ankle injury is worse than they thought, which puts more pressure on the interior. With another day of bad weather ahead, the deck crew figures out a creative way to get the guests on the water. When Courtney tries to pull up the anchor, however, she gets an unwelcome surprise. After Natasha and Natalya work a long, exhaustive day on their own, Natasha must make a difficult decision about the future of her department."
      },
      {
        "id": "tvmaze:2419605",
        "title": "Stuck in the Griddle with You",
        "season": 7,
        "episode": 18,
        "released": "2022-10-31",
        "overview": "A unique, new crew member joins for the final charter and the interior team scrambles to train her. The charter group includes two well-known NFL players, one of whom has a special food request that sends Dave scrambling. Natasha and Natalya try to bury the hatchet. When one of the charter guests loses a valuable item, Courtney feels pressured to help them with the impossible. Natasha and Dave are forced to confront a blast from the past under shocking circumstances."
      },
      {
        "id": "tvmaze:2423957",
        "title": "Let's Bring It Home",
        "season": 7,
        "episode": 19,
        "released": "2022-11-07",
        "overview": "The crew welcomes their final day of charter with exhaustion and exhilaration. Dave faces a new challenge as he tries to accommodate a guest's specific food request. Elena finds herself running behind. After reflecting on her past relationships, Natasha has some major realizations about herself. Storm and Natalya navigate the end of the season and their relationship after a toast gone wrong. As the charter season comes to an end, the crew has their wildest night yet."
      },
      {
        "id": "tvmaze:2428115",
        "title": "Reunion",
        "season": 7,
        "episode": 20,
        "released": "2022-11-22",
        "overview": "A new boat, crew and location in this series that follows nine members of a crew who live and work aboard a 150-foot yacht. As the ship journeys through the Mediterranean, each episode features a new group of elite passengers."
      },
      {
        "id": "tvmaze:2635384",
        "title": "The Italian Job",
        "season": 8,
        "episode": 1,
        "released": "2023-09-25",
        "overview": "Capt. Sandy embarks on a new charter season on the beautiful waters of the Italian Riviera, but this time she's facing uncharted challenges. Two of her stews have unprecedented issues getting to the yacht, so a familiar face is called in to help. The deck team faces unforeseen obstacles. Capt. Sandy has no choice but to make a difficult decision."
      },
      {
        "id": "tvmaze:2648549",
        "title": "Two Many Cooks",
        "season": 8,
        "episode": 2,
        "released": "2023-10-02",
        "overview": "A deckhand steps up after a surprise incident. The crew is challenged by seasick guests, which leads to an impromptu excursion to Portofino. Natalya attempts to keep the interior team afloat before she meets her new chief stew, Tumi, for the first time."
      },
      {
        "id": "tvmaze:2648550",
        "title": "We've Only Just Begun",
        "season": 8,
        "episode": 3,
        "released": "2023-10-09",
        "overview": "Tumi and Natalya grapple with differences in management styles. Steward Kyle and a new deckhand join the crew on board. While stuck at the dock with unhappy guests, the interior team scrambles to keep everyone happy. Tumi and Chef Jack have trouble with communication."
      },
      {
        "id": "tvmaze:2655500",
        "title": "Take It to the Bridge",
        "season": 8,
        "episode": 4,
        "released": "2023-10-16",
        "overview": "A stew is torn between their open relationship and a growing onboard flirtation. The deck team's communication is strained during a rough docking. The rivalry amongst stews spills into the workplace and Capt. Sandy is forced to intervene."
      },
      {
        "id": "tvmaze:2655501",
        "title": "Max Tension",
        "season": 8,
        "episode": 5,
        "released": "2023-10-23",
        "overview": "A deckhand's questionable work ethic gets on the rest of the team's nerves, while the Bosun struggles to motivate them. Two stews hope to bury the hatchet for the sake of crew morale. Past charter guests arrive with a new baby and a lot of energy, keeping the crew on their toes. Things get heated between two deckhands during an anchor pull, resulting in Capt. Sandy wanting to intervene."
      },
      {
        "id": "tvmaze:2662859",
        "title": "Pirate's Booty Call",
        "season": 8,
        "episode": 6,
        "released": "2023-10-30",
        "overview": "The crew orchestrates an intricate pirate-themed day; a tense docking tests the deck crew."
      },
      {
        "id": "tvmaze:2667102",
        "title": "Tightly Unwound",
        "season": 8,
        "episode": 7,
        "released": "2023-11-06",
        "overview": "Some of the crew take notice of a group of attractive young women chartering the yacht. A miscommunication between the chief stewardess and the interior department leaves them uncertain. Capt. Sandy has an accident that could impact the rest of the charter season."
      },
      {
        "id": "tvmaze:2668688",
        "title": "Who Needs Frenemies",
        "season": 8,
        "episode": 8,
        "released": "2023-11-13",
        "overview": "The bosun causes confusion when he shifts his romantic focus. The chef gives into temptation. The charter guests continue the festivities with the crew after the charter ends. An argument between the crew could be the one that ends friendships."
      },
      {
        "id": "tvmaze:2672972",
        "title": "Ciao for Now",
        "season": 8,
        "episode": 9,
        "released": "2023-11-20",
        "overview": "The crew's day off at a beach resort is fraught with tension and division, lingering from the previous night's kerfuffle. The bosun's new romance ignites. A crew member confesses their frustrations and puts Capt. Sandy in a difficult position."
      },
      {
        "id": "tvmaze:2672973",
        "title": "Dirty Laundry",
        "season": 8,
        "episode": 10,
        "released": "2023-11-27",
        "overview": "A new crewmember arrives but may lack some necessary skills. Capt. Sandy gives it her all trying to persuade a deckhand to stay on the boat. In scenic Portofino, the deckhands face their most challenging docking yet. Interior woes continue when a stew thinks the chef is out to get them."
      },
      {
        "id": "tvmaze:2684093",
        "title": "Safety Dance",
        "season": 8,
        "episode": 11,
        "released": "2023-12-04",
        "overview": "Tensions rise as the chef and a crew member clash, dividing the interior team. Romance blossoms, bringing two yachties closer together. The chief stew's frustration grows as her new team member struggles with the workload. Capt. Sandy loses her patience with the bosun after his actions cause a safety issue."
      },
      {
        "id": "tvmaze:2688945",
        "title": "Sink or Swim",
        "season": 8,
        "episode": 12,
        "released": "2023-12-11",
        "overview": "Capt. Sandy has a difficult conversation with the primary charter guest after someone in their group becomes unruly. The bosun's interior love interest develops feelings for him, but fears that he doesn't reciprocate her sentiments. The chief stew's problems with an interior crew member reach a boiling point, forcing her to seek Capt. Sandy's intervention."
      },
      {
        "id": "tvmaze:2697691",
        "title": "High Steaks",
        "season": 8,
        "episode": 13,
        "released": "2023-12-18",
        "overview": "A returning guest seeks redemption on a charter; a stew tries to find their footing."
      },
      {
        "id": "tvmaze:2714482",
        "title": "Caught Read Handed",
        "season": 8,
        "episode": 14,
        "released": "2024-01-08",
        "overview": "The bosun's texting with a familiar chief stew turns into a damage control crisis. The chef faces a culinary challenge with a blindfolded dinner. The chief stew's service skills are put to the test. Illness strikes the lead deckhand, leaving Capt. Sandy with the daunting prospect of embarking on the next charter short staffed and potentially jeopardizing their ability to leave the dock."
      },
      {
        "id": "tvmaze:2714483",
        "title": "Curb Your Stewsiasm",
        "season": 8,
        "episode": 15,
        "released": "2024-01-15",
        "overview": "Due to inclement weather coming in, the final charter of the season risks remaining docked. The chief stew and bosun work tirelessly to organize activities for the guests, relying heavily on the assistance of the fourth stew. The chef receives a surprising text message from a former crew member."
      },
      {
        "id": "tvmaze:2719696",
        "title": "Guess Who's Coming to Dinner",
        "season": 8,
        "episode": 16,
        "released": "2024-01-22",
        "overview": "On the season finale, the chief stew entrusts two crew members with the task of organizing an epic foam party for the guests. However, when the guests finally arrive, the party falls short of expectations. The bosun lands himself in hot water when he's caught texting again. The crew's final night out takes a shocking turn, leaving the bosun to make a difficult decision."
      },
      {
        "id": "tvmaze:2838327",
        "title": "My Big Fat Greek Yacht Emergency",
        "season": 9,
        "episode": 1,
        "released": "2024-06-03",
        "overview": "Capt. Sandy embarks on a new charter season in Athens, Greece; she welcomes back familiar face Aesha Scott to serve as her chief steward; provisions fail to arrive before the guests and the yacht crew is forced to scramble."
      },
      {
        "id": "tvmaze:2900136",
        "title": "Sneak, Sip, and Sink",
        "season": 9,
        "episode": 2,
        "released": "2024-06-10",
        "overview": "The charter guests remain without provisions, but two deckhands come to the rescue by acquiring a surprise from a nearby boat; Aesha has difficulty maintaining the interior's smooth operation."
      },
      {
        "id": "tvmaze:2900137",
        "title": "Drifting Standards",
        "season": 9,
        "episode": 3,
        "released": "2024-06-17",
        "overview": "A new boat, crew, and location in this series that follows nine members of a crew who live and work aboard a 150-foot yacht; as the ship journeys through the Mediterranean, each episode features a new group of elite passengers."
      },
      {
        "id": "tvmaze:2925462",
        "title": "Greeking Havoc",
        "season": 9,
        "episode": 4,
        "released": "2024-06-24",
        "overview": "Tensions escalate as the deck team leaps into action to salvage a chaotic beach picnic; The chef finds himself in hot water when charter guests complain to Capt. Sandy before disembarking; Romance begins to blossom between more than two crew members."
      },
      {
        "id": "tvmaze:2925463",
        "title": "Caught Between a Dock and a Heart Place",
        "season": 9,
        "episode": 5,
        "released": "2024-07-01",
        "overview": "Tensions flare when two stews pursue the same deckhand; with a charter on the horizon, Aesha is rushed to the hospital, leaving her interior team in disarray; the deck team is still recovering from a difficult charter and struggles to maintain order."
      },
      {
        "id": "tvmaze:2925464",
        "title": "Running Aft-er Time",
        "season": 9,
        "episode": 6,
        "released": "2024-07-08",
        "overview": "Aesha's patience is tested when her stews' work starts slipping due to their transgressions. With tensions escalating, Aesha steps in to restore order and ensure the deckhands get their rest. A major mechanical issue prevents the anchor from lifting, leaving them stranded at sea."
      },
      {
        "id": "tvmaze:2940194",
        "title": "Chain Reaction",
        "season": 9,
        "episode": 7,
        "released": "2024-07-15",
        "overview": "To avoid being stranded at sea, Capt. Sandy must make a critical decision that could significantly impact the charter season. As tensions rise among the interior crew, Aesha attempts to broker a truce and struggles on the bow lead Capt. Sandy to question the bosun's decisionmaking. With wildfires encroaching on the marina, the crew must navigate an unprecedented environment."
      },
      {
        "id": "tvmaze:2946703",
        "title": "Dirty Laundry",
        "season": 9,
        "episode": 8,
        "released": "2024-07-22",
        "overview": "Tensions escalate on the interior when a stew reports a concern to Aesha. Before heading to a nearby island, the crew struggles with undocking amidst nearby wildfires. Aesha gives her interior team added responsibility with lunch service, but after overhearing a series of walkie calls, she begins to doubt if they can manage it on their own."
      },
      {
        "id": "tvmaze:2955214",
        "title": "This Boat's Not Big Enough for the Stew of Us",
        "season": 9,
        "episode": 9,
        "released": "2024-07-29",
        "overview": "After rough dockings, Capt. Sandy questions her bosun about safety concerns and trust. Romance and tension mix between a stew and a deckhand while another deckhand ends a relationship. A heated argument between two stews prompts Capt. Sandy to intervene on a most serious level."
      },
      {
        "id": "tvmaze:2955215",
        "title": "Regret Me Knot",
        "season": 9,
        "episode": 10,
        "released": "2024-08-05",
        "overview": "The stews face an ultimatum given by Capt. Sandy. Aesha implements a new laundry system. A deckhand's song about their romantic dilemma is overheard. During a day off, a deckhand apologizes as romance escalates."
      },
      {
        "id": "tvmaze:2971318",
        "title": "From Cloud Nine to Flatline",
        "season": 9,
        "episode": 11,
        "released": "2024-08-12",
        "overview": "Aesha consoles Capt. Sandy after a heartbreaking loss; the guests go on an excursion and romance heats up as a stew asks a deckhand out, which is followed by quick regret."
      },
      {
        "id": "tvmaze:2971319",
        "title": "The Perfect Storm",
        "season": 9,
        "episode": 12,
        "released": "2024-08-19",
        "overview": "The boat faces a catastrophic storm that exposes a major leak, putting the deck crew on high alert; tensions rise as the stews voice their frustrations over a deckhand; the interior crew's plans are thwarted, leading to chaos and challenges onboard."
      },
      {
        "id": "tvmaze:2984212",
        "title": "Chef Woes and Cabin Blows",
        "season": 9,
        "episode": 13,
        "released": "2024-08-26",
        "overview": "A potential catastrophe looms when a near-fatal dish is serve; interior challenges come to a head as Aesha's team remains in disarray; after the storm, the crew manages to fix the leak in the uninhabitable cabin."
      },
      {
        "id": "tvmaze:2984213",
        "title": "New Kid on the Dock",
        "season": 9,
        "episode": 14,
        "released": "2024-09-02",
        "overview": "The arrival of a new stew sets the stage for mixed reactions among the crew; a deckhand is blindsided by bad news from home; Aesha's frustration peaks when she discovers the laundry room is still in chaos."
      },
      {
        "id": "tvmaze:2993544",
        "title": "Fourth Stew's a Charm",
        "season": 9,
        "episode": 15,
        "released": "2024-09-09",
        "overview": "The stew dynamic gets further shaken up, sparking tension in the interior; two deckhands have a heated confrontation; a deckhand's flirting widens the divide onboard; a stew finds a solution to the mounting laundry problems."
      },
      {
        "id": "tvmaze:2997857",
        "title": "Chain of Command-Ment",
        "season": 9,
        "episode": 16,
        "released": "2024-09-16",
        "overview": "The crew heads into its final charter determined to finish strong despite brewing tension. A relationship between two deckhands heats up, leaving one of them questioning their future. Drama in the interior reaches a peak when Aesha calls out a stew for overstepping boundaries."
      },
      {
        "id": "tvmaze:3006452",
        "title": "Happily Ever Aft",
        "season": 9,
        "episode": 17,
        "released": "2024-09-23",
        "overview": "In the season finale, the crew bands together to ensure Capt. Sandy's proposal goes off without a hitch, but unexpected challenges arise. A new romance sparks on the final crew night out."
      },
      {
        "id": "tvmaze:3343195",
        "title": "Raising the Bar-Celona",
        "season": 10,
        "episode": 1,
        "released": "2025-09-29",
        "overview": "Captain Sandy and three trusted returnees are back for another wild charter season but when two deckies are sidelined by illness, the crew struggles to get the boat ready in time for charter. Aesha worries one of her green stews may be giving her deju vu. A crew member damages the boat on the first night."
      },
      {
        "id": "tvmaze:3389059",
        "title": "Stingled Out",
        "season": 10,
        "episode": 2,
        "released": "2025-10-06",
        "overview": "The deck team struggles to find their footing, and big mistakes are made. A stew begins to flirt with all male crew members on board. The chef struggles to get a handle on eccentric guest requests. Tension between two deckhands escalates to a heated argument."
      },
      {
        "id": "tvmaze:3389060",
        "title": "Excess Baggage",
        "season": 10,
        "episode": 3,
        "released": "2025-10-13",
        "overview": "A group of wealthy socialites keep the crew busy. The stews vie for attention from the guys. Meanwhile, the deck team downfall continues as major mistakes cause chaos including a deckhand that floats out to sea on a jet ski."
      },
      {
        "id": "tvmaze:3389061",
        "title": "Tough Divisions",
        "season": 10,
        "episode": 4,
        "released": "2025-10-20",
        "overview": "A group of young, entitled guests continue to cause chaos for the crew. The chef pulls together an over-the-top eight-course tasting menu that totally rocks and when the primary demands a late-night swim, it lands him and the crew in murky waters. Two deckhands have become a liability and Capt. Sandy and Nathan must figure out what to do about it."
      },
      {
        "id": "tvmaze:3389062",
        "title": "Let the Games Vegan",
        "season": 10,
        "episode": 5,
        "released": "2025-10-27",
        "overview": "A massive changeover rocks the boat. A stew gets pulled in multiple and a flirty love triangle starts to heat up. The chef struggles to cater to vegan guests with particular palates and complaints."
      },
      {
        "id": "tvmaze:3405648",
        "title": "The Tempest",
        "season": 10,
        "episode": 6,
        "released": "2025-11-03",
        "overview": "Bad weather rolls in suddenly and causes chaos. A crew member takes on a new role and shifts the group dynamic. Romance heats up on board, prompting jealousy and a crew member initiates a tearful breakup."
      },
      {
        "id": "tvmaze:3405660",
        "title": "Le Vie en Bros",
        "season": 10,
        "episode": 7,
        "released": "2025-11-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3405661",
        "title": "French Kiss",
        "season": 10,
        "episode": 8,
        "released": "2025-11-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3450097",
        "title": "This Is Un-Peasant",
        "season": 10,
        "episode": 9,
        "released": "2025-11-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3450098",
        "title": "Bowing Out",
        "season": 10,
        "episode": 10,
        "released": "2025-12-01",
        "overview": ""
      }
    ]
  }
}