{
  "meta": {
    "id": "tvmaze:55350",
    "type": "series",
    "name": "Abbott Elementary",
    "description": "In this workplace comedy, a group of dedicated, passionate teachers — and a slightly tone-deaf principal — are brought together in a Philadelphia public school where, despite the odds stacked against them, they are determined to help their students succeed in life. Though these incredible public servants may be outnumbered and underfunded, they love what they do — even if they don't love the school district's less-than-stellar attitude toward educating children.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/586/1467109.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/586/1467109.jpg",
    "videos": [
      {
        "id": "tvmaze:3427944",
        "title": "Birthday",
        "season": 5,
        "episode": 8,
        "released": "2025-12-10",
        "overview": "Jacob takes the lead on organizing Abbott's annual winter show; Janine celebrates her 30th birthday."
      },
      {
        "id": "tvmaze:2207064",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2021-12-07",
        "overview": "Passionate teachers -- and a slightly tone-deaf principal -- are determined to help their students succeed."
      },
      {
        "id": "tvmaze:2237736",
        "title": "Light Bulb",
        "season": 1,
        "episode": 2,
        "released": "2022-01-04",
        "overview": "Janine takes it upon herself to fix every problem when she notices a flicking light bulb in the hallway; Gregory asks Barbara for help talking to a parent, which leads him to spend his lunch period in an unexpected way."
      },
      {
        "id": "tvmaze:2237014",
        "title": "Wishlist",
        "season": 1,
        "episode": 3,
        "released": "2022-01-11",
        "overview": "The teachers to ask the local community for new school supplies; Janine encourages Gregory to decorate his classroom."
      },
      {
        "id": "tvmaze:2237015",
        "title": "New Tech",
        "season": 1,
        "episode": 4,
        "released": "2022-01-18",
        "overview": "When a new computer program is introduced at Abbott, Janine is excited to finally help Barbara with something; Barbara is reluctant to accept change and finds herself in a tricky situation; Melissa surprises Jacob."
      },
      {
        "id": "tvmaze:2252040",
        "title": "Student Transfer",
        "season": 1,
        "episode": 5,
        "released": "2022-01-25",
        "overview": "After a negative teacher review, Janine gets a confidence boost when a student gets transferred from Melissa's class into hers; Jacob tries to forge a friendship with an uninterested Gregory."
      },
      {
        "id": "tvmaze:2256099",
        "title": "Gifted Program",
        "season": 1,
        "episode": 6,
        "released": "2022-02-01",
        "overview": "Janine convinces Ava to start a gifted program at Abbott led by Jacob; Barbara pushes a hesitant Melissa to start dating again."
      },
      {
        "id": "tvmaze:2261623",
        "title": "Art Teacher",
        "season": 1,
        "episode": 7,
        "released": "2022-02-08",
        "overview": "Janine is thrilled when her best friend from college is hired as the art teacher; Jacob and Barbara decide to start a school garden."
      },
      {
        "id": "tvmaze:2266827",
        "title": "Work Family",
        "season": 1,
        "episode": 8,
        "released": "2022-02-15",
        "overview": "After Jacob reveals a detail about his personal life, Janine realizes she doesn't know the other teachers as well as she thought; Gregory's stern teaching approach is causing his whole class to underperform."
      },
      {
        "id": "tvmaze:2267386",
        "title": "Step Class",
        "season": 1,
        "episode": 9,
        "released": "2022-02-22",
        "overview": "Ava asks Janine to help her teach the after-school step class, but they don't agree on how to run the program; Gregory must reveal a secret when Barbara, Melissa and Jacob plan a pizza \"eat-off.\""
      },
      {
        "id": "tvmaze:2283546",
        "title": "Open House",
        "season": 1,
        "episode": 10,
        "released": "2022-03-22",
        "overview": "Janine prepares to meet her struggling student's mother during open house, while the rest of the faculty uses the time to relax; Gregory is taken aback when he learns how Ava got the principal job; Barbara's daughter's visit creates a commotion."
      },
      {
        "id": "tvmaze:2293209",
        "title": "Desking",
        "season": 1,
        "episode": 11,
        "released": "2022-03-29",
        "overview": "When the students start participating in a new online trend that causes disruption to the school, the teachers band together to put an end to it; Mr. Johnson provides comforting life advice to Gregory; the teachers finally meet Jacob's boyfriend."
      },
      {
        "id": "tvmaze:2297664",
        "title": "Ava vs. Superintendent",
        "season": 1,
        "episode": 12,
        "released": "2022-04-05",
        "overview": "With the school board threatening to pull their funds, Janine and Gregory decide to help Ava out with her presentation; their plan is derailed when a curveball is thrown at Ava; Barbara offends Melissa when she doesn't agree with her blackmail idea."
      },
      {
        "id": "tvmaze:2301331",
        "title": "Zoo Balloon",
        "season": 1,
        "episode": 13,
        "released": "2022-04-12",
        "overview": "While on Abbott's annual zoo field trip, Tariq reveals that he has been offered a job in New York; Janine struggles with a big choice; Barbara starts questioning her future after finding out her favorite tuatara has been retired because of old age."
      },
      {
        "id": "tvmaze:2348028",
        "title": "Development Day",
        "season": 2,
        "episode": 1,
        "released": "2022-09-21",
        "overview": "The teachers are back for development week, a time to prepare for the upcoming year; Janine is determined to start the year off right and leave her problems at home; Ava runs a side hustle out of the school parking lot."
      },
      {
        "id": "tvmaze:2371538",
        "title": "Wrong Delivery",
        "season": 2,
        "episode": 2,
        "released": "2022-09-28",
        "overview": "Janine is determined to make Abbott Elementary look just as good as a new charter school; Gregory goes out of his way to avoid Barbara; Ava hosts an event to help decide what to do with the rest of the funds from the grant."
      },
      {
        "id": "tvmaze:2371539",
        "title": "Story Samurai",
        "season": 2,
        "episode": 3,
        "released": "2022-10-05",
        "overview": "A traveling storytelling troupe Jacob used to be in visits Abbott Elementary for a day of education and entertainment; Melissa struggles with the new normal of her combined second and third grade class."
      },
      {
        "id": "tvmaze:2371540",
        "title": "The Principal's Office",
        "season": 2,
        "episode": 4,
        "released": "2022-10-12",
        "overview": "After Gregory sends a disruptive student to the principal's office, he discovers the kids actually enjoy spending supposed disciplinary time with Ava; Melissa invites Janine over to her house to teach her how to cook."
      },
      {
        "id": "tvmaze:2371541",
        "title": "Juice",
        "season": 2,
        "episode": 5,
        "released": "2022-10-19",
        "overview": "Janine is thrilled to help introduce a new beverage to the cafeteria, but it ends up causing unexpected consequences; Melissa clashes with her new aide, Ashley, who brings more disruption than help to the classroom."
      },
      {
        "id": "tvmaze:2371542",
        "title": "Candy Zombies",
        "season": 2,
        "episode": 6,
        "released": "2022-10-26",
        "overview": "A student steals a bag of Halloween candy meant to be given out to the kids at the end of the day and starts distributing it during school hours; Janine is invited to a Halloween party by an old friend and starts to reconsider her personal life."
      },
      {
        "id": "tvmaze:2373257",
        "title": "Attack Ad",
        "season": 2,
        "episode": 7,
        "released": "2022-11-02",
        "overview": "The teachers are appalled after seeing a commercial in support of charter schools criticizing Abbott Elementary; Janine and Gregory talk about Janine's relationship with Tariq."
      },
      {
        "id": "tvmaze:2373258",
        "title": "Egg Drop",
        "season": 2,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "When the eighth grade science class participates in an egg drop activity, Janine insists her second grade class join in; Barbara is shocked at the clothing one of her student's parents wears."
      },
      {
        "id": "tvmaze:2373259",
        "title": "Sick Day",
        "season": 2,
        "episode": 9,
        "released": "2022-11-30",
        "overview": "Janine is out sick for the day, so Ava grows desperate and must step in to help out; Barbara and Melissa revel in the quieter-than-normal teacher's lounge."
      },
      {
        "id": "tvmaze:2373260",
        "title": "Holiday Hookah",
        "season": 2,
        "episode": 10,
        "released": "2022-12-07",
        "overview": "Janine is convinced by a friend to go to a popular hookah club where she runs into unexpected colleagues; Jacob crashes Barbara and Melissa's traditional holiday dinner and in the process begins to learn the true meaning of Christmas."
      },
      {
        "id": "tvmaze:2392016",
        "title": "Read-A-Thon",
        "season": 2,
        "episode": 11,
        "released": "2023-01-04",
        "overview": "The competition heats up between Melissa and Janine as their classes go head-to-head in a read-a-thon sponsored by a local pizza shop; Jacob and Gregory join forces and attempt to get their student-podcasting club off the ground."
      },
      {
        "id": "tvmaze:2392017",
        "title": "Fight",
        "season": 2,
        "episode": 12,
        "released": "2023-01-11",
        "overview": "Two of Janine's students aren't getting along, leading her to seek advice from her colleagues on how to help repair their friendship; Melissa and Ava plot to bring down Mr. Johnson in fantasy football."
      },
      {
        "id": "tvmaze:2392018",
        "title": "Fundraiser",
        "season": 2,
        "episode": 13,
        "released": "2023-01-18",
        "overview": "Barbara organizes a candy-selling fundraiser to raise money for a school field trip to the science museum; when sales don't go as planned, Ava steps in to teach the students new, unconventional selling tactics."
      },
      {
        "id": "tvmaze:2475808",
        "title": "Valentine's Day",
        "season": 2,
        "episode": 14,
        "released": "2023-02-08",
        "overview": "The Abbott teachers discuss their relationships and plans for Valentine's Day; Janine finds out one of her students has a crush on her; Ava sits in on Jacob's Black History class after receiving a complaint."
      },
      {
        "id": "tvmaze:2479241",
        "title": "Fire",
        "season": 2,
        "episode": 15,
        "released": "2023-02-15",
        "overview": "Barbara's candle accidentally starts a small fire in the teacher's lounge, and a counselor suggests that she might not be handling the aftermath well; Melissa rekindles her childhood dream of being a firefighter."
      },
      {
        "id": "tvmaze:2484066",
        "title": "Teacher's Conference",
        "season": 2,
        "episode": 16,
        "released": "2023-02-22",
        "overview": "Staff members head to the Pennsylvania Educational Conference; Gregory reluctantly attends after a disagreement with Amber; Jacob finds himself charmed by the Addington teachers."
      },
      {
        "id": "tvmaze:2487728",
        "title": "Mural Arts",
        "season": 2,
        "episode": 17,
        "released": "2023-03-01",
        "overview": "Jacob secures a visit from a mural arts program for his students; Barbara and Melissa learn parents are petitioning to turn Abbott into a charter school."
      },
      {
        "id": "tvmaze:2491564",
        "title": "Teacher Appreciation",
        "season": 2,
        "episode": 18,
        "released": "2023-03-08",
        "overview": "On Teacher Appreciation Day, the district gives Abbott two courtside tickets to a 76ers game and the teachers must decide who deserves them; Janine invites the teachers to her house for game night and her sister, Ayesha, comes to visit."
      },
      {
        "id": "tvmaze:2492741",
        "title": "Festival",
        "season": 2,
        "episode": 19,
        "released": "2023-03-15",
        "overview": "Abbott Elementary rallies together to fight the threat from Legendary Charter Schools; Ava pitches a festival to draw parents to school and collect their signatures for a petition, but Draemond shows up with the intention of derailing the event."
      },
      {
        "id": "tvmaze:2506931",
        "title": "Educator of the Year",
        "season": 2,
        "episode": 20,
        "released": "2023-04-05",
        "overview": "Gregory is named Educator of the Year; Janine deals with a difficult student; it is revealed that Barbara hasn't completed her teaching requirements."
      },
      {
        "id": "tvmaze:2510117",
        "title": "Mom",
        "season": 2,
        "episode": 21,
        "released": "2023-04-12",
        "overview": "Janine's plan for a Memorial Day weekend solo trip is derailed when her mother shows up unannounced asking for help; Gregory notices his colleagues are great at small talk and realizes he needs to brush up on his people skills."
      },
      {
        "id": "tvmaze:2510546",
        "title": "Franklin Institute",
        "season": 2,
        "episode": 22,
        "released": "2023-04-19",
        "overview": "Abbott Elementary takes a field trip to the Franklin Institute; Gregory is eager to spend time with a reluctant Janine; Ava teaches the students about aliens, which leads to chaos."
      },
      {
        "id": "tvmaze:2689295",
        "title": "Career Day Part 1",
        "season": 3,
        "episode": 1,
        "released": "2024-02-07",
        "overview": "Janine plans a district-wide initiative -- Career Day -- and is anxious for it to be a success; Ava has a new approach to her job; Melissa is asked a surprising question."
      },
      {
        "id": "tvmaze:2744898",
        "title": "Career Day Part 2",
        "season": 3,
        "episode": 2,
        "released": "2024-02-07",
        "overview": "Janine plans a district-wide initiative -- Career Day -- and is anxious for it to be a success; Ava has a new approach to her job; Melissa is asked a surprising question."
      },
      {
        "id": "tvmaze:2751771",
        "title": "Gregory's Garden Goofballs",
        "season": 3,
        "episode": 3,
        "released": "2024-02-14",
        "overview": "Gregory is hesitant when kids start hanging out in his classroom at lunch, looking to him for advice; Barbara is shocked to find Tariq is dating the mother of one of her students; Janine and Jacob try to hire an ASL interpreter."
      },
      {
        "id": "tvmaze:2761248",
        "title": "Smoking",
        "season": 3,
        "episode": 4,
        "released": "2024-02-21",
        "overview": "After a student is caught smoking, the staff come together to revamp the outdated drug policy; Janine tries to prep the new substitute teacher for her class, but finds it challenging to give up her former role."
      },
      {
        "id": "tvmaze:2765922",
        "title": "Breakup",
        "season": 3,
        "episode": 5,
        "released": "2024-02-28",
        "overview": "When Barbara's church choir uses the gym for rehearsals, Ava notices tension in the group; Jacob's eagerness for a full social calendar worries Gregory; Melissa and Janine investigate a new substitute."
      },
      {
        "id": "tvmaze:2767859",
        "title": "Willard R. Abbott",
        "season": 3,
        "episode": 6,
        "released": "2024-03-10",
        "overview": "Abbott Elementary is deemed a Philadelphia historical landmark, much to Ava and Janine's delight; the school plans a celebration in honor of its namesake, but not everything goes as planned."
      },
      {
        "id": "tvmaze:2767860",
        "title": "Librarian",
        "season": 3,
        "episode": 7,
        "released": "2024-03-13",
        "overview": "Janine spearheads a pilot program that brings a librarian to Abbott; Melissa and Jacob deal with some big changes at home."
      },
      {
        "id": "tvmaze:2767861",
        "title": "Panel",
        "season": 3,
        "episode": 8,
        "released": "2024-03-20",
        "overview": "Ava and Gregory are invited to speak on a panel about public schools, while the other teachers must complete CPR training; Janine faces challenges securing district approval for her librarian extension program."
      },
      {
        "id": "tvmaze:2783642",
        "title": "Alex",
        "season": 3,
        "episode": 9,
        "released": "2024-04-10",
        "overview": "Jacob is shocked when he finds out his colleagues are not invested in his frequent email messages and haven't even been writing their own replies; Gregory turns to Janine for help with a former student."
      },
      {
        "id": "tvmaze:2783643",
        "title": "2 Ava 2 Fest",
        "season": 3,
        "episode": 10,
        "released": "2024-04-17",
        "overview": "Ava Fest is back, and with the help of the teachers, Ava's set on outdoing last year by any means necessary; after Janine accepts the offer for a full-time position at the district, she just has to check off one last thing to make it official."
      },
      {
        "id": "tvmaze:2783644",
        "title": "Double Date",
        "season": 3,
        "episode": 11,
        "released": "2024-05-01",
        "overview": "Two teachers head out on a double date, but when they run into familiar bar patrons, it proves to be an unfortunate distraction; at Ava's first book club meeting, the group ends up in a debate over who would be the best post-apocalyptic leader."
      },
      {
        "id": "tvmaze:2783721",
        "title": "Mother's Day",
        "season": 3,
        "episode": 12,
        "released": "2024-05-08",
        "overview": "Barbara invites Gregory to her family's Mother's Day brunch; Jacob scrambles to figure out how to organize a school field trip."
      },
      {
        "id": "tvmaze:2810507",
        "title": "Smith Playground",
        "season": 3,
        "episode": 13,
        "released": "2024-05-15",
        "overview": "Jacob manages to pull off a school-wide field trip to the park, but when Abbott must share the playground, the fun and games turn competitive; Mr. Johnson enjoys having an empty school to himself."
      },
      {
        "id": "tvmaze:2810508",
        "title": "Party",
        "season": 3,
        "episode": 14,
        "released": "2024-05-22",
        "overview": "Ahead of summer vacation, Janine throws the perfect end-of-year party for her colleagues and friends, taking all their interests into consideration."
      },
      {
        "id": "tvmaze:2939781",
        "title": "Back to School",
        "season": 4,
        "episode": 1,
        "released": "2024-10-09",
        "overview": "The neighboring construction site of a new golf course causes issues at Abbott, forcing the teachers to find creative solutions; an HR representative visits the school; following their kiss, Janine and Gregory's relationship status is revealed."
      },
      {
        "id": "tvmaze:3009191",
        "title": "Ringworm",
        "season": 4,
        "episode": 2,
        "released": "2024-10-16",
        "overview": "When it's revealed that a student in Jacob's class has ringworm, the faculty must band together to stop it from spreading through the entire school."
      },
      {
        "id": "tvmaze:3010075",
        "title": "Class Pet",
        "season": 4,
        "episode": 3,
        "released": "2024-10-23",
        "overview": "Janine gets a budget for class pets, but Melissa is resistant to taking on the added work and responsibility for her room's guinea pig; an IT rep from the school district arrives to set up new computers."
      },
      {
        "id": "tvmaze:3010076",
        "title": "Costume Contest",
        "season": 4,
        "episode": 4,
        "released": "2024-10-30",
        "overview": "It's Halloween at Abbott Elementary and Janine and Gregory proudly show off their couple's costume, but it fails to translate; Barbara faces pushback from parents concerned about hygiene and her beloved apple-bobbing tradition."
      },
      {
        "id": "tvmaze:3024955",
        "title": "Dad Fight",
        "season": 4,
        "episode": 5,
        "released": "2024-11-06",
        "overview": "Gregory forms a bond with one of his students, but the student's dad becomes jealous of their relationship and seeks a confrontation; Melissa suffers a fall but avoids receiving medical attention for the injury."
      },
      {
        "id": "tvmaze:3034813",
        "title": "The Deli",
        "season": 4,
        "episode": 6,
        "released": "2024-11-13",
        "overview": "When the neighborhood deli is forced to close to make room for a trendy smoothie place, Melissa, Barbara and Jacob team up to fight the gentrification; the district asks Ava to give a presentation to fellow principals."
      },
      {
        "id": "tvmaze:3041829",
        "title": "Winter Show",
        "season": 4,
        "episode": 7,
        "released": "2024-12-04",
        "overview": "Despite a few setbacks, Barbara is determined to make Abbott Elementary's first-ever holiday show a success; Jacob's brother arrives for his visit earlier than planned."
      },
      {
        "id": "tvmaze:3041830",
        "title": "Winter Break",
        "season": 4,
        "episode": 8,
        "released": "2024-12-04",
        "overview": "Melissa hosts the Schemmenti family Christmas Eve dinner and goes to great lengths to make sure everything is perfect; Janine and Gregory get an unexpected guest."
      },
      {
        "id": "tvmaze:3049930",
        "title": "Volunteers",
        "season": 4,
        "episode": 9,
        "released": "2025-01-08",
        "overview": "Ava announces the school district is sending a group of volunteers to help out at Abbott; however, when they arrive, things don't go as planned."
      },
      {
        "id": "tvmaze:3087534",
        "title": "Testing",
        "season": 4,
        "episode": 10,
        "released": "2025-01-15",
        "overview": "Janine must rethink her lesson plans after her class performs poorly on a practice test; Jacob struggles to engage a disinterested student; the district sends a new custodian to train under Mr. Johnson."
      },
      {
        "id": "tvmaze:3087535",
        "title": "Strike",
        "season": 4,
        "episode": 11,
        "released": "2025-01-22",
        "overview": "When city buses stop running due to a strike, resulting in many students being absent from school, the teachers at Abbott try to find creative solutions and adapt to hybrid learning; Gregory and O'Shon strike up a friendship."
      },
      {
        "id": "tvmaze:3087536",
        "title": "Girard Creek",
        "season": 4,
        "episode": 12,
        "released": "2025-01-29",
        "overview": "The Abbott Elementary students and staff are invited to a special grand opening preview of the Girard Creek Golf Club."
      },
      {
        "id": "tvmaze:3087537",
        "title": "Science Fair",
        "season": 4,
        "episode": 13,
        "released": "2025-02-05",
        "overview": "While supervising the kids making their science fair projects, the teachers' competitive sides come out."
      },
      {
        "id": "tvmaze:3087538",
        "title": "District Budget Meeting",
        "season": 4,
        "episode": 14,
        "released": "2025-02-12",
        "overview": "Ava and the Abbott teachers plan for the annual school district budget meeting; Janine and Gregory prepare for Valentine's Day as a couple."
      },
      {
        "id": "tvmaze:3087539",
        "title": "100th Day of School",
        "season": 4,
        "episode": 15,
        "released": "2025-02-26",
        "overview": "During Abbott's 100th day of school celebrations, Barbara receives a surprise from her daughter; Jacob and Mr. Johnson join forces to conduct a search party."
      },
      {
        "id": "tvmaze:3135690",
        "title": "Books",
        "season": 4,
        "episode": 16,
        "released": "2025-03-05",
        "overview": "A debate over a controversial book leads Ava to remove it from the library, but some parents push for its return."
      },
      {
        "id": "tvmaze:3144746",
        "title": "Karaoke",
        "season": 4,
        "episode": 17,
        "released": "2025-03-12",
        "overview": "When the teachers hit a karaoke bar for a night of fun, Jacob bumps into an old friend."
      },
      {
        "id": "tvmaze:3154410",
        "title": "Audit",
        "season": 4,
        "episode": 18,
        "released": "2025-03-19",
        "overview": "Ava and the teachers must band together to hide the golf-course contraband."
      },
      {
        "id": "tvmaze:3154411",
        "title": "Music Class",
        "season": 4,
        "episode": 19,
        "released": "2025-03-26",
        "overview": "Barbara and Gregory are in over their heads when they find themselves in new roles at Abbott Elementary."
      },
      {
        "id": "tvmaze:3154412",
        "title": "Ava Fest: Tokyo Drift",
        "season": 4,
        "episode": 20,
        "released": "2025-04-02",
        "overview": "The Abbott teachers turn their open house into a car wash to help raise money for the school."
      },
      {
        "id": "tvmaze:3165914",
        "title": "Rally",
        "season": 4,
        "episode": 21,
        "released": "2025-04-09",
        "overview": "Ava and the Abbott teachers go to the district to plead for Ava's job back; Gregory handles duties as interim principal."
      },
      {
        "id": "tvmaze:3165915",
        "title": "Please Touch Museum",
        "season": 4,
        "episode": 22,
        "released": "2025-04-16",
        "overview": "Abbott Elementary goes on a schoolwide field trip to the Please Touch Museum, which has some of the older kids skeptical."
      },
      {
        "id": "tvmaze:3305507",
        "title": "Team Building",
        "season": 5,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "The teachers prepare for the upcoming school year with new faces and big changes on the horizon."
      },
      {
        "id": "tvmaze:3364392",
        "title": "Cheating",
        "season": 5,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "Melissa tries to outsmart her students; Tariq causes chaos in Janine's class; a new guidance counselor joins the school."
      },
      {
        "id": "tvmaze:3368363",
        "title": "Ballgame",
        "season": 5,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "The Abbott crew heads to the ballpark for Teachers' Appreciation Night at the Philadelphia Phillies game."
      },
      {
        "id": "tvmaze:3383306",
        "title": "Game Night",
        "season": 5,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "Gregory steps in to host game night at his apartment; Mr. Johnson, Ava, Barbara and Melissa head to the DMV to renew their licenses."
      },
      {
        "id": "tvmaze:3383307",
        "title": "Camping",
        "season": 5,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "Barbara organizes a Halloween camping trip for older kids."
      },
      {
        "id": "tvmaze:3399711",
        "title": "No Phones",
        "season": 5,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "Abbott Elementary participates in the district's No Phones Day initiative."
      },
      {
        "id": "tvmaze:3399885",
        "title": "Goofgirl",
        "season": 5,
        "episode": 7,
        "released": "2025-12-03",
        "overview": "A new member joins Gregory's Garden Goofballs; Janine pitches a new club idea to Ava."
      },
      {
        "id": "tvmaze:3427944",
        "title": "Birthday",
        "season": 5,
        "episode": 8,
        "released": "2025-12-10",
        "overview": "Jacob takes the lead on organizing Abbott's annual winter show; Janine celebrates her 30th birthday."
      },
      {
        "id": "tvmaze:3427945",
        "title": "Mall",
        "season": 5,
        "episode": 9,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3427946",
        "title": "Mall Part 2: Questions & Concerns",
        "season": 5,
        "episode": 10,
        "released": "2026-01-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3448775",
        "title": "TBA",
        "season": 5,
        "episode": 11,
        "released": "2026-01-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3451996",
        "title": "TBA",
        "season": 5,
        "episode": 12,
        "released": "2026-01-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3451997",
        "title": "TBA",
        "season": 5,
        "episode": 13,
        "released": "2026-02-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3451998",
        "title": "TBA",
        "season": 5,
        "episode": 14,
        "released": "2026-02-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3451999",
        "title": "TBA",
        "season": 5,
        "episode": 15,
        "released": "2026-02-18",
        "overview": ""
      }
    ]
  }
}