{
  "meta": {
    "id": "tvmaze:2091",
    "type": "series",
    "name": "When Calls the Heart",
    "description": "When Calls the Heart is inspired by Janette Oke's bestselling book series about the Canadian West, the series tells the captivating story of Elizabeth Thatcher, a young teacher accustomed to her high society life, who receives her first classroom assignment in Coal Valley, a small coal mining town where life is simple, but often fraught with challenges. Upon arrival, Elizabeth befriends Abigail Stanton, a wife and mother whose husband, the foreman of the mine, along with a dozen other miners, has just been killed in an explosion. The newly widowed women find their faith is tested when they must go to work in the mines to keep a roof over their heads. Set against the wild canvas of a 19th century coal town, Elizabeth will have to learn the ways of the frontier if she wishes to thrive in the rural west on her own.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373564.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373564.jpg",
    "videos": [
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:165681",
        "title": "Lost and Found",
        "season": 1,
        "episode": 1,
        "released": "2014-01-11",
        "overview": "Coal Valley is at odds when a special message is found at the site of a fatal coal mining accident."
      },
      {
        "id": "tvmaze:165682",
        "title": "Cease and Desist",
        "season": 1,
        "episode": 2,
        "released": "2014-01-18",
        "overview": "The Pacific Northwest Mining Company threatens to evict the widows of Coal Valley unless they pick up where their husbands left off."
      },
      {
        "id": "tvmaze:165683",
        "title": "A Telling Silence",
        "season": 1,
        "episode": 3,
        "released": "2014-01-25",
        "overview": "Coal Valley comes together when a young grieving girl, who lost her father in the fatal mining accident, goes missing."
      },
      {
        "id": "tvmaze:165684",
        "title": "Secrets and Lies",
        "season": 1,
        "episode": 4,
        "released": "2014-02-01",
        "overview": "After discovering new evidence, Jack investigates a surprising suspect in the church arson case."
      },
      {
        "id": "tvmaze:165685",
        "title": "The Dance",
        "season": 1,
        "episode": 5,
        "released": "2014-02-08",
        "overview": "When a group of new male miners comes to Coal Valley, many of the town's women get caught up in the prospect of the single men. Before long, Jack acts jealous when one of the men takes an interest in Elizabeth."
      },
      {
        "id": "tvmaze:165686",
        "title": "These Games",
        "season": 1,
        "episode": 6,
        "released": "2014-02-15",
        "overview": "Elizabeth is feeling caught between overprotective Jack and new miner Billy Hamilton. When Jack tells her he has proof Billy lied to her, Elizabeth has had enough. Abigail, sensing Jack's feelings for Elizabeth go beyond his protective duties as Coal Valley's Constable, suggests Jack try a gentler approach to reach her."
      },
      {
        "id": "tvmaze:165687",
        "title": "Second Chances",
        "season": 1,
        "episode": 7,
        "released": "2014-02-22",
        "overview": "Abigail is encouraged to re-open Coal Valley's dilapidated and abandoned cafe and make it her own after Elizabeth raves about Abigail's baking. Meanwhile, Jack and Elizabeth are at odds after Elizabeth's brief romance with a dishonest miner, which has left her pride hurt, and Jack accidentally insults her as he fumbles to confess his growing feelings."
      },
      {
        "id": "tvmaze:165688",
        "title": "Perils of the Soloists",
        "season": 1,
        "episode": 8,
        "released": "2014-03-01",
        "overview": "Elizabeth and Abigail emotionally move out of the row house and into the rooms above Abigail's cafe, starting a new chapter and leaving many memories behind. Elizabeth learns that she and her students must put on the Coal Valley Founders' Day play. While rehearsals begin, Jack surprises Elizabeth with some special talents, and has an even bigger gesture in mind to help her more than she could have ever hoped."
      },
      {
        "id": "tvmaze:165689",
        "title": "Change of Heart",
        "season": 1,
        "episode": 9,
        "released": "2014-03-08",
        "overview": "A determined Jack properly asks Elizabeth for a dinner date, finally making his romantic intentions clear. Elizabeth is excited, and is in for another very special surprise—an unexpected visit from her younger sister, Julie. Elizabeth hesitates to make a fuss about her date with Jack, but can't help but be swept away when he surprises her with a very romantic evening at the café, with a little help from Abigail."
      },
      {
        "id": "tvmaze:165690",
        "title": "Love Comes First",
        "season": 1,
        "episode": 10,
        "released": "2014-03-15",
        "overview": "Saying goodbye to Jack has left Elizabeth heartbroken, but she tries to stay strong in front of her class. Meanwhile, wanting to continue the investigation she started with Jack, Abigail tries to outwit Henry Gowen by stealing a file from his office that could hold the clues to the cause of the mine explosion."
      },
      {
        "id": "tvmaze:165691",
        "title": "Rules of Engagement",
        "season": 1,
        "episode": 11,
        "released": "2014-03-22",
        "overview": "Jack is hailed a hero after putting away the Tolliver outlaws, and has decided to come back to Coal Valley for good. But his return to town — and to Elizabeth — is unexpectedly complicated by the arrival of gorgeous big-city actress. Meanwhile, Jack has asked Mountie forensic investigator and friend Bill Avery to help Abigail make a case against Gowen and the Pacific Northwest Mining Company regarding the mine explosion."
      },
      {
        "id": "tvmaze:165692",
        "title": "Prelude to a Kiss",
        "season": 1,
        "episode": 12,
        "released": "2014-03-29",
        "overview": "Abigail is beginning to let go of her grief and look toward the future with forensic investigator Bill Avery. Meanwhile, a hurt and confused Jack confronts Elizabeth about her new job offer back home. Visiting Circuit Judge, Jedidiah Black a legendary man who is insolent, insufferable and incorruptible will finally bring justice to Coal Valley after the repercussions of the mine explosion, just as Elizabeth and Jack take an important step in their relationship."
      },
      {
        "id": "tvmaze:165693",
        "title": "Trials of the Heart",
        "season": 2,
        "episode": 1,
        "released": "2015-04-25",
        "overview": "Coal Valley's trial gets underway in the town with a new Judge presiding over it. Elizabeth gets unsettling news from Hamilton regarding her family, and must return. Abigail's case is presided over by an unlikely prosecutor. Elizabeth's family meets, Jack.The trial's verdict is rendered by the Judge, which effects the whole town. Elizabeth readjusts to family life in Hamilton. Abigail is reunited with a family member. Jack has to reevaluate his importance in Elizabeth's life. A new man comes to town with a prospect that can change the townspeople's entire future."
      },
      {
        "id": "tvmaze:165694",
        "title": "Heart and Soul",
        "season": 2,
        "episode": 2,
        "released": "2015-05-02",
        "overview": "Rosemary makes herself useful at Abigail's Cafe. Jack and the townspeople work on building the new church to become the school. Elizabeth gets reacquainted with her old life away from Coal Valley. One of the widows gets proposed to and the wedding brings the townspeople closer together. Abigail receives troubling information about Bill Avery."
      },
      {
        "id": "tvmaze:165695",
        "title": "Heart's Desire",
        "season": 2,
        "episode": 3,
        "released": "2015-05-16",
        "overview": "Abigail travels to Hamilton to stay with Elizabeth's family and is compelled to accept Bill's help on a personal matter. A heroic act by Jack brings him closer to his ex-fiancée, Rosemary. Elizabeth returns to Hope Valley and she and Jack come together to consider what the future holds."
      },
      {
        "id": "tvmaze:165696",
        "title": "Awakenings and Revelations",
        "season": 2,
        "episode": 4,
        "released": "2015-05-23",
        "overview": "When a visitor from home arrives in Hope Valley, Elizabeth begins to question the direction of her heart and feelings for Jack. As Abigail struggles with how to help her daughter-in-law, Bill delves deeper into an undercover investigation."
      },
      {
        "id": "tvmaze:165697",
        "title": "Heart and Home",
        "season": 2,
        "episode": 5,
        "released": "2015-05-30",
        "overview": "Elizabeth and Jack receive upsetting news from their families in Hamilton that could tear them apart. Meanwhile, Abigail tries to find forgiveness in her heart for Bill as Lee enlists Rosemary's help to fight Gowen and keep Hope Valley from falling apart."
      },
      {
        "id": "tvmaze:165698",
        "title": "Coming Together, Coming Apart",
        "season": 2,
        "episode": 6,
        "released": "2015-06-06",
        "overview": "Jack and Elizabeth don't see eye to eye on everything in Hamilton. They discover that their relationship is not as straightforward as they originally thought. Elizabeth's family puts a strain on Jack, and it takes all of Jack's skills as a constable to resolve the conflict. Bill sorts out a relationship from his past, so that he can move forward with the future. Gowen's grasp on the town is threatened by a powerful member of the town. It all comes down to the luck of the draw."
      },
      {
        "id": "tvmaze:165699",
        "title": "With All My Heart",
        "season": 2,
        "episode": 7,
        "released": "2015-06-13",
        "overview": "Abigail develops a friendship with the new Pastor of the town. Elizabeth and Jack are forced to re-examine the future of their relationship under extreme circumstances. Rosemary questions her true feelings about one of the town members. Gowen gets backed into a corner by his local rival.Elizabeth and Jack discover that true love is more than just societal positions and external influences. After a harrowing ordeal Jack and Elizabeth are brought closer together. Rosemary realizes when you find a good man you don't let him get away. Gowen and his rival sharpen their knives and prepare for a battle for power over the town. Bill's shady dealings catch up with him, putting his freedom and reputation at stake. Elizabeth has to make a choice between a life on the frontier or a life of luxury in Hamilton."
      },
      {
        "id": "tvmaze:553683",
        "title": "Troubled Hearts",
        "season": 3,
        "episode": 1,
        "released": "2016-02-21",
        "overview": "Elizabeth acquires her own home, which is a surprise to Jack. Elsewhere, Gowen's selfish plot is unearthed by Abigail; and Frank realizes he can no longer outrun his past."
      },
      {
        "id": "tvmaze:558115",
        "title": "A Time to Speak",
        "season": 3,
        "episode": 2,
        "released": "2016-02-28",
        "overview": "The townsfolk turn on Frank when they learn he's a fugitive, but Abigail tries to help him by reminding them that a person can change."
      },
      {
        "id": "tvmaze:597714",
        "title": "Heart of a Hero",
        "season": 3,
        "episode": 3,
        "released": "2016-03-06",
        "overview": "As Abigail and Frank pursue a fledgling romance, his old gang of outlaws resort to violence in an attempt to bring him back into the fold in order to do a new job. Meanwhile, an old, attractive friend of Jack's arrives in Hope Valley to help take care of Lee following an accident at the mill; resulting in Elizabeth getting jealous of their friendship."
      },
      {
        "id": "tvmaze:599206",
        "title": "A Gentle Heart",
        "season": 3,
        "episode": 4,
        "released": "2016-03-13",
        "overview": "As Elizabeth struggles to start her writing about her life in Hope Valley, she is also starting to become jealous of Jack's budding friendship with Faith. Abigail aids Pastor Frank in helping nearby settlers who are down on their luck. Meanwhile, following his injury, Lee has to deal with Rosemary's overbearing protectiveness and trying to figure out who is sabotaging his lumber business."
      },
      {
        "id": "tvmaze:599208",
        "title": "Forever in My Heart",
        "season": 3,
        "episode": 5,
        "released": "2016-03-20",
        "overview": "Jack and Bill Avery help Lee investigate who might be sabotaging his business, with the mayor near the top of their list of suspects. Jack start thinking of his future with Elizabeth, and as a result, contemplates buying some property to build a house on. Abigail opens her home to Cody's sister Becky, who's arriving back in town following her stay in the hospital. As a result, Abigail contemplates adopting the siblings. Rosemary gets excited when a movie production company comes to town, casting for a new movie. Meanwhile, Elizabeth finds ways to get her students excited about science."
      },
      {
        "id": "tvmaze:599209",
        "title": "Heartbreak",
        "season": 3,
        "episode": 6,
        "released": "2016-03-27",
        "overview": "Abigail endures anguish when the children's aunt arrives and a parting seems inevitable. However, while staying in Hope Valley in which she spends time getting to know Cody and Becky, the citizens of Hope Valley observe a powerful act of love when Charlotte realizes that what is best for them is to stay with Abigail. Rosemary receives a movie offer that causes her to contemplate leaving Hope Valley."
      },
      {
        "id": "tvmaze:639684",
        "title": "Hearts in Question",
        "season": 3,
        "episode": 7,
        "released": "2016-04-03",
        "overview": "Jack's mom visits and makes life difficult for Elizabeth. Meanwhile, Rosemary plans her dream wedding, but the weather is not cooperating with her."
      },
      {
        "id": "tvmaze:639685",
        "title": "Prayers from the Heart",
        "season": 3,
        "episode": 8,
        "released": "2016-04-10",
        "overview": "After a landslide puts one of Hope Valley's own in grave danger, the strength of a town is tested."
      },
      {
        "id": "tvmaze:1025355",
        "title": "Words from the Heart",
        "season": 4,
        "episode": 1,
        "released": "2017-02-19",
        "overview": "Abigail takes on her duties as mayor and it seems nearly everyone in Hope Valley wants her attention. The National Pacific Railroad wants to run a new route through Hope Valley but not all the residents are convinced it's in everyone's best interests and a heated debate ensues. Meanwhile, in an effort to integrate Elizabeth's new students from the settlement with the Hope Valley children, Jack suggests a friendly game of baseball, prompting he and Elizabeth to coach the two teams. When it's time to hit the field, the whole town turns out for the game and one of the new children becomes a hero thanks to Elizabeth's encouragement to overcome his fear.helps him come to terms with it as she and Jack coach the children in baseball."
      },
      {
        "id": "tvmaze:1028513",
        "title": "Heart of Truth",
        "season": 4,
        "episode": 2,
        "released": "2017-02-26",
        "overview": "After Robert tells a lie about seeing a bear outside of school, he is called a hero. However, Jack and Elizabeth suspect he isn't telling the truth and tries to get him to come clean. Abigail tries to play mediator when the residents of Hope Valley start to take sides on whether the town will benefit from the railroad coming through town. A local farmer is accused of causing problems with the railroad surveyors near his farm."
      },
      {
        "id": "tvmaze:1062197",
        "title": "The Heart of the Community",
        "season": 4,
        "episode": 3,
        "released": "2017-03-05",
        "overview": "Abigail finalizes a deal with Ray Wyatt to bring the railroad to Hope Valley and new families flock to the town with the promise of work. When word reaches the town that a notorious gang is at large and may be heading their way, Jack and Bill enlist Frank's counsel in thwarting their plan to rob the incoming stage carrying the railroad's payroll. Elizabeth takes a strong interest in new student Philip Cantrell, whose single father Shane is working overtime at the mill and has little time left over for his son. Elizabeth plans a carnival to raise much-needed money for supplies the school needs to accommodate the new students and the entire town turns out in support. Rosemary's new job at the café comes to an abrupt end but she quickly sets her sights on a new opportunity."
      },
      {
        "id": "tvmaze:1062198",
        "title": "Change of Heart",
        "season": 4,
        "episode": 4,
        "released": "2017-03-12",
        "overview": "Abigail's tenure as mayor is threatened as Gowen plots in the shadows to be reinstated. Ray Wyatt promises Elizabeth that the railroad will help the underfunded school but in a shocking turn of events, she ultimately finds her teaching position in jeopardy. Jack has a brief reunion with a younger Mountie he mentored at the Academy as he passes through town, while newcomer Carson Shepherd lands a job at the café after sustaining an injury sidelining him from railroad labor. Abigail and Frank's relationship is still in limbo but Rosemary schemes with Cody on a plan to get them back together. Not swayed after the stagecoach heist was thwarted by Bill, Jack and Frank, the Tate brothers return to Hope Valley with their sights set on carrying out a daring bank robbery."
      },
      {
        "id": "tvmaze:1062199",
        "title": "Heart of a Teacher",
        "season": 4,
        "episode": 5,
        "released": "2017-03-19",
        "overview": "With the key witness against him suddenly and mysteriously nowhere to be found, Henry Gowen reassumes his position as mayor of Hope Valley and, without warning, summarily fires Elizabeth as the school's teacher, citing a hidden scandal from her past as the cause. With the support of nearly the entire town - especially the children - and an impassioned Abigail at her side, Elizabeth travels to Cape Fullerton in hopes of resolving the false allegations against her. Certain that big money is at play in Gowen's favorable dealings with the railroad, Bill lays out a plan to find out what underhanded business is going on between Gowen and Ray Wyatt. Following days of instruction under Mr. Stoneman, the school's strict and demanding new teacher, Cody takes a stand in defense of Emily and leads the students in a walkout. When Jack delivers the Tate brothers to Mountie Headquarters, he receives bad news about a young Mountie he mentored, which weighs heavily on him."
      },
      {
        "id": "tvmaze:1062200",
        "title": "My Heart Will Go On",
        "season": 4,
        "episode": 6,
        "released": "2017-03-26",
        "overview": "Elizabeth spends her days tutoring Hope Valley's children after school while continuing to fight for her rightful job as their teacher. Abigail and Cody spearhead a letter-writing campaign for Elizabeth's reinstatement while an unexpected ally steps in on Elizabeth's behalf. Henry Gowen continues to act as the puppet of Ray Wyatt, who remains intent on controlling the town and its inhabitants. Meanwhile, Bill Avery redoubles his efforts to locate the missing witness, an accountant whose testimony could help bring Gowen to justice once and for all. Jack attends the funeral of a young Mountie who died in service and begins to question his own devotion to duty."
      },
      {
        "id": "tvmaze:1095423",
        "title": "Healing Heart",
        "season": 4,
        "episode": 7,
        "released": "2017-04-02",
        "overview": "Elizabeth has problems in her classroom when the nephews of Ray Wyatt come to her class and bully other students; Lee loses his voice and Rosemary does the talking for him; Bill finds AJ foster; Ray Wyatt opens a commissary."
      },
      {
        "id": "tvmaze:1095424",
        "title": "Courageous Hearts",
        "season": 4,
        "episode": 8,
        "released": "2017-04-09",
        "overview": "Tension between Elizabeth and her new students continues; Lee and Rosemary fight about Rosemary learning to drive; Abigail struggles to hold the cafe together while the railroad's commissary thrives."
      },
      {
        "id": "tvmaze:1095425",
        "title": "Heart of a Secret",
        "season": 4,
        "episode": 9,
        "released": "2017-04-16",
        "overview": "Elizabeth takes Opal in while her parents are away; a newcomer to Hope Valley has some insight into Carson Shepherd's mysterious past; an unlikely turn of events puts Cody in harm's way."
      },
      {
        "id": "tvmaze:1095426",
        "title": "Heart of a Fighter",
        "season": 4,
        "episode": 10,
        "released": "2017-04-23",
        "overview": "The town gathers around Abigail as Cody fights for his life; Carson comes to terms with his past and gets a chance at redemption."
      },
      {
        "id": "tvmaze:1360386",
        "title": "Believing",
        "season": 5,
        "episode": 1,
        "released": "2018-02-18",
        "overview": "Abigail leaves town to testify on behalf of Henry while Bill joins her, but will testify against him. Abigail must convince a strict judge to give Henry a second chance but it seems like the odds are against it. With Bill gone, Lee is made acting sheriff and, despite Rosemary's encouragement, isn't confident that he is up to the task. Still anxiously awaiting Jack's return from the Northern Territories, Elizabeth is given a diversion thanks to a surprise visit from her sister, Julie, who reveals to Elizabeth the surprising career path she's decided to take. Clara thinks it may be time for a break from Jesse but becomes jealous when she sees Jesse spending time with Julie. Dr. Carson is determined to stop a traveling salesman selling a tonic that has caused a stomachache epidemic in town, which leads to a surprising arrest."
      },
      {
        "id": "tvmaze:1382051",
        "title": "Hearts and Minds",
        "season": 5,
        "episode": 2,
        "released": "2018-02-25",
        "overview": "Elizabeth mentors Julie, who finds teaching more difficult than she imagined; Abigail has to find a way to convince the railroad to build its depot in Hope Valley."
      },
      {
        "id": "tvmaze:1402653",
        "title": "Home Is Where the Heart Is",
        "season": 5,
        "episode": 3,
        "released": "2018-03-04",
        "overview": "Jack returns and begins planning his future with Elizabeth; Elizabeth teaches her students the difference between facts and speculation; the town is put on edge when Lee cannot withdraw funds to pay his employees."
      },
      {
        "id": "tvmaze:1402654",
        "title": "Open Hearts",
        "season": 5,
        "episode": 4,
        "released": "2018-03-11",
        "overview": "Abigail tries to figure out how to keep the town's bank afloat; Elizabeth struggles to understand what troubles one of her young students; Rosemary goes overboard planning Jack and Elizabeth's wedding."
      },
      {
        "id": "tvmaze:1402655",
        "title": "My Heart Is Yours",
        "season": 5,
        "episode": 5,
        "released": "2018-03-18",
        "overview": "Jack and Elizabeth's plan to get married is put in serious jeopardy; Bill has difficulty transporting a prisoner."
      },
      {
        "id": "tvmaze:1402656",
        "title": "Love and Marriage",
        "season": 5,
        "episode": 6,
        "released": "2018-03-25",
        "overview": "Jack and Elizabeth's marriage is put to the test; Pastor Frank and Abigail resolve the future of their relationship; Bill helps a young girl solve a mystery."
      },
      {
        "id": "tvmaze:1420650",
        "title": "Heart of the Matter",
        "season": 5,
        "episode": 7,
        "released": "2018-04-01",
        "overview": "Elizabeth assigns her students to follow business leaders in Hope Valley for a day. Meanwhile, Abigail and the town host two possible investors for the failing bank. Bill s life is disrupted when AJ Foster arrives and turns herself in."
      },
      {
        "id": "tvmaze:1420651",
        "title": "Weather the Storm",
        "season": 5,
        "episode": 8,
        "released": "2018-04-08",
        "overview": "Bill is put in serious jeopardy while transporting AJ to face trial. Abigail tries to save the town from an investor who will hurt Hope Valley. Carson is faced with a life and death medical decision. Elizabeth tries to reunite a mother and her son."
      },
      {
        "id": "tvmaze:1420652",
        "title": "In My Dreams",
        "season": 5,
        "episode": 9,
        "released": "2018-04-15",
        "overview": "The widow of Lee's former silent partner arrives and gives Gowen a chance to run a company again, Elizabeth tutors an unexpected new student and the residents of Hope Valley conspire to pull off a surprise."
      },
      {
        "id": "tvmaze:1420653",
        "title": "Close to My Heart",
        "season": 5,
        "episode": 10,
        "released": "2018-04-22",
        "overview": "In the season 5 finale, the citizens of Hope Valley struggle to come to terms with Jack's death, and rally to give Elizabeth comfort as she grieves. Then, in spite of the darkness that everyone feels, a glimmer of hope shines through when one of the town's residents receive some surprising news."
      },
      {
        "id": "tvmaze:1583515",
        "title": "Phone Rings and Heartstrings",
        "season": 6,
        "episode": 1,
        "released": "2019-02-24",
        "overview": "After taking time off to care for her new baby, Elizabeth returns to teaching but soon realizes she needs more support than she could have imagined.  Abigail prepares for the arrival of the telephone to Hope Valley.  Bill and Gowen enter a bidding war for the town saloon. When Rosemary senses a spark between Faith and Carson, she fans the flames trying to get a romance started."
      },
      {
        "id": "tvmaze:1605251",
        "title": "The Queen of Hearts",
        "season": 6,
        "episode": 2,
        "released": "2019-03-03",
        "overview": "When Lucas, a businessman from out of town, arrives in Hope Valley, Bill investigates the mystery man with some help from a spy at the town's new switchboard. Elizabeth teaches one of her students to find his confidence. Intrigued by the stock market, Abigail solicits Gowen's investment help."
      },
      {
        "id": "tvmaze:1613408",
        "title": "A Vote of Confidence",
        "season": 6,
        "episode": 3,
        "released": "2019-03-10",
        "overview": "Bill turns to an old friend for help tracking down gunrunners responsible for the deaths of Mounties. Elizabeth helps one of her students stand up for himself, while Abigail uses her power of persuasion when Lucas becomes an uncooperative business owner.  Rosemary and Lee help Elizabeth care for her baby but a struggle weighs on the couple. Faith and Carson reevaluate their relationship."
      },
      {
        "id": "tvmaze:1616511",
        "title": "Heart of a Mountie",
        "season": 6,
        "episode": 4,
        "released": "2019-05-05",
        "overview": "When a new Mountie, Nathan Grant, comes to Hope Valley, Elizabeth confronts her memories, and Bill reluctantly teams up with him to investigate a suspicious robbery.  Rosemary buys a telephone, and Lee worries this new technology will contribute to his wife's gossipy tendencies. Meanwhile, Jesse's jealousy of Lucas reaches a boiling point."
      },
      {
        "id": "tvmaze:1617300",
        "title": "Surprise",
        "season": 6,
        "episode": 5,
        "released": "2019-05-06",
        "overview": "Elizabeth steps in to help Nathan's strong-willed niece connect with her new classmates.  Bill contemplates an interesting job offer.  Gowen makes a compelling offer of his own to Jesse and Clara.  Meanwhile, Carson and Faith grow closer."
      },
      {
        "id": "tvmaze:1617301",
        "title": "Disputing Hearts",
        "season": 6,
        "episode": 6,
        "released": "2019-05-12",
        "overview": "Elizabeth helps Nathan's niece open up to her classmates, and learns more about Nathan in the process. Rosemary debates sharing a struggle with Lee.  Carson helps Faith connect with her estranged father.  Meanwhile, Fiona trains Florence at the town switchboard, and quickly realizes she has her work cut out for her."
      },
      {
        "id": "tvmaze:1617302",
        "title": "Hope Is with the Heart",
        "season": 6,
        "episode": 7,
        "released": "2019-05-19",
        "overview": "Elizabeth receives unexpected help from Lucas in her mission to create a town library.  Jesse and Gowen continue to have conflict. Meanwhile, Bill and Nathan apprehend an infamous outlaw and Rosemary and Lee have an overdue talk."
      },
      {
        "id": "tvmaze:1617304",
        "title": "A Call from the Past",
        "season": 6,
        "episode": 8,
        "released": "2019-05-26",
        "overview": "Elizabeth faces danger when strangers come to Hope Valley to collect a debt from Lucas.  Lee's business suffers when Gowen hires his top employees away. Meanwhile, Rosemary hosts some out of town visitors, and finds that their help disturbs her otherwise peaceful domestic bliss."
      },
      {
        "id": "tvmaze:1617305",
        "title": "Two of Hearts",
        "season": 6,
        "episode": 9,
        "released": "2019-06-02",
        "overview": "Elizabeth holds a christening for baby Jack during the excitement of Founder's Day Weekend. Meanwhile, Jesse plans a surprise for Clara"
      },
      {
        "id": "tvmaze:1790187",
        "title": "A Moving Picture",
        "season": 7,
        "episode": 1,
        "released": "2020-02-23",
        "overview": "Lucas gives Elizabeth writing advice that causes her to search for new inspiration. Rosemary and Lee plan a vacation. Faith returns home with a dilemma that may force her to part ways from Carson. Gowen is interviewed for a business magazine."
      },
      {
        "id": "tvmaze:1800685",
        "title": "The Heart of a Father",
        "season": 7,
        "episode": 2,
        "released": "2020-03-01",
        "overview": "Nathan tries to protect his niece by keeping her away from her grandfather, an ex-convict, but is torn by her desire to get to know him and learn more about her late mother. Elizabeth does her best to support Nathan, including helping him host a sleepover for his niece. Bill and Lucas join forces when a rumor about food poisoning impacts their businesses. Faith considers a job opportunity that would take her out of Hope Valley, while Carson has a different career path in mind for her. Rosemary feels hurt when Clara and Elizabeth ignore her well-intentioned advice, while Jesse turns to Lee for tips on a happy marriage."
      },
      {
        "id": "tvmaze:1805126",
        "title": "Family Matters",
        "season": 7,
        "episode": 3,
        "released": "2020-03-08",
        "overview": "Elizabeth encourages Nathan to investigate his father. Lucas enjoys the first chapters of Elizabeth's novel. Clara and Jesse cross items off their wedding to-do list."
      },
      {
        "id": "tvmaze:1805127",
        "title": "Sweet and Sour",
        "season": 7,
        "episode": 4,
        "released": "2020-03-15",
        "overview": "Elizabeth, Carson and Faith deal with an outbreak of chickenpox. Faith's dedication to her job jeopardizes her future."
      },
      {
        "id": "tvmaze:1805128",
        "title": "An Unexpected Gift",
        "season": 7,
        "episode": 5,
        "released": "2020-03-22",
        "overview": "Elizabeth gets a surprise bouquet of flowers on her doorstep which has the whole town wondering who left them. Rosemary and Lee organize Jesse &amp; Clara's Bachelor and Bachelorette parties."
      },
      {
        "id": "tvmaze:1805129",
        "title": "In Perfect Unity",
        "season": 7,
        "episode": 6,
        "released": "2020-03-29",
        "overview": "Elizabeth gets the people of Hope Valley to band together as only they can to give Clara and Jesse the wedding of their dreams."
      },
      {
        "id": "tvmaze:1811963",
        "title": "Heart of a Writer",
        "season": 7,
        "episode": 7,
        "released": "2020-04-05",
        "overview": "Elizabeth goes on a trip with Lucas and must face her growing feelings for him; Jesse and Clara adjust to sharing a home; Lee and Rosemary are challenged with watching Little Jack."
      },
      {
        "id": "tvmaze:1811965",
        "title": "Into the Woods",
        "season": 7,
        "episode": 8,
        "released": "2020-04-12",
        "overview": "A dangerous windstorm puts Hope Valley at risk; Elizabeth takes half the class on a field trip while Carson is the substitute teacher for the rest; Jesse causes concern."
      },
      {
        "id": "tvmaze:1811966",
        "title": "New Possibilities",
        "season": 7,
        "episode": 9,
        "released": "2020-04-19",
        "overview": "Elizabeth and Nathan try to resolve their differences; Rosemary learns a secret about Lee; Elizabeth feels betrayed by Lucas, but helps him get the oil company's records from Gowen; Nathan goes under cover; Fiona gets bad news."
      },
      {
        "id": "tvmaze:1811967",
        "title": "Don't Go",
        "season": 7,
        "episode": 10,
        "released": "2020-04-26",
        "overview": "Elizabeth hears news about her book; Lee gets a surprise that stirs up wounds from his past; Fiona tries to find a way to stay in Hope Valley; Lucas makes a last-ditch effort to preserve his partnership in Gowen Petroleum."
      },
      {
        "id": "tvmaze:1988535",
        "title": "Open Season",
        "season": 8,
        "episode": 1,
        "released": "2021-02-21",
        "overview": "Elizabeth has finished her manuscript. An unwelcome visitor stirs up trouble for Nathan and Allie. A homesick Rosemary and Lee cut their South American trip short. Faith arrives back from medical school. Clara and Jesse haven't been getting along. Fiona has a new business venture."
      },
      {
        "id": "tvmaze:2013015",
        "title": "Honestly, Elizabeth",
        "season": 8,
        "episode": 2,
        "released": "2021-02-28",
        "overview": "Helen Bouchard starts the edits of Elizabeth's manuscript. When Lee gets injured, a newcomer's words of comfort cause Rosemary to reflect on what she wants in life."
      },
      {
        "id": "tvmaze:2030290",
        "title": "From the Ashes",
        "season": 8,
        "episode": 3,
        "released": "2021-03-07",
        "overview": "A geyser erupts at the oil rig and everyone in Hope Valley drops everything to help. Nathan is summoned for an inquiry by a Mountie from his past and Jesse takes a liking to driving Lee's motorcycle."
      },
      {
        "id": "tvmaze:2030291",
        "title": "Welcome to Hope Valley",
        "season": 8,
        "episode": 4,
        "released": "2021-03-14",
        "overview": "The inquiry begins, and Nathan starts to question his own actions. Meanwhile, the Canfields, a new family in town, buy Gowen's cabin and Elizabeth welcomes them. Lee's sister and niece arrive in Hope Valley."
      },
      {
        "id": "tvmaze:2030292",
        "title": "What the Heart Wants",
        "season": 8,
        "episode": 5,
        "released": "2021-03-21",
        "overview": "It's graduation day at the Jack Thornton School house as well time for parent-teacher conferences. Rosemary and Lee adjust to having family in town. A letter from Dottie sends all the Coulters reeling. Clara learns Jesse made a big mistake."
      },
      {
        "id": "tvmaze:2030293",
        "title": "No Regrets",
        "season": 8,
        "episode": 6,
        "released": "2021-03-28",
        "overview": "Elizabeth questions if she is truly ready to let love in again. Rosemary wonders what her purpose is. Clara and Jesse try to sort through their marital issues. Carson receives the opportunity of a lifetime. A stranger named Christopher comes to town."
      },
      {
        "id": "tvmaze:2043632",
        "title": "Before My Very Eyes",
        "season": 8,
        "episode": 7,
        "released": "2021-04-04",
        "overview": "A health scare has everyone in Hope Valley worried about one of their own. Nathan is finally going to get Allie's adoption finalized. Lucas starts to become suspicious of Christopher's behavior since arriving in Hope Valley, while Christopher decides maybe he'd like to stay."
      },
      {
        "id": "tvmaze:2043633",
        "title": "A Parade and a Charade",
        "season": 8,
        "episode": 8,
        "released": "2021-04-11",
        "overview": "Elizabeth focuses on teaching Angela how to read braille. Rosemary and Lee struggle to give Rachel the freedom she was promised in Hope Valley. Bill feels displaced when he's asked to finally return his Mountie uniform."
      },
      {
        "id": "tvmaze:2043635",
        "title": "Pre-Wedding Jitters",
        "season": 8,
        "episode": 9,
        "released": "2021-04-18",
        "overview": "Elizabeth is distraught over the reveal of Nathan's secret; everyone helps a couple prepare for their wedding; the bachelor and bachelorette parties stir up mixed emotions from the guests; a mysterious businessman arrives in town."
      },
      {
        "id": "tvmaze:2043636",
        "title": "Old Love, New Love, Is This True Love",
        "season": 8,
        "episode": 10,
        "released": "2021-04-25",
        "overview": "Florence and Ned's wedding leads every couple in Hope Valley to evaluate their relationships. Rosemary realizes there is more happening in Hope Valley than everyone realizes and decides to get to the bottom of it."
      },
      {
        "id": "tvmaze:2043638",
        "title": "Changing Times",
        "season": 8,
        "episode": 11,
        "released": "2021-05-02",
        "overview": "Landis, the school inspector, arrives in town and causes trouble for Elizabeth; Rosemary finds her calling; a search is called when one of Hope Valley's residents is lost; Carson and Faith's relationship is put to the test."
      },
      {
        "id": "tvmaze:2043640",
        "title": "The Kiss",
        "season": 8,
        "episode": 12,
        "released": "2021-05-09",
        "overview": "Elizabeth finally realizes who she is supposed to be with; big changes are coming to Hope Valley; the town rallies together to say goodbye and good luck to one of its own."
      },
      {
        "id": "tvmaze:2248315",
        "title": "In Like a Lion",
        "season": 9,
        "episode": 1,
        "released": "2022-03-06",
        "overview": "Change is in the air for Hope Valley with the foundry that's to be built and the upcoming mayoral election. Elizabeth arrives home from a trip to Hamilton. A potential investor arrives in town to discuss the oil business with Lucas."
      },
      {
        "id": "tvmaze:2274606",
        "title": "Out Like a Lamb",
        "season": 9,
        "episode": 2,
        "released": "2022-03-13",
        "overview": "Hope Valley elects a new mayor. Lucas and Elizabeth try to find the \"little moments\" in their relationship. Elizabeth offers to help Nathan with his horse after the hit-and-run, but it's newcomer, Mei who connects with Newton."
      },
      {
        "id": "tvmaze:2287792",
        "title": "Turn of the Page",
        "season": 9,
        "episode": 3,
        "released": "2022-03-20",
        "overview": "Elizabeth's book is finally published and it's the talk of the town. Lucas plans a surprise party to celebrate the event, but some bad book reviews have Elizabeth in a less social mood."
      },
      {
        "id": "tvmaze:2289638",
        "title": "Straight From the Heart",
        "season": 9,
        "episode": 4,
        "released": "2022-03-27",
        "overview": "Elizabeth sees a new side of Lucas when a flu bug leaves her without a babysitter, and he volunteers to watch Little Jack."
      },
      {
        "id": "tvmaze:2295004",
        "title": "Journey into the Light",
        "season": 9,
        "episode": 5,
        "released": "2022-04-03",
        "overview": "School Inspector Augustus Landis is back in town and starts questioning Elizabeth's new accreditation to teach Angela. Lucas and Nathan decide to have a race, animal vs. machine."
      },
      {
        "id": "tvmaze:2295005",
        "title": "Past, Present, Future,",
        "season": 9,
        "episode": 6,
        "released": "2022-04-10",
        "overview": "Lee writes a new editorial in the Valley Voice. Gowen worries about the oil company's intentions now that Fiona has all but secured a deal with investors."
      },
      {
        "id": "tvmaze:2295006",
        "title": "Hope Valley Days (1)",
        "season": 9,
        "episode": 7,
        "released": "2022-04-17",
        "overview": "Mayor Hickam decides that Hope Valley needs to get back to its hopeful, joyous roots and decides to host Hope Valley Days, a collective celebration inspired by giving, fun, hope, and love."
      },
      {
        "id": "tvmaze:2295007",
        "title": "Hope Valley Days (2)",
        "season": 9,
        "episode": 8,
        "released": "2022-04-24",
        "overview": "Residents of Hope Valley continue to enjoy the festival and everyone comes together to help one of their own."
      },
      {
        "id": "tvmaze:2295008",
        "title": "Recent Memory",
        "season": 9,
        "episode": 9,
        "released": "2022-05-01",
        "overview": "Walden arrives back in town, putting more pressure than ever on Lucas and the residents of Hope Valley. Bill comes up with a plan to stop Walden. New investors arrive from the oil company."
      },
      {
        "id": "tvmaze:2295009",
        "title": "Never Say Never",
        "season": 9,
        "episode": 10,
        "released": "2022-05-08",
        "overview": "Elizabeth and Rosemary don't agree about how best to share unsettling news in the town regarding the coal mines, but that's put behind them when Rosemary hears even more shocking news."
      },
      {
        "id": "tvmaze:2295010",
        "title": "Smoke on the Water",
        "season": 9,
        "episode": 11,
        "released": "2022-05-15",
        "overview": "With the mine reopening imminent, Gowen decides to take drastic measures to make sure it stays closed. Elizabeth and Lucas struggle to communicate with each other. Lucas gets out of town to clear his head."
      },
      {
        "id": "tvmaze:2295011",
        "title": "Rock, A Bye, Baby",
        "season": 9,
        "episode": 12,
        "released": "2022-05-22",
        "overview": "Elizabeth worries about her relationship with Lucas, while Bill helps Gowen through the fallout of the mine explosion. Rosemary and Lee receive some news."
      },
      {
        "id": "tvmaze:2494524",
        "title": "Carpe Diem",
        "season": 10,
        "episode": 1,
        "released": "2023-07-30",
        "overview": "Hope Valley faces an economic downturn together. Meanwhile, Elizabeth and Bill learn that the children of Hope Valley have made a discovery that could change the future of the town."
      },
      {
        "id": "tvmaze:2570722",
        "title": "Hope Springs Eternal",
        "season": 10,
        "episode": 2,
        "released": "2023-08-06",
        "overview": "Everyone is buzzing with talk of the Hot Springs and how it will help the town. Meanwhile, Elizabeth and Lucas host Aunt Agatha and Julie on an interesting visit to Hope Valley."
      },
      {
        "id": "tvmaze:2570723",
        "title": "Oh, Baby",
        "season": 10,
        "episode": 3,
        "released": "2023-08-13",
        "overview": "Tourists start arriving, including the St. Johns, who may prove to be trouble for Bill. Meanwhile, Elizabeth rallies all Rosemary's friends to plan the perfect baby shower."
      },
      {
        "id": "tvmaze:2570724",
        "title": "Great Expectations",
        "season": 10,
        "episode": 4,
        "released": "2023-08-20",
        "overview": "The Coulter baby is late, but Faith assures them it's fine. By the time Rosemary goes into labor, the entire town is there to support her. Madeline tries to stay in Hope Valley."
      },
      {
        "id": "tvmaze:2570725",
        "title": "Life is But a Dream",
        "season": 10,
        "episode": 5,
        "released": "2023-08-27",
        "overview": "Rosemary and Lee are still adjusting to parenthood. Lucas reveals the surprise he's been working on to Elizabeth. Nathan has a camping trip planned for just him and Allie."
      },
      {
        "id": "tvmaze:2570726",
        "title": "The Heart of the Problem",
        "season": 10,
        "episode": 6,
        "released": "2023-09-03",
        "overview": "Rosemary and Lee's baby has brought up memories of Rosemary's own mother, and questions about her past. Meanwhile, the kids feel left out of the hot springs with all the tourists."
      },
      {
        "id": "tvmaze:2570727",
        "title": "Best Laid Plans",
        "season": 10,
        "episode": 7,
        "released": "2023-09-10",
        "overview": "Elizabeth is visited by a former student. Lucas orders something for all of Hope Valley to enjoy if they can get it working."
      },
      {
        "id": "tvmaze:2570728",
        "title": "What Is and What Never Should Be",
        "season": 10,
        "episode": 8,
        "released": "2023-09-17",
        "overview": "Elizabeth encourages Gowen to seek forgiveness from Rosaleen to heal old wounds. Rosemary and Minnie start a choir. Meanwhile Montague continues to raise suspicion."
      },
      {
        "id": "tvmaze:2570729",
        "title": "Deep Water",
        "season": 10,
        "episode": 9,
        "released": "2023-09-24",
        "overview": "Everyone helps Rosemary as the Governor visits early. Meanwhile, Nathan is called away to help with land trouble only to find himself in unexpected danger and with surprising intel."
      },
      {
        "id": "tvmaze:2570731",
        "title": "All Dressed Up",
        "season": 10,
        "episode": 10,
        "released": "2023-10-01",
        "overview": "The town prepares for the governor's black-tie ball. While still reeling from the true intentions of Union City Holdings, Lucas decides to try to sway the governor to their side."
      },
      {
        "id": "tvmaze:2570732",
        "title": "Long Time Running",
        "season": 10,
        "episode": 11,
        "released": "2023-10-08",
        "overview": "Lucas is the talk of the Valley. Elizabeth and the whole town rallies around him, but everyone still worries it won't be enough to stop the Governor."
      },
      {
        "id": "tvmaze:2570733",
        "title": "Starry Night",
        "season": 10,
        "episode": 12,
        "released": "2023-10-15",
        "overview": "With Elizabeth at his side, Election Day has the entire town supporting Lucas, hoping he will save Hope Valley. Rosemary and Lee discuss who should be their baby's godfather."
      },
      {
        "id": "tvmaze:2750362",
        "title": "When Stars Align",
        "season": 11,
        "episode": 1,
        "released": "2024-04-07",
        "overview": "Elizabeth turns over a new leaf. Nathan returns home from an investigation, and Bill questions its outcome. Rosemary chases a scoop. Lucas make a surprise announcement."
      },
      {
        "id": "tvmaze:2790511",
        "title": "Tomorrow Never Knows",
        "season": 11,
        "episode": 2,
        "released": "2024-04-14",
        "overview": "Elizabeth and Allie plan a birthday party for Nathan. Lee and Rosemary weigh business responsibilities against family time. Lucas settles into his role as governor."
      },
      {
        "id": "tvmaze:2790512",
        "title": "Steps Forward",
        "season": 11,
        "episode": 3,
        "released": "2024-04-21",
        "overview": "Rosemary and Bill team up to investigate a case they believe shouldn't be closed. The women of Hope Valley start a day care. Hickam and Mei celebrate a milestone."
      },
      {
        "id": "tvmaze:2790513",
        "title": "Along Came a Spider",
        "season": 11,
        "episode": 4,
        "released": "2024-04-28",
        "overview": "It's Easter in Hope Valley. Elizabeth organizes an egg hunt with help from Nathan. A visitor from Lucas's past gets the town talking. Angela and Cooper seek to mend a relationship."
      },
      {
        "id": "tvmaze:2813696",
        "title": "Stronger Together",
        "season": 11,
        "episode": 5,
        "released": "2024-05-05",
        "overview": "Hickam and Lee clash with the mayor of Benson Hills, and Gowen suggests a solution with huge implications for the town. Elizabeth and Nathan clear up a misunderstanding."
      },
      {
        "id": "tvmaze:2813697",
        "title": "Believe",
        "season": 11,
        "episode": 6,
        "released": "2024-05-12",
        "overview": "Elizabeth confronts an imposing figure from her past with Nathan's support. Rosemary helps Lee navigate a new leadership role. Lucas struggles to find bidders for his resort project."
      },
      {
        "id": "tvmaze:2813698",
        "title": "Facing the Music",
        "season": 11,
        "episode": 7,
        "released": "2024-05-19",
        "overview": "Elizabeth hopes for the best when Tom Thornton visits with an exciting opportunity for the town's choir. Rosemary and Bill interview a source. Lucas considers his options."
      },
      {
        "id": "tvmaze:2813699",
        "title": "Brother's Keeper",
        "season": 11,
        "episode": 8,
        "released": "2024-05-26",
        "overview": "Elizabeth and Nathan help Tom out of a tight situation, and the town comes together after a setback. With encouragement from family, Joseph heals and old rift. Gowen councils Lucas."
      },
      {
        "id": "tvmaze:2830333",
        "title": "Truth Be Told",
        "season": 11,
        "episode": 9,
        "released": "2024-06-02",
        "overview": "Rosemary's newspaper article creates waves when she questions Lucas's judgement. Allie discusses her birth father with Nathan, and Elizabeth realizes Little Jack is growing up."
      },
      {
        "id": "tvmaze:2847557",
        "title": "What Goes Around",
        "season": 11,
        "episode": 10,
        "released": "2024-06-09",
        "overview": "Allie makes a daring decision, and Nathan and Elizabeth rush to intervene. Uncovered memories shift Lucas's plans. Faith takes a big step. Mei cooks for Hickam's family."
      },
      {
        "id": "tvmaze:2847558",
        "title": "Run to You",
        "season": 11,
        "episode": 11,
        "released": "2024-06-16",
        "overview": "Nathan and Bill take charge when a notorious gangster threatens the town. Rosemary teams up with her competition to uncover the truth. Elizabeth and Nathan take a leap of faith."
      },
      {
        "id": "tvmaze:2847559",
        "title": "Anything for Love",
        "season": 11,
        "episode": 12,
        "released": "2024-06-23",
        "overview": "Nathan and Elizabeth exchange secrets. Rosemary and Lee pitch Lucas an idea for the future of Hope Valley."
      },
      {
        "id": "tvmaze:3047631",
        "title": "The Mountie Way",
        "season": 12,
        "episode": 1,
        "released": "2025-01-05",
        "overview": "Elizabeth receives a sentimental surprise in time for Little Jack's first day of school. Nathan trains a new Mountie cadet. Rosemary and Lee make a landmark decision."
      },
      {
        "id": "tvmaze:3087182",
        "title": "You Get What You Give",
        "season": 12,
        "episode": 2,
        "released": "2025-01-12",
        "overview": "When the comic book craze sweeps Hope Valley, Elizabeth teaches her students through nature. Rosemary launches a radio show, and Lucas meets a new political player."
      },
      {
        "id": "tvmaze:3087183",
        "title": "All That Glitters",
        "season": 12,
        "episode": 3,
        "released": "2025-01-19",
        "overview": "Elizabeth and Nathan uncover Oliver's secret. Rosemary worries Lee has a secret of his own. Allie's interest is piqued when Earl Wyatt returns to town."
      },
      {
        "id": "tvmaze:3087184",
        "title": "Dancing Teens",
        "season": 12,
        "episode": 4,
        "released": "2025-01-26",
        "overview": "Elizabeth helps Allie plan a birthday dance while Nathan struggles with Allie growing up. Rosemary and Bill team up again to investigate a train robbery and Lucas ends Edie a hand."
      },
      {
        "id": "tvmaze:3105753",
        "title": "Mom's the Word",
        "season": 12,
        "episode": 5,
        "released": "2025-02-02",
        "overview": "Elizabeth develops a new method of teaching. Nathan goes undercover. A familiar face returns to Hope Valley with an unlucky heiress in tow. Lucas and Lee face their differences."
      },
      {
        "id": "tvmaze:3105754",
        "title": "When Autumn Leaves Begin to Fall",
        "season": 12,
        "episode": 6,
        "released": "2025-02-08",
        "overview": "Allie and Oliver discover a threat. Rosemary invites the kids to debate Lucas on the radio. Bill interrogates a suspect with an old friend's help. Elizabeth fights a cold."
      },
      {
        "id": "tvmaze:3105755",
        "title": "Dance the Night Away",
        "season": 12,
        "episode": 7,
        "released": "2025-02-16",
        "overview": "Elizabeth and Nathan's date night leads to an undercover operation at a glamorous party. Lucas and Edie grow closer over cards. Rosemary holds auditions for a play."
      },
      {
        "id": "tvmaze:3105756",
        "title": "The Show Must Go On",
        "season": 12,
        "episode": 8,
        "released": "2025-02-23",
        "overview": "Rosemary's play gets a new venue and a new cast. Elizabeth takes her curriculum to the airwaves. Faith helps a friend make a decision. Lucas faces unexpected opposition."
      },
      {
        "id": "tvmaze:3136181",
        "title": "Buried Treasure",
        "season": 12,
        "episode": 9,
        "released": "2025-03-02",
        "overview": "The Garrison Gang comes for their gold with Hope Valley residents in the crosshairs. Angela visits the Schwartzman School and Rosemary uncovers the truth about Ava."
      },
      {
        "id": "tvmaze:3136184",
        "title": "Through the Valley",
        "season": 12,
        "episode": 10,
        "released": "2025-03-09",
        "overview": "The land dispute around McGinty's Meadow intensifies. Hickam and Mei throw a harvest festival for the town. Elizabeth helps Emily find her purpose."
      },
      {
        "id": "tvmaze:3136182",
        "title": "Having Faith",
        "season": 12,
        "episode": 11,
        "released": "2025-03-16",
        "overview": "When Little Jack falls ill, Elizabeth and Nathan care for him together as Hickam and Mei race to secure medicine. The kids broadcast a baseball game over the radio to lift spirits."
      },
      {
        "id": "tvmaze:3136183",
        "title": "Must Be Gold",
        "season": 12,
        "episode": 12,
        "released": "2025-03-23",
        "overview": "As graduation approaches, Elizabeth and Nathan plan for a happy summer together. Lucas and Edie race Rosemary and Bill to find the gold. The town plans a sweet surprise for Minnie."
      },
      {
        "id": "tvmaze:3447615",
        "title": "TBA",
        "season": 13,
        "episode": 1,
        "released": "2026-01-04",
        "overview": ""
      }
    ]
  }
}