{
  "meta": {
    "id": "tvmaze:81133",
    "type": "series",
    "name": "Finding Mr. Christmas",
    "description": "10 men compete in a series of festive challenges that will showcase their acting chops and their holiday spirit. Jonathan Bennett hosts while these lovable guys vie to become the next Hallmark leading man.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/591/1478095.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/591/1478095.jpg",
    "videos": [
      {
        "id": "tvmaze:3448776",
        "title": "Merry Christmas, Mom",
        "season": 2,
        "episode": 7,
        "released": "2025-12-08",
        "overview": "The final four pen holiday cards to their moms before being surprised with live reunions."
      },
      {
        "id": "tvmaze:3069223",
        "title": "The Hunt for Mr. Christmas",
        "season": 1,
        "episode": 1,
        "released": "2024-10-31",
        "overview": "Ten unknown talents compete for the role of a lifetime - a leading role in a Hallmark Christmas movie. Host Jonathan Bennett invites Erin Cahill to be their first scene partner."
      },
      {
        "id": "tvmaze:3069224",
        "title": "Mr. December",
        "season": 1,
        "episode": 2,
        "released": "2024-10-31",
        "overview": "Nine unknown talents compete in a Mr. December photoshoot where fan fav Tyler Hynes helps them navigate celebrity photographers, Hallmark Superfans, and demanding co-stars."
      },
      {
        "id": "tvmaze:3069225",
        "title": "Falling for You",
        "season": 1,
        "episode": 3,
        "released": "2024-11-07",
        "overview": "After battling tangled Christmas lights, the contestants learn their next scene partner is Hallmark's Brooke D'Orsay. Not only must they learn their lines, but they've got to act on ice!"
      },
      {
        "id": "tvmaze:3069226",
        "title": "The Talented Mr. Christmas",
        "season": 1,
        "episode": 4,
        "released": "2024-11-14",
        "overview": "The remaining men tackle an outdoor holiday-themed obstacle course, then show their stuff in a Mr. Christmas talent show. And, a backstage surprise with Keltie Knight from E! News."
      },
      {
        "id": "tvmaze:3069227",
        "title": "Laughing All the Way",
        "season": 1,
        "episode": 5,
        "released": "2024-11-21",
        "overview": "The remaining men decide if they want to bring someone back. A festive faceoff squeezes every ounce of energy out of the guys, they try improv with some special scene partners - B.J. Britt, Jonathan Bennett and Melissa Peterman."
      },
      {
        "id": "tvmaze:3069228",
        "title": "The Festive Five",
        "season": 1,
        "episode": 6,
        "released": "2024-11-28",
        "overview": "Five leading men face an emotional acting scene with Rachel Boston, directed by Ali Liebert. Contestants must draw on events from their past to help them make the sad scene believable."
      },
      {
        "id": "tvmaze:3069229",
        "title": "A Christmas Waltz",
        "season": 1,
        "episode": 7,
        "released": "2024-12-05",
        "overview": "During a frosty festive faceoff, the guys must trust each other. Choreographer Witney Carson teaches the remaining men dances to perform before an audience, including surprise guests. With Jonathan Bennett and Melissa Peterman."
      },
      {
        "id": "tvmaze:3069230",
        "title": "Our Christmas Star",
        "season": 1,
        "episode": 8,
        "released": "2024-12-12",
        "overview": "The finalists film their most difficult scene yet, kiss included! One man's life is changed forever when he wins a leading role in a Hallmark Christmas movie."
      },
      {
        "id": "tvmaze:3375167",
        "title": "The Search for Mr. Christmas",
        "season": 2,
        "episode": 1,
        "released": "2025-10-27",
        "overview": "Host Jonathan Bennett and judge Melissa Peterman kick off the hunt for Hallmark's next leading man as ten new hunks reinvent Santa, and then brave a ski-slope meet-cute with Janel Parrish."
      },
      {
        "id": "tvmaze:3400653",
        "title": "Reindeer Games",
        "season": 2,
        "episode": 2,
        "released": "2025-11-03",
        "overview": "The hunks team up to launch gifts into Santa's sleigh, then soar sky-high as reindeer in an Entertainment Weekly photo shoot, where the winning team's advantage shakes up the competition."
      },
      {
        "id": "tvmaze:3400654",
        "title": "Riding Into Romance",
        "season": 2,
        "episode": 3,
        "released": "2025-11-10",
        "overview": "The hunks get personal while building gingerbread houses, sharing what Christmas means to them; Alison Sweeney joins as they saddle up for a cowboy scene, where animal co-stars lead to some unexpected performances."
      },
      {
        "id": "tvmaze:3400655",
        "title": "A Very Merry Talent Show",
        "season": 2,
        "episode": 4,
        "released": "2025-11-17",
        "overview": "The hunks slide through a messy Festive Face Off before cleaning up for the Mr. Talent show; with Hallmark Superfans as guest judges, the guys are faced with tough questions; it all leads to an elimination with a shocking twist."
      },
      {
        "id": "tvmaze:3400656",
        "title": "Christmas on Main Street",
        "season": 2,
        "episode": 5,
        "released": "2025-11-24",
        "overview": "The hunks roll into giant plastic balls, crashing through Christmas trees in a wild Festive Face Off; with Hunter King as guest judge, teams perform a neighborhood holiday party scene that leads to a dramatic elimination."
      },
      {
        "id": "tvmaze:3442015",
        "title": "The Holi-Date",
        "season": 2,
        "episode": 6,
        "released": "2025-12-01",
        "overview": "Ashley Williams is a guest for a picnic date scene packed with twists that test charm."
      },
      {
        "id": "tvmaze:3448776",
        "title": "Merry Christmas, Mom",
        "season": 2,
        "episode": 7,
        "released": "2025-12-08",
        "overview": "The final four pen holiday cards to their moms before being surprised with live reunions."
      },
      {
        "id": "tvmaze:3455927",
        "title": "Crowning Mr. Christmas",
        "season": 2,
        "episode": 8,
        "released": "2025-12-15",
        "overview": "Erin Krakow joins Jonathan Bennett and Melissa Peterman to step back in time and into the story."
      },
      {
        "id": "tvmaze:3465564",
        "title": "Finding Mr. Christmas: Reunion Special",
        "season": 2,
        "episode": 9,
        "released": "2025-12-20",
        "overview": "Host Jonathan Bennett gathers the guys for an inside look; finding out what they've been up to!"
      }
    ]
  }
}