{
  "meta": {
    "id": "tvmaze:44656",
    "type": "series",
    "name": "Fixer to Fabulous",
    "description": "Dave and Jenny Marrs embrace small-town America by renovating classic homes in and around their hometown of Bentonville, Arkansas. This resourceful and creative couple transforms historic houses in desperate need of an update and turns them into charming forever homes.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/600/1502369.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/600/1502369.jpg",
    "videos": [
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436545",
        "title": "Fix This Rundown Rental",
        "season": 7,
        "episode": 2,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:1743914",
        "title": "From Craftsman to Creole Cottage",
        "season": 1,
        "episode": 1,
        "released": "2019-10-22",
        "overview": "A couple who loves New Orleans-style architecture asks Dave and Jenny transform their classic Craftsman into a Creole cottage. The dynamic duo remodels each room with unique touches like antique doors, homemade gas lanterns and an airy front porch."
      },
      {
        "id": "tvmaze:1743915",
        "title": "Classic Colonial Meets Modern-Day Makeover",
        "season": 1,
        "episode": 2,
        "released": "2019-10-29",
        "overview": "Jenny and Dave are challenged to completely overhaul a historic Dutch Colonial home for a couple of farm owners and their two small children. While keeping the home's history and character, they come up with a plan for a open-concept kitchen, a one-of-a-kind playroom and an unexpected pop of color on the exterior."
      },
      {
        "id": "tvmaze:1743917",
        "title": "Outdated to Modern",
        "season": 1,
        "episode": 3,
        "released": "2019-11-05",
        "overview": "A family that owns a local brewery purchased an older home rich with history, but the outdated rooms and obsolete features create many challenges. Dave and Jenny Marrs hatch a plan to overhaul the space by adding creative and personal touches like a custom, handmade beer tap, brand-new master suite and stunning outdoor kitchen."
      },
      {
        "id": "tvmaze:1743916",
        "title": "Century-Old Farmhouse Becomes New Forever Home",
        "season": 1,
        "episode": 4,
        "released": "2019-11-12",
        "overview": "Dave and Jenny help a couple update their century-old farmhouse so that it better accommodates large family gatherings. Their main goal is to improve flow and add modern amenities without stripping the home of its unique country character. The plan calls for a complete kitchen overhaul with a custom concrete sink and a couple surprising flourishes that celebrate the family's 100-year history in the home."
      },
      {
        "id": "tvmaze:1743918",
        "title": "A Drab Victorian Gets a Fab Facelift",
        "season": 1,
        "episode": 5,
        "released": "2019-11-19",
        "overview": "Dave and Jenny Marrs help a woman turn her historic 1905 home into a beautiful Victorian retreat. But they have their work cut out for them with its shoddy, unfinished contracting work throughout the living room, kitchen, master bedroom and back porch."
      },
      {
        "id": "tvmaze:1763141",
        "title": "From Nightmare Cabin to Family Dream Home",
        "season": 1,
        "episode": 6,
        "released": "2019-11-26",
        "overview": "Dave and Jenny modernize a couple's rundown log cabin while keeping its historic integrity intact. The top-to-bottom transformation includes new amenities like a custom live-edge bar, outdoor shower and a brand-new porch."
      },
      {
        "id": "tvmaze:1763142",
        "title": "A Bigger Kitchen for a Growing Family",
        "season": 1,
        "episode": 7,
        "released": "2019-12-03",
        "overview": "Dave and Jenny Marrs overhaul an expecting couple's outdated, 1970s home into a space that feels welcoming for their growing family. They create an open, airy kitchen and a backyard that will be the envy of every kid and grown-up in the neighborhood."
      },
      {
        "id": "tvmaze:1763143",
        "title": "Entertaining Oasis",
        "season": 1,
        "episode": 8,
        "released": "2019-12-10",
        "overview": "A married couple owns a wine bar and loves to entertain, but their home's not quite ready for guests due to its compartmentalized layout, unstable balconies and an enormous, rotting tree. They desperately need Dave and Jenny to bring the place back to its former glory. Dave puts his skills to the test, creating more space in the cramped kitchen and an outdoor oasis, while Jenny draws on her artistic talents to craft a surprise."
      },
      {
        "id": "tvmaze:1764543",
        "title": "Surprise Renovation for First-Time Homeowner",
        "season": 1,
        "episode": 9,
        "released": "2019-12-17",
        "overview": "A new homeowner's first place needs work, so her parents recruit Dave and Jenny to pull off a surprise renovation while she's out of town. The Marrs race the clock to create a quaint, warm and welcoming home that matches the homeowner's tastes perfectly."
      },
      {
        "id": "tvmaze:1787105",
        "title": "Dreary Home Gets Bright Update",
        "season": 1,
        "episode": 10,
        "released": "2020-01-07",
        "overview": "A baking aficionado and her husband want to convert their dark, oddly constructed home into a bright and welcoming space for them and their kids. Dave and Jenny must tackle its fortress facade and 1970s interior to bring the home into the 21st century. While Dave encounters odd structural issues, Jenny battles one of her biggest fears as she updates the exterior's extremely high, rusted balconies."
      },
      {
        "id": "tvmaze:1787112",
        "title": "Historic Home Overhaul",
        "season": 1,
        "episode": 11,
        "released": "2020-01-14",
        "overview": "Dave and Jenny Marrs transform the a family's historic, 1893 house. From turning an attic space into two bedrooms to completely renovating the kitchen and living area, they pull out all the stops to give the family of five their first home."
      },
      {
        "id": "tvmaze:1953225",
        "title": "A New Lease on Life",
        "season": 2,
        "episode": 1,
        "released": "2020-10-27",
        "overview": "After overcoming health issues, a family purchased a house on the lake and hoped to make it their forever home. They started renovations themselves and realized they needed help, so they call on Dave and Jenny to transform it into their dream lake home."
      },
      {
        "id": "tvmaze:1960246",
        "title": "She Said \"Yes!\"",
        "season": 2,
        "episode": 2,
        "released": "2020-11-03",
        "overview": "A newly engaged couple recently purchased their first property, but the outdated and closed-off interior doesn't fit their needs. Dave and Jenny expand the floor plan, overhaul the kitchen and transform the backyard to create an entertaining hot spot."
      },
      {
        "id": "tvmaze:1960248",
        "title": "A Home to Love",
        "season": 2,
        "episode": 3,
        "released": "2020-11-10",
        "overview": "A woman made an offer on a 1902 house before her husband could see it, and he believes it's too outdated to be their forever home. Dave and Jenny work to renovate and update the spaces while preserving its original charm that she loves."
      },
      {
        "id": "tvmaze:1960249",
        "title": "Rustic Cabin to Contemporary Retreat",
        "season": 2,
        "episode": 4,
        "released": "2020-11-17",
        "overview": "A family that survived a devastating house fire buys a home on the lake so they can enjoy their favorite spot year-round. However, the lack of space doesn't fit their needs, so they ask Dave and Jenny to completely overhaul the rustic cabin."
      },
      {
        "id": "tvmaze:1960247",
        "title": "Family House with History",
        "season": 2,
        "episode": 5,
        "released": "2020-11-24",
        "overview": "A couple's 19th-century home has been in their family for five generations, and they want to update it to fit their lifestyle. Dave and Jenny renovate the space while preserving the historic charm so the home can be passed down for generations to come."
      },
      {
        "id": "tvmaze:1971711",
        "title": "Old Dojo to Modern Mojo",
        "season": 2,
        "episode": 6,
        "released": "2020-12-01",
        "overview": "A couple bought a karate studio as an investment property but when life threw them a curveball, they decided to downsize. With Dave and Jenny's help, they want to transform the commercial space into a home complete with industrial and modern charm."
      },
      {
        "id": "tvmaze:1977926",
        "title": "An Old Rancher Gets a Chef-Inspired Facelift",
        "season": 2,
        "episode": 7,
        "released": "2020-12-15",
        "overview": "Two restaurant owners live in the house her grandfather built, but it's too old-fashioned for their taste and two active boys. When they call on Dave and Jenny to update their outdated ranch, the results are inspiring, modern and ready for entertaining."
      },
      {
        "id": "tvmaze:1986316",
        "title": "A Life-Changing, Marrs Family Renovation",
        "season": 2,
        "episode": 8,
        "released": "2020-12-22",
        "overview": "When Jenny's parents decided to make the move to Bentonville, Arkansas, from Florida, the Marrs were thrilled to have them closer ... but after months of living under the same roof, it's time for Joan and Steve to have a fabulous dream home of their own."
      },
      {
        "id": "tvmaze:1986317",
        "title": "A Boring House Turns Into a Boho-Chic Rental",
        "season": 2,
        "episode": 9,
        "released": "2020-12-29",
        "overview": "Tired of their tight quarters in New Jersey, two best friends were happy to be transferred back to Bentonville, Arkansas, for work. Luckily, Dave and Jenny Marrs have a rental property that is ready to be custom-renovated with cool Caribbean style."
      },
      {
        "id": "tvmaze:2000359",
        "title": "Dysfunctional Rancher Becomes a Family-Friendly Home",
        "season": 2,
        "episode": 10,
        "released": "2021-01-05",
        "overview": "A couple has dreamed of renovating their Bentonville home with an extra bedroom and a space for homeschooling since the day they moved in. With the help of Dave and Jenny Marrs, their outdated rancher gets the upgrades it needs to become a forever home."
      },
      {
        "id": "tvmaze:2000360",
        "title": "Victorian Hodgepodge Gets Modern Makeover",
        "season": 2,
        "episode": 11,
        "released": "2021-01-12",
        "overview": "After moving 20 times in 28 years, a couple is ready to make the move into a recently purchased Victorian their last. The rooms are a hash of renovations past, so Dave and Jenny Marrs help turn this house into a modern home where they'll want to stay."
      },
      {
        "id": "tvmaze:2006558",
        "title": "A Closed-Off House Turns Character-Filled Home",
        "season": 2,
        "episode": 12,
        "released": "2021-01-19",
        "overview": "A young couple loves their downtown Bentonville home, but they don't like how closed-off it feels -- inside and out. With some added charm, Dave and Jenny Marrs create the warm and inviting open space they've been dreaming of for their growing family."
      },
      {
        "id": "tvmaze:2012445",
        "title": "Historic House Gets Pretty Pink Overhaul",
        "season": 2,
        "episode": 13,
        "released": "2021-01-26",
        "overview": "After seeing overhaul they did on her parent's house, a woman moving back to Bentonville knows that Dave and Jenny can create her dream home, too. The Marrs use her love of pink to craft the ultimate starter home that she'll never want to leave."
      },
      {
        "id": "tvmaze:2215957",
        "title": "Lakeside Retreat Gets Kid-Friendly Upgrade",
        "season": 3,
        "episode": 1,
        "released": "2021-11-16",
        "overview": "A couple bought a waterfront home with a stunning, panoramic view of the lake for their whole family to enjoy. Dave and Jenny have their work cut out for them as they turn this humdrum house into an artsy, kid-friendly home with its own indoor treehouse!"
      },
      {
        "id": "tvmaze:2215962",
        "title": "Modern Lodge Chalet at Long Last",
        "season": 3,
        "episode": 2,
        "released": "2021-11-23",
        "overview": "A couple has been wanting to renovate their home for ten years, but major health issues put their remodel plans on the backburner. Dave and Jenny aim to give them their dream home complete with a kitchen that has lots of storage and a cozy screened porch."
      },
      {
        "id": "tvmaze:2215963",
        "title": "From Boring 90s House to Stylish Family Home",
        "season": 3,
        "episode": 3,
        "released": "2021-11-30",
        "overview": "A single father longs to turn his drab bachelor pad into a cozy, welcoming and sporty home fit for him and his two sons. Dave and Jenny incorporate bourbon and baseball into their home design to make both Dad and the boys feel right at home."
      },
      {
        "id": "tvmaze:2215964",
        "title": "Lakehouse Dreams Do Come True",
        "season": 3,
        "episode": 4,
        "released": "2021-12-07",
        "overview": "A couple bought a house on Lake Windsor to turn their dream of lake living into a reality, but the spacious property needs lots of work. Dave and Jenny are eager to turn this massive project into a modern oasis that perfectly suits a young family of four."
      },
      {
        "id": "tvmaze:2221951",
        "title": "Holiday Surprise",
        "season": 3,
        "episode": 5,
        "released": "2021-12-14",
        "overview": "Just in time for the holidays, Dave and Jenny gift the Bella Vista Animal Shelter with a very merry renovation. After tackling a major refresh, new kennels and a custom cat playroom, they'll reopen the decked-out shelter with a festive pet adoption event!"
      },
      {
        "id": "tvmaze:2240865",
        "title": "Victorian Turned Storybook Cottage",
        "season": 3,
        "episode": 6,
        "released": "2021-12-21",
        "overview": "A couple loves their 1905 Victorian house, but its layout makes most of their rooms feel small. While attempting to preserve the home's beloved historic charm, Dave and Jenny completely open up the floor plan to update this cute storybook cottage."
      },
      {
        "id": "tvmaze:2240866",
        "title": "Rough Rancher Made Modern Farmhouse",
        "season": 3,
        "episode": 7,
        "released": "2021-12-28",
        "overview": "A businesswoman has had several houses built by Dave and Jenny in the past, but this time she is looking to settle down in her forever home. The Marrs are in for a challenge when they take on a rough project that's in need of a total overhaul."
      },
      {
        "id": "tvmaze:2241305",
        "title": "Boring Rancher to Beautiful Bungalow",
        "season": 3,
        "episode": 8,
        "released": "2022-01-04",
        "overview": "A couple hosts a lot of international students in their home, and they need Dave and Jenny's help with transforming their small rancher into a welcoming, worldly and eclectic place where visitors and family members can gather."
      },
      {
        "id": "tvmaze:2235031",
        "title": "New Tudor Home in Time for a Newborn",
        "season": 3,
        "episode": 9,
        "released": "2022-01-11",
        "overview": "A couple is ecstatic to learn that they are expecting another child, but now they need more space in their Tudor-style home. Dave and Jenny jump at the chance to create a full-blown Cotswold cottage with an open layout for this hip, young family."
      },
      {
        "id": "tvmaze:2241306",
        "title": "Funky, Modern Home With a Pool",
        "season": 3,
        "episode": 10,
        "released": "2022-01-18",
        "overview": "A father wants to turn his half-finished bachelor pad into a modern home for entertaining that reflects his style. Dave and Jenny update the house to match his prized pool and enlist his daughter's skills to paint a special finishing touch for the home."
      },
      {
        "id": "tvmaze:2241307",
        "title": "Home Dreams Live On",
        "season": 3,
        "episode": 11,
        "released": "2022-01-25",
        "overview": "A mother wants to fulfill her late husband's dream of turning their outdated home into a modern farmhouse. Dave and Jenny bring that dream to life with a basketball court for the kids and some fun personal touches the family can enjoy for years to come."
      },
      {
        "id": "tvmaze:2261014",
        "title": "Storm Chaser Tracks Down Forever Home",
        "season": 3,
        "episode": 12,
        "released": "2022-02-01",
        "overview": "After storm chasing through the South, a couple has decided to settle down in an Arkansas forever home. Now, they need Dave and Jenny's help to turn their boring brick rancher into an updated and fully accessible home their whole family will love."
      },
      {
        "id": "tvmaze:2269986",
        "title": "Midcentury Party House",
        "season": 3,
        "episode": 14,
        "released": "2022-02-15",
        "overview": "A couple who loves the midcentury modern style thought buying a 1970s home made sense, but a pile of renovation projects has them calling for help. Dave and Jenny get to work bringing their groovy pad and party-ready pool house back to its former glory."
      },
      {
        "id": "tvmaze:2273255",
        "title": "City Family Returns to Country Roots",
        "season": 3,
        "episode": 15,
        "released": "2022-02-22",
        "overview": "Now that their kids are older, a family is moving back to their roots in Arkansas. Dave and Jenny step in to help turn their large country home with lots of acreage into a cozy farmhouse where they can focus on \"unplugging\" with more family time together."
      },
      {
        "id": "tvmaze:2277656",
        "title": "Newlywed Dream Home",
        "season": 3,
        "episode": 16,
        "released": "2022-03-01",
        "overview": "Two newlyweds from Chicago love the house they bought in Arkansas, but they want to put their own personalized stamp on it. Jenny and Dave use the couple's Napa wedding as inspiration to turn the drab brick rancher into a dazzling first home to remember."
      },
      {
        "id": "tvmaze:2287318",
        "title": "Small Rancher Gets the Biggest Addition",
        "season": 3,
        "episode": 17,
        "released": "2022-03-08",
        "overview": "After living all over the country, Jenny's sister wants to put down some roots with her husband and two sons in Arkansas! Dave and Jenny face a massive undertaking as they transform a small rancher into a two-story dream home with a pool and aquarium."
      },
      {
        "id": "tvmaze:2421319",
        "title": "Family Home with Aussie Flair",
        "season": 4,
        "episode": 1,
        "released": "2022-11-29",
        "overview": "A couple with Australian roots wants to brighten up their dull '80s rancher and make it better reflect their family's lifestyle. Dave and Jenny give all the kids a special space of their own and update the home with some Aussie inspired touches."
      },
      {
        "id": "tvmaze:2435594",
        "title": "Giving Family Gets Sweet Upgrade",
        "season": 4,
        "episode": 2,
        "released": "2022-12-06",
        "overview": "A couple who has made a positive impact in their community for many years is eager to complete their long-delayed dream house remodel. Dave and Jenny incorporate custom and meaningful touches throughout the family's home, including a sweet surprise."
      },
      {
        "id": "tvmaze:2435595",
        "title": "Dull House to Dazzling Home",
        "season": 4,
        "episode": 3,
        "released": "2022-12-13",
        "overview": "A newly single mom wants to give her early 2000s home a colorful makeover to better reflect her family's vibrant lifestyle. Dave and Jenny transform the home's exterior with smart and stylish design choices, along with a beautifully renovated kitchen."
      },
      {
        "id": "tvmaze:2442545",
        "title": "Modern Cabin in the Woods",
        "season": 4,
        "episode": 4,
        "released": "2022-12-20",
        "overview": "A couple purchased a '90s lake house with the hopes of making it their forever home, but it desperately needs an update. Dave and Jenny transform the dated home into a modern cabin-in-the-woods by using the surrounding lush forest as inspiration."
      },
      {
        "id": "tvmaze:2442546",
        "title": "Historic House Revival",
        "season": 4,
        "episode": 5,
        "released": "2022-12-27",
        "overview": "A couple wants to honor the history of their 100-year-old craftsman and make it a functional forever home for their family. Dave and Jenny have a personal connection with the homeowners, so the pressure's on to make this reno perfect for their friends."
      },
      {
        "id": "tvmaze:2452375",
        "title": "Family Farmhouse Restoration",
        "season": 4,
        "episode": 6,
        "released": "2023-01-03",
        "overview": "A couple inherits a home that's been in their family for many years, and now they want to turn it into a place for future generations to enjoy. Dave and Jenny transform the home with a timeless renovation that includes meaningful nods to its rich history."
      },
      {
        "id": "tvmaze:2458448",
        "title": "Rustic Cape Cod Reno",
        "season": 4,
        "episode": 7,
        "released": "2023-01-10",
        "overview": "Newly empty nesters purchase a property with plenty of land for their dogs, but the dated house needs some serious renovations to fit their style. Dave and Jenny transform the home with a rustic Cape Cod inspired look while adding a few personal touches."
      },
      {
        "id": "tvmaze:2458449",
        "title": "Dated Log Cabin Turns Forever Home",
        "season": 4,
        "episode": 8,
        "released": "2023-01-17",
        "overview": "A couple relocating from Texas purchased their dream log cabin on the lake, but the dated house needs major updates before they can move in. Dave and Jenny transform the dark and drab cabin into a relaxing retreat for the entire family."
      },
      {
        "id": "tvmaze:2474870",
        "title": "Builder-Grade to Custom Craftsman",
        "season": 4,
        "episode": 9,
        "released": "2023-01-24",
        "overview": "A movie-loving couple wants to turn their builder-grade house into a customized home that reflects both their styles. Dave and Jenny look to turn this bachelor's bungalow into a cozy craftsman fit for a couple featuring a movie theatre in the old attic."
      },
      {
        "id": "tvmaze:2474873",
        "title": "Historic Cottage Gets a Modern Upgrade",
        "season": 4,
        "episode": 10,
        "released": "2023-01-31",
        "overview": "High school sweethearts looking for a change of pace from suburban life find a historic 1940s home in downtown Bentonville. Dave and Jenny transform the small home by maximizing every square foot and giving it a cozy and charming cottage-inspired look."
      },
      {
        "id": "tvmaze:2474876",
        "title": "Century-Old Barn Turned Family Home",
        "season": 4,
        "episode": 11,
        "released": "2023-02-07",
        "overview": "A couple with family across the country want to turn their century-old barn into a home where they can all come together. Dave and Jenny take on this massive project and transform their rustic barn into a modern gathering space with unique design choices."
      },
      {
        "id": "tvmaze:2492355",
        "title": "Small House to Cozy Casita",
        "season": 4,
        "episode": 12,
        "released": "2023-02-21",
        "overview": "A couple with family ties to Peru have purchased a small house that they want to make their forever home, but it needs a lot of work; Dave and Jenny brighten up the home and incorporate a Peruvian design-style with personal touches."
      },
      {
        "id": "tvmaze:2492356",
        "title": "California Couple Gets Dream Home",
        "season": 4,
        "episode": 13,
        "released": "2023-02-28",
        "overview": "A California couple moved their family of five to Arkansas, but the '90s rancher they purchased needs a major makeover before they can move in; Dave and Jenny look to transform the house into a California style dream home with a unique kids' space."
      },
      {
        "id": "tvmaze:2496852",
        "title": "Eccentric House Gets Modern Makeover",
        "season": 4,
        "episode": 14,
        "released": "2023-03-07",
        "overview": "A Seattle couple relocate to Bentonville, Ark., for work, and their new home has a bizarre, eccentric interior that doesn't match their personal style; Dave and Jenny look to transform the space with cozy design elements."
      },
      {
        "id": "tvmaze:2501279",
        "title": "Historic Bank Building Turned Apartment",
        "season": 4,
        "episode": 15,
        "released": "2023-03-14",
        "overview": "Dave and Jenny purchased a historic building in Centerton with the vision of revitalizing the downtown area. Now, they're ready to begin this massive project by renovating the second-floor apartment to create a space for friends and family to stay."
      },
      {
        "id": "tvmaze:2501280",
        "title": "Historic Bank Building Turned Mercantile",
        "season": 4,
        "episode": 16,
        "released": "2023-03-21",
        "overview": "Dave and Jenny are in the final phase of their historic Centerton bank building renovation with the construction of a mercantile on the first floor. They look to create a community gathering place and a space for local artisans to showcase their work."
      },
      {
        "id": "tvmaze:2668322",
        "title": "Drab Fixer to Charming Cottage",
        "season": 5,
        "episode": 1,
        "released": "2023-11-07",
        "overview": "A first-time homeowner is excited for her English cottage style renovation that she can enjoy with her friends. As demolition gets underway, however, Dave and Jenny uncover an unexpected challenge when they discover her crawl space is filled with water."
      },
      {
        "id": "tvmaze:2678531",
        "title": "A Military Family Gets a Dream Renovation",
        "season": 5,
        "episode": 2,
        "released": "2023-11-14",
        "overview": "The pressure's on for Dave and Jenny as they look to give a military family an unforgettable makeover. With deployment coming soon, however, Dave and Jenny need to work against the clock to finish the renovation in time for this deserving family."
      },
      {
        "id": "tvmaze:2683649",
        "title": "Trading Texas Roots for a Horse Ranch Dream",
        "season": 5,
        "episode": 3,
        "released": "2023-11-21",
        "overview": "A family decides to uproot their lives in Texas for their new home in Arkansas. They're looking for the ultimate horse ranch renovation, but as Dave and Jenny dive into the makeover, they encounter issues that could result in major budget adjustments."
      },
      {
        "id": "tvmaze:2684097",
        "title": "Cozy Lake House Reno",
        "season": 5,
        "episode": 4,
        "released": "2023-11-28",
        "overview": "A woman aims to renovate her home on the lake in Rogers, Arkansas. The backyard is treacherous and unusable, so Dave and Jenny look to take advantage of her amazing views to create the ultimate lakeside hangout for her and her family."
      },
      {
        "id": "tvmaze:2684098",
        "title": "Small Historic Home Meets Full Potential",
        "season": 5,
        "episode": 5,
        "released": "2023-12-19",
        "overview": "A young couple purchased a small century old home for their family of three, and the place is in desperate need of a revival. The house is a piece of Bentonville history, and now Dave and Jenny face big challenges as they aim to bring it back to life."
      },
      {
        "id": "tvmaze:2685925",
        "title": "A Grand Makeover Meets the Marrs",
        "season": 5,
        "episode": 6,
        "released": "2023-12-26",
        "overview": "A ballroom dancing California couple is ready for a renovation, and for the Marrs, it's their most grand and unique home yet. Dave and Jenny take on the massive project as they aim to create a bathroom spa-retreat, a chef's kitchen and a formal entryway."
      },
      {
        "id": "tvmaze:2716540",
        "title": "Bland Rancher Gets Global Upgrade",
        "season": 5,
        "episode": 7,
        "released": "2024-01-02",
        "overview": "A couple reconnects after years of dating, and now they're moving in together and want to make major updates to their home. As a nod to their time spent traveling, Dave and Jenny look to add traces of the world to create the couple's unique renovation."
      },
      {
        "id": "tvmaze:2721806",
        "title": "Lakeside House in the Trees",
        "season": 5,
        "episode": 8,
        "released": "2024-01-09",
        "overview": "A couple and their young daughter are ready to update their midcentury three-story house on the lake. There's definite safety concerns within the home, so Dave and Jenny look to navigate the twists and turns of this much needed renovation."
      },
      {
        "id": "tvmaze:2721807",
        "title": "Old Home Brings Big Expectations",
        "season": 5,
        "episode": 9,
        "released": "2024-01-16",
        "overview": "A couple who built their home 20 years ago are ready for an upgrade, and they're looking to modernize the space for family gatherings. Now, Dave and Jenny are challenged to deliver a \"Jenny Marrs Kitchen\" and the colossal closet they've always dreamt of."
      },
      {
        "id": "tvmaze:2721808",
        "title": "The Ultimate Cabin",
        "season": 5,
        "episode": 10,
        "released": "2024-01-23",
        "overview": "A single mother and her son are ready to update their small cabin, and they're seeking a sense of comfort in the renovation. Dave and Jenny take on the task of transforming their confined space into the ultimate hideaway in the woods."
      },
      {
        "id": "tvmaze:2744208",
        "title": "A Worldwide Home Renovation",
        "season": 5,
        "episode": 11,
        "released": "2024-01-30",
        "overview": "A couple who has lived in the same home for 29 years is ready for a renovation that includes items and memories from their world travels. Dave and Jenny look to incorporate new elements into their updated space while preserving the treasured old."
      },
      {
        "id": "tvmaze:2750800",
        "title": "Rustic Barn to Luxury In-Law Suite",
        "season": 5,
        "episode": 12,
        "released": "2024-02-06",
        "overview": "The Marrs look to convert a barn into an in-law suite and wedding venue for country singer Gabrielle Mooney and her fiance. After surviving a major health crisis, Gabrielle's brother, country singer Shay Mooney, and family help with this special makeover."
      },
      {
        "id": "tvmaze:2756027",
        "title": "Family Home Makeover Helps Tie the Knot",
        "season": 5,
        "episode": 13,
        "released": "2024-02-13",
        "overview": "The renovation continues for a country singer's family home as Dave and Jenny work under a tight deadline to transform her home before her wedding date arrives."
      },
      {
        "id": "tvmaze:2756029",
        "title": "Lakeside Home Reno Brings Family Ties",
        "season": 5,
        "episode": 14,
        "released": "2024-02-20",
        "overview": "Dave's aunt and uncle are moving to Arkansas to be closer to their daughters and family, and they're ready for a lake house renovation. Dave and Jenny feel the pressure as they're tasked to create a relaxing and functional space for the family."
      },
      {
        "id": "tvmaze:2768239",
        "title": "Forever Home on the Lake",
        "season": 5,
        "episode": 15,
        "released": "2024-02-27",
        "overview": "A Texas couple relocates to Arkansas to be closer to family, and now they're ready to renovate their bland lakeside house; Dave and Jenny aim to transform the old home into an up-to-date space where they can enjoy the views for years to come."
      },
      {
        "id": "tvmaze:2771215",
        "title": "Marrs Family Farmhouse Renovation",
        "season": 5,
        "episode": 16,
        "released": "2024-03-05",
        "overview": "It's a mix of emotions as the Marrs take on a special renovation of their own family farmhouse. Dave and Jenny face the unexpected and embrace some big changes as they prepare to say goodbye to the old home and adjust to their new space."
      },
      {
        "id": "tvmaze:3066680",
        "title": "Massive Brick House Makeover",
        "season": 6,
        "episode": 1,
        "released": "2025-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3083094",
        "title": "Fresh Spin on a Family Home",
        "season": 6,
        "episode": 2,
        "released": "2025-01-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3083095",
        "title": "Modern Reno for Family",
        "season": 6,
        "episode": 3,
        "released": "2025-01-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3115759",
        "title": "Overnight Overhaul",
        "season": 6,
        "episode": 4,
        "released": "2025-01-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3115760",
        "title": "Midcentury Dreams Come True",
        "season": 6,
        "episode": 5,
        "released": "2025-02-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3115761",
        "title": "Midcentury Masterpiece",
        "season": 6,
        "episode": 6,
        "released": "2025-02-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3115762",
        "title": "Lake House Retreat Reno",
        "season": 6,
        "episode": 7,
        "released": "2025-02-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3145087",
        "title": "Rebuild After the Storm",
        "season": 6,
        "episode": 8,
        "released": "2025-02-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3145088",
        "title": "A Forever Family Home",
        "season": 6,
        "episode": 9,
        "released": "2025-03-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3145089",
        "title": "Lakeside Motel Overhaul",
        "season": 6,
        "episode": 10,
        "released": "2025-03-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3145090",
        "title": "Race To Renovate for Check-In",
        "season": 6,
        "episode": 11,
        "released": "2025-03-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3145091",
        "title": "First Home Gets a Modern Makeover",
        "season": 6,
        "episode": 12,
        "released": "2025-03-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3180935",
        "title": "Starting Over After the Storm",
        "season": 6,
        "episode": 13,
        "released": "2025-04-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3180936",
        "title": "Transforming a Tornado Ravaged Home",
        "season": 6,
        "episode": 14,
        "released": "2025-04-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3405625",
        "title": "Fix This Tornado-Hit Home",
        "season": 7,
        "episode": 1,
        "released": "2025-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3436545",
        "title": "Fix This Rundown Rental",
        "season": 7,
        "episode": 2,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3436546",
        "title": "Fix This Chaotic Cabin",
        "season": 7,
        "episode": 3,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3456149",
        "title": "Fix This $5K Cabin",
        "season": 7,
        "episode": 4,
        "released": "2025-12-23",
        "overview": ""
      }
    ]
  }
}