{
  "meta": {
    "id": "tvmaze:50551",
    "type": "series",
    "name": "HOT ROD Garage",
    "description": "Tony Angelo and Lucky Costa host a project build show that has all the tips, tricks and wrenching you would expect from the crew at Hot Rod Magazine.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/491/1229457.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/491/1229457.jpg",
    "videos": [
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3446045",
        "title": "The Dodge Utiline Re-Rescue",
        "season": 12,
        "episode": 8,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:1933168",
        "title": "Draguar Engine Swap, El Camino 4L60-E Trans Install & More!",
        "season": 1,
        "episode": 1,
        "released": "2014-05-22",
        "overview": "HOT ROD Garage, presented by Lincoln Tech, is the new show from HOT ROD Magazine with host Mike Finnegan and guest David Freiburger of HOT ROD and the Roadkill series here on the Motor Trend Channel. In this very first episode, we have fun showing you how to install a 4L60-E overdrive transmission into a 1969 Chevy El Camino, drop a 700hp blown small-block into a 1974 Jaguar XJ12, get TIG welding lessons from the guys at ToxicFab, and do smoky burnouts at every opportunity. We have tips from Lincoln Tech, Gumout, and Duplicolor. There's dragstrip testing, a live punk band, bad jokes, great parts, and lots of inside info into the cars that have appeared on Roadkill. Check out HOT ROD Garage every month for the tips, tricks, and wrenching that you've come to expect from the crew at HOT ROD Magazine."
      },
      {
        "id": "tvmaze:1933169",
        "title": "Supercharging a 5th Gen Camaro the Hemi Chevy Gasser Gets a Fuel System",
        "season": 1,
        "episode": 2,
        "released": "2014-06-19",
        "overview": "In this episode of HOT ROD Garage presented by Lincoln Tech, Finnegan blows up the stock clutch in a borrowed 2010 Camaro SS at the drag strip after installing an SLP supercharger kit and a pair of drag radials. The blower pushed the power output from 420 to 575 horsepower and except for a couple extra holes in the valance, bolted-right onto the stock LS2. During the Roadkill Project Car Update presented by Dickies, Freiburger and Finnegan prepare for the ultimate cross-country road trip in Finnegan's Hemi-powered Bel Air Gasser with the installation of an Aeromotive Stealth fuel tank and fuel system. The install offers tips on assembling soft and hard fuel lines, relay wiring, and gives a closer look at this righteous street/strip car. Finally, the guys answer viewer questions about the cars, the show, and their personal lives before getting an in-depth look at custom piston design from Bryan Moreland, Engineering Manager at CP-Carrillo."
      },
      {
        "id": "tvmaze:1933170",
        "title": "Easy Big-Block Chevy Power Upgrades Plus Sheet Metal Beadrolling Tips",
        "season": 1,
        "episode": 3,
        "released": "2014-07-17",
        "overview": "On this episode of HOT ROD Garage Presented by Lincoln Tech Mike Finnegan gets tips for strengthening sheet metal using a bead roller from world-famous fabricator, Jamey Jordan, owner of Handmade Seat Company. Then he and David Freiburger eliminate a few electrical gremlins in the Roadkill '73 Chevy C30 ramp truck and pick up more power on the dyno by replacing the old quadrajet carburetor with a new Holley Ultra Street Avenger and the stock HEI distributor with a new part from MSD. Finally, Freiburger tests Duplicolor's Vinyl and Fabric Coating, a spray-on dye for restoring interior parts. If you aren't sick of their faces by the end of this episode, stick around to watch the duo answer questions from the Hot Rod Garage Facebook page and insult a good portion of the Motor Trend staff."
      },
      {
        "id": "tvmaze:1933171",
        "title": "Wilwood Brakes for the Roadkill El Camino and Sand Casting Hot Rod Parts!",
        "season": 1,
        "episode": 4,
        "released": "2014-08-07",
        "overview": "On this episode of Hot Rod Garage Presented by Lincoln Tech, Kirk Brown stops by the shop to school us on the art of sand casting traditional hot rod parts. From flip-top gas caps to old-school friction shocks, Kirk creates parts that turn vintage iron into period-correct hot rods under his Crafty-B moniker. Finnegan also drives the infamous Roadkill 69 El Camino to Camarillo airfield to find out how badly the factory brakes perform and then Wilwood Brakes gives the Elco a serious binder upgrade. The Elco is fitted with 11-inch disc brakes at all four-corners and tested to see how much the stopping distance is affected. Next a monster set of 14-inch discs and six-piston calipers are swapped onto the car for the ultimate brake upgrade. How well do the new parts work? Stay tuned and find out! Oh yeah, Finnegan and Freiburger also take a break from wrenchin to answer viewer questions posed on the Hot Rod Garage Facebook page."
      },
      {
        "id": "tvmaze:1933172",
        "title": "Muscle Truck Revamp on a 1974 Chevrolet C10!",
        "season": 1,
        "episode": 5,
        "released": "2014-09-04",
        "overview": "On this episode of Hot Rod Garage Presented by Lincoln Tech we revamp the Muscle Truck, our 1974 Chevrolet C10. In episode 28 of Roadkill we ripped the stepside fenders off the bed and cut the front sheet metal to make room for aggressive off-road rubber so that we could roost through the Imperial Sand Dunes. The fenderless version of the Muscle Truck was fun but it's high time we restore the truck to her former glory. We'll replace the rapidly deteriorating particle board bed floor with new oak slats and bolt-on a new pair of aftermarket front fenders. We'll also add a bit of functionality to the truck by covering the massive step notch in the rear frame rails with sheet metal, which will keep stuff from falling out of the bed. As usual, Finnegan and Freiburger will answer viewer questions pulled from our Facebook page and Lincoln Tech instructors and students will drop a bit of knowledge in a"
      },
      {
        "id": "tvmaze:1933173",
        "title": "Budget-Minded Muscle Car Suspension Upgrades!",
        "season": 1,
        "episode": 6,
        "released": "2014-10-02",
        "overview": "On this episode of Hot Rod Garage Presented by Lincoln Tech, we turn a lowridin' 1965 Pontiac LeMans into a corner-carving muscle car with a budget-minded suspension system, a quick-ratio steering box, and disc brakes. Classic Performance Products supply the parts, which bolt in place and result in dramatic improvements to the handling of Hot Rod Magazine staffer Brandan Gilllogly's car. Once the LeMans is sorted we work on our 1973 Chevy Ramp Truck during a Dickies Roadkill Project Car Update. The electrical system has seen better days and so we play detective to trace a battery drain and replace both batteries with new units from AC Delco. We wrap up this episode with a question and answer session with Mike Finnegan and David Freiburger as they ponder the mysteries of the universe and cars in general."
      },
      {
        "id": "tvmaze:1933174",
        "title": "Bolt-On Overdrive for the Hemi-Powered Super Bee!",
        "season": 1,
        "episode": 7,
        "released": "2014-10-30",
        "overview": "On this episode of Hot Rod Garage, presented by Lincoln Tech, we catch up with David Freiburger's Hemi-powered Dodge Super Bee project car as it gains a much needed fourth gear and a few more in between in its three-speed 727 trans. During the Dickies Roadkill Project Car Update we bolt-on a Gear Vendors Underdrive/Overdrive unit onto the Torqueflite, which results in lower cruising RPM, better fuel economy, and gear-splitting capability. Plus, we've got another Q-and-A session with Finnegan and Freiburger as they discuss road trips, muscle cars and of course, Carlos Lago's ability to drive a car."
      },
      {
        "id": "tvmaze:1933175",
        "title": "Nitrous Fogger Install on the Crusher Camaro!",
        "season": 1,
        "episode": 8,
        "released": "2014-11-27",
        "overview": "On this episode of Hot Rod Garage, Presented by Lincoln Tech, we've got a brand-new Dickies Roadkill Project Car Update on the Crusher Camaro. Freiburger installs a single stage nitrous oxide system from NOS onto the Mast Motorsports LS7 to break the car into 9-second territory at the dragstrip. He also re-geared the 9-inch rear end, changed the transmission from a 4L65E to a 4L80E, and swapped converters. Off the bottle, the car slowed down from its previous best pass of 10.03 seconds, but with the go-button in play the car ran a respectable 9.94 ET. Finnegan also dropped by the garage for a new Q –and-A session and we've got a brand new quick tip from the staff of Lincoln Tech."
      },
      {
        "id": "tvmaze:1933176",
        "title": "Blasphemi, Burnouts, and FAST XFI 2.0 EFI Tuning!",
        "season": 1,
        "episode": 9,
        "released": "2014-12-18",
        "overview": "After a last-minute thrash to assemble Mike Finnegan's '55 Chevy Bel Air, it famously cruised from Los Angeles to Charlotte, North Carolina, to attend the start of Hot Rod Power Tour 2014. The summertime road trip revealed the good and bad traits of the street-legal gasser and now it's time to exorcize some of its demons. On this episode of Hot Rod Garage Presented by Lincoln Tech, the crew tunes the FAST XFI 2.0 electronic fuel injection system for wide-open throttle performance, lowers the front suspension, adds a pair of Viking adjustable dampers, and installs a Hurst Roll Control line lock for better burnouts. Then Finnegan takes to the drag strip to find out how well the car performs on the same wore-out pair of Firestone Cheater Slicks that he drove cross-country on. In the Q &amp; A session, Freiburger and Finnegan discuss vintage Mustang Sportroofs, old Roadkill project cars, the F-Bomb Camaro, and of course, the staff of Motor Trend."
      },
      {
        "id": "tvmaze:1933179",
        "title": "GM A-Body Suspension Upgrades on a 1969 El Camino!",
        "season": 1,
        "episode": 10,
        "released": "2015-01-08",
        "overview": "On this episode Hot Rod Garage Presented by Lincoln Tech we revamp the suspension on our 1969 Chevy El Camino to turn this lowly hauler into a real corner-carver. The crew from Ridetech not only helped swap out the old mismatched suspension and steering components, but gave us a couple of shock-tuning tricks. The Elco received new triple-adjustable dampers, front and rear sway bars, adjustable control arms, and coilover shocks at all four-corners. We've also got new tech tips from Lincoln Tech and AC Delco and a brand-new question and answer session with Freiburger and Finnegan."
      },
      {
        "id": "tvmaze:1933177",
        "title": "The Ultimate Bolt-In Chevy LS3 Engine Swap",
        "season": 1,
        "episode": 11,
        "released": "2015-01-22",
        "overview": "On this episode of Hot Rod Garage, Presented by Lincoln Tech, we round out a season of El Camino upgrades with a big heart transplant. Gone is our old 383ci Small-Block and in its place is Chevrolet Performance' LS376/525 an all-aluminum, fuel-injected, crate engine that is probably underrated at 525hp and 475 lb-ft of torque. Using parts from Hooker, Aeromotive, Holley, Gearstar, Flex-A-Lite, and Chevrolet Performance, the swap only requires a few holes drilled and a bit of exhaust pipe fitting to make happen. In the end, our 1969 El Camino lost some weight and reset the track record on our autocross course. In this episode we also have a new Lincoln Tech Quick Tip and another Q &amp; A session with Finnegan and Freiburger."
      },
      {
        "id": "tvmaze:1933178",
        "title": "1,225 Horsepower Engine 711 ci Sonny Leonard Chevy Hemi!",
        "season": 1,
        "episode": 12,
        "released": "2015-01-29",
        "overview": "On this episode of Hot Rod Garage, presented by Lincoln Tech, Mike Finnegan journeys to Sonny Leonard Racing Engines in Lynchburg, Virginia to help assemble his new engine, a 771ci Big-Block Chevy topped with Hemi heads, which is primed to produce ridiculous pump-gas horsepower and torque. This all-aluminum, rule-injected beast is built with parts from Brodix, CP-Carillo, ARP, Sonny Bryant, Trend, Holley, and Accufab and weighs just 595 pounds. Once assembled, Sonny dyno-test the engine to verify the power output on 92 octane gasoline before shipping it home to Mike so he can fab a turbo kit for even more power. We've also got a brand new Lincoln Tech Quick Tip and the last Q&amp;A session of Season 1 with Finnegan and Freiburger."
      },
      {
        "id": "tvmaze:1933180",
        "title": "2005-2009 Mustang Lowering and Braking on a Budget",
        "season": 2,
        "episode": 1,
        "released": "2015-02-26",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech we're kicking off 2015 with a new project car, the EBC Brakes 2005 Mustang GT. Our plan for this car is simple: build an S197 Mustang with easy bolt-on parts to answer all the basic questions we read on every Mustang forum on the Internet. Our goal is to have an affordable daily driver that can also handle a weekend autocross or open-track day. Here in the first installment, we're lowering the car as affordably as possible with Ford Racing K springs, telling you the exact wheel and tire specs for a perfect fit, and making it stop more reliably with EBC Brakes stock-replacement rotors and Yellowstuff pads. Best of all, we test the performance once we're done. Come back to HOT ROD Garage in coming episodes to see more on the EBC Brakes Mustang."
      },
      {
        "id": "tvmaze:1933181",
        "title": "Ford Racing Cold Air Test for 2005-2009 Mustang GTs",
        "season": 2,
        "episode": 2,
        "released": "2015-03-12",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, we look at the EBC Brakes 2005 Mustang GT project car. This is based on the premise that the '05-'10 Mustangs with the 4.6L three-valve V8s have gotten affordable to drive, and they can be hopped up inexpensively and easily, and they make make a fun daily drivers and occasional auto-crossers or open-track cars. In this episode, we're looking for a little more power. The 4.6 three-valves need a lot of work if you plan to make big power, and in that case you should look for a power adder like a blower or nitrous. With or without a power adder, long-tube headers are one of the best add-ons for these engines, but those are illegal in many areas. That's why, for the EBC Brakes Mustang, we decided to keep it as simple as possible. We installed a Ford Racing cold-air kit and an SCT custom tune, and made surprisingly good power at the wheels. We will also let you hear the difference in sound between JBA mufflers and Ford Racing FR500S mufflers. The air box tested here is the same type used on 2008 Mustang Bullitts from the factory. It fits '05-'09 Mustang GTs, but not 2010s due to the change in body style that year. The part number of the cold air kit alone is M-9603-M463. The kit that includes the cold air setup plus the required custom tune in a handheld device is M-9603-GTB."
      },
      {
        "id": "tvmaze:1933182",
        "title": "Struts, Sway Bars & More! 2005-2009 Mustang Handling Upgrades",
        "season": 2,
        "episode": 3,
        "released": "2015-03-26",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, we jump back into the suspension of our EBC Brakes 2005 Mustang GT, with a complete handling package from Ford Performance Racing including full front strut assemblies, sway bars, pan- hard bar, and more. We also install and explain why the addition of caster/camber plates and a strut tower brace is easy and extremely beneficial towards this application."
      },
      {
        "id": "tvmaze:1933183",
        "title": "2005-2009 Mustang Dress-Ups",
        "season": 2,
        "episode": 4,
        "released": "2015-04-09",
        "overview": "On this episode it's the final installment of the EBC Brakes 2005 Mustang project car, we get it ready to stand out in traffic and throw in a Dana Performance one-piece aluminum driveshaft. Eagle 1 comes in to show us a really cool new clay mitt, which works like a clay bar but is much faster and easier. You'll also see how to install vinyl tape stripes without loading them full of bubbles. We'll wrap with an extra long question and answer session with Mike Finnegan and David Freiburger of Roadkill."
      },
      {
        "id": "tvmaze:1933184",
        "title": "1970 SS Chevelle Undercover HT502 Build",
        "season": 2,
        "episode": 5,
        "released": "2015-04-23",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, we're welcoming a new project car to the show, a 1970 Chevelle that we're building for the owner of OPG. Original Parts Group sells just about everything you'd need to restore one of these to factory specifications but we are gonna put our own spin on things and hide a fuel-injected HT502 in the engine bay disguised as a 454 LS6. When we're finished we'll have a car that has all the classic looks of a 1970's muscle car with the power and reliability that you could have only dreamed of 45 years ago. Watch our new host pro-drifter and stunt driver Tony Angelo work with OPG's own Jorge Lopez to transform this modern crate engine into a lookalike original big-block. Come back to HOT ROD Garage in coming episodes to see more on the OPG Chevelle."
      },
      {
        "id": "tvmaze:1933185",
        "title": "630 Horsepower Chevy Van LS Swap!",
        "season": 2,
        "episode": 6,
        "released": "2015-05-07",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech we take our well-used 1974 Chevrolet delivery van and start the process of stuffing it full of Lingenfelter Performance LS7 goodness! We are going to turn this rusty T-shirt delivery van into an MSD Atomic Surf van that will now deliver 650 HP! David will explain the process of shoehorning a modern dry-sump LS7 into the place of the original carb'd 6 cylinder Once we get this van running and ripping, David and Mike will be driving it across the US for HOT ROD Power Tour 2015. For Q and A, new host Tony Angelo and David Freiburger discuss Tony's Hot Rod roots, professional drifting, and wild times growing up in PA."
      },
      {
        "id": "tvmaze:1933186",
        "title": "1974 Chevy Van: Body Repair and Quick Paint!",
        "season": 2,
        "episode": 7,
        "released": "2015-06-04",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech David Freiburger and Tony Angelo will show you how to get the most out of an affordable paint job. Our hosts will run through what to expect from a Maaco paint job, and what you can do before and after paint to really maximize your finished product. We've taken our rusty, banged up 1974 Chevy Panel Van and turned it into a sleek, less banged up Red Rocket! The MSD Atomic Surf Van looks ready to roll on Hot Rod Magazine Power Tour 2015!"
      },
      {
        "id": "tvmaze:1933187",
        "title": "1970 OPG HT502 Chevelle, First Fire then Smoke! (Tire Smoke)",
        "season": 2,
        "episode": 8,
        "released": "2015-06-18",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, Tony Angelo installs a cleverly disguised HT502 into the Original Parts Group 1970 Chevelle https://www.opgi.com/70chevelle/ and gets it running for the first time! Then it's off to the drag strip to see what this thing can do. This big block powered beast does not disappoint and Tony has a blast trying to keep this thing from spinning tires everywhere!"
      },
      {
        "id": "tvmaze:1933188",
        "title": "630 Horsepower LS7 Swap: Our Chevy Van Runs!",
        "season": 2,
        "episode": 9,
        "released": "2015-07-02",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, We've been working on installing a 630-horsepower Lingenfelter LS7 in our 1973 Chevy Van, and in this episode we finally fire it up! We will show you some of the final details of the installation, including the Gearstar 4L80e transmission and MSD Atomic EFI and trans controller."
      },
      {
        "id": "tvmaze:1933189",
        "title": "Atomic LS7 Van Rear-Axle How-To and Drag Test!",
        "season": 2,
        "episode": 10,
        "released": "2015-07-16",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, we've been working on installing a 630-horsepower Lingenfelter LS7 in our 1973 Chevy Van, and in this episode we install the Moser 12 Bolt Chevy Rear End and show you how to order your own custom rear axle. We cover EVERY detail of the install so get ready for some serious tech in this episode. After the install, we take the MSD Atomic Surf Van to the drag strip and make a bunch of tire smoke and several passes down the track… so stay tuned to the end to find out the E.T's."
      },
      {
        "id": "tvmaze:1933190",
        "title": "1970 Chevelle HT502 Limited Slip Differential Upgrade and Dragstrip Runs!!",
        "season": 2,
        "episode": 11,
        "released": "2015-07-30",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, we try to get all the power from our HT502 Chevelle to the ground! Watch Tony Angelo take you step by step detailing a complete rear end overhaul and upgrade. Watch as we take our old, beat up 2.73 open-diff rear and install all new everything including 3.73 ring and pinion gears, Auburn Cone-type LSD, new axles, bearings and seals, turning it into a proper high performance rear. Once it's all together, we head back to the dragstrip at California Speedway to see just how much faster this Chevelle can go!"
      },
      {
        "id": "tvmaze:1933191",
        "title": "1970 Chevelle HT502 Suspension and Brake Upgrades Plus Autocross Run!",
        "season": 2,
        "episode": 12,
        "released": "2015-08-21",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, we finish up the build on the OPG Chevelle. Starting with interior upgrades, https://www.opgi.com/70chevelle/ we install a brand new Supersport dash upgrade, and add a Vintage Air conditioning system to keep things cool. Next we head underneath the car, and revamp the entire braking and suspension systems with the best that Hotchikis and Wilwood have to offer! Once it's all done, watch Tony Angelo push this Chevelle hard around our Autocross course, and compare it to stock form! Stay tuned for a Q and A with the Roadkill guys!"
      },
      {
        "id": "tvmaze:1933192",
        "title": "1973 Dodge D200 Diesel 12V Cummins Swap! Meet RollSmokey!",
        "season": 3,
        "episode": 1,
        "released": "2015-09-03",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, we try something new, our first Diesel Swap! Watch us take our 1973 D200 with a badly shaking 400 BB, yank it out and cram a 1995 Ram 2500 Dodge Diesel Turbo drivetrain into it! We cover the teardown of both trucks, and bring in guest fabricator Colin Jones to handle making beautiful custom mounts. We don't stop until we see some smoke! We call our creation #Roll Smokey!"
      },
      {
        "id": "tvmaze:1933193",
        "title": "Rollsmokey Hits The Dyno (With Tons of Torque!)",
        "season": 3,
        "episode": 2,
        "released": "2015-09-10",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, watch Tony Angelo finish up his 1973 Dodge D200 Cummins Swap. With the help of special guest Brenden Jones, they turn this project into a coal spewing monster, with lots of power boosting upgrades along the way. They install a big turbocharger, larger injectors and more in the hopes of doubling the power output of the engine. Once together, they run #rollsmokey on the Dyno to see if they hit their goals!"
      },
      {
        "id": "tvmaze:1933194",
        "title": "1971 Dodge 340: Summoning the Demon",
        "season": 3,
        "episode": 3,
        "released": "2015-09-24",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, Tony Angelo shows you how to bring a long-forgotten car back to life. Tony demonstrates with his first car, a 1971 Dodge Demon 340, that hasn't been on the road in nearly 20 years. We start by inspecting and changing all the necessary fluids, then cover the fuel and oiling systems, engine evaluation, and what to do after the engine is running. Following this step-by-step guide, you'll (hopefully) have that old junker up and running in no time!"
      },
      {
        "id": "tvmaze:1933195",
        "title": "1971 Demon 340: Monster Suspension Upgrades!",
        "season": 3,
        "episode": 4,
        "released": "2015-10-10",
        "overview": "On this episode of HOT ROD Garage, presented by Lincoln Tech, watch Tony Angelo and some friends install a completely new and upgraded suspension by Qa1 into his classic 1971 Dodge Demon340. Full tubular subframe and control arms in the front, and Qa1's new radical bolt-in 6link rear coilover suspension system! Catch up on the engine revival drama as well, bad things have happened! We cap it all off with some big fun in #Rollsmokey."
      },
      {
        "id": "tvmaze:1933196",
        "title": "Fabrication 101: Cut, Grind, Weld, BUILD!!",
        "season": 3,
        "episode": 5,
        "released": "2015-10-29",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln tech, we deliver the basics of Fabrication! You've seen us build all sorts of things in the HOT ROD garage; engine mounts, exhausts, brackets, etc. But we've never really addressed how we manage to build these things. With some basic fabrication skills and a small set of tools, you can open up a world of possibilities in Hot Rod builds. Tony Angelo and special guest Colin Wolf show you how to use these skills, as they build a cool modular fixture table for use in the HOT ROD GARAGE shop. School is in session!"
      },
      {
        "id": "tvmaze:1933197",
        "title": "Greemon 340 Mopar Small-Block Autopsy",
        "season": 3,
        "episode": 6,
        "released": "2015-11-13",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln tech we dig into the seized 1971 340 Engine from our #Greemon340 project. Watch Tony Angelo and Lucky Costa investigate the dead engine for signs of failure and damage. A complete tear-down and analysis of this engine shows why the 340 stopped running, and it's going to live again!"
      },
      {
        "id": "tvmaze:1933198",
        "title": "LS1 Swapped Rx-7 Build and Blast #Iammarklenardon",
        "season": 3,
        "episode": 7,
        "released": "2015-11-26",
        "overview": "Earlier this year, the Motor Trend family lost one of it's own, Mark Lenardon in a tragic motorcycle accident. Mark left behind an Rx-7 that he was in the processing of swapping in a 1999 Camaro LS1 and t56. Watch Tony Angelo, and some of Mark's best buds come together and furiously work to turn this pile of parts into a running, driving, drifting machine! Once running, we hit the track, and let this Rx-7 scream! #iammarklenardon."
      },
      {
        "id": "tvmaze:1933199",
        "title": "Crusher Camaro Complete Suspension Upgrade and Record-Breaking Test Times!",
        "season": 3,
        "episode": 8,
        "released": "2015-12-10",
        "overview": "On this episode of Hot Rod Garage presented by Lincoln Tech, we take a Hot Rod institution, The Crusher Camaro. We turn it from a jacked-up drag racer to an autocross ripper and take down the HRG test track record in the process! Special Guest David Freiburger and Host Tony Angelo install everything that Qa1 makes for the first generation F-body car, and a few others things as well."
      },
      {
        "id": "tvmaze:1933200",
        "title": "#Greemon340 Rear End Upgrades, Fresh Rubber and Back on the Streets!",
        "season": 3,
        "episode": 9,
        "released": "2015-12-24",
        "overview": "Tony Angelo Bought his 1971 Dodge Demon 340 in 1995 and it has sat dormant since 1997. To get the #greemon340 going in Hot Rod Garage style, we refreshed the engine, installed a full QA1 Suspension system, convert the front brakes to power discs, but that wasn't enough. In this episode of Hot Rod Garage presented by Lincoln Tech, watch Tony install upgraded Moser Axles, measure for new wheels and tires, and then take the #greemon340 out on the Malibu canyon roads and relive his high school dreams!"
      },
      {
        "id": "tvmaze:1933201",
        "title": "#Rollsmokey 12V Cummins Low and Not At All Slow!!",
        "season": 3,
        "episode": 10,
        "released": "2016-01-07",
        "overview": "In this episode of Hot Rod Garage, presented by Lincoln Tech, we've got #Rollsmokey, our 12 V Cummins Turbo Diesel swapped 1973 D200, back in the shop for a complete handling overhaul.  To deal with the  750+ft lbs of torque from the Cummins engine, we had to upgrade the Dana 60 rear-end with a Detroit Truetrac, and longer 3.54 gears, to make it handle we upgraded all the suspension bushings to polyurethane, installed a quick-ratio steering gearbox, and replaced all the bushings and joints with fresh parts. To finish it off, a set of Heavy-duty shocks, and clipped 1-ton springs were installed to get a lowered street-machine stance. Watch Tony Angelo abuse this truck before and after upgrades in a tire-melting thrash session!"
      },
      {
        "id": "tvmaze:1933202",
        "title": "1966 LS Powered Chevelle Mini-Tub Install & Burnouts!",
        "season": 3,
        "episode": 11,
        "released": "2016-01-21",
        "overview": "Lucky Costa – \"I'm hard-pressed to pick a favorite. Working with David on the Msd Atomic Van in ep. 21 was a good time.  Also, the trip to Colorado and building the Cummins powered Cadillac (bro-hammer) in the junkyard was a lot of fun, however that wasn't HRG. More recently I enjoyed building the Crownhick in ep. 49 especially after hours completing the job off camera and of course I was forced to drive it around for a week or so just to make sure everything was working.  But, if I really had to pick, I'm guessing my favorite would be between ep. 44 the Fury Road master episode - taking a family station wagon and turning it into a fun driver, and episode 35 - mini tubbing my 66 Chevelle...... Yeah, ok, that's the one I'm going with, Ep 35.  Hanging out with friends and working on my own car is pretty much the perfect way to spend the week.  Yours Truly....... Lucky\""
      },
      {
        "id": "tvmaze:1933203",
        "title": "Hidden Horsepower - Carb vs EFI: Where Does the Power Hide?",
        "season": 3,
        "episode": 12,
        "released": "2016-01-28",
        "overview": "Which home-tuned system is hiding more horsepower, a traditional carburetor, or a Holley Electronic Fuel Injection system? Find out in this episode of Hot Rod Garage presented by Lincoln Tech! Watch Tony Angelo turn screws on his 4bbl Carb'd 1971 Dodge Demon 340 while Lucky sits back and let's his Holley HP EFI system work it's own magic on his LQ9 '66 Chevelle. After the home-tunes we take the Demon and Chevelle over to the experts at Westech Performance, strap them down, and let the dyno-tuners show us the real potential of these cars!"
      },
      {
        "id": "tvmaze:1933204",
        "title": "Low-Buck Speed Project! LS Swapped 1979 Camaro! #Bonemaro",
        "season": 4,
        "episode": 1,
        "released": "2016-02-11",
        "overview": "Tony Angelo - \"This is my favorite episode because the topic is such a timeless theme in Hot-Rodding. How fast can you go on a budget?! It's something that everyone has worked towards since the very first days of modifying cars, and as some of the go-fast technology becomes more affordable, the cheapest way to go fast changes every few years. This episode also marked my version of the HRG show really hitting its stride. With Bonemaro part 1, our format changed from 11 to 22 minutes, episodes got more fun with the addition of a Co-host in Lucky Costa, and we were afforded the ability to pick some really fun content. All of that combined to deliver the first HRG to have over a million views since I took over the show. Bonemaro continues to be a project people ask me about regularly and it will be a favorite for a long time to come. TA\""
      },
      {
        "id": "tvmaze:1933205",
        "title": "Cheap V-8 Turbo Build! LS-Turbo #Bonemaro!",
        "season": 4,
        "episode": 2,
        "released": "2016-03-11",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, we take our low-buck drag project, #bonemaro, upgrade the engine for boost, and build a turbo system using the best ebay has to offer! Using a CX racing turbo kit designed for a truck, some parts from Craigslist, and a ton of elbow grease, Tony and Lucky work to get the Camaro boosted and ready for action. Once on the dyno, the #bonemaro makes over more than 500WHP 500 hp on mild boost, - more than enough to propel this thing to some wicked fast times on the track!"
      },
      {
        "id": "tvmaze:1933206",
        "title": "512 Cubic-Inch Stroker Sleeper Wagon! #Furyroadmaster",
        "season": 4,
        "episode": 3,
        "released": "2016-04-07",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, we set out to build a good old-fashioned sleeper! We found a very innocent-looking and long-forgotten 1965 Plymouth Fury III wagon and began to revive the old Mopar 400 big-block from Rollsmokey. Watch Tony and Lucky take that shaky, low-compression 400, strip it to the block, and rebuild it into a 512ci stroked beast! After the new 512 big-block gets stuffed into the #furyroadmaster, it's time to hit the streets for some fun!"
      },
      {
        "id": "tvmaze:1933207",
        "title": "Budget Turbo V-8 Drag Times! #Bonemaro Hits the Track!!!",
        "season": 4,
        "episode": 4,
        "released": "2016-05-05",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, we finally see what kind of times we can hit with our dirt-cheap 1979 Turbo Camaro, #bonemaro! First we spend the rest of our 10k USD budget to get all 530 whp to the pavement. Tony and Lucky install subframe connectors, drag shocks, slapper bars, and a mini-spool on the car before hitting the track!"
      },
      {
        "id": "tvmaze:1933208",
        "title": "Blown '57 Chevy! Project X Returns with a 6-71 Blown Small-Block!!",
        "season": 4,
        "episode": 5,
        "released": "2016-06-02",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, we get our hands on a hot-rodding icon, Project X! In 1965, Popular Hot Rodding purchased an unremarkable 1957 Chevy 210 and began a 50-build legacy using it as a testbed for every hot, new part. It's been sitting for years with a Pro Touring look and fuel-injected big-block, so we decided it was time to take it back to its roots! Watch Project X get a nasty LSX 376 GM Performance crate engine with a Weiand blower and two proper Holley carburetors!"
      },
      {
        "id": "tvmaze:1933209",
        "title": "Blueprint for Horsepower! Crusher Camaro Gets a 427ci Supercharged LS Swap!",
        "season": 4,
        "episode": 6,
        "released": "2016-06-30",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, it's time for the Crusher Camaro to get a serious powerplant upgrade! The old, borrowed, tunnel-ram LS engine has to be returned to its rightful owner, so we're using this opportunity to cram some big power into it! Watch Tony Angelo and Lucky Costa install a monstrous Magnuson supercharged Blueprint Engines-built 427 LS in the Crusher. The new setup makes 708 whp and 770 whtq, which Tony tries to wrangle at the Famoso Raceway dragstrip!"
      },
      {
        "id": "tvmaze:1933243",
        "title": "1957 Chevy Suspension Upgrades! Project X Gets the Full QA1 Treatment",
        "season": 4,
        "episode": 7,
        "released": "2016-07-28",
        "overview": "In this episode of HOT ROD Garage presented by Lincoln Tech, watch Tony Angelo and Lucky Costa perform a complete suspension upgrade on the most iconic 1957 Chevy of all time- Project X! The guys also execute an exterior transformation to make X look like it did in the '80s!"
      },
      {
        "id": "tvmaze:1933210",
        "title": "Tire Killer! '66 Fury Wagon! Big-Block Stroker Wagon Gets Big Power!",
        "season": 4,
        "episode": 8,
        "released": "2016-08-25",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, we decide to upgrade all the necessary things to make our 1966 Fury Wagon (which is housing a 512ci V-8) safe. Watch Tony Angelo and Lucky Costa install 4 Piston disc brakes, an upgraded transmission, and axles to handle the power of our big-block Mopar. Once that's sorted and she's a reliable driver, we turn the power way up with cylinder heads, an intake manifold, a header, and a big, new Holley carburetor-just to make sure this car is still way out of control! Once we're done, watch Tony literally tear the tires off the #furyroadmaster in our most epic testdrive ever!"
      },
      {
        "id": "tvmaze:1933211",
        "title": "Hot Rod Roundup! HRG Project Cars in Drag Race Competition!",
        "season": 4,
        "episode": 9,
        "released": "2016-09-29",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, our hosts Tony Angelo and Lucky Costa take the HRG project cars from last season and drag race them against each other! We've got the Bonemaro, Project X, Rollsmokey, Furyroadmaster, Lucky's Chevelle, and Tony's Demon 340! First, we've got to get them all track ready, and that means fitting new brakes and 15-inch wheels and tires on the Project X-and the Bonemaro and Lucky's Chevelle each get drivetrain upgrades! See which is the fastest!"
      },
      {
        "id": "tvmaze:1933212",
        "title": "Drift `Cuda! Meet Project FishTail!!",
        "season": 4,
        "episode": 10,
        "released": "2016-10-27",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, host Tony Angelo unveils a new passion project. Coming from a Hot Rod upbringing that turned into a career as a professional drift racer, Tony is building a 1972 Cuda, dubbed \"Fishtail,\" into a Drift Muscle car to be featured at the 2016 SEMA show. This first FishTail episode covers the design and fabrication of a completely custom suspension system using a full inventory of QA1 parts and supplies. Watch Tony and cohost Lucky Costa turn this Cuda into a sideways-handling monster!"
      },
      {
        "id": "tvmaze:1933213",
        "title": "6.4 Hemi Crate Engine Swap! Drift `Cuda Gets Modern Hemi Power!",
        "season": 4,
        "episode": 11,
        "released": "2016-11-24",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, our Drift Project, a 1972 Plymouth `Cuda, gets a serious drivetrain for the kind of sideways action we want out of this car! Watch Tony Angelo and Lucky Costa install the brand-new Mopar Performance 392 Crate Hemi kit and a Tremec T56 Magnum six-speed into project FishTail. As part of a six-week build to unveil the car for SEMA, the guys are hustling to turn this barn find into a track monster!"
      },
      {
        "id": "tvmaze:1933214",
        "title": "Drift 'Cuda Hits the SEMA Show and Then the Track!! #fishtailcuda",
        "season": 4,
        "episode": 12,
        "released": "2016-12-22",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, watch hosts Tony Angelo and Lucky Costa complete the hustle of all hustles to get the 1972 'Cuda drift car, Fishtail 'Cuda, to the SEMA show on time! With less than a month before the event, there's still paint and bodywork to be done-and a complete rebuild of the car. Building a custom car from a barn-find in six weeks is hard enough. Watch as limited shop time, parts mix-ups, and even a flood in Los Angeles try to keep the guys down! Will it make it?! Watch and find out! After the SEMA show, Tony takes the 'Cuda to his home track, Englishtown Raceway Park for a little tire-burning testing!"
      },
      {
        "id": "tvmaze:1933215",
        "title": "Ford Truck / Cop Car Body Swap!",
        "season": 5,
        "episode": 1,
        "released": "2017-03-23",
        "overview": "Hot Rod Garage Presented by Lincoln Tech, is back with a brand new season! Out of all the cool projects they built last year, there was still one important thing missing: a shop truck. Tony and Lucky went out and bought a 1966 Ford F100, but it's a total dog and really a slouch of a truck. So the guys also got their hands on a 2007 Crown Victoria cop car from the guys at cruiser connections. Why? Because it's built on an incredible platform with a ton of modern components. In this episode they show how to perform the ultimate body swap and build a solid budget shop truck. How will it turn out? Tune in to find out!"
      },
      {
        "id": "tvmaze:1933216",
        "title": "Crown Hick, F100/Crown Victoria Cop Car Body Swap Gets Up and Running!",
        "season": 5,
        "episode": 2,
        "released": "2017-03-16",
        "overview": "In this episode of HOT ROD Garage presented by Lincoln Tech, watch our hosts, Tony Angelo and Lucky Costa, finish the build of their new, ultimate shop truck: the Crown Hick! They took a minty 1966 Ford F100 truck body and laid it onto the frame and mechanicals of a 2007 Crown Victoria Police Interceptor that has some serious suspension and exhaust upgrades. Once the guys get it all bolted into place and integrate steering, brakes, and throttle, they apply a Holley EFI system and MSD transmission controller to make it all run! Once together, they take it out for a serious shakedown to show off all the modern performance that is now hiding under that 1966 F100!"
      },
      {
        "id": "tvmaze:1933217",
        "title": "How to Build a Low-Buck Muscle Car",
        "season": 5,
        "episode": 3,
        "released": "2017-04-13",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, Tony Angelo and Lucky Costa decide to go with the wind in their hair in this 1965 Pontiac Lemans convertible. The only problem is that it's half rust and half dirt, and this thing needs a bunch of sheetmetal repair. Watch the guys replace most of the rear end of the car, and once that is all handled, they install a full frame bracing kit and make the underside of this car WAY prettier than the top side."
      },
      {
        "id": "tvmaze:1933218",
        "title": "Ultimate Road Trip Build: Bare frame to driver in 2 days!",
        "season": 5,
        "episode": 4,
        "released": "2017-05-11",
        "overview": "In this episode of Hot Rod Garage presented by Lincoln Tech, Tony Angelo and Lucky Costa get the #HRGLEMANSTER back in action with a complete QA1 suspension system, and fire up 326 with the new Holley Terminator Stealth EFI system. Starting with our freshly rust-free body, and completely beefed up frame, watch these two guys install a complete QA1 suspension front to back, and then install Holley's new carburetor look-a-like fuel injection system and hit the road in just a couple of days!"
      },
      {
        "id": "tvmaze:1933219",
        "title": "The Crown Hick Gets Supercharged V-8 Power!",
        "season": 5,
        "episode": 5,
        "released": "2017-06-08",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, Tony Angelo and Lucky Costa take their trusty shop truck, the Crown Hick-a 1966 Ford F-100 sitting on a 2007 Crown Victoria complete chassis-and add boost for more power! Watch the guys install a Vortech V3 centrifugal blower and add more than 100 hp. To get all this new power to the rear wheels, Tony and Lucky install a Ford Performance Trac-Lok differential to double their smoky burnout fun!"
      },
      {
        "id": "tvmaze:1933220",
        "title": "Drift 'Cuda Gets Sideways!! #fishtailcuda",
        "season": 5,
        "episode": 6,
        "released": "2017-07-06",
        "overview": "The Drift 'Cuda is back! Project #fishtail, Tony Angelo's dream drift muscle car build, gets some suspension upgrades and sees some track time on this episode of HOT ROD Garage presented by Lincoln Tech! We made the trek to Angelo's home shop outside Philadelphia, Pennsylvania, where he and Lucky Costa modify the 'Cuda that was built fast for SEMA, installing custom NASCAR-style sway bars and different-rate springs and getting it track-ready. After this show car is dialed, Angelo and Costa take it over to Old Bridge Township Raceway Park to spend a day on the drift course!"
      },
      {
        "id": "tvmaze:1933221",
        "title": "10-Second Quarter-Mile for 10 Grand (ish)! #Bonemaro Hits Tens!!",
        "season": 5,
        "episode": 7,
        "released": "2017-08-03",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, watch Tony Angelo and Lucky Costa swap in a junkyard-fresh 5.3L on our low-buck drag project, the #bonemaro-and perform some critical upgrades along the way. After that, it's back out to the track, where Angelo tries to wrangle this sketchy pile of used parts on a 10.99-second-or-lower run. Over the last year, we've attempted to run a 10-second quarter-mile in the #bonemaro, and last time we hit the track with all the right parts, the 5.3L LS truck engine exploded!"
      },
      {
        "id": "tvmaze:1933222",
        "title": "Big American V-8 in a Tiny British Car, Meet the 5.0 MG!! (Say it 5 OMG).",
        "season": 5,
        "episode": 8,
        "released": "2017-08-31",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, watch Tony Angelo and Lucky Costa try to stuff 10 pounds of engine into 5 pounds of car. Instead of the usual HOT ROD tact of doubling or tripling the horsepower of a Mustang 5.0, the guys decided to take the 200(ish) hp of this 1986 Ford V-8 and cram it into a tiny 1964 MGB ex-racer. Different route, but same terrifying results! Power to weight is the name of the game."
      },
      {
        "id": "tvmaze:1933223",
        "title": "'70s Street Machine Van Build! Let's Get Sleazy!",
        "season": 5,
        "episode": 9,
        "released": "2017-09-28",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, watch Tony Angelo and Lucky Costa transform a banged-up 1987 Chevrolet G10 work van into a 1977 Boogie Van clone! After completely changing the body over to a 1977, Costa installs a front-end suspension drop, while Angelo and special guest Lindsay Ross install a recently uncovered set of original '80s bubble windows. A complete set of heads and side pipes give it some growl, and the guys finish it off with a seriously radical custom graphics package."
      },
      {
        "id": "tvmaze:1933224",
        "title": "Adding 150 Horsepower to a Junkyard 6.0L LS! The #66ChevHell Gets Some Serious Power!",
        "season": 5,
        "episode": 10,
        "released": "2017-10-26",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, Lucky Costa's personal '66 Chevelle gets major upgrades to its 6.0L LS truck engine. Tony Angelo and Costa install a set of AFR heads and a Magnuson supercharger on this high-mileage, well-worn engine to really wake up the powerplant. Without any upgrades to the 100,000-plus-mile bottom end, the #66ChevHell puts down more than 500 whp!"
      },
      {
        "id": "tvmaze:1933225",
        "title": "Ultimate Road Trip Car Goes Cross-Country for Fresh Paint!",
        "season": 5,
        "episode": 11,
        "released": "2017-11-22",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln tech, Tony Angelo and Lucky Costa take their '65 LeMans project and turn it into a road-trip hauler. Already having upgraded the entire chassis and suspension, the guys turn their attention to highway speeds. To make the LeMans eat up long stretches of road at modern highway speeds (and then some), they install a Gearstar 700R4 and a Currie bolt-in 9-inch rearend. When it's all together, it's time to hit the road from L.A. to Denver to the Lincoln Tech campus where the LeMans body will be worked and painted to a killer shine!"
      },
      {
        "id": "tvmaze:1933226",
        "title": "Hack the C10 Market! Longbed to Shortbed DIY Conversion!",
        "season": 5,
        "episode": 12,
        "released": "2017-12-21",
        "overview": "On this episode of HOT ROD Garage presented by Lincoln Tech, Tony Angelo and Lucky Costa dive into the red-hot C10 truck market and show you how to build a killer shortbed truck on a longbed budget! Watch the guys cut, shorten, and weld a longbed C10 into a sweet shorty using a Brothers Trucks kit and bed parts. Then they turn their new shortbed C10 into a killer handling machine using the brand-new QA1 complete suspension system."
      },
      {
        "id": "tvmaze:1933227",
        "title": "2005 Dodge Magnum Dad-Rod Build—Perfect for Hauling Kids and Hauling Ass!",
        "season": 6,
        "episode": 1,
        "released": "2018-01-15",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa turn a 2005 Dodge Magnum into the ultimate ride for a new \"Dad,\" the Dad-Rod. Angelo and Costa do a complete performance upgrade: more power, better handling, and enhancements to make it look awesome. Then they added the dad-specific modifications: a custom rearview baby monitor and a killer roof rack for carrying family gear."
      },
      {
        "id": "tvmaze:1933228",
        "title": "LS vs. 2JZ vs. 12V Cummins. Superstar Engine Comparo!!",
        "season": 6,
        "episode": 2,
        "released": "2018-02-12",
        "overview": "Unless you've been living under a rock for the last 20 years, you have heard of the three hottest engines in all of motoring, the LS-based Chevy V-8, the Toyota turbo six-cylinder 2JZ, and the beastly 5.9L Cummins Turbodiesel. These engines are absolutely legendary and have been swapped into every chassis under the sun, but they've never gone head-to-head. On this episode of HOT ROD Garage, watch Tony Angelo and Lucky Costa hop up each one of these engines and put them to the test on the same dyno!"
      },
      {
        "id": "tvmaze:1933229",
        "title": "$3,500 Chevy S-10 Total Transformation! Low-Budget High School Hot Rod",
        "season": 6,
        "episode": 3,
        "released": "2018-03-12",
        "overview": "Most of us didn't get our dream car the first time around. As a teenager, you probably got a random hand-me-down, or saved up and bought a beater. On this episode of HOT ROD Garage, watch Tony Angelo and Lucky Costa turn a very plain-Jane  S-10 into a car that a kid would be stoked to own.  For around $3,500, the guys do a complete color change, lower the car, and make it handle. Of course they throw in some tunes too!"
      },
      {
        "id": "tvmaze:1933230",
        "title": "500hp Ultimate Sleeper Getaway Car! 1979 Chevy Malibu!",
        "season": 6,
        "episode": 4,
        "released": "2018-04-09",
        "overview": "On this episode of HOT ROD Garage, we build the ultimate getaway car! Watch hosts Tony Angelo and Lucky Costa take a very plain 1979 four-door Chevy Malibu and make it ready to outrun anyone and anything. The guys install the 500hp LS-based V-8 from the engine comparo episode and run all that power through an American Powertrain TK0600. The result is a whole lot of tire smoke and lots of giggles. Stay tuned to see Part 2!"
      },
      {
        "id": "tvmaze:1933231",
        "title": "Cops vs. Robbers in Action! 500HP 1979 Malibu Getaway Build, Part 2!!!",
        "season": 6,
        "episode": 5,
        "released": "2018-05-07",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa take a 500hp 1979 Malibu sleeper and turn it into an actual getaway car. The must-haves for anyone running from the law: hydraulic handbrake for quick 180s, off-road high-travel bumpstops for jumps, and a Currie 9-inch differential to handle all the abuse. After the build, watch a HOT ROD Garage version of a reenacted 1970s car chase!"
      },
      {
        "id": "tvmaze:1933232",
        "title": "Trackside Upgrades! 5.0 Mustang Drag Testing!",
        "season": 6,
        "episode": 6,
        "released": "2018-06-04",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa take a mostly stock 1985 Ford Mustang 5.0 to a dragstrip! They set up shop at the track for two days to install a ton of go-fast parts to see just how much faster the car will go after each upgrade! The guys install all the typical mods: exhaust, intake, carb, cam, and even cylinder heads in their attempt to go quicker and quicker!"
      },
      {
        "id": "tvmaze:1933233",
        "title": "Cheap Chevy Small-block Build and S-10 V-8 Swap!",
        "season": 6,
        "episode": 7,
        "released": "2018-07-02",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa take their High School Special S-10, a truck that had been upgraded to drive, look, and sound better in a previous episode, and cram a 375hp Vortec V-8 in place of the original four-cylinder! The Vortec V-8 is a perfect candidate for a budget buildup with tons of potential. Watch the guys modify a $600 junkyard engine, and nearly double the power while keeping the stock heads! After the install, Angelo pilots the budget S-10 at the eighth-mile drags against some modern muscle and more than holds his own!"
      },
      {
        "id": "tvmaze:1933234",
        "title": "5.9l Cummins Diesel El Camino Swap! Dieselcamino!!",
        "season": 6,
        "episode": 8,
        "released": "2018-07-30",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa shoehorn the 5.9L Diesel Turbo Cummins engine from an earlier episode, which made more than 400 hp and nearly 1,000 lb-ft of torque, into a 1970 El Camino! Is it a tow truck? Is it a drag race car?  We don't really know! Watch the #dieselcamino tow just about everything we had around, including a big rig!"
      },
      {
        "id": "tvmaze:1933235",
        "title": "Automotive Archaeology! 1965 NHRA Champion Racer Revived!",
        "season": 6,
        "episode": 9,
        "released": "2018-08-27",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa dig into the history of an old clunker 1956 Chevy 210 to find out the car was a 1965 NHRA H Class Champion! Once they've got an idea of how special this old Chevy is, they start on the long road getting the car back into racing shape. Watch the guys hunt down an original drivetrain, rebuild it to H/S Class specifications, and get this car back on track after sitting for decades! Will it run how it did in 1965? Check it out!"
      },
      {
        "id": "tvmaze:1933236",
        "title": "Auction Find! Ballin' on a Budget 575hp Mercedes SL500",
        "season": 6,
        "episode": 10,
        "released": "2018-09-24",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa take a trip to a local SoCal auto auction with a stack of cash and some high hopes of finding a muscle car. After money changed hands and the dust settled, the guys left with a 1991 Mercedes-Benz SL500, not our typical project! Watch Angelo and Costa get the SL500 back into driving shape, and then cram in a 575hp Toyota 2JZ-GTE turbocharged, six-cylinder in place of the tired German V-8. Once the car is an absolute screamer, the guys go on the hunt to find some '80s exotics and show them what this old 'Benz can do!"
      },
      {
        "id": "tvmaze:1933237",
        "title": "Ready, Set, Race! Our 5.0 MG Transformed Into a Road Racer!",
        "season": 6,
        "episode": 11,
        "released": "2018-10-22",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa revive our old lightweight runabout, the 5.0 MG! This is a '64 MGB roadster that we crammed a 5.0 Ford V-8 into last year, resulting in one sketchy little rocket ship that didn't handle, or stop, but it sure did GO! This time, watch the guys fabricate a complete three-link rear suspension, convert the front end to a coilover suspension, and drop the car on seriously sticky rubber. Then you'll be given a killer introduction to suspension tuning while they tear up the Streets of Willow Springs International Raceway!"
      },
      {
        "id": "tvmaze:1933238",
        "title": "5.0 Fox-body Dragstrip Redemption!!",
        "season": 6,
        "episode": 12,
        "released": "2018-11-19",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa drag out our 1985 Ford Mustang 5.0  GT that was a total failure. They took the car out, threw a bunch of go-fast parts at it at the dragstrip, and tried to make the car faster and faster. It did not exactly work out. On this episode, the guys investigate what went wrong, and come up with a proper plan to make things right. After rebuilding the 5.0, they hit the dragstrip and totally redeem themselves!"
      },
      {
        "id": "tvmaze:1933239",
        "title": "Low Buck, Big Power, Big Block!",
        "season": 6,
        "episode": 13,
        "released": "2018-12-17",
        "overview": "On this episode of Hot Rod Garage, Tony Angelo and Lucky Costa put together a killer street Big Block Chevy engine on the CHEAP! The guys try to commandeer the exotic ZL1 427 From Project X that's been sitting in a cage and get denied by the big bosses. So, instead they take a run of the mill Vortec 7400 from a junkyard, and try to make the same power numbers as the Zl1 for about 25% of the price! Watch as a bunch of go-fast bits turn this old truck engine into a killer street/race engine!!"
      },
      {
        "id": "tvmaze:1933240",
        "title": "Re-Crowning the Hick!",
        "season": 7,
        "episode": 1,
        "released": "2019-01-14",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa revive one of the most popular HRG builds ever, the Crown Hick. This do-everything shop truck is really a 2007 Crown Victoria Police Interceptor dressed up as a 1966 F-100. The Hick has been out of commission since it dominated the Roadkill truck shootout, leaving it battered and broken. The guys set out to get the truck back on the road, and make it better than ever. A Gearstar 4R75W replaces the trashed cop gearbox, a set of ADTR.net adjustable coilover suspension enhances the handling, and a bunch of fabricated bracing makes the whole truck more stable! At the end of the episode, the Crown Hick is king once again!"
      },
      {
        "id": "tvmaze:1933241",
        "title": "1970s Street Machine Corvette! Fiberglass Dreams!",
        "season": 7,
        "episode": 2,
        "released": "2019-02-11",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa dream of a 1969 big-block, widebody, four-speed Corvette, but they just can't afford it! Watch the guys transform a beat-up 1974 Corvette into the '69 widebody they really want. Installing a low-buck, 475hp big-block with killer side pipes is step one. Step two is to cut the entire body off and get the car ready for a complete 1969 changeover! Before the new body parts go on, though, there are lots of burnouts!"
      },
      {
        "id": "tvmaze:1933242",
        "title": "1971 Caddy Sedan DeVille LS Swap!! Complete Misadventure!!",
        "season": 7,
        "episode": 3,
        "released": "2019-03-11",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa decide to build a boat of a car, a 1971 Cadillac Sedan deVille, and drop it on airbags for a sweet-and-low cruiser. The Caddy, however, had other plans. The 472 Cadillac V-8 exploded on the first test drive, and it was clear we needed to swap in a serious powerplant. A 5.3 LS setup for a carburetor and a 4L60E overdrive transmission swap become the new focus of the episode. After the car is running, the guys take it on a high-speed desert blast to make sure it won't let them down again!"
      },
      {
        "id": "tvmaze:1933244",
        "title": "How to Drag Race! Hot Rod Garage Takes You to the Strip! Bonus: Burnouts!",
        "season": 7,
        "episode": 4,
        "released": "2019-04-08",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa give you the lowdown on drag racing! Watch the guys take our 10-second turbo Camaro project and a bone-stock 1986 Ford Thunderbird Turbo Coupe, prep them for action, and hit the racetrack! There's a full rundown on exactly how to do everything at the strip—burnouts, launching, nailing the tree, and even how to shift and slow down. Whether you are a total newbie or have been down the strip a million times, there's lots of great info in this one."
      },
      {
        "id": "tvmaze:1933245",
        "title": "Boat on Bags! '71 Sedan deVille Gets Dropped!!!!",
        "season": 7,
        "episode": 5,
        "released": "2019-05-06",
        "overview": "On this episode of HOT ROD Garage, Tony Angelo and Lucky Costa take their LS-swapped '71 Sedan deVille and turn it into a rolling party machine! The car was already a highway-crushing cruiser with a 5.3 LS and 4L60E overdrive transmission, but the guys needed it to finally have the style to back up the new power. Watch them install a complete state-of-the-art airbag system, with full electronic controls, and then add a 100 shot of nitrous, just for fun. This Caddy can now cruise anywhere at stock ride height but with the flip of a few switches, everything changes!  It's now slammed on the ground, has an open-pipe exhaust, and an extra 100 hp of nitrous oxide!"
      },
      {
        "id": "tvmaze:1933246",
        "title": "Modern Turbo Tech! Updating and Upgrading a 1986 Ford Thunderbird Turbo Coupe!",
        "season": 7,
        "episode": 6,
        "released": "2019-06-03",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa take a bone-stock 150hp 1986 Ford Thunderbird Turbo Coupe and bring it into the 21st century! Can you extract modern performance from an 80s engine by applying liberal amounts of new turbo technology? Can this 2.3L Pinto engine hang with the new Ford 2.3 Ecoboost? Watch and see! The guys will install high-flowing manifolds, a dual ball bearing turbo, big intercooler and exhaust, and one serious modern computer to control it all!"
      },
      {
        "id": "tvmaze:1933247",
        "title": "16 Cylinders! Twin LS Engine! 600 HP! AWD 2006 Chevy Impala SS! The Twinpala is Here!",
        "season": 7,
        "episode": 7,
        "released": "2019-07-02",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa build one of the most insane project cars in the history of the show! The guys head to Angelo's personal shop in Pennsylvania to build the Twinpala. Watch them figure out how to cram an entire second drivetrain into the rear of the Impala: engine, transmission, and suspension all have to go into the car where the rear seats used to live. Once it's all together, they put the car through its paces at Englishtown Raceway Park and light up all four tires for the most insane burnouts of all time!"
      },
      {
        "id": "tvmaze:1933248",
        "title": "Dirt Track Racing - Hot Rod Garage Gets Round and Dirty With a Roadrunner Class Circle Track Racer!",
        "season": 7,
        "episode": 8,
        "released": "2019-07-29",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa jump headfirst into the dirt track world! Watch the guys scoop up an old beat-up Nova, build a basic 350 for it, and take it to compete on a superfast half-mile dirt oval at Selinsgrove Speedway. You'll see everything you need to do, and not do to make a competitive dirt car!! The action is wild and the failures are constant, so buckle up!"
      },
      {
        "id": "tvmaze:1933249",
        "title": "Twin-Engine, 1,000HP, 16-Cylinder AWD GT-R Killer!!! The Twinpala Gets Boosted and Hits the Dragstrip!",
        "season": 7,
        "episode": 9,
        "released": "2019-08-26",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa take the Twinpala, a twin LS-engined '06 Chevy Impala SS and turn it up to 11! A completely insane twin-turbo system boosts the two stock LS4 engines to more than 900 WHP. The stock transmissions can't hang, so the boys install two Gearstar upgraded 4T65Es and get ready for action. At Maple Grove Raceway, Angelo pilots the Redneck Veyron to crush the quarter-mile at more than 139 miles per hour, and 10.40 e.t. on street tires! HOT ROD Garage has never been wilder!"
      },
      {
        "id": "tvmaze:1933250",
        "title": "Fiberglass Realities - Scratching the Itch",
        "season": 7,
        "episode": 10,
        "released": "2019-09-23",
        "overview": "Big block.  Big fenders. Big smiles. After months of cutting glass and gluing panels, painting uglies, and stretching dollars, Tony Angelo and Lucky Costa finally finish backdating their '74 Vette with a '69 look, proper power, and real driveability. On this episode of HOT ROD Garage, watch as they transform it from a tire-shredding husk of car to a fit-and-finished (and still tire-shredding) cruise night star."
      },
      {
        "id": "tvmaze:1933251",
        "title": "Fast! Cheap! Mopar!!! Pick Two!!!! The Story of the MythDuster!",
        "season": 7,
        "episode": 11,
        "released": "2019-10-21",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa attempt to do the impossible: build a fast, cheap Mopar!!! It's the end of the season and the budget is tight but it's been too long without a Mopar. Angelo has dug through every online classified to find a 1973 Duster with some goodies on it, and Costa does his best to cram a 2005 5.7L Gen III Hemi into the car on the cheap! Can it be done? Will the myth of the cheap Mopar die in 2019? Watch and see!"
      },
      {
        "id": "tvmaze:1933252",
        "title": "Does America Make a Better Barra?!?! Vortec 4200 Turbo Engine Builds!",
        "season": 7,
        "episode": 12,
        "released": "2019-11-18",
        "overview": "On this episode of HOT ROD Garage, hosts Tony Angelo and Lucky Costa are going to take on the legendary Aussie engine, the Ford Barra. It's a beastly 4.0L six-cylinder turbocharged unit that churns out enough combined tire smoke yearly to blot out the sun! These engines are the best that Australia has to offer, and they reign supreme in the land down under. The boys think that Chevrolet might have just built something in the Vortec 4200 that could be a better Barra! Both engines are around four liters, both are inline-six cylinders, both have 24 valves, so there's only one thing to do, and that's build a couple of these Vortec engines up, bolt turbochargers to them, and see what they can do!"
      },
      {
        "id": "tvmaze:1933253",
        "title": "3-Way Drag Racing! Hot Rod Garage Unfinished Business!",
        "season": 8,
        "episode": 1,
        "released": "2020-06-29",
        "overview": "Three cars that desperately need redemption get out to the track. Tony and Lucky dig into a Cummins-swapped '70 El Camino, a Hemi-swapped '70 Duster and a ratty '79 Camaro with a turbo LS, get them track ready and then just see what they can actually do."
      },
      {
        "id": "tvmaze:1933254",
        "title": "Cheap Hot Muscle!! 2004 Mustang GT Hiding in Plain Sight!",
        "season": 8,
        "episode": 2,
        "released": "2020-07-06",
        "overview": "Tony and Lucky pick up a complete running and driving 2004 Mustang GT on the cheap, with the goal of turning it into a really fun car. They install better suspension and brakes, give it more power, and throw in some interior and exterior upgrades."
      },
      {
        "id": "tvmaze:1933255",
        "title": "AMC 401 V-8 Racing Engine Build! High Revs! Big Power! Trans-AM Killer!",
        "season": 8,
        "episode": 3,
        "released": "2020-07-13",
        "overview": "The AMC V-8 has long been seen as a strong engine that isn't very durable. Tony and Lucky build up a 401ci power plant that will live to take whatever abuse they can throw at it, keep spinning happily, and make killer power along the way."
      },
      {
        "id": "tvmaze:1933256",
        "title": "The Cheapest Turbo Buick in America! The $3,800 Grand Trashional!",
        "season": 8,
        "episode": 4,
        "released": "2020-07-20",
        "overview": "The T-Type, Grand National and Turbo Regal were '80s monsters with their turbocharged V6 engines. Tony Angelo and Lucky Costa buy the absolute cheapest turbo Buick they can find and piece together a 1984 T-Type, overcoming much rust, corrosion and awful previous repairs."
      },
      {
        "id": "tvmaze:1933257",
        "title": "1971 Caddy Sedan DeVille Made Hard to Kill!!",
        "season": 8,
        "episode": 5,
        "released": "2020-07-27",
        "overview": "When the HRG director picked up a '71 Sedan DeVille for himself, it was his first hot rod. Unaware how fast old parts can fail, it overheated badly, destroying the 5.3 LS engine. Tony and Lucky make it right by raiding the Drift Thislimo for a 6.0, plus other add-ons that should keep the \"Cecil B DeVille\" rolling."
      },
      {
        "id": "tvmaze:1933258",
        "title": "Twinpala is Back! Shooting for 9s! 1000-hp, 16-cylinder, AWD!",
        "season": 8,
        "episode": 6,
        "released": "2020-08-03",
        "overview": "Tony and Lucky fastest project ever is the 1,000-hp 2006 Chevy Impala SS, with an entire second V8 drivetrain crammed into the back. The front engine needs work, so the guys pull it out and use this chance to upgrade everything, including new headers, intake manifolds and EFI."
      },
      {
        "id": "tvmaze:1967932",
        "title": "Lucky's Build! 1927-ish Ford T-Bucket Truck, the Guac and Roll!",
        "season": 8,
        "episode": 7,
        "released": "2020-11-09",
        "overview": "We call this show HOT ROD Garage, and we've never built a proper prewar hot rod. When we gave Lucky Costa the chance to decide what we were building, he decided to rectify that once and for all with this mashup of parts! It's a 1927 Ford truck body on a mostly 1929 Ford Model T frame, powered by a small-block Chevy with a good helping of random speed parts gathered over a few decades. It all adds up to a whole lot of ratty awesome hot rod! Watch Hosts Tony Angelo and Lucky slap this thing together over a very long week and take it out for a maiden cruise!"
      },
      {
        "id": "tvmaze:1972089",
        "title": "Big-Block Bicoastal Swap! Our C10 gets a 454 upgrade!",
        "season": 8,
        "episode": 8,
        "released": "2020-11-16",
        "overview": "Our C10 short-bed conversion truck has been in need of a serious power-up for years now, and it's finally time to cram some big power into this killer street truck. Hosts Tony Angelo and Lucky Costa are stuck on opposite coasts, but they aren't going to let that stop them from getting the job done. Watch Tony grab a 1968 Chevy big-block and do a complete top-end upgrade. Aluminum heads, a big camshaft, and killer accessories all go onto this 454 in Tony's Pennsylvania shop. Once it's up and running strong, it gets shipped over to Lucky and current owner Mikey P for install with a killer Gearstar 6L80E transmission. Once it's in and running, watch Mikey P tear it down the dragstrip with all that new power!"
      },
      {
        "id": "tvmaze:1975128",
        "title": "Do-It-All Performance Machine, the C5 Corvette! Stage One: Power and Drag Racing!",
        "season": 8,
        "episode": 9,
        "released": "2020-11-23",
        "overview": "Tony Angelo scoops a high-mileage 1999 six-speed manual transmission 'Vette for 7,000 bucks, and it was begging for upgrades. Lucky Costa tears out the well-used 5.7 liter LS1 engine and upgrades it with a complete top-end kit before taking it down the dragstrip."
      },
      {
        "id": "tvmaze:1977993",
        "title": "C5 Do-It-All Corvette Part 2! Drift AND Road-Race",
        "season": 8,
        "episode": 10,
        "released": "2020-11-30",
        "overview": "On this episode of Hot Rod Garage we put our C5 through some new, sideways paces! The 2000 Corvette has already been pumped to around 500 hp and ripped down the dragstrip in an earlier episode by host Lucky Costa. This time, Tony Angelo and his buddy Mike Edwards get it all set up to handle the turns."
      },
      {
        "id": "tvmaze:1985902",
        "title": "$6 Grand Supercars! Coast to Coast Battle! Tony vs. Lucky!",
        "season": 8,
        "episode": 11,
        "released": "2020-12-07",
        "overview": "Tony Angelo and Lucky Costa each get $6,000 dollars to buy and modify a car for a variety of speed, handling and braking contests! Tony Angelo scoops a wrecked Mercedes-Benz CLK 55, and Lucky grabs a Mitsubishi 3000GT VR4 Twin Turbo! Watch the boys go head to head and coast to coast!"
      },
      {
        "id": "tvmaze:1986244",
        "title": "Dirt-Cheap Rear End DIY Build!! 5.7 Hemi Duster Gets a Ford 8.8 Out Back!",
        "season": 8,
        "episode": 12,
        "released": "2020-12-14",
        "overview": "Tony Angelo and Lucky Costa put together a cheap rear-end package for our 1973 Gen-3 Hemi-swapped Plymouth Duster. Once the cheap rear is built, the guys swap it into the Duster, and then drive it across LA to the 1/8 mile track at Irwindale, where it goes faster than ever!"
      },
      {
        "id": "tvmaze:2050161",
        "title": "Coyote Engine Transplant Into Sleepy SN95 Mustang! SN95 Gets Coyotified!",
        "season": 8,
        "episode": 13,
        "released": "2020-12-21",
        "overview": "Last season Tony bought a 170,000-mile, 260-hp, five-speed Ford Mustang GT for $3,000 as a great, affordable muscle car. After he and Lucky got through with upgrading just about everything, they realized it was a great car, but seriously lacking in the muscle department."
      },
      {
        "id": "tvmaze:2159123",
        "title": "1,000-hp Street Monster!!! Built V-8 + Giant Turbo = Party Time!",
        "season": 9,
        "episode": 1,
        "released": "2021-08-29",
        "overview": "The guys set out to build a 1,000-hp street car using a 2014 Caprice police patrol car, a built 5.3 LS, and a turbo big enough to boost three cars! Tony is on the East Coast building the giant turbo system, and Lucky Costa is in LA building the 5.3 to killer spec. Can the boys build a car with more power than anything coming out of Detroit?"
      },
      {
        "id": "tvmaze:2164213",
        "title": "Bonemaro Completely Reborn! Our Trashy Drag Car Turns Classy!",
        "season": 9,
        "episode": 2,
        "released": "2021-09-05",
        "overview": "For HOT ROD Garage's 100th episode, Tony and Lucky finally put a shine on \"Bonemaro,\" the cheap/fast/ugly project that was the show's first big hit back in the day. Lucky comes through with a fuel system upgrade, while Tony and his boys add a one-piece fiberglass front end and a proper paint job."
      },
      {
        "id": "tvmaze:2170187",
        "title": "1,000-Horsepower Street Car Project Hits the Dyno!!",
        "season": 9,
        "episode": 3,
        "released": "2021-09-12",
        "overview": "Tony and Lucky have set out to turn a run-of-the-mill 2014 Chevy Caprice PPV into an insanely powerful street car making over 1,000 horsepower! That's more HP than literally any American car produced today. They take a 5.3 LS engine, bolt on a giant turbocharger, and then let those things sing!"
      },
      {
        "id": "tvmaze:2176659",
        "title": "Guac 'N' Roll Is Now a Little Extra! '20s T-Bucket Project Actually Works!",
        "season": 9,
        "episode": 4,
        "released": "2021-09-19",
        "overview": "Hot Rod Garage's first traditional hot rod build, the 1927-ish Ford T-bucket truck, is in need of a good bit of love. Tony and Lucky completely revamp, well, just about everything! Brakes, frame, steering, suspension, even the engine gets a sweet-looking 3x2 carburetor setup for primo old-school looks and performance!"
      },
      {
        "id": "tvmaze:2181548",
        "title": "1974 AMC Javelin Trans Am/Street Racer Hits the Track!",
        "season": 9,
        "episode": 5,
        "released": "2021-09-26",
        "overview": "We take a rowdy 401 AMC V8 engine that we built a couple years ago and cram it inside of our very crusty 1974 Javelin. On the way in, we pair the V8 with a proper four-speed Super T-10 transmission, long-tube headers, and a ton of other hot parts. The goal is to have this package turned into a 1971 Trans Am tribute racer"
      },
      {
        "id": "tvmaze:2185900",
        "title": "1974 Chevy Corvette has GOT TO GO!! Buy low, sell wide!!!",
        "season": 9,
        "episode": 6,
        "released": "2021-10-04",
        "overview": "After months of agony searching for overpriced projects, Tony decides it's time to sell something. Our best looking and most complete car is a 1974 454-powered Chevy Corvette wearing a custom 1969 custom wide body and killer paint. Steve Dulcich joins him for a final set of sweet upgrades to the 'Vette, plus a few memorable test drives!"
      },
      {
        "id": "tvmaze:2241715",
        "title": "The World's Cheapest Turbo Buick Gets '87 Intercooled Power!",
        "season": 9,
        "episode": 7,
        "released": "2021-12-21",
        "overview": "Tony and guest Jimmie Caldwell dig back into the Grand Trashional, the cheapest running turbo Buick ever. They swap in a much-preferred 1987 intercooler engine, and then bolt up a ton of modern performance parts in an attempt to get this thing making serious power."
      },
      {
        "id": "tvmaze:2247756",
        "title": "The Grand Trashional Part 3: Horsepower, Handling, Still Not Handsome",
        "season": 9,
        "episode": 8,
        "released": "2021-12-26",
        "overview": "Our dirt-cheap turbo Buick T-type, the \"Grand Trashional,\" comes back for redemption after a total dyno letdown. After finding the right transmission and torque converter, plus a complete suspension upgrade, Tony Angelo and Jimmie Caldwell go head-to-head in a driving battle to see who gets to unveil the next HRG project!"
      },
      {
        "id": "tvmaze:2247754",
        "title": "Coyote-Powered '04 Mustang GT on Rails! Incredible Suspension Upgrades!",
        "season": 9,
        "episode": 9,
        "released": "2022-01-02",
        "overview": "The Coyote-engine-swapped 2004 GT gets a chassis and suspension upgrade to handle the 400-plus horses the 2015 F-150 Coyote V-8 puts down. Tony Angelo and Jimmie Caldwell replace the entire rear four-link suspension with a Griggs Racing torque arm setup with QA1 custom coil-overs. Then, they upgrade the whole interior and set some fast lap times at Willow Springs!"
      },
      {
        "id": "tvmaze:2254432",
        "title": "Crown Hick Is Built AND Bought!",
        "season": 9,
        "episode": 10,
        "released": "2022-01-09",
        "overview": "Tony Angelo and Lucky Costa are reunited with the Crown Hick, a '66 F-100 sitting on an entire 2007 Crown Victoria frame, with suspension upgrades and a supercharger. The guys built it years ago, and now it's time to get this thing built right and huffing serious boost."
      },
      {
        "id": "tvmaze:2260083",
        "title": "Turbocharged, Fuel Injected, Five-Speed...Minivan?!",
        "season": 9,
        "episode": 11,
        "released": "2022-01-16",
        "overview": "Tony Angelo and Lucky Costa stray way off the beaten path when they get their hands on a 1990 Plymouth Voyager five-speed, turbocharged minivan! These cars are super rare and as '80s as it gets. The boys refresh the suspension, engine and accessories until this 250,000-mile van is as good as new."
      },
      {
        "id": "tvmaze:2260128",
        "title": "Come ChevHell or High Water, We Will Revive Lucky's '66!",
        "season": 9,
        "episode": 12,
        "released": "2022-01-23",
        "overview": "Tony and Lucky dig into Lucky's personal '66 Chevelle to wake it from a long slumber. Years ago, it left our garage with a supercharged LS engine making big power! Like any good hot-rodder, Lucky turned it up until it popped, and the car was sent to the back of his shop. Now it's time to get this thing back on the road."
      },
      {
        "id": "tvmaze:2260129",
        "title": "'72 Javelin Trans Am Street Tribute Turns, Burns and Gets Some RESPECT",
        "season": 9,
        "episode": 13,
        "released": "2022-01-30",
        "overview": "Tony Angelo and Lucky Costa dive back into the '72 Javelin project! The guys pull out EVERYTHING old underneath, then upgrade it with tubular, heim-jointed, rack and pinioned, four wheel disced, and Ford 9-inched goodness. Then, like all good builders, they give it an absolute flogging on the track."
      },
      {
        "id": "tvmaze:2387831",
        "title": "Hunting 9s",
        "season": 10,
        "episode": 1,
        "released": "2022-09-05",
        "overview": "Hot Rod Garage welcomes its newest member to the HRG team, host Alex Taylor! Coming from a long history of fast cars, she and Lucky set their sights on pushing our 10s for 10K Bonemaro build into some 9-second timeslip territory. A solid plan of weight loss, a transbrake and a booster seat should all add up to the fastest pass in Bonemaro's history."
      },
      {
        "id": "tvmaze:2392047",
        "title": "Re-redeeming the Grand Trashional",
        "season": 10,
        "episode": 2,
        "released": "2022-09-12",
        "overview": "The Grand Trashional gets one more shot at making the power it deserves. Alex and Lucky put all their faith in heads, a cam, hopes and a dream. And because they're gluttons for punishment, they introduce another creampuff to the fleet -- yet another must-have GM turbo V6. But at least this one will be fast, right?"
      },
      {
        "id": "tvmaze:2397471",
        "title": "Hard Lessons for the Javelin",
        "season": 10,
        "episode": 3,
        "released": "2022-09-19",
        "overview": "HRG's Javelin is back to get the seating sorted, safety started and the nut behind the wheel trained. Alex and Lucky add seating for two and a roll cage, and MT's resident hot lapper Randy Pobst helps with some on-track tuning. Then, after some quick and dirty road course lessons, Alex and Lucky strap in to do battle with the Javelin's hottest lap times."
      },
      {
        "id": "tvmaze:2397472",
        "title": "TwinZies!",
        "season": 10,
        "episode": 4,
        "released": "2022-09-26",
        "overview": "Having near-zero experience in the sport of drifting, Alex and Lucky bring a pair of unexpected stock into the HRG stable -- the catch all of entry-level drift cars, two Nissan 370Zs. Drift-prepping the twin-Zs with ultra basic upgrades, these once abused and beaten Zs will continue to be abused and beaten, except this time under the watchful tutelage of an actual pro drifter."
      },
      {
        "id": "tvmaze:2409753",
        "title": "A Little Work and A Lotta Work!",
        "season": 10,
        "episode": 5,
        "released": "2022-10-03",
        "overview": "Alex and Lucky bounce between the forgotten hero of a turbocharged five-speed Voyager minivan, and the newest member of the HRG stable, a desert-fresh, soon-to-be-tube-chassised '55 Savoy. Which one is destined for greatness? Hint: It's not the minivan, at least not yet."
      },
      {
        "id": "tvmaze:2409754",
        "title": "Savoy Ya Later",
        "season": 10,
        "episode": 6,
        "released": "2022-10-10",
        "overview": "On this very busy episode of Hot Rod Garage, the gang gets sick, loses the shop, and still manages to finish the Savoy. Not just finish it, but transform it from its shell of a self into a blown, injected, six-speed, tube-chassised, big-tire Savoy. It's a feat of endurance and one heck of a sight to behold."
      },
      {
        "id": "tvmaze:2417222",
        "title": "Bringin' the Heat to Roadkill Nights!",
        "season": 10,
        "episode": 7,
        "released": "2022-10-17",
        "overview": "With the 28-day thrash from field car to big-tire Savoy complete, Alex and Lucky prep the Crown Hic and DiesEl Camino for a burnout competition with the Roadkill and FWF guys. Then it's down to business as Alex flexes her stick shift skills in the Influencer Grudge Match drag race at Roadkill Nights. Woodward Ave, here we come!"
      },
      {
        "id": "tvmaze:2448987",
        "title": "Double the Fix, Double the Fun",
        "season": 10,
        "episode": 8,
        "released": "2022-12-19",
        "overview": "Freshly stoked off of their win at Roadkill Nights, Alex and Lucky take on double the cars for double the seat time. A broken but Coyote-swapped '04 Mustang and a leaking but eager '74 Javelin track screamer are both just barely on the disabled list, and it's time to get them off. When some friendly sparring on the road course is just a few wrenches away, how do you not?"
      },
      {
        "id": "tvmaze:2461214",
        "title": "The 1,000-hp Blow-Nanza!!!",
        "season": 10,
        "episode": 9,
        "released": "2022-12-26",
        "overview": "Just like drag racing before it, roll racing is starting to get organized and move to the track. As stewards of speed, it's only right that we try our hand at this rolling-start craze. We're just one Vortech V7 install away from pitting Lucky's soon-to-be 1,000-hp Chevelle against last season's 1,000-hp Caprice PPV."
      },
      {
        "id": "tvmaze:2461215",
        "title": "From Dust to Dust",
        "season": 10,
        "episode": 10,
        "released": "2023-01-02",
        "overview": "The MythDuster's Gen III Hemi has been resting in pieces ever since Engine Masters' report card showed it down nearly 100 hp from its later brethren. Alex and Lucky upgrade this early version of the engine with much-improved later Eagle heads to get the MythDuster making some actual power and some actual passes!"
      },
      {
        "id": "tvmaze:2466117",
        "title": "Hot Tater!!",
        "season": 10,
        "episode": 11,
        "released": "2023-01-09",
        "overview": "Let's face it, we've all got budgets. Sometimes the best hot rodding you can do is with that old truck in the field, and Roadkill Garage's old project Tater Truck has been loafing around the MotorTrend offices for years just begging for some love. What can we do with this sluggish, tired, and granny-geared F250? Two words: Spud Life."
      },
      {
        "id": "tvmaze:2474212",
        "title": "Super Secret Galaxie",
        "season": 10,
        "episode": 12,
        "released": "2023-01-16",
        "overview": "Lucky tells a lot of stories, so when you hear a new one, you listen. Alex loves surprises, so when she heard the story of the vehicle that got Lucky into cars, she hatched a plan to find him one. A light tune-up and a few lies later, Lucky finally gets what's coming to him -- a super secret '63 Ford Galaxie Country Sedan."
      },
      {
        "id": "tvmaze:2478186",
        "title": "Happy HRG Day!",
        "season": 10,
        "episode": 13,
        "released": "2023-01-23",
        "overview": "The crew from Hot Rod Garage is inventing a holiday. HRG Day is the most magical day of the year where we rent a dragstrip, order up a taco cart, and invite our friends to come out and play cars! This is -- without a doubt -- the best job ever."
      },
      {
        "id": "tvmaze:2631752",
        "title": "Typhoon Rollin' In",
        "season": 11,
        "episode": 1,
        "released": "2023-09-08",
        "overview": "HRG is back and so is our 80/90s Super-Truck, the granddaddy of go-fast SUVs, our '92 Typhoon!! Rod knock will be a thing of the past as Alex and Lucky refresh the drivetrain and pit it head to head against today's top-of-the-line, ultra-lux, supercharged people-mover."
      },
      {
        "id": "tvmaze:2633122",
        "title": "Solving Crimes & Clocking Times",
        "season": 11,
        "episode": 2,
        "released": "2023-09-15",
        "overview": "Last year's newly minted annual holiday, HRG Day, was a wild success for everyone but the Bonemaro, the Crown Hic and the Savoy. All three came home hurt, and Hot Rod detectives Alex and Lucky are on the case to find out why. But more important, they're out to serve justice by finally putting a quarter-mile time on the Red-Eye-powered, big-tire Savoy."
      },
      {
        "id": "tvmaze:2633123",
        "title": "To Achieve a Goal, Set a Goal",
        "season": 11,
        "episode": 3,
        "released": "2023-09-22",
        "overview": "Alex and Lucky explore new territory in the world of land speed racing and continue down a well-worn path with the Bonemaro. But more than the cars, this one is all about goals: setting personal targets on the dry lake beds of El Mirage and (fingers crossed) breaking personal bests running the Bonemaro into the nines."
      },
      {
        "id": "tvmaze:2633124",
        "title": "The ICE-Cold Return of Project X",
        "season": 11,
        "episode": 4,
        "released": "2023-09-29",
        "overview": "After years of living a very polarizing existence with an electric motor swapped between its frame rails, Alex and Lucky have finally been given the go-ahead to bring Project X back to its glory days as a gas-huffing machine. As a long-running test mule of the latest trends, there is no better way to bring Project X back than a simple 1,000-hp crate 632 from GM."
      },
      {
        "id": "tvmaze:2651293",
        "title": "Grand Trashional Earns a New Name!",
        "season": 11,
        "episode": 5,
        "released": "2023-10-06",
        "overview": "Our long disappointed Grand National has finally earned its keep here at Hot Rod Garage. With whiff after whiff at the dragstrip, we pulled out all the stops, called a few friends, and finally got to the bottom (end) of what's been holding us back. But with a proper foundation intact at last, there is no longer a question of what's wrong, but rather why stop now?"
      },
      {
        "id": "tvmaze:2651294",
        "title": "Roadkill Nights Is Back!",
        "season": 11,
        "episode": 6,
        "released": "2023-10-13",
        "overview": "Roadkill Nights is back, and so is our '55 Savoy! We're heading back to Pontiac, Michigan, for all the street-legal drag racing action on Woodward, but this time we're competing in the Big Tire class. That means faster cars, better drivers, and a real need to step up our game."
      },
      {
        "id": "tvmaze:2651295",
        "title": "Burnt Reynolds",
        "season": 11,
        "episode": 7,
        "released": "2023-10-20",
        "overview": "Who doesn't love a '79 Trans Am? We do, and so does Derek from Roadworthy Rescues. He also seems to like us just enough to let us play with his 'Bird when he was done with it. The only problem is the little engine fire that ignited on its way over to us. So before we can get to our plans of big power and smoky burnouts, we have to re-roadworthy Derek's rescue before we can live out our smoky dreams."
      },
      {
        "id": "tvmaze:2710269",
        "title": "Land Speed Field Test",
        "season": 11,
        "episode": 8,
        "released": "2023-12-22",
        "overview": "Our '32 Roadster land speed car is finally starting to take shape, and it's ready to take its maiden voyage down the dry lake bed of El Mirage. That is, of course, if the lake bed stays dry. Weather aside, our flathead V-8 sings the song of our forebears in celebration of 75 years of Hot Rod magazine."
      },
      {
        "id": "tvmaze:2717499",
        "title": "Buggin' Out!",
        "season": 11,
        "episode": 9,
        "released": "2023-12-29",
        "overview": "Can a dime-a-dozen Beetle be called a hot rod? That's the question Alex and Lucky set out to answer as they take a well-worn Beetle and start it down the road to a Cal-look cruiser. They're cheap, easy to modify and have parts support galore. So you tell us: Is a Beetle a hot rod?"
      },
      {
        "id": "tvmaze:2726534",
        "title": "Typhoon Times Two",
        "season": 11,
        "episode": 10,
        "released": "2024-01-05",
        "overview": "An all-wheel-drive sport truck should really have all of its wheels driving, right? That's the goal this week as Alex and Lucky upgrade our Typhoon trans and everything from the transfer case forward, bulletproofing parts until the next one fails! Now who's got a lead on a good turbo upgrade?"
      },
      {
        "id": "tvmaze:2726535",
        "title": "Busted Burt Combusts Again",
        "season": 11,
        "episode": 11,
        "released": "2024-01-12",
        "overview": "We may have killed Derek's Roadworthy Rescue'd Trans Am last time, but we're here to make it right -- and to make it better! Enter 455 upgrades for power, a T-56 for shifts, and EFI for all of those hairpin turns, and we've got ourselves the Trans Am of Burt's dreams!"
      },
      {
        "id": "tvmaze:2726536",
        "title": "We're Gonna Lose the Shop!",
        "season": 11,
        "episode": 12,
        "released": "2024-01-19",
        "overview": "We're losing the shop, so we have one last, very cool project: a push truck for our Land Speed Roadster! A '57 Chevy panel truck makes the perfect base to clear the HRG Speed Shop's shelves, and it's exactly what you'd see pushing cars on the Salt Flats in the '60s. Not to mention it won't hurt to have it as we move into the new shop."
      },
      {
        "id": "tvmaze:2726537",
        "title": "HRG Day Is Here to Stay!",
        "season": 11,
        "episode": 13,
        "released": "2024-01-26",
        "overview": "HRG Day is back, and it's officially annual! Your new favorite holiday is still full of friends, horsepower and tacos, and this year we're lining up all the newest members of our fleet for dragstrip duty. Watch the episode this year, then come be a part of it in person next year, because HRG Day is here to stay!"
      },
      {
        "id": "tvmaze:3398700",
        "title": "This Galaxie Howls!!",
        "season": 12,
        "episode": 1,
        "released": "2025-10-15",
        "overview": "Lucky's Galaxie gets one-step closer to proper super-wagon status."
      },
      {
        "id": "tvmaze:3404482",
        "title": "Pro Street Camino",
        "season": 12,
        "episode": 2,
        "released": "2025-10-22",
        "overview": "Hot Rod Garage puts its Pro Street stamp on a big-winged 1960 El Camino."
      },
      {
        "id": "tvmaze:3402030",
        "title": "Lease Money Well Spent",
        "season": 12,
        "episode": 3,
        "released": "2025-10-29",
        "overview": "Alex and Lucky build a '72 Nova for both the street and the track."
      },
      {
        "id": "tvmaze:3423869",
        "title": "Lease Money",
        "season": 12,
        "episode": 4,
        "released": "2025-11-05",
        "overview": "Our Nova gets the bugs worked out to let us finally test its suspension."
      },
      {
        "id": "tvmaze:3430488",
        "title": "Someone Else's Project",
        "season": 12,
        "episode": 5,
        "released": "2025-11-12",
        "overview": "Buying someone else's lead sled project can be full of surprises."
      },
      {
        "id": "tvmaze:3438706",
        "title": "Spray and Pray",
        "season": 12,
        "episode": 6,
        "released": "2025-11-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3441433",
        "title": "Land and Panel",
        "season": 12,
        "episode": 7,
        "released": "2025-11-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3446045",
        "title": "The Dodge Utiline Re-Rescue",
        "season": 12,
        "episode": 8,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3455523",
        "title": "Sunday Cruiser Corvette",
        "season": 12,
        "episode": 9,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3466353",
        "title": "D100 Rides Again",
        "season": 12,
        "episode": 10,
        "released": "2025-12-17",
        "overview": ""
      }
    ]
  }
}