{
  "meta": {
    "id": "tvmaze:562",
    "type": "series",
    "name": "Law & Order",
    "description": "In the criminal justice system, the people are represented by two separate, yet equally important, groups: the police, who investigate crime; and the district attorneys, who prosecute the offenders. These are their stories.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472919.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472919.jpg",
    "videos": [
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:52329",
        "title": "Prescription for Death",
        "season": 1,
        "episode": 1,
        "released": "1990-09-13",
        "overview": "Suzanne Morton dies after a visit to a hospital emergency room during a hectic night shift. Her father, a former army medic in Vietnam, accuses the hospital of negligence and demands a police investigation. Logan and Greevey question a doctor who made adjustments to her chart, but are soon led to the respected Dr. Edward Auster, who they feel may have been drunk on duty. The other residents are reluctant to speak for fear their jobs may be in jeopardy, and Stone is faced with the awkward job of prosecuting a revered physician."
      },
      {
        "id": "tvmaze:52330",
        "title": "Subterranean Homeboy Blues",
        "season": 1,
        "episode": 2,
        "released": "1990-09-20",
        "overview": "A white woman, Laura di Biasi, shoots two black men in a crowded subway. The shooting at first appears to be self-defense, but further investigation shows that the motive may be revenge. Logan and Greevey argue about di Biasi's guilt, especially after learning that the dead man has a substantial record, and the living one cannot control himself in court. Laura di Biasi tries to make her case to Robinette, but he distances himself from the issue. Stone has trouble with the case, both in dealing with di Biasi's public defender, Shambala Green, and with the fact that the district attorney's office is divided over the issue."
      },
      {
        "id": "tvmaze:52331",
        "title": "The Reaper's Helper",
        "season": 1,
        "episode": 3,
        "released": "1990-10-04",
        "overview": "Construction worker Bobby Holland is found shot to death in his apartment. Logan and Greevey investigate and soon learn that Holland was gay. After reading a magazine article, Greevey connects the death to others in Los Angeles and San Francisco. The detectives arrest Jack Curry, who is connected to all three cases. Curry admits his involvement and claims that each man asked him to help them commit suicide because they had AIDS. Stone is troubled about prosecuting the case because of his doubts that Curry did anything wrong"
      },
      {
        "id": "tvmaze:52332",
        "title": "Kiss the Girls and Make Them Die",
        "season": 1,
        "episode": 4,
        "released": "1990-10-11",
        "overview": "Paige Bartlett is found beaten severely in her Upper East Side apartment. She dies in the hospital. Greevey and Logan investigate her boyfriend Steven Feinstein, but find that they broke up the evening before she was killed. The detectives locate another boyfriend, Ned Loomis, and learn that he has a history of violence after another former victim comes forward. Stone is frustrated when he is not able to use Loomis' former crimes against him in court."
      },
      {
        "id": "tvmaze:52333",
        "title": "Happily Ever After",
        "season": 1,
        "episode": 5,
        "released": "1990-10-23",
        "overview": "Alan Ralston is shot to death and his wife Janet wounded inside their building parking garage. In hospital, Janet identifies the alleged attacker from a police photo. One witness questioned early in the investigation is Gil Himes, a business associate of Alan. Police eventually piece together that the crime was not a random act of violence by the identified attacker. Rather it was the intentional murder of Alan and equally intentional wounding of Janet. Stone tries to get one of the suspects to testify against the other."
      },
      {
        "id": "tvmaze:52334",
        "title": "Everybody's Favorite Bagman",
        "season": 1,
        "episode": 6,
        "released": "1990-10-30",
        "overview": "When a city councilman is robbed and his throat slit, the investigation ties the victim to organized crime. Logan, Greevey, and an undercover narcotics officer trace the crime to mob figure Tony Scalisi. Stone and Robinette cut a deal with Scalisi, who in turn leads them to corrupt city officials."
      },
      {
        "id": "tvmaze:52335",
        "title": "By Hooker, By Crook",
        "season": 1,
        "episode": 7,
        "released": "1990-11-13",
        "overview": "The discovery of an unconscious man named Diamond in Central Park leads Greevey and Logan to Diamond's previous activity and locale—with an escort named Jolene in a hotel room. Greevey poses as a \"john\" looking for Jolene. When she stipulates her fees and services, Greevey arrests her for solicitation. When Diamond dies, the investigation leads to Jolene's superior, Jasmine, then to Jasmine's superior, Laura Winthrop. Winthrop claims that she runs a catering service, but when Jolene's blood tests HIV-positive, the case takes a sharp tack questioning the safety of the escort service industry."
      },
      {
        "id": "tvmaze:52336",
        "title": "Poison Ivy",
        "season": 1,
        "episode": 8,
        "released": "1990-11-20",
        "overview": "During a routine drug arrest, a veteran police officer, Freddo Parisi, kills an young African-American man named Tommy Richardson, who may have been unarmed. Parisi is accused of planting a gun on the victim to justify the shooting. Moreover, Parisi has a similar incident already on his record. Richardson was a student at Princeton University who was well respected for his contributions to his community in terms of time, energy, and money. But the investigation reveals that he sold drugs to get the money."
      },
      {
        "id": "tvmaze:52337",
        "title": "Indifference",
        "season": 1,
        "episode": 9,
        "released": "1990-11-27",
        "overview": "Greevey and Logan discover that an abused child has a cocaine-addicted mother, who is also being abused by her drug-addicted psychotherapist husband. The detectives investigate the doctor's checkered past, while prosecutors take a new tactic after the child dies."
      },
      {
        "id": "tvmaze:52338",
        "title": "Prisoner of Love",
        "season": 1,
        "episode": 10,
        "released": "1990-12-04",
        "overview": "The apparent suicide of a controversial bisexual artist, who died while engaging in an apparent act of auto-erotic strangulation, leads Detectives Greevey and Logan into the city's bondage/S&amp;M subculture. The initial explanation for the artist/victim's position is that he was involved in a \"performance art work.\" Further investigation reveals that, in fact, he was one of a sadomasochistic trio that included the head of the New York Department of Cultural Affairs and his \"mistress,\" a wealthy socialite dominatrix who instigated and monitored the S&amp;M scene that led to the artist's death."
      },
      {
        "id": "tvmaze:52339",
        "title": "Out of the Half-Light",
        "season": 1,
        "episode": 11,
        "released": "1990-12-11",
        "overview": "A teenaged African-American girl claims to have been raped by white police officers. Police and prosecutors struggle to get the truth when an ambitious African-American congressman claims the investigation is a racially motivated cover-up. However, when the rape kit tests negative, the prosecution suspects the case may be a hoax. The conflict heats until Robinette learns from the girl's parents that she and her boyfriend had sexual relations. The family fears an unwanted pregnancy, so, with the urging of the congressman, they claim the girl was raped by police officers. Having admitted the hoax, the family avoids the congressman whose campaign has been destroyed. Prosecutors devise a solution involving all-round gag orders. They concede that reputations were seriously damaged, but they reason that, with its impetus deflated, the case will fade quickly from people's memories."
      },
      {
        "id": "tvmaze:52340",
        "title": "Life Choice",
        "season": 1,
        "episode": 12,
        "released": "1991-01-08",
        "overview": "After Mary Donovan, an anti-abortion protester, is killed in an abortion center bombing, detectives search for all of her potential co-conspirators. The victim's parents and brother prove to be as committed to the pro-life movement as the victim. The first defendant arrested is Celeste McClure, who purchased the fertilizer to be mixed with the diesel fuel to create the bomb. Police determine that the central figure in the plot is Rose Schwimmer who is arrested. Detectives discover that the victim was pregnant and was secretly seeking an abortion. At trial, Schwimmer attempts to use her witness testimony to preach against abortion. Stone stops the attempt by asking Schwimmer that, if abortion is murder, is Schwimmer not guilty of murdering Mary Donovan's unborn baby. Schwimmer is visibly defeated by the question and remains silent for the remainder of the trial, including her conviction."
      },
      {
        "id": "tvmaze:52341",
        "title": "A Death in the Family",
        "season": 1,
        "episode": 13,
        "released": "1991-01-15",
        "overview": "NYPD officer Pete Rennick is shot to death on a rooftop in the dark; Logan and Greevey believe that a crook known as Brutus Walker is responsible for it, and the NYPD initiates a citywide manhunt for him. However, it later turns out that Walker was not the one who shot Rennick; it was his partner, Nicki Sandoval. Investigation reveals that, after displaying many blatant examples of his corruption to his partner, he was afraid that she would report him. So he lured her to the rooftop and tried to kill her, but she killed him first in self-defense. She is cleared of the shooting, but since policy dictates that she should have reported him, she will lose her job."
      },
      {
        "id": "tvmaze:52342",
        "title": "The Violence of Summer",
        "season": 1,
        "episode": 14,
        "released": "1991-02-05",
        "overview": "Stone temporarily dismisses rape charges against three defendants because the victim is a journalist of questionable character whose testimony has too many flaws. Greevey and Logan's subsequent reinvestigation uncovers a possible fourth assailant. This is one of the few episodes where the \"Order\" segment preceded the \"Law\" segment."
      },
      {
        "id": "tvmaze:52343",
        "title": "The Torrents of Greed, Part 1",
        "season": 1,
        "episode": 15,
        "released": "1991-02-12",
        "overview": "Detectives arrest three members of the Masucci crime family involved in a fatal assault, which leads to Stone attempting to use the arrest as a means to take down the entire Masucci crime syndicate via charging Mafia chieftain Frank Masucci. However, the plan backfires when Stone discovers that his chief witness (one of the three charged in the fatal assault) perjures himself on the stand, leading to Masucci's acquittal."
      },
      {
        "id": "tvmaze:52344",
        "title": "The Torrents of Greed, Part 2",
        "season": 1,
        "episode": 16,
        "released": "1991-02-19",
        "overview": "In the wake of Masucci's acquittal, ADAs Stone and Robinette intensify their investigation with the mob boss. Their investigation leads them to bust Masucci's brother-in-law, who the mob boss promptly has murdered. The murder leads to the discovery of the dumping ground for victims of Masucci's crime syndicate. As they re-arrest the mob boss, his grieving sister supports her brother in court by putting up the money for his bail. However, within hours of leaving the courtroom, Frank Masucci is killed by an unknown hitman. Robinette and Stone speculate that Masucci's sister as the one who ordered the hit, but are unable to prove it. The two men, along with Adam Schiff, take comfort in the fact that in spite of their failure to bring Masucci to justice through the legal system, that his death will severely cripple the crime family."
      },
      {
        "id": "tvmaze:52345",
        "title": "Mushrooms",
        "season": 1,
        "episode": 17,
        "released": "1991-02-26",
        "overview": "A 12-year-old boy is injured and his infant brother is killed by gunshots. The investigation reveals the children were the accidental victims of a hit ordered by a drug dealer against a real estate broker. Tragically, the murders prove to be the result of an adolescent gunman targeting the wrong address because he knows more about operating automatic weapons than about basic reading."
      },
      {
        "id": "tvmaze:52346",
        "title": "The Secret Sharers",
        "season": 1,
        "episode": 18,
        "released": "1991-03-12",
        "overview": "Stone faces a Texas cowboy lawyer and a hostile community as he tries to prosecute a young man accused of murdering a drug dealer. He discovers two truths-that the drug dealer raped the defendant's sister, and that the community views the murder as retribution."
      },
      {
        "id": "tvmaze:52347",
        "title": "The Serpent's Tooth",
        "season": 1,
        "episode": 19,
        "released": "1991-03-19",
        "overview": "A businessman and his wife are murdered; initially, the couple's two sons are treated as suspects. As the investigation develops, detectives discover that, in order to obtain financing for his business, the man took on a partner who was connected to Russian organized crime."
      },
      {
        "id": "tvmaze:52348",
        "title": "The Troubles",
        "season": 1,
        "episode": 20,
        "released": "1991-03-26",
        "overview": "A truck with three handcuffed federal prisoners arrives at the 27th precinct. FBI and NYPD officials discover that one of the prisoners has mysteriously been murdered. The FBI officials assert jurisdiction and transport the other two to a federal prison. One of the two is a suspected IRA member who has been detained in the U.S. for five years without charge, bail or trial. Shortly afterwards, the remaining prisoner is discovered hanging in his federal prison cell. A prison guard is discovered to be an IRA member; he confesses to the prisoner's murder. Detectives and prosecutors face resistance from federal authorities as they pursue murder charges against a suspected IRA member serving time in federal prison, after he is suspected of killing another federal prisoner."
      },
      {
        "id": "tvmaze:52349",
        "title": "Sonata for a Solo Organ",
        "season": 1,
        "episode": 21,
        "released": "1991-04-02",
        "overview": "Greevey and Logan discover that an apparent mugging victim found unconscious on a park bench has had his kidney removed. The case leads to a powerful man whose daughter desperately needed a transplant and the doctor who may have helped him."
      },
      {
        "id": "tvmaze:52350",
        "title": "The Blue Wall",
        "season": 1,
        "episode": 22,
        "released": "1991-06-09",
        "overview": "Suspicion grows in the department after incriminating evidence is erased. Captain Cragen is implicated in the internal affairs investigation. The detectives and prosecutors work together to get his name cleared."
      },
      {
        "id": "tvmaze:52351",
        "title": "Confession",
        "season": 2,
        "episode": 1,
        "released": "1991-09-17",
        "overview": "Logan forces a confession at gunpoint from the man suspected of murdering Max Greevey and, in the process, endangers Stone's prosecution. Logan is also introduced to his new partner, Phil Cerreta (Paul Sorvino), while he speaks to a counselor, Dr. Elizabeth Olivet (Carolyn McCormick)."
      },
      {
        "id": "tvmaze:52352",
        "title": "The Wages of Love",
        "season": 2,
        "episode": 2,
        "released": "1991-09-24",
        "overview": "A double homicide of an older man and his younger lover casts suspicion on both the ex-wife and the former boyfriend of the murdered duo, with the murdered man's son holding the key to the mystery."
      },
      {
        "id": "tvmaze:52353",
        "title": "Aria",
        "season": 2,
        "episode": 3,
        "released": "1991-10-01",
        "overview": "A lethal drug overdose of a young actress leads the detectives to an aggressive stage mother and a pornographic movie producer."
      },
      {
        "id": "tvmaze:52354",
        "title": "Asylum",
        "season": 2,
        "episode": 4,
        "released": "1991-10-08",
        "overview": "A victim's stabbing death in front of a coffee shop leads to one vagrant testifying against another. But the conviction is threatened twice based on the lack of a search warrant for a suspect's home - first an SRO hotel room and second a lean-to in the park."
      },
      {
        "id": "tvmaze:52355",
        "title": "God Bless the Child",
        "season": 2,
        "episode": 5,
        "released": "1991-10-22",
        "overview": "A couple, whose religious beliefs forbids medical treatment, is on trial for letting their daughter die of strep throat infection. Stone's prosecution hinges on whether either or both of the parents wanted to call for medical help. The investigation uncovers two other pertinent facts: 1. the night of the girl's death, the mother was drinking (also against the couple's religious beliefs), and 2. the couple had another child that died under similar circumstances."
      },
      {
        "id": "tvmaze:52356",
        "title": "Misconception",
        "season": 2,
        "episode": 6,
        "released": "1991-10-29",
        "overview": "The mugging of a pregnant legal secretary leads to a charge against her employer of assault, which is upgraded to murder when the baby dies. Time span confirmation of the baby's conception and the employer-secretary affair eliminates the employer as a suspect. Suspicion shifts to the secretary and her boyfriend (a disbarred lawyer) when a wiretap reveals that the couple intended, first, to have the employer held criminally responsible for the baby's murder and, second, to sue the employer for wrongful death. Initially, the primary issue appears to be the fetus age at which a murder charge can be leveled. The primary issue proves to be two-fold; 1. whether the suspects can be held accountable for knowing both the law and its meaning, and 2. even if the suspects cannot legally be convicted of the baby's murder, whether they can be convicted of a lesser crime, i.e. attempted murder."
      },
      {
        "id": "tvmaze:52357",
        "title": "In Memory Of",
        "season": 2,
        "episode": 7,
        "released": "1991-11-05",
        "overview": "The renovation of a brownstone uncovers the remains of a young boy who disappeared thirty-one years earlier during the 1960 presidential campaign. The discovery revives a wrenching and long-suppressed memory in a childhood friend and neighbor-and the suspect's daughter."
      },
      {
        "id": "tvmaze:52358",
        "title": "Out of Control",
        "season": 2,
        "episode": 8,
        "released": "1991-11-12",
        "overview": "The detectives investigate the gang rape of a college student during a fraternity Halloween party, but when her own testimony can't be supported by the evidence, it becomes hard to prove rape."
      },
      {
        "id": "tvmaze:52359",
        "title": "Renunciation",
        "season": 2,
        "episode": 9,
        "released": "1991-11-19",
        "overview": "When a gambler is killed, the hit-and-run investigation leads to the discovery of a schoolteacher carrying on an affair with one of her students. Cerreta and Logan suspect that she may have manipulated him into killing her husband."
      },
      {
        "id": "tvmaze:52360",
        "title": "Heaven",
        "season": 2,
        "episode": 10,
        "released": "1991-11-26",
        "overview": "The investigation into an illegal social club fire which claimed 53 fatalities leads to a connection between arson, illegal immigrants and the sale of green cards."
      },
      {
        "id": "tvmaze:52361",
        "title": "His Hour Upon the Stage",
        "season": 2,
        "episode": 11,
        "released": "1991-12-10",
        "overview": "The discovery of a frozen corpse in a dumpster leads to rival Broadway producers."
      },
      {
        "id": "tvmaze:52362",
        "title": "Star Struck",
        "season": 2,
        "episode": 12,
        "released": "1992-01-07",
        "overview": "An obsessive fan pleads temporary insanity when he is charged with attempting to murder the soap opera actress who is the center of his life."
      },
      {
        "id": "tvmaze:52363",
        "title": "Severance",
        "season": 2,
        "episode": 13,
        "released": "1992-01-14",
        "overview": "Stone faces an old rival in court as he tries to link a hit man and three murders to a sleazy lawyer and a powerful man behind bars."
      },
      {
        "id": "tvmaze:52364",
        "title": "Blood Is Thicker...",
        "season": 2,
        "episode": 14,
        "released": "1992-02-04",
        "overview": "An apparent mugging ends in the death of a wealthy woman but the case comes to hang on a silver pin that may have been in the victim's possession."
      },
      {
        "id": "tvmaze:52365",
        "title": "Trust",
        "season": 2,
        "episode": 15,
        "released": "1992-02-11",
        "overview": "Stone is determined to see that a teenage boy doesn't get away with murder twice when the young man is brought to trial for the shooting death of one of his friends."
      },
      {
        "id": "tvmaze:52366",
        "title": "Vengeance",
        "season": 2,
        "episode": 16,
        "released": "1992-02-18",
        "overview": "The parents of a murdered woman contest Stone's prosecution of her killer so that he can be extradited to their home state, where the death penalty still exists."
      },
      {
        "id": "tvmaze:52367",
        "title": "Sisters of Mercy",
        "season": 2,
        "episode": 17,
        "released": "1992-03-03",
        "overview": "Cerreta and Logan investigate the accusation that a nun in charge of a shelter for teens molested a young addict."
      },
      {
        "id": "tvmaze:52368",
        "title": "Cradle to Grave",
        "season": 2,
        "episode": 18,
        "released": "1992-03-31",
        "overview": "The discovery of a dead baby leads to a case involving a slumlord who would not provide any heat and who defends her actions by blaming the rent laws."
      },
      {
        "id": "tvmaze:52369",
        "title": "The Fertile Fields",
        "season": 2,
        "episode": 19,
        "released": "1992-04-07",
        "overview": "The brutal murder of a Jewish jeweler appears to be a hate crime, but the investigation soon leads back to the man's brother and his shady business deals. First appearance of Leslie Hendrix as Assistant Chief Medical Examiner Dr. Elizabeth Rodgers."
      },
      {
        "id": "tvmaze:52370",
        "title": "Intolerance",
        "season": 2,
        "episode": 20,
        "released": "1992-04-14",
        "overview": "When a Chinese-American honors student is killed, the investigation uncovers a racist mother whose son was competing with the victim for the same scholarship."
      },
      {
        "id": "tvmaze:52371",
        "title": "Silence",
        "season": 2,
        "episode": 21,
        "released": "1992-04-28",
        "overview": "A politician opposes the prosecution of his son's murderer because it might mean revealing that his late son was gay."
      },
      {
        "id": "tvmaze:52372",
        "title": "The Working Stiff",
        "season": 2,
        "episode": 22,
        "released": "1992-05-14",
        "overview": "The murder of a Wall Street legend begins a case involving an ailing union worker, a former governor and old friend of Schiff's."
      },
      {
        "id": "tvmaze:52373",
        "title": "Skin Deep",
        "season": 3,
        "episode": 1,
        "released": "1992-09-23",
        "overview": "After photographer Julian Decker is found murdered in his studio, Logan and Cerreta discover that Decker's real business was prostitution and acting as a pimp for models who aren't getting the work they needed. Their investigation leads to Angela Brandt, one of Decker's models who found more money working for Decker in other ways, but they also discover that Decker was romantically involved with Angela's teenage daughter. Stone realizes that something strange is going on when the case gets weaker against Angela, but all of a sudden she wants to cut a deal"
      },
      {
        "id": "tvmaze:52374",
        "title": "Conspiracy",
        "season": 3,
        "episode": 2,
        "released": "1992-09-30",
        "overview": "After Marcus Tate, the respected leader of a controversial African-American rights movement, is assassinated at a rally, Logan and Cerreta attempt to get information on the crime but are stonewalled by many of Tate's followers, who aren't interested in talking to white police officers. Photographs lead them to Mitchell Kolbin, a white man who had followed Tate religiously but who seemed to lose some of his wonderment when Tate began an affair with his wife."
      },
      {
        "id": "tvmaze:52375",
        "title": "Forgiveness",
        "season": 3,
        "episode": 3,
        "released": "1992-10-07",
        "overview": "After Beth Milgram is found beaten to death in an alleyway after her going away party, Logan and Cerreta initially turn their suspicion to the girl's father after her fiancé, Tommy Beltran, claims that he had hit her after Beth told him they were engaged, but it isn't long before their primary suspect becomes Beltran himself. Stone has the unpleasant task of facing the renowned Cyrus Weaver, who is determined to prove that Tommy Beltran is not guilty of murdering Beth Milgram because he was a poor young man from a Mexican family who could not restrain his rage when his upper-class girlfriend broke up with him."
      },
      {
        "id": "tvmaze:52376",
        "title": "The Corporate Veil",
        "season": 3,
        "episode": 4,
        "released": "1992-10-14",
        "overview": "A teenager's fatal heart attack is traced to fraud and greed on the part of the manufacturer of his pacemaker and their supplier."
      },
      {
        "id": "tvmaze:52377",
        "title": "Wedded Bliss",
        "season": 3,
        "episode": 5,
        "released": "1992-10-21",
        "overview": "The discovery of a young woman's body in the river leads to an investigation of illegal sweatshops and the enslavement of young immigrants."
      },
      {
        "id": "tvmaze:52378",
        "title": "Helpless",
        "season": 3,
        "episode": 6,
        "released": "1992-11-04",
        "overview": "Dr. Olivet accuses her gynecologist of rape, but Stone finds his case in trouble when he discovers that Olivet tape-recorded the crime."
      },
      {
        "id": "tvmaze:52379",
        "title": "Self Defense",
        "season": 3,
        "episode": 7,
        "released": "1992-11-11",
        "overview": "Cerreta and Stone find themselves on opposite sides of the fence when a storeowner kills two robbers and then claims self-defense as a justification."
      },
      {
        "id": "tvmaze:52380",
        "title": "Prince of Darkness",
        "season": 3,
        "episode": 8,
        "released": "1992-11-18",
        "overview": "Cerreta poses as a weapons dealer to help Stone build a case against a Colombian hit man, but the deal takes an unexpected turn, resulting in bloodshed."
      },
      {
        "id": "tvmaze:52381",
        "title": "Point of View",
        "season": 3,
        "episode": 9,
        "released": "1992-11-25",
        "overview": "Logan has trouble dealing with Lennie Briscoe (Jerry Orbach), who has been brought in while Cerreta recovers from surgery during their investigation of the murder of Tommy Duff, a small-time hood. Their investigation leads them to a woman who claims Duff raped her, and when her attorney, an old friend of Stone's from law school, calls Olivet to the stand to testify in Mary Kostrinski's defense, Schiff forces Stone to use Olivet's recent rape to discredit her testimony. Logan is upset to learn that Cerreta has accepted another position within the department and will not be returning."
      },
      {
        "id": "tvmaze:52382",
        "title": "Consultation",
        "season": 3,
        "episode": 10,
        "released": "1992-12-09",
        "overview": "An engineer and a tribal chief become the chief suspects in the death of a Nigerian woman who died while smuggling heroin internally."
      },
      {
        "id": "tvmaze:52383",
        "title": "Extended Family",
        "season": 3,
        "episode": 11,
        "released": "1993-01-06",
        "overview": "When Janet Silver kidnaps her daughter from the mall, Logan and Briscoe are sent in to investigate and learn that she committed the crime with the assistance of a children's help organization after going to them with fears that the little girl's father was sexually abusing her."
      },
      {
        "id": "tvmaze:52384",
        "title": "Right to Counsel",
        "season": 3,
        "episode": 12,
        "released": "1993-01-13",
        "overview": "After Stone accepts a plea bargain from the much younger and poorer lover of a wealthy older woman found murdered in her apartment, he begins to have doubts that he has sent the right man to prison, especially as he learns more about the attorney who handled the woman's estate."
      },
      {
        "id": "tvmaze:52385",
        "title": "Night and Fog",
        "season": 3,
        "episode": 13,
        "released": "1993-02-03",
        "overview": "The confession of an elderly man that he assisted his wife in committing suicide doesn't fully satisfy Stone when rumors surface that the man was once a Nazi collaborator."
      },
      {
        "id": "tvmaze:52386",
        "title": "Promises to Keep",
        "season": 3,
        "episode": 14,
        "released": "1993-02-10",
        "overview": "The investigation into the murder of a young physician leads to the discovery of an unorthodox and illegal relationship between her fiancé and his psychiatrist."
      },
      {
        "id": "tvmaze:52387",
        "title": "Mother Love",
        "season": 3,
        "episode": 15,
        "released": "1993-02-24",
        "overview": "The absence of a murder weapon complicates the investigation into the murder of a drug addict who stole from her family to support her habit."
      },
      {
        "id": "tvmaze:52388",
        "title": "Jurisdiction",
        "season": 3,
        "episode": 16,
        "released": "1993-03-03",
        "overview": "Stone battles the Brooklyn D.A.'s office over prosecutorial jurisdiction in the case of a mentally handicapped man who confesses to the stabbing deaths of two women."
      },
      {
        "id": "tvmaze:52389",
        "title": "Conduct Unbecoming",
        "season": 3,
        "episode": 17,
        "released": "1993-03-10",
        "overview": "Stone and the police battle the closed ranks of the Navy to investigate the death of a female Naval officer during a party in a Manhattan hotel."
      },
      {
        "id": "tvmaze:52390",
        "title": "Animal Instinct",
        "season": 3,
        "episode": 18,
        "released": "1993-03-17",
        "overview": "The initial investigation into the death of a research scientist leads to an animal-rights group until evidence surfaces that her husband's affair with a coworker may point to a possible motive for the murder. When the husband is acquitted, the investigation turns to the individual who provided evidence of the affair."
      },
      {
        "id": "tvmaze:52391",
        "title": "Virus",
        "season": 3,
        "episode": 19,
        "released": "1993-04-21",
        "overview": "While investigating several deaths at a diabetes clinic, Briscoe and Logan discover that teenage computer hackers may have tampered with the clinic's medical database."
      },
      {
        "id": "tvmaze:52392",
        "title": "Securitate",
        "season": 3,
        "episode": 20,
        "released": "1993-05-05",
        "overview": "When a Romanian immigrant kills, his lawyer announces he will plead his client \"not guilty due to cultural insanity\" claiming the man had been conditioned to violence in his homeland."
      },
      {
        "id": "tvmaze:52393",
        "title": "Manhood",
        "season": 3,
        "episode": 21,
        "released": "1993-05-12",
        "overview": "The statement of a drug dealer who survived a shoot-out that killed a cop leads Logan and Briscoe to suspect that the cop died because he was gay and his fellow officers were reluctant to back him up."
      },
      {
        "id": "tvmaze:52394",
        "title": "Benevolence",
        "season": 3,
        "episode": 22,
        "released": "1993-05-19",
        "overview": "Logan and Briscoe begin their investigation into the death of a hearing-impaired young woman by questioning her two most recent boyfriends."
      },
      {
        "id": "tvmaze:52395",
        "title": "Sweeps",
        "season": 4,
        "episode": 1,
        "released": "1993-09-15",
        "overview": "Logan and Briscoe investigate after a convicted child molester, Dr. Joseph Vinton, is murdered on Rick Mason's controversial talk show. The shooter is easily identified — he's Sid Fisher, the father of the dead man's victim from three years earlier. During the course of the investigation, however, the detectives find evidence that leads them to believe that Mason may have set up Vinton's murder so as to assure high ratings during sweeps period. Stone's case is made more difficult because Sid Fisher isn't willing to say anything that could put his son, Scotty, on the stand."
      },
      {
        "id": "tvmaze:52396",
        "title": "Volunteers",
        "season": 4,
        "episode": 2,
        "released": "1993-09-29",
        "overview": "A disruptive, unbalanced homeless man is found severely beaten in an alley of the middle-class neighborhood he calls home, leading Stone to try to prosecute one of the residents for premeditated murder."
      },
      {
        "id": "tvmaze:52397",
        "title": "Discord",
        "season": 4,
        "episode": 3,
        "released": "1993-10-06",
        "overview": "When college student Julia Wood charges an admittedly promiscuous rock star, C Square, with rape, he claims the act was consensual. Logan and Briscoe investigate the crime and soon learn that C Square isn't the nice guy he would have everyone believe. Kincaid makes a mistake during trial that puts her position as Stone's new ADA in jeopardy."
      },
      {
        "id": "tvmaze:52398",
        "title": "Profile",
        "season": 4,
        "episode": 4,
        "released": "1993-10-13",
        "overview": "After a number of neighborhood residents are murdered, the police follow the investigation to a local racist who is murdering people he doesn't feel belong in his neighborhood. Stone finds himself facing a prominent black attorney representing the murderer."
      },
      {
        "id": "tvmaze:52399",
        "title": "Black Tie",
        "season": 4,
        "episode": 5,
        "released": "1993-10-20",
        "overview": "After wealthy Jonathan Keyes is found dead in his home, the police receive an anonymous tip that he was murdered. Logan and Briscoe encounter difficulties at the scene when the widow and her attorney refuse to allow an autopsy, and by the time Rodgers is able to examine the body, it has already been embalmed. The medical examiner claims the death was natural causes, and even though the state finally gets the necessary proof that the death was murder, the methods used to obtain the needed evidence come under question when Stone tries the case in court."
      },
      {
        "id": "tvmaze:52400",
        "title": "Pride and Joy",
        "season": 4,
        "episode": 6,
        "released": "1993-10-27",
        "overview": "When building superintendent Frank McKinnon is found murdered in the basement of the building he works and lives in, Logan and Briscoe initially investigate the crime as a potential break-in until forensics discovers that the \"break-in\" was staged. The state's attention soon turns to Sean, Frank's 17-year-old son. Dr. Olivet determines the son is an abusive sociopath after interviewing him. But when the victim's wife claims that Frank beat his family on a regular basis, Stone and Kincaid try to determine who is telling the truth."
      },
      {
        "id": "tvmaze:52401",
        "title": "Apocrypha",
        "season": 4,
        "episode": 7,
        "released": "1993-11-03",
        "overview": "Stone and Kincaid try to prove that the young woman believed to have planted a bomb in a parking garage had been brainwashed and was acting under the direct orders of Daniel Hendricks, the charismatic leader of a local cult known as the Acherusian Temple."
      },
      {
        "id": "tvmaze:52402",
        "title": "American Dream",
        "season": 4,
        "episode": 8,
        "released": "1993-11-09",
        "overview": "A dig at a building site uncovers the body of Sid Cohen, who had gone missing and been presumed murdered years earlier. The identification of the body proves troublesome for Stone, who had initially prosecuted Phillip Swann eight years earlier and had obtained a conviction. Swann uses inconsistencies between the original trial and the location of the body to seek an appeal."
      },
      {
        "id": "tvmaze:52403",
        "title": "Born Bad",
        "season": 4,
        "episode": 9,
        "released": "1993-11-16",
        "overview": "When teenager Chris Pollit beats a fellow foster home resident to death, his lawyer seeks a not guilty verdict by reason of genetic defect, claiming that Pollit is genetically predisposed to violence because he has an extra Y chromosome."
      },
      {
        "id": "tvmaze:52404",
        "title": "The Pursuit of Happiness",
        "season": 4,
        "episode": 10,
        "released": "1993-12-01",
        "overview": "When Billy Cooper is found murdered at the meat-packing plant where he works, Logan and Briscoe turn their eye to his wife Irina, a green card bride from Russia who had married Cooper in the hopes of a better life but had fallen in love with a co-worker and lost favor with her husband, who repeatedly threatened to send her back."
      },
      {
        "id": "tvmaze:52405",
        "title": "Golden Years",
        "season": 4,
        "episode": 11,
        "released": "1994-01-05",
        "overview": "After 82-year-old Mildred Bauer is found dead in her apartment, suspicion immediately turns to her at-home caregiver and her boyfriend until the medical examiner reveals that the elderly woman had been starved to death. Feeding instructions given to Maria by Laura, the deceased woman's granddaughter, turn Stone's eye on the young woman, and she is charged with neglect and grave indifference to human life."
      },
      {
        "id": "tvmaze:52406",
        "title": "Snatched",
        "season": 4,
        "episode": 12,
        "released": "1994-01-12",
        "overview": "After Sol Bregman is arrested while trying to exchange a ransom payoff for his kidnapped son, Logan and Briscoe find themselves trying to find Jason Bregman while trying to stop the father, a millionaire and a close friend of Adam Schiff, from interfering in the investigation. Once Jason Bregman is found, suspicion turns to the victim himself."
      },
      {
        "id": "tvmaze:52407",
        "title": "Breeder",
        "season": 4,
        "episode": 13,
        "released": "1994-01-19",
        "overview": "Debra Elkins claims to have passed out in a cab after giving birth only to wake up and discover her baby is missing, but it isn't long before Briscoe and Logan follow the trail of evidence to her boyfriend, Steven Shaw, who is keeping the baby in a hotel at Debra's request. As the investigation continues, Stone and Kincaid find three separate couples who had been led to believe that they would be the family who would adopt the baby, but it seems as though Debra has no intention of giving her baby to any of the couples."
      },
      {
        "id": "tvmaze:52408",
        "title": "Censure",
        "season": 4,
        "episode": 14,
        "released": "1994-02-02",
        "overview": "When the investigation into threats on a 5-year-old girl leads to a judge that Kincaid had been romantically involved with when she clerked under him, she asks Ben to take her off the case. When Thayer is brought to trial, he insinuates that Kincaid deliberately pointed the witness in his direction, claiming that she had approached him in an inappropriate manner while she worked with him."
      },
      {
        "id": "tvmaze:52409",
        "title": "Kids",
        "season": 4,
        "episode": 15,
        "released": "1994-02-09",
        "overview": "When 14-year-old Angel Ramirez is shot dead while out with two friends, the investigation leads to a local gun dealer, Juan Domingo. While investigating Domingo, Briscoe and Logan learn that he was a recent suspect in a shooting that paralyzed a teenage boy, and Briscoe finds himself in an awkward position when Kevin Parker, the son of an old friend of Briscoe's, ends up being the prime suspect in young Angel's murder."
      },
      {
        "id": "tvmaze:52410",
        "title": "Big Bang",
        "season": 4,
        "episode": 16,
        "released": "1994-03-02",
        "overview": "A nuclear physicist becomes the chief suspect when his estranged wife, who has been delaying divorce proceedings, is the victim of a mail bomb."
      },
      {
        "id": "tvmaze:52411",
        "title": "Mayhem",
        "season": 4,
        "episode": 17,
        "released": "1994-03-09",
        "overview": "During a 24-hour period, Briscoe and Logan have a heavy caseload that includes five unrelated murders and a domestic quarrel (which results in the maiming of the husband)."
      },
      {
        "id": "tvmaze:52412",
        "title": "Wager",
        "season": 4,
        "episode": 18,
        "released": "1994-03-30",
        "overview": "Briscoe and Logan bet that the killing of a star athlete's father is linked to gambling debts and threats to the baseball player's family, but it turns out the son's alibi does not hold up and he ends up under suspicion himself."
      },
      {
        "id": "tvmaze:52413",
        "title": "Sanctuary",
        "season": 4,
        "episode": 19,
        "released": "1994-04-13",
        "overview": "A black minister fans the flames of racial intolerance after a hit-and-run in Harlem claims the life of a 12-year-old and the Jewish driver isn't indicted."
      },
      {
        "id": "tvmaze:52414",
        "title": "Nurture",
        "season": 4,
        "episode": 20,
        "released": "1994-05-04",
        "overview": "Briscoe and Logan investigate the disappearance of a child from her abusive foster home and find her being held by a loving but disturbed woman who insists she has acted only for the child's own good."
      },
      {
        "id": "tvmaze:52415",
        "title": "Doubles",
        "season": 4,
        "episode": 21,
        "released": "1994-05-18",
        "overview": "An assailant breaks the wrist of a tennis player prior to a tournament, and a competitor is among the suspects."
      },
      {
        "id": "tvmaze:52416",
        "title": "Old Friends",
        "season": 4,
        "episode": 22,
        "released": "1994-05-25",
        "overview": "A truck hits a pedestrian and the investigation reveals the victim's link to a baby-food company in which a new partner has connections to the Russian mob."
      },
      {
        "id": "tvmaze:52417",
        "title": "Second Opinion",
        "season": 5,
        "episode": 1,
        "released": "1994-09-21",
        "overview": "A woman's death exposes an unorthodox method of treating cancer that Executive Assistant DA McCoy intends to prove is negligent homicide."
      },
      {
        "id": "tvmaze:52418",
        "title": "Coma",
        "season": 5,
        "episode": 2,
        "released": "1994-09-28",
        "overview": "A comedy-club owner comes under suspicion for having shot his wife, now comatose with a bullet in her head, after it's discovered he was abusive and she was about to divorce him."
      },
      {
        "id": "tvmaze:52419",
        "title": "Blue Bamboo",
        "season": 5,
        "episode": 3,
        "released": "1994-10-05",
        "overview": "The killing of a Japanese nightclub owner who was visiting New York leads to the arrest of a singer who once worked for the deceased, and whose lawyer uses the \"battered-woman syndrome\" as a defense. While assisting on the case, Olivet remembers her own prior sexual assault."
      },
      {
        "id": "tvmaze:52420",
        "title": "Family Values",
        "season": 5,
        "episode": 4,
        "released": "1994-10-12",
        "overview": "A missing victim, a suspicious ex-husband and a family hiding something all contribute to the ADAs' decision to risk their licenses on a hunch. After ruling out suicide, McCoy and Kincaid turn their focus on the missing woman's daughter – and take a giant leap to prove their far-fetched theory."
      },
      {
        "id": "tvmaze:52421",
        "title": "White Rabbit",
        "season": 5,
        "episode": 5,
        "released": "1994-10-19",
        "overview": "A burglary unlocks a decades-old case. A safety deposit box company unwittingly exposes a female political activist-fugitive who has been hiding for over 20 years. Detectives locate and arrest one of the four involved in the burglary, and ultimately catch the female fugitive who is accused of killing a policeman during a 1971 robbery."
      },
      {
        "id": "tvmaze:52422",
        "title": "Competence",
        "season": 5,
        "episode": 6,
        "released": "1994-11-02",
        "overview": "When Lt. Van Buren is the victim of an attempted holdup by two teens, she fires her gun and kills one of them, and the detectives are faced with the fact that she shot an unarmed child in the back."
      },
      {
        "id": "tvmaze:52423",
        "title": "Precious",
        "season": 5,
        "episode": 7,
        "released": "1994-11-09",
        "overview": "When Briscoe and Logan suspect that a missing infant may have been murdered rather than kidnapped, they uncover a terrible family secret."
      },
      {
        "id": "tvmaze:52424",
        "title": "Virtue",
        "season": 5,
        "episode": 8,
        "released": "1994-11-23",
        "overview": "McCoy uses a charge of \"larceny by extortion\" against a councilman, whose former colleague claims he demanded sex in exchange for a law-firm partnership."
      },
      {
        "id": "tvmaze:52425",
        "title": "Scoundrels",
        "season": 5,
        "episode": 9,
        "released": "1994-11-30",
        "overview": "Among the suspects in a lawyer's murder are a swindler, who conned a woman out of her family fortune, and the woman's once-wealthy son."
      },
      {
        "id": "tvmaze:52426",
        "title": "House Counsel",
        "season": 5,
        "episode": 10,
        "released": "1995-01-04",
        "overview": "The killing of a man who had served as a juror in a mob trial leads to a battle of wills between McCoy and his long-time friend, the suspect's attorney."
      },
      {
        "id": "tvmaze:52427",
        "title": "Guardian",
        "season": 5,
        "episode": 11,
        "released": "1995-01-11",
        "overview": "After the body of a young female junkie is identified as the daughter of a wealthy family, Briscoe and Logan try to find out who left her to die in the yard of a day-care center."
      },
      {
        "id": "tvmaze:52428",
        "title": "Progeny",
        "season": 5,
        "episode": 12,
        "released": "1995-01-25",
        "overview": "After the murder of an abortion clinic doctor, Briscoe and Logan are led to a suspect who belongs to a radical pro-life movement and their suspicion soon turns to the group's leader, who admits that he's glad the doctor died. McCoy faces the unpleasant task of charging the respected and charismatic former priest with murder, and the public debate over whether the secular community should interfere in spiritual matters."
      },
      {
        "id": "tvmaze:52429",
        "title": "Rage",
        "season": 5,
        "episode": 13,
        "released": "1995-02-01",
        "overview": "A Wall Street broker accused of murdering his mentor uses the defense of \"black rage\" in court."
      },
      {
        "id": "tvmaze:52430",
        "title": "Performance",
        "season": 5,
        "episode": 14,
        "released": "1995-02-08",
        "overview": "Briscoe and Logan set out to identify the apparent victim in a snuff film, but find her alive and really the victim of a points-for-sex club at her prestigious high school."
      },
      {
        "id": "tvmaze:52431",
        "title": "Seed",
        "season": 5,
        "episode": 15,
        "released": "1995-02-15",
        "overview": "A routine investigation into a woman's death leads Briscoe and Logan to a fertility doctor guilty of unethical practices, but who apparently cannot be touched because of confidentiality rules, and patient reluctance to talk."
      },
      {
        "id": "tvmaze:52432",
        "title": "Wannabe",
        "season": 5,
        "episode": 16,
        "released": "1995-03-15",
        "overview": "The shooting of a board member of an exclusive private school leads to a blue-collar family and a classist system."
      },
      {
        "id": "tvmaze:52433",
        "title": "Act of God",
        "season": 5,
        "episode": 17,
        "released": "1995-03-22",
        "overview": "A bomb at a construction site kills a 12-year-old boy, and the suspects include the bankrupt contractor and a jealous husband."
      },
      {
        "id": "tvmaze:52434",
        "title": "Privileged",
        "season": 5,
        "episode": 18,
        "released": "1995-04-05",
        "overview": "The investigation into a double murder leads to a young alcoholic whose family once lived in the victims' house and who admitted to his AA group that he had nightmares about the killings."
      },
      {
        "id": "tvmaze:52435",
        "title": "Cruel and Unusual",
        "season": 5,
        "episode": 19,
        "released": "1995-04-19",
        "overview": "The death of an autistic youth (Steven Burns) in custody reveals a multitude of unusual and possibly illegal therapies being used, but also parents reluctant to pursue a prosecution."
      },
      {
        "id": "tvmaze:52436",
        "title": "Bad Faith",
        "season": 5,
        "episode": 20,
        "released": "1995-04-26",
        "overview": "Logan relives unhappy childhood memories when a friend is found dead; a presumed suicide, until the investigation reveals recent contact with a former priest who has a history of pedophilia."
      },
      {
        "id": "tvmaze:52437",
        "title": "Purple Heart",
        "season": 5,
        "episode": 21,
        "released": "1995-05-03",
        "overview": "The investigation into a taxi driver's murder involves a loan shark, a missing plumber, a forged check and the victim's wife."
      },
      {
        "id": "tvmaze:52438",
        "title": "Switch",
        "season": 5,
        "episode": 22,
        "released": "1995-05-17",
        "overview": "Suspects in a psychiatrist's murder include the victim's ex-husband, a patient suffering from multiple-personality disorder and her obstructive father."
      },
      {
        "id": "tvmaze:52439",
        "title": "Pride",
        "season": 5,
        "episode": 23,
        "released": "1995-05-24",
        "overview": "A gay city councilman is murdered and the trail leads to a bigoted rival politician and a male prostitute."
      },
      {
        "id": "tvmaze:52440",
        "title": "Bitter Fruit",
        "season": 6,
        "episode": 1,
        "released": "1995-09-20",
        "overview": "Briscoe and his new partner, Det. Reynaldo Curtis (Benjamin Bratt), investigate the murder of a young girl who disappeared between school and her music lesson, with a blurry film from an ATM as their clue."
      },
      {
        "id": "tvmaze:52441",
        "title": "Rebels",
        "season": 6,
        "episode": 2,
        "released": "1995-09-27",
        "overview": "Briscoe and Curtis have a hard time finding cooperative witnesses when investigating the murder of a college student at a rough biker bar."
      },
      {
        "id": "tvmaze:52442",
        "title": "Savages",
        "season": 6,
        "episode": 3,
        "released": "1995-10-18",
        "overview": "McCoy and Kincaid clash over the death penalty as McCoy prosecutes a man who murdered an undercover cop during a drug bust."
      },
      {
        "id": "tvmaze:52443",
        "title": "Jeopardy",
        "season": 6,
        "episode": 4,
        "released": "1995-11-01",
        "overview": "A dead editor reveals a family dispute over the family business. Detectives find out that the victim's brother tried to sabotage the victim's reputation and business in order to gain new clients for his own, competing business -- but when forensics evidence is ruled inadmissable, McCoy and Kincaid must refocus their case , leads to a case of sibling rivalry, a protective matriarch and a corrupt judge."
      },
      {
        "id": "tvmaze:52444",
        "title": "Hot Pursuit",
        "season": 6,
        "episode": 5,
        "released": "1995-11-08",
        "overview": "When the detectives solve a series of murders committed by a holdup team in ski masks, McCoy must determine whether a young woman found with them is an unwilling hostage, or an active participant in the crimes."
      },
      {
        "id": "tvmaze:52445",
        "title": "Paranoia",
        "season": 6,
        "episode": 6,
        "released": "1995-11-15",
        "overview": "Briscoe and Curtis try to solve a co-ed's murder after a graphic description appears online, while McCoy finds himself up against a lawyer who is reluctant to reveal elements of her client's past."
      },
      {
        "id": "tvmaze:52446",
        "title": "Humiliation",
        "season": 6,
        "episode": 7,
        "released": "1995-11-22",
        "overview": "The investigation into a prostitute's murder leads to a married plastic surgeon as the obvious suspect, but Kincaid has a hunch that an elaborate frame-up is in play."
      },
      {
        "id": "tvmaze:52447",
        "title": "Angel",
        "season": 6,
        "episode": 8,
        "released": "1995-11-29",
        "overview": "A mother, claiming that her baby was kidnapped while she was at confession, retraces her steps and actions with Curtis, which raises legal questions later when her attorney introduces a unique defense."
      },
      {
        "id": "tvmaze:52448",
        "title": "Blood Libel",
        "season": 6,
        "episode": 9,
        "released": "1996-01-03",
        "overview": "A hidden anti-Semitic message in a high school yearbook offers a clue to an art teacher's murder and leads to a case that matches McCoy against \"Klan lawyer\" Roy Payne."
      },
      {
        "id": "tvmaze:52449",
        "title": "Remand",
        "season": 6,
        "episode": 10,
        "released": "1996-01-10",
        "overview": "The victim in a 30-year-old rape and stabbing case is fearful when information received by Briscoe and Curtis creates the possibility of a new trial for the perpetrator."
      },
      {
        "id": "tvmaze:52450",
        "title": "Corpus Delicti",
        "season": 6,
        "episode": 11,
        "released": "1996-01-17",
        "overview": "The death of a show horse leads to a trial involving insurance fraud, a sting operation and a wealthy woman's disappearance."
      },
      {
        "id": "tvmaze:52451",
        "title": "Trophy",
        "season": 6,
        "episode": 12,
        "released": "1996-01-31",
        "overview": "McCoy finds that his career is on the line when his former assistant and ex-lover accuses him of concealing evidence that helped put an innocent man in prison."
      },
      {
        "id": "tvmaze:52452",
        "title": "Charm City",
        "season": 6,
        "episode": 13,
        "released": "1996-02-07",
        "overview": "Briscoe and Curtis clash with Pembleton and Bayliss, who have come to New York to investigate a subway explosion resembling an unsolved bombing in Baltimore from five years ago. The investigation soon leads to a larger conspiracy."
      },
      {
        "id": "tvmaze:52453",
        "title": "Custody",
        "season": 6,
        "episode": 14,
        "released": "1996-02-21",
        "overview": "Paul Robinette places the system on trial when he defends a young black woman accused of kidnapping her biological baby from his white, adoptive parents."
      },
      {
        "id": "tvmaze:52454",
        "title": "Encore",
        "season": 6,
        "episode": 15,
        "released": "1996-02-28",
        "overview": "A jogger killed in Central Park turns out to be the second wife of a former comedy club owner, who was acquitted of killing his first wife. And convicting him this time may hinge on tracing the path of a Colombian coin used as a subway token slug."
      },
      {
        "id": "tvmaze:52455",
        "title": "Savior",
        "season": 6,
        "episode": 16,
        "released": "1996-03-13",
        "overview": "A down-on-his-luck ad executive becomes the prime suspect when his wife and son are killed, and his daughter wounded on a night that he claims was spent drinking."
      },
      {
        "id": "tvmaze:52456",
        "title": "Deceit",
        "season": 6,
        "episode": 17,
        "released": "1996-03-27",
        "overview": "When a young attorney is murdered shortly after he decides to file a sexual harassment claim against his employer, Briscoe and Curtis quickly discover that the alleged harasser and his wife each have an excellent motive for murder."
      },
      {
        "id": "tvmaze:52457",
        "title": "Atonement",
        "season": 6,
        "episode": 18,
        "released": "1996-04-10",
        "overview": "The investigation into the murder of a model with a passion for cocaine and partying focuses on the men in her life — a nightclub owner, a basketball player, a photographer and a limousine driver."
      },
      {
        "id": "tvmaze:52458",
        "title": "Slave",
        "season": 6,
        "episode": 19,
        "released": "1996-04-21",
        "overview": "A woman is shot while sleeping and the investigation leads the police to a boy whose crack-addicted mother has entrusted him to a dealer's care."
      },
      {
        "id": "tvmaze:52459",
        "title": "Girlfriends",
        "season": 6,
        "episode": 20,
        "released": "1996-05-01",
        "overview": "After a college co-ed's body is found, the detectives look for a campus rapist, but the medical examiner's report puts them on a different path, one involving prostitution."
      },
      {
        "id": "tvmaze:52460",
        "title": "Pro Se",
        "season": 6,
        "episode": 21,
        "released": "1996-05-08",
        "overview": "The investigation into multiple homicides at a clothing store leads to the arrest of a schizophrenic (Denis O'Hare) who presents McCoy with a formidable opponent when he decides to represent himself."
      },
      {
        "id": "tvmaze:52461",
        "title": "Homesick",
        "season": 6,
        "episode": 22,
        "released": "1996-05-15",
        "overview": "After an infant is found dead in his crib, it is determined he was poisoned, and all evidence points to the child's au pair."
      },
      {
        "id": "tvmaze:52462",
        "title": "Aftershock",
        "season": 6,
        "episode": 23,
        "released": "1996-05-22",
        "overview": "After Briscoe, Curtis, McCoy, and Kincaid witness the execution of a criminal they brought to justice, their unique reactions to the event culminate in personal tragedies for each of them."
      },
      {
        "id": "tvmaze:52463",
        "title": "Causa Mortis",
        "season": 7,
        "episode": 1,
        "released": "1996-09-18",
        "overview": "McCoy's new second chair, ADA Jamie Ross, is determined to prosecute as harshly as possible a carjacker who took the life of a teacher as she pleaded for her life on an audio tape discovered at the crime scene."
      },
      {
        "id": "tvmaze:52464",
        "title": "ID",
        "season": 7,
        "episode": 2,
        "released": "1996-09-25",
        "overview": "The cops tackle identifying a corpse left in an elevator, and McCoy finds his prosecution of the suspect later hampered by a vindictive judge (Jerry Adler) who resents Ross's in-court rebuke for sexual harassment."
      },
      {
        "id": "tvmaze:52465",
        "title": "Good Girl",
        "season": 7,
        "episode": 3,
        "released": "1996-10-07",
        "overview": "Briscoe and Curtis have to break the mutual alibi of two girlfriends as they try to find the killer of a young black man, whose angry parents pressure McCoy to indict a young woman who claims the victim had raped her."
      },
      {
        "id": "tvmaze:52466",
        "title": "Survivor",
        "season": 7,
        "episode": 4,
        "released": "1996-10-23",
        "overview": "Briscoe and Curtis's investigation of the murder of a rare coin dealer nets them a millionaire as a suspect, but Ross has to play detective too as the DA's office tries to establish a provenance for the missing coin collection."
      },
      {
        "id": "tvmaze:52467",
        "title": "Corruption",
        "season": 7,
        "episode": 5,
        "released": "1996-10-30",
        "overview": "Curtis, angered by the attitude of an old colleague of Briscoe's, looks beyond the findings of an IAB investigation and turns up evidence of police corruption that puts the DA's office into competition with an ambitious judge and Briscoe under investigation for stealing evidence from a police lockup."
      },
      {
        "id": "tvmaze:52468",
        "title": "Double Blind",
        "season": 7,
        "episode": 6,
        "released": "1996-11-06",
        "overview": "The murder of a janitor in a university laboratory building leads back to a student employee whose participation in a drug study may have prompted the crime."
      },
      {
        "id": "tvmaze:52469",
        "title": "Deadbeat",
        "season": 7,
        "episode": 7,
        "released": "1996-11-13",
        "overview": "The murder of a deadbeat father whose son is dying of leukemia presents McCoy and Ross with a sympathetic suspect and a moral dilemma."
      },
      {
        "id": "tvmaze:52470",
        "title": "Family Business",
        "season": 7,
        "episode": 8,
        "released": "1996-11-20",
        "overview": "The murder of Richard Speigel, chief financial officer for an exclusive, family-owned department store goes from the sitting room to the bedroom and into the board room as suspicion shifts from co-workers to family members."
      },
      {
        "id": "tvmaze:52471",
        "title": "Entrapment",
        "season": 7,
        "episode": 9,
        "released": "1997-01-08",
        "overview": "The case against Huey Tate, a young man accused of shooting the well-known leader of the African-American Congress, comes undone when the New York authorities learn that their chief witness was once an informant for the FBI, and is still under their protection."
      },
      {
        "id": "tvmaze:52472",
        "title": "Legacy",
        "season": 7,
        "episode": 10,
        "released": "1997-01-15",
        "overview": "The investigation of a seemingly random shooting leads Briscoe and Curtis to a brazen, cold-blooded hitman, and the only way to bring him down is for Briscoe to pose as his competition. The case is complicated during trial when we learn that the victim was shot as revenge for a murder he committed himself just three years ago."
      },
      {
        "id": "tvmaze:52473",
        "title": "Menace",
        "season": 7,
        "episode": 11,
        "released": "1997-02-05",
        "overview": "An apparent suicide turns out to be murder as Briscoe and Curtis investigate the death of a woman who jumped from a bridge (in front of numerous bystanders) to avoid a crazed attacker with whom she was apparently involved in a fender-bender. When they are unable to convict, McCoy and Ross dig deeper and discover that the 'accident' might not have been so accidental after all. Meanwhile, Curtis is booted from his house after admitting to his wife that he cheated on her."
      },
      {
        "id": "tvmaze:52474",
        "title": "Barter",
        "season": 7,
        "episode": 12,
        "released": "1997-02-12",
        "overview": "An unpromising case of murder suddenly develops new leads when the cops explore the possibility that the victim was mistaken for someone else. McCoy walks a thin line in the matter of ethical conduct as he tries to make a case against a lender who uses unscrupulous methods to collect the money owed to him."
      },
      {
        "id": "tvmaze:52475",
        "title": "Matrimony",
        "season": 7,
        "episode": 13,
        "released": "1997-02-19",
        "overview": "The discovery of a would-be thief refocuses a murder investigation, leaving the prosecutors the task of making a conspiracy case against the deceased's attorney and the pretty young widow."
      },
      {
        "id": "tvmaze:52476",
        "title": "Working Mom",
        "season": 7,
        "episode": 14,
        "released": "1997-02-26",
        "overview": "The shooting of an ex-cop in a neighborhood notorious for prostitution leads Briscoe and Curtis to two suburban housewives who are secretly high-class hookers. When one of the housewife's specialty lipstick is matched to a lipstick sample taken from a very private spot on the victim, it seems like McCoy has an open and shut case. However, the accused soon claims rape and hires a famous women's rights attorney to defend her. Felicity Huffman (Sports Night) guest stars."
      },
      {
        "id": "tvmaze:52477",
        "title": "D-Girl",
        "season": 7,
        "episode": 15,
        "released": "1997-03-13",
        "overview": "A headless corpse fished out of the river sends Briscoe and Curtis out to Los Angeles to obtain a blood sample from their chief suspect. Back in New York, McCoy and Ross try to obtain a court order for the procedure."
      },
      {
        "id": "tvmaze:52478",
        "title": "Turnaround",
        "season": 7,
        "episode": 16,
        "released": "1997-03-20",
        "overview": "In New York, Briscoe and Curtis try to pin down the suspect's schedule on the night of the murder, but find instead that another man was in the area at the right time and more importantly, might have a motive for the crime. After a new arrest warrant is issued, McCoy and Ross have to fly to L.A. to defend their warrant against attacks by the man's defense counsel, Ross's former husband Neal Gorton."
      },
      {
        "id": "tvmaze:52479",
        "title": "Showtime",
        "season": 7,
        "episode": 17,
        "released": "1997-03-27",
        "overview": "The trial of Eddie Newman begins but the prosecution's chances of conviction are hampered by a \"dream team\" of defense attorneys, Gorton's personal pressures on Ross, and a surprise accusation of sexual harassment. Curtis' relationship with Lisa also creates tension."
      },
      {
        "id": "tvmaze:52480",
        "title": "Mad Dog",
        "season": 7,
        "episode": 18,
        "released": "1997-04-02",
        "overview": "McCoy pushes the police perilously close to harassment as he tries to link a recently paroled serial rapist to a new fatal rape."
      },
      {
        "id": "tvmaze:52481",
        "title": "Double Down",
        "season": 7,
        "episode": 19,
        "released": "1997-04-16",
        "overview": "The cops' best hope of finding a kidnapped hired car driver alive is one of the armed robbers who grabbed him after a job, but the immunity deal he demands in return would effectively preclude his prosecution for the shooting death of an off-duty cop, placing McCoy in a difficult position as he seeks to placate the cops, who want the guy prosecuted, and the kidnapped man's wife, who wants every avenue of saving her husband explored.The cops' best hope of finding a kidnapped hired car driver alive is one of the armed robbers who grabbed him after a job, but the immunity deal he demands in return would effectively preclude his prosecution for the shooting death of an off-duty cop, placing McCoy in a difficult position as he seeks to placate the cops, who want the guy prosecuted, and the kidnapped man's wife, who wants every avenue of saving her husband explored."
      },
      {
        "id": "tvmaze:52482",
        "title": "We Like Mike",
        "season": 7,
        "episode": 20,
        "released": "1997-04-30",
        "overview": "A young man who claims to have helped a murdered young man change a flat tire is first the cops' primary suspect, then the prosecutors' chief witness."
      },
      {
        "id": "tvmaze:52483",
        "title": "Passion",
        "season": 7,
        "episode": 21,
        "released": "1997-05-07",
        "overview": "Briscoe and Curtis investigate the death of a pretty young book editor who was reputedly having an affair with one of her authors, and find themselves focusing on the author's longtime companion, who steadfastly denies there was anything wrong with their relationship."
      },
      {
        "id": "tvmaze:52484",
        "title": "Past Imperfect",
        "season": 7,
        "episode": 22,
        "released": "1997-05-14",
        "overview": "The cops have a definite clue when a bloodstain that's not the same as the victim's reveals that the killer was a blood relative, and the prosecutors stumble when their chief suspect claims their chief witness is her lawyer, and his knowledge of the crime represents privileged communications."
      },
      {
        "id": "tvmaze:52485",
        "title": "Terminal",
        "season": 7,
        "episode": 23,
        "released": "1997-05-21",
        "overview": "The cops uncover a man with a secret second life as they try to learn who opened fire on a group of people disembarking from a party cruise, but his guilt or innocence becomes almost a second thought as Adam Schiff goes toe-to-toe with the governor and the state's Attorney General over the decision to seek the death penalty. Meanwhile Schiff learns his wife has been rushed to Cedar's Hospital after suffering a severe stroke rendering her unconscious."
      },
      {
        "id": "tvmaze:52486",
        "title": "Thrill",
        "season": 8,
        "episode": 1,
        "released": "1997-09-24",
        "overview": "The cops break the seemingly random murder of a fried chicken deliverer with a little \"undercover\" work in the park, but McCoy and Ross face a harder battle to get a conviction when the two defendants resolutely point the finger at each other, and the one item identifying the actual killer is the recording of a confession-made to a priest. Meanwhile, Curtis learns that his wife has multiple sclerosis."
      },
      {
        "id": "tvmaze:52487",
        "title": "Denial",
        "season": 8,
        "episode": 2,
        "released": "1997-10-08",
        "overview": "Bloody sheets and an apparently stolen credit card lead Briscoe and Curtis to a pair of college-age lovers who present McCoy and Ross with a united front of denial that one of them killed their newborn son and disposed of the body."
      },
      {
        "id": "tvmaze:52488",
        "title": "Navy Blues",
        "season": 8,
        "episode": 3,
        "released": "1997-10-15",
        "overview": "McCoy finds himself battling the Navy and the office of the Judge Advocate General as he tries to prosecute a female pilot accused of murdering her married lover after he tried to break off with her."
      },
      {
        "id": "tvmaze:52489",
        "title": "Harvest",
        "season": 8,
        "episode": 4,
        "released": "1997-10-29",
        "overview": "A discrepancy concerning the time of death of a drive-by shooting victim leads McCoy and Ross to initiate prosecutions against both the shooter and the doctor who harvested her organs as transplant donations."
      },
      {
        "id": "tvmaze:52490",
        "title": "Nullification",
        "season": 8,
        "episode": 5,
        "released": "1997-11-05",
        "overview": "After the cops trace an eagle tattoo on a man shot and killed while holding up an armored truck to a group of militia members, McCoy finds himself facing one of their number as the pro se counsel for his friends, arguing for the concept of \"jury nullification\", the right of a jury to protect a defendant from an unjust law by acquittal despite the evidence."
      },
      {
        "id": "tvmaze:52491",
        "title": "Baby, It's You",
        "season": 8,
        "episode": 6,
        "released": "1997-11-12",
        "overview": "Falsone and Munch team up with Briscoe and Curtis to investigate the murder of a 14-year-old girl. They trace the suspect from New York back to Baltimore."
      },
      {
        "id": "tvmaze:52492",
        "title": "Blood",
        "season": 8,
        "episode": 7,
        "released": "1997-11-19",
        "overview": "The paternity of a black baby given up for adoption by a white mother who later fell from an apartment balcony might provide a clue to her murderer, but it also unearths some long-buried family secrets that it seems more than one person would kill to keep hidden."
      },
      {
        "id": "tvmaze:52493",
        "title": "Shadow",
        "season": 8,
        "episode": 8,
        "released": "1997-11-26",
        "overview": "The murder of a bail bondsman looks fairly routine until the chance words of the chief suspect uncover possible case-fixing between a shady lawyer and an unknown contact within the judicial system."
      },
      {
        "id": "tvmaze:52494",
        "title": "Burned",
        "season": 8,
        "episode": 9,
        "released": "1997-12-10",
        "overview": "A message overheard on an answering machine leads Briscoe and Curtis to a confessed murderer and the home of wealthy Carl Anderton, an old friend of Adam Schiff, whose stubborn non-cooperation with the district attorney threatens to create a serious miscarriage of justice."
      },
      {
        "id": "tvmaze:52495",
        "title": "Ritual",
        "season": 8,
        "episode": 10,
        "released": "1997-12-17",
        "overview": "Curtis and Briscoe investigate the death of Josef Moussad, an Arab man found behind a dumpster, the victim of an apparent mugging. The detectives soon realize that Moussad had brought a doctor into the country to perform aclitoridectomy on his young niece, and suspicion turns to the family. Ross is horrified that young Alison's grandmother and uncle were both in full support of the operation, which makes it hard for her to prosecute the case objectively."
      },
      {
        "id": "tvmaze:52496",
        "title": "Under the Influence",
        "season": 8,
        "episode": 11,
        "released": "1998-01-07",
        "overview": "After Briscoe and Curtis finally determine who was driving the car that killed three people, the legal prosecution stands in danger of becoming a kangaroo court when McCoy's feelings over Kincaid mesh with the political agenda of Gary Feldman, an ambitious judge anxious to make an example of the defendant to boost his election chances against Adam Schiff."
      },
      {
        "id": "tvmaze:52497",
        "title": "Expert",
        "season": 8,
        "episode": 12,
        "released": "1998-01-21",
        "overview": "The shooting of two people in a restaurant restroom takes some abrupt turns as they try to discover who exactly the intended victim was, and the prosecutors have to deal with a defendant claiming to have been in a dissociative state while committing the crime — the same defense used years before by the defendant's father."
      },
      {
        "id": "tvmaze:52498",
        "title": "Castoff",
        "season": 8,
        "episode": 13,
        "released": "1998-01-28",
        "overview": "The street murder of a woman who worked with underprivileged kids takes a turn towards the bizarre when the detectives uncover she had a predilection for kinky sex, and that one of her current partners appears to be a serial killer, who offers an overexposure to television violence as his defense during his trial."
      },
      {
        "id": "tvmaze:52499",
        "title": "Grief",
        "season": 8,
        "episode": 14,
        "released": "1998-02-04",
        "overview": "The cops, as they try to pin down the specifics of an assault on a man reluctant to talk about it, uncover the alleged rape of two women in custodial care. But as the prosecutors attempt to prepare their case, a reluctant witness changes their view of the cases."
      },
      {
        "id": "tvmaze:52500",
        "title": "Faccia a Faccia",
        "season": 8,
        "episode": 15,
        "released": "1998-02-25",
        "overview": "Taking on an apparent Mafia murder, Detectives Briscoe and Curtis are stymied by a dead witness and a seemingly incoherent mob boss."
      },
      {
        "id": "tvmaze:52501",
        "title": "Divorce",
        "season": 8,
        "episode": 16,
        "released": "1998-03-04",
        "overview": "The stabbing death of a psychologist draws Detectives Briscoe and Curtis into a heated divorce case and pits McCoy and Ross against a manipulative attorney."
      },
      {
        "id": "tvmaze:52502",
        "title": "Carrier",
        "season": 8,
        "episode": 17,
        "released": "1998-04-01",
        "overview": "The death of a college student leads to a case involving an HIV-positive male who's seeking to infect as many young women as possible. McCoy, testing right-to-privacy ethics, wants to charge him with murder."
      },
      {
        "id": "tvmaze:52503",
        "title": "Stalker",
        "season": 8,
        "episode": 18,
        "released": "1998-04-15",
        "overview": "When a woman is found unconscious at the bottom of her apartment stairs, Briscoe and Curtis must figure out what happened — before it's too late. In order to make his case, McCoy pits the two detectives against each other in the courtroom."
      },
      {
        "id": "tvmaze:52504",
        "title": "Disappeared",
        "season": 8,
        "episode": 19,
        "released": "1998-04-22",
        "overview": "A defendant refuses to allow his lawyer to raise the issue of insanity. This complicates matters for the brother who turned him in with hopes of securing medical treatment for him."
      },
      {
        "id": "tvmaze:52505",
        "title": "Burden",
        "season": 8,
        "episode": 20,
        "released": "1998-04-24",
        "overview": "After a 12-year-old quadriplegic dies at home in his bed, paramedics claim that he was suffocated and the suspects include the boy's parents and sister."
      },
      {
        "id": "tvmaze:52506",
        "title": "Bad Girl",
        "season": 8,
        "episode": 21,
        "released": "1998-04-29",
        "overview": "Schiff's re-election may hinge on the stabbing death of a police officer; Briscoe's daughter is arrested for dealing drugs."
      },
      {
        "id": "tvmaze:52507",
        "title": "Damaged",
        "season": 8,
        "episode": 22,
        "released": "1998-05-06",
        "overview": "The case of a teacher's shooting uncovers a vendetta involving the rape of a mentally challenged coed by three students, whose attorney claims they weren't aware of her condition. Briscoe is devastated to learn of his daughter Cathy's death."
      },
      {
        "id": "tvmaze:52508",
        "title": "Tabloid",
        "season": 8,
        "episode": 23,
        "released": "1998-05-13",
        "overview": "Tabloid journalism comes under scrutiny during the investigations into the deaths of a gossip columnist and a celebrity target he pursued."
      },
      {
        "id": "tvmaze:52509",
        "title": "Monster",
        "season": 8,
        "episode": 24,
        "released": "1998-05-20",
        "overview": "A 10-year-old girl is raped and rendered comatose by a pedophile. A snitch offers Briscoe a chance to avenge his daughter's death. The NYPD brass is looking to force Lieutenant Van Buren out of her job, while Ross resigns from hers to devote more time to her family life and her ongoing divorce. McCoy, meanwhile, must contend with Judge Feldman as an adversary both at trial and outside the courtroom due to an ethics complaint the judge filed against him. While all of this goes on, Schiff begins to consider the possibility that Feldman might defeat him in the election."
      },
      {
        "id": "tvmaze:52510",
        "title": "Cherished",
        "season": 9,
        "episode": 1,
        "released": "1998-09-23",
        "overview": "After a baby girl is found dead, Briscoe and Curtis investigate the family and learn that her adopted family and brother were trying to keep some painful secrets. Jack gets a new partner, Abbie Carmichael, who had a 95% conviction rate in her four years with Special Narcotics. Together McCoy and Carmichael try to prove that the little girl's brother committed the crime."
      },
      {
        "id": "tvmaze:52511",
        "title": "DWB",
        "season": 9,
        "episode": 2,
        "released": "1998-10-07",
        "overview": "Detectives discover a shocking twist involving unlikely suspects when they investigate the brutal beating of a black man dumped near the highway."
      },
      {
        "id": "tvmaze:52512",
        "title": "Bait",
        "season": 9,
        "episode": 3,
        "released": "1998-10-14",
        "overview": "The investigation into how a teen got wounded leads to a case involving a young woman's murder and a drug operation."
      },
      {
        "id": "tvmaze:52513",
        "title": "Flight",
        "season": 9,
        "episode": 4,
        "released": "1998-10-21",
        "overview": "After a child in a day-care center dies from an antibiotic resistant bacteria, Briscoe and Curtis try to find the source of the infection, leading to a case involving an extramarital affair, embezzlement and a drug manufacturer."
      },
      {
        "id": "tvmaze:52514",
        "title": "Agony",
        "season": 9,
        "episode": 5,
        "released": "1998-11-04",
        "overview": "After the detectives find a murdered postman and a woman who was left for dead in her apartment, the investigation leads to a serial killer and a surprise."
      },
      {
        "id": "tvmaze:52515",
        "title": "Scrambled",
        "season": 9,
        "episode": 6,
        "released": "1998-11-11",
        "overview": "The murder of an employee at a fertility clinic leads to a case involving a dead man's first and second wives."
      },
      {
        "id": "tvmaze:52516",
        "title": "Venom",
        "season": 9,
        "episode": 7,
        "released": "1998-11-18",
        "overview": "The killing of a professional escort leads to a case involving the relationships between a young man and two older women."
      },
      {
        "id": "tvmaze:52517",
        "title": "Punk",
        "season": 9,
        "episode": 8,
        "released": "1998-11-25",
        "overview": "The murder of a corrections officer leads detectives to a women's prison where a guard was linked to an inmate Carmichael put away on drug charges and a confrontation with defense attorney Danielle Melnick."
      },
      {
        "id": "tvmaze:52518",
        "title": "True North",
        "season": 9,
        "episode": 9,
        "released": "1998-12-09",
        "overview": "The double murder of a wealthy man and his daughter leads the detectives to the wife and stepmother of the deceased. However, Canada's objection to the death penalty hampers McCoy and Carmichael in seeking crucial evidence for obtaining a conviction."
      },
      {
        "id": "tvmaze:52519",
        "title": "Hate",
        "season": 9,
        "episode": 10,
        "released": "1999-01-06",
        "overview": "Evidence points the detectives in the direction of a white supremacist youth gathering after the brutal beating and murder of a high school girl."
      },
      {
        "id": "tvmaze:52520",
        "title": "Ramparts",
        "season": 9,
        "episode": 11,
        "released": "1999-01-13",
        "overview": "Briscoe and Curtis reopen a case that was closed in the 1960s when a vehicle is dredged from the Hudson River containing the remains of a murdered man who was involved in a fight for civil rights."
      },
      {
        "id": "tvmaze:52521",
        "title": "Haven",
        "season": 9,
        "episode": 12,
        "released": "1999-02-10",
        "overview": "Briscoe and Curtis probe the murder of a popular Harlem community leader while McCoy and Carmichael struggle to prevent a chaotic situation involving affirmative action."
      },
      {
        "id": "tvmaze:52522",
        "title": "Hunters",
        "season": 9,
        "episode": 13,
        "released": "1999-02-10",
        "overview": "Briscoe and Curtis race against time to find the killer of a parolee before two bounty hunters find the suspected murderer."
      },
      {
        "id": "tvmaze:52523",
        "title": "Sideshow",
        "season": 9,
        "episode": 14,
        "released": "1999-02-17",
        "overview": "The New York and Baltimore detectives re-team to investigate the murder of a government worker and expose a connection to the White House."
      },
      {
        "id": "tvmaze:52524",
        "title": "Disciple",
        "season": 9,
        "episode": 15,
        "released": "1999-02-24",
        "overview": "After a teen is found dead in the emergency room, the investigation leads to a case involving a religious ritual and a defendant who claims that the action taken was dictated by a saint's voice."
      },
      {
        "id": "tvmaze:52525",
        "title": "Harm",
        "season": 9,
        "episode": 16,
        "released": "1999-03-03",
        "overview": "Briscoe and Curtis investigate a possible homicide while probing the assault of a retired divorce attorney."
      },
      {
        "id": "tvmaze:52526",
        "title": "Shield",
        "season": 9,
        "episode": 17,
        "released": "1999-03-24",
        "overview": "Briscoe and Curtis investigate the murder of a police officer who was shot while on an undercover stakeout."
      },
      {
        "id": "tvmaze:52527",
        "title": "Juvenile",
        "season": 9,
        "episode": 18,
        "released": "1999-04-14",
        "overview": "The investigation into the shooting of a newspaper columnist leads to a murder case from the 1970s and involves a suspect who at the time had been a juvenile."
      },
      {
        "id": "tvmaze:52528",
        "title": "Tabula Rasa",
        "season": 9,
        "episode": 19,
        "released": "1999-04-21",
        "overview": "After a philosophy professor is pushed in front of a subway train and killed, the investigation leads to a suspect who, following a divorce, changed his identity and disappeared with his daughters."
      },
      {
        "id": "tvmaze:52529",
        "title": "Empire",
        "season": 9,
        "episode": 20,
        "released": "1999-05-05",
        "overview": "The death of a corporate mogul caused by an overdose of a sexual performance-enhancing drug leads to a case with a witness that puts Curtis in a compromising position."
      },
      {
        "id": "tvmaze:52530",
        "title": "Ambitious",
        "season": 9,
        "episode": 21,
        "released": "1999-05-12",
        "overview": "The murder of an audio installation salesman leads the detectives to a case with connections to the Italian mafia."
      },
      {
        "id": "tvmaze:52531",
        "title": "Admissions",
        "season": 9,
        "episode": 22,
        "released": "1999-05-19",
        "overview": "A coed's killing leads to a case involving the deceased's relationship with a professor and two male students who vouch for each other's whereabouts on the night of the murder."
      },
      {
        "id": "tvmaze:52532",
        "title": "Refuge (1)",
        "season": 9,
        "episode": 23,
        "released": "1999-05-26",
        "overview": "A crime scene where both the victim and perpetrator are found dead leads detectives and attorneys to a speechless 10-year-old witness – and into a dangerous web that involves the ruthless Russian mafia."
      },
      {
        "id": "tvmaze:52533",
        "title": "Refuge (2)",
        "season": 9,
        "episode": 24,
        "released": "1999-05-26",
        "overview": "McCoy must connect defendants who are part of the Russian mob with a money-laundering operation before vital evidence is destroyed - and any more witnesses are found dead."
      },
      {
        "id": "tvmaze:52534",
        "title": "Gunshow",
        "season": 10,
        "episode": 1,
        "released": "1999-09-22",
        "overview": "A murderer's shooting spree in Central Park prompts Briscoe and his new partner, Detective Ed Green, to trace the murder weapon's origin; McCoy makes it his mission to punish the killer and the gun manufacturer."
      },
      {
        "id": "tvmaze:52535",
        "title": "Killerz",
        "season": 10,
        "episode": 2,
        "released": "1999-09-29",
        "overview": "Briscoe and Green believe a 10-year-old is responsible for a child's death, and McCoy wants her isolated to stop any future fatalities."
      },
      {
        "id": "tvmaze:52536",
        "title": "DNR",
        "season": 10,
        "episode": 3,
        "released": "1999-10-06",
        "overview": "As Briscoe and Green investigate the shooting of a judge, suspicion quickly points to her husband as the person who ordered the hit, but McCoy's case is hindered when she refuses to implicate her husband during the trial."
      },
      {
        "id": "tvmaze:52537",
        "title": "Merger",
        "season": 10,
        "episode": 4,
        "released": "1999-10-13",
        "overview": "The murder of a drug-laden teen presents the detectives with a host of suspects from her wealthy family."
      },
      {
        "id": "tvmaze:52538",
        "title": "Justice",
        "season": 10,
        "episode": 5,
        "released": "1999-11-10",
        "overview": "After the murder of a lawyer, McCoy finds himself on the opposite side of the courtroom from his former colleague, Jamie Ross, when she defends a man who claims to have key evidence that could put to death a man McCoy believes was wrongly convicted."
      },
      {
        "id": "tvmaze:52539",
        "title": "Marathon",
        "season": 10,
        "episode": 6,
        "released": "1999-11-17",
        "overview": "A frustrating investigation of a purse-snatching victim who was fatally shot leads to tension between Briscoe and Green over age and racial innuendos. Briscoe notices his partner has developed a dangerous habit."
      },
      {
        "id": "tvmaze:52540",
        "title": "Patsy",
        "season": 10,
        "episode": 7,
        "released": "1999-11-24",
        "overview": "The investigation that follows the discovery of a comatose woman in her apartment leads to an unusual case involving murder and a possible frame-up, despite the prosecution having key DNA evidence to the contrary."
      },
      {
        "id": "tvmaze:52541",
        "title": "Blood Money",
        "season": 10,
        "episode": 8,
        "released": "1999-12-01",
        "overview": "A taxi driver finds that his passenger is dead, leading the detectives to a case involving an insurance scam and Holocaust victims."
      },
      {
        "id": "tvmaze:52542",
        "title": "Sundown",
        "season": 10,
        "episode": 9,
        "released": "1999-12-15",
        "overview": "A patient is found beaten to death in a hospital lounge — and the resulting case involves infidelity, Alzheimer's disease and a ladies' man."
      },
      {
        "id": "tvmaze:52543",
        "title": "Loco Parentis",
        "season": 10,
        "episode": 10,
        "released": "2000-01-05",
        "overview": "After sanitation workers find a teenage boy's body, the investigation leads to a school bully who displays an avid interest in martial-arts weapons, and whose father bought the murder weapon."
      },
      {
        "id": "tvmaze:52544",
        "title": "Collision",
        "season": 10,
        "episode": 11,
        "released": "2000-01-26",
        "overview": "The investigation of a schizophrenic woman's death leads to a case involving a homeless man and his right to refuse medication. It is revealed that the schizophrenic woman and the homeless man were lovers. The woman told the man to kill her if he loved her. She also loved him. He refused to take his medication because he wanted to die because of guilt. He pleads guilty to manslaughter in the first degree along with medication in the psychiatric facility."
      },
      {
        "id": "tvmaze:52545",
        "title": "Mother's Milk",
        "season": 10,
        "episode": 12,
        "released": "2000-02-09",
        "overview": "Bloodstains in an apartment that belonged to a young couple with a baby leads to the separated parents, each of whom claims that the other has the infant. The baby is later found dead."
      },
      {
        "id": "tvmaze:52546",
        "title": "Panic",
        "season": 10,
        "episode": 13,
        "released": "2000-02-16",
        "overview": "Briscoe and Green investigate the shooting of a best-selling mystery writer and the death of her accountant, with a love triangle involving the author's consulting FBI agent (Tom Berenger) as a possible motive for the crime."
      },
      {
        "id": "tvmaze:52547",
        "title": "Entitled, Part 2",
        "season": 10,
        "episode": 14,
        "released": "2000-02-18",
        "overview": "The detectives of Special Victims Unit team with the 27th Precinct to investigate a salesman's murder, leading them to a politically influential family. When the case goes to court, McCoy finds the matriarch to be a formidable opponent."
      },
      {
        "id": "tvmaze:52548",
        "title": "Fools for Love",
        "season": 10,
        "episode": 15,
        "released": "2000-02-23",
        "overview": "After the bodies of two teens are found, the detectives trace their identities and learn that one of them had a sister who was traveling with the girls."
      },
      {
        "id": "tvmaze:52549",
        "title": "Trade This",
        "season": 10,
        "episode": 16,
        "released": "2000-03-01",
        "overview": "The murder of a stockbroker points to a coworker and supervisor (Michael Gross (actor)) involved with organized crime when a hired hit man kills the prime suspect."
      },
      {
        "id": "tvmaze:52550",
        "title": "Black, White and Blue",
        "season": 10,
        "episode": 17,
        "released": "2000-03-22",
        "overview": "The murder of a young white man in Harlem sparks outrage when it is discovered that two police officers intentionally dropped him off in a known crime prone neighborhood."
      },
      {
        "id": "tvmaze:52551",
        "title": "Mega",
        "season": 10,
        "episode": 18,
        "released": "2000-04-05",
        "overview": "The investigation into a helicopter bombing points to a victim's wife and her unconventional financial adviser (Michael McKean)."
      },
      {
        "id": "tvmaze:52552",
        "title": "Surrender Dorothy",
        "season": 10,
        "episode": 19,
        "released": "2000-04-26",
        "overview": "The body of a teacher, suspected of having an affair, is found in a car trunk and the investigation involves husband and father-in-law, both of whom are psychiatrists."
      },
      {
        "id": "tvmaze:52553",
        "title": "Untitled",
        "season": 10,
        "episode": 20,
        "released": "2000-05-03",
        "overview": "A wealthy woman, who is a patron of the arts, is found dead in her apartment and the ensuing investigation leads to a suspect whose violence was spurred by a painting similar to the crime scene."
      },
      {
        "id": "tvmaze:52554",
        "title": "Narcosis",
        "season": 10,
        "episode": 21,
        "released": "2000-05-10",
        "overview": "The discovery of a strangled prostitute's body leads to a case involving illegal immigrants and a family grappling with internet addiction."
      },
      {
        "id": "tvmaze:52555",
        "title": "High & Low",
        "season": 10,
        "episode": 22,
        "released": "2000-05-17",
        "overview": "Detectives Briscoe and Green probe the strangulation of a college coed who moonlighted as a stripper, and while they believe a pair of drug-dealing skinheads committed the murder, they struggle to determine the motive of the strip club owner who paid them for the hit. However, as they work their way up the ladder of complicity, the cops learn that the slaying is keyed to an insider trading scam that forces McCoy to connect a former porn star with a businessman."
      },
      {
        "id": "tvmaze:52556",
        "title": "Stiff",
        "season": 10,
        "episode": 23,
        "released": "2000-05-24",
        "overview": "The detectives' investigation into why a wealthy woman is comatose involves her husband, daughter, and doctor (John Slattery)."
      },
      {
        "id": "tvmaze:52557",
        "title": "Vaya Con Dios",
        "season": 10,
        "episode": 24,
        "released": "2000-05-24",
        "overview": "The death of an elderly man trying to find who was responsible for the torture killing of his son in Chile in 1973 leads to a former high-ranking Chilean Army officer who is in New York receiving cancer treatments at a Manhattan hospital."
      },
      {
        "id": "tvmaze:52558",
        "title": "Endurance",
        "season": 11,
        "episode": 1,
        "released": "2000-10-18",
        "overview": "A suspicious apartment fire leaves a severely disabled boy dead of smoke inhalation. Though an antique store owner in the same building had been \"victim\" to several other fires in the past, Detectives Briscoe and Green are drawn to suspects closer to home as they discover the tremendous burden the young boy posed to his parents and their failed marriage during his twelve years. As more is learned about the devoted mother (Megan Follows), even E.A.D.A. Jack McCoy begins to question whether his prosecution is truly in the service of justice. Meanwhile, Mayor Giuliani introduces Interim District Attorney Nora Lewin (Dianne Wiest) to McCoy and Carmichael."
      },
      {
        "id": "tvmaze:52559",
        "title": "Turnstile Justice",
        "season": 11,
        "episode": 2,
        "released": "2000-10-25",
        "overview": "When a woman with no identification is found dead from a blow to the head with a pavement stone, the only clues to her past are found in the information stored on her mass-transit pass. More magnetic evidence leads Detectives Briscoe and Green to the current possessor of the dead woman's credit card; but once they have their suspect, the mental state of the attacker calls into question whether the perpetrator alone is responsible for the tragedy. Following a plea to action from the deceased's husband (Ty Burrell), District Attorney Lewin pursues media glory by encouraging prosecutors McCoy and Carmichael to take on the health care system responsible for releasing the emotionally disturbed convict into society."
      },
      {
        "id": "tvmaze:52560",
        "title": "Dissonance",
        "season": 11,
        "episode": 3,
        "released": "2000-11-01",
        "overview": "When the star violinist of the Manhattan Symphony Orchestra is found murdered in her dressing room, Detectives Briscoe and Green don't have to look beyond the concert hall for an array of leads. The priceless violin she played is missing and the rest of the violin section is found to have been resentful of the recent Juilliard graduate's rapid ascent to stardom. Meanwhile, the brilliant and debonair conductor Carl Reger (Ronald Guttman), whose wife also performs in the orchestra, points the detectives toward a stagehand who may have been rebuffed in his advances toward the victim, as his own relationship with his first chair violinist comes under scrutiny."
      },
      {
        "id": "tvmaze:52561",
        "title": "Standoff",
        "season": 11,
        "episode": 4,
        "released": "2000-11-08",
        "overview": "When a gang leader convicted of brutal crimes is stabbed to death in a prison scuffle, Detectives Briscoe and Green find that their victim had numerous enemies on both sides of the law. The investigation; in which gang members, corrections officers, and undercover cops are all suspects; results in an eventual indictment that leaves E.A.D.A. McCoy with an uphill battle as he tries to convict the murderer of a vicious criminal."
      },
      {
        "id": "tvmaze:52562",
        "title": "Return",
        "season": 11,
        "episode": 5,
        "released": "2000-11-15",
        "overview": "The murder of a storeowner leads to a case where the suspect flees to Israel and may be protected from extradition by Israel's Law of Return."
      },
      {
        "id": "tvmaze:52563",
        "title": "Burn Baby Burn",
        "season": 11,
        "episode": 6,
        "released": "2000-11-22",
        "overview": "A former Black Panther, accused of murdering a Caucasian police officer, questions Green's integrity amidst a politically charged trial."
      },
      {
        "id": "tvmaze:52564",
        "title": "Amends",
        "season": 11,
        "episode": 7,
        "released": "2000-11-29",
        "overview": "Under pressure from the department's top brass, a 20-year-old murder case, initially investigated by Briscoe's now-retired boss, is reopened; it involves the slaying of a teenage girl, with the spoiled son of a politically connected family as the prime suspect."
      },
      {
        "id": "tvmaze:52565",
        "title": "Thin Ice",
        "season": 11,
        "episode": 8,
        "released": "2000-12-20",
        "overview": "The killing of a school hockey coach leads to a case in which the defendant claims that he committed the crime while suffering from \"sports rage.\""
      },
      {
        "id": "tvmaze:52566",
        "title": "Hubris",
        "season": 11,
        "episode": 9,
        "released": "2001-01-10",
        "overview": "An assistant manager at a jeweler's discovers four bodies at the store, leading to the prosecution of an amiable murder suspect who insists on representing himself, and winning the admiration of a female juror."
      },
      {
        "id": "tvmaze:52567",
        "title": "Whose Monkey Is It Anyway?",
        "season": 11,
        "episode": 10,
        "released": "2001-01-17",
        "overview": "The death of a lab technician and the abduction of 17 infected monkeys lead to a trial involving the treatment of research animals."
      },
      {
        "id": "tvmaze:52568",
        "title": "Sunday in the Park with Jorge",
        "season": 11,
        "episode": 11,
        "released": "2001-01-24",
        "overview": "Following \"wilding incidents\" in Central Park, a woman's body is found in the lake and the suspects include the deceased's wealthy husband."
      },
      {
        "id": "tvmaze:52569",
        "title": "Teenage Wasteland",
        "season": 11,
        "episode": 12,
        "released": "2001-02-07",
        "overview": "The beating death of a restaurant owner leads Briscoe and Green to thrill-seeking teenagers; McCoy and Lewin are forced to decide how young is too young for the death penalty."
      },
      {
        "id": "tvmaze:52570",
        "title": "Phobia",
        "season": 11,
        "episode": 13,
        "released": "2001-02-14",
        "overview": "Briscoe and Green investigate the beating death of a gay man and the kidnapping of his adopted son, and their investigation leads McCoy and Carmichael to believe that homophobia was the motive rather than ransom."
      },
      {
        "id": "tvmaze:52571",
        "title": "A Losing Season",
        "season": 11,
        "episode": 14,
        "released": "2001-02-21",
        "overview": "Briscoe and Green initially investigate the fiancé of a pregnant woman found dying in the trunk of her car, but the investigation soon turns to professional athlete Chris Coty, who may have had reasons of his own to want the woman and her unborn child out of the way."
      },
      {
        "id": "tvmaze:52572",
        "title": "Swept Away - A Very Special Episode",
        "season": 11,
        "episode": 15,
        "released": "2001-02-28",
        "overview": "When a participant in a TV reality show is murdered, McCoy goes after the producers and network executives for deliberately fomenting hostility among the participants to boost the ratings. All too appropriately, the outcome of the case hinges on a videotape made by a hidden camera."
      },
      {
        "id": "tvmaze:52573",
        "title": "Bronx Cheer",
        "season": 11,
        "episode": 16,
        "released": "2001-03-14",
        "overview": "When a woman is found strangled to death with a large quantity of the drug Ecstasy in her handbag, Detectives Briscoe and Green have difficulty gathering sufficient evidence for an indictment of their prime suspect, drug dealer Francis \"Taz\" Partell. But when they question one of his former associates, they discover new evidence indicating that Taz is responsible for the earlier murder of a bouncer in Bronx County."
      },
      {
        "id": "tvmaze:52574",
        "title": "Ego",
        "season": 11,
        "episode": 17,
        "released": "2001-03-21",
        "overview": "When the dead body of Karen Hall, an investigator with the State Attorney General's Office Criminal Division, is found in the Hudson River, Detectives Briscoe and Green find that her boss, Alec Conroy, had written off her disappearance as a random kidnapping from an Albany train station. But as more is learned about Conroy's controlling relationships — with the dead woman, with his wife and with a longtime girlfriend — he quickly becomes a suspect."
      },
      {
        "id": "tvmaze:52575",
        "title": "White Lie",
        "season": 11,
        "episode": 18,
        "released": "2001-04-04",
        "overview": "Briscoe and Green investigate a couple murdered in their apartment, which leads them to the wife of an officer in the U.S. Army who is involved in anti-drug activities in Colombia, leaving McCoy with the awkward job of getting her to testify."
      },
      {
        "id": "tvmaze:52576",
        "title": "Whiplash",
        "season": 11,
        "episode": 19,
        "released": "2001-04-18",
        "overview": "When a Hispanic male is found dead from a severe chest trauma, Detectives Briscoe and Green discover that he and two other illegal immigrants had been in a staged automobile accident. As evidence mounts linking numerous similar car crashes with the same employer, chiropractor, insurance adjuster and lawyers, ADAs McCoy and Carmichael must determine who is ultimately responsible for the man's death, from which so many others profited."
      },
      {
        "id": "tvmaze:52577",
        "title": "All My Children",
        "season": 11,
        "episode": 20,
        "released": "2001-05-02",
        "overview": "The murder of a prep school student points to a mysterious woman who may have been extorting money from the victim's wealthy father who she believed was also her father."
      },
      {
        "id": "tvmaze:52578",
        "title": "Brother's Keeper",
        "season": 11,
        "episode": 21,
        "released": "2001-05-09",
        "overview": "Briscoe and Green discover that a murdered businessman may have been the target of a well-known criminal, but the investigation stumbles when the FBI acts as the suspect's alibi. The case gets even more complicated when the detectives find out the suspect has a twin brother, that both brothers had a motive for killing the victim and they can't be sure who was actually the murderer."
      },
      {
        "id": "tvmaze:52579",
        "title": "School Daze",
        "season": 11,
        "episode": 22,
        "released": "2001-05-16",
        "overview": "Detectives Briscoe and Green investigate when a masked schoolkid opens fire on classmates, killing four and wounding eleven. It soon becomes apparent that more than one child fits the profile of a youth capable of committing such violence. An e-mail sent by one of the students skews the investigation towards one particular youth with a violent history. But finding the perpetrator becomes a race against time when another e-mail arrives threatening more murders. E.A.D.A. McCoy goes head to head with Jamie Ross (Carey Lowell), who is acting as the teen's defense attorney, and who argues that the e-mail is inadmissible because it is privileged."
      },
      {
        "id": "tvmaze:52580",
        "title": "Judge Dread",
        "season": 11,
        "episode": 23,
        "released": "2001-05-23",
        "overview": "An attempted murder of a tough judge leads Briscoe and Green on a wild goose chase to track down the inimical criminal. When the perpetrator is found, Carmichael and McCoy have a difficult time making a case."
      },
      {
        "id": "tvmaze:52581",
        "title": "Deep Vote",
        "season": 11,
        "episode": 24,
        "released": "2001-05-23",
        "overview": "A woman's murder leads Briscoe and Green to discover the actual target was a reporter who did a story about voting improprieties in a recent senatorial election. Carmichael can't get the reporter to reveal her sources for a story containing allegations that the vote was fixed and ballots tampered with, even though the reporter's life is at risk. Without the source, McCoy and Carmichael have a difficult time making a case against the Senator, who they believe has ties to the mob and ordered the hit on the reporter. The case hinges on 2,000 missing ballots from the vote that were stolen by the mob. Once the ballots are found, there is a court battle over whether or not they should be counted. McCoy believes that the ballots will show the Senator's motive for ordering the hit, but an appellate court won't allow it, so their case is virtually dead. In the end, McCoy is able to convince the reporter to reveal her source and have him testify against the senator, which surprisingly turns out to be the Senator's own assessor. Meanwhile Carmichael tells McCoy that she is leaving the D.A.'s Office to accept a job with the U.S. Attorney's Office as soon as the case is over."
      },
      {
        "id": "tvmaze:52582",
        "title": "Who Let the Dogs Out?",
        "season": 12,
        "episode": 1,
        "released": "2001-09-26",
        "overview": "The investigation into the death of a jogger mauled by a vicious dog leads to an Attica inmate, his attorneys, and an underground dog-fighting ring."
      },
      {
        "id": "tvmaze:52583",
        "title": "Armed Forces",
        "season": 12,
        "episode": 2,
        "released": "2001-10-03",
        "overview": "The fatal stabbing of a man leads to the discovery of his status as a Vietnam war veteran and the truths uncovered about an incident that occurred with him and three former soldiers in his division."
      },
      {
        "id": "tvmaze:52584",
        "title": "For Love or Money",
        "season": 12,
        "episode": 3,
        "released": "2001-10-10",
        "overview": "The death of a parolee, who was a hit man, leads to a wealthy widow and daughter who may have hired him to kill their rich relative."
      },
      {
        "id": "tvmaze:52585",
        "title": "Soldier of Fortune",
        "season": 12,
        "episode": 4,
        "released": "2001-10-24",
        "overview": "The daring daylight kidnapping of a diamond dealer which results in two murders at the scene uncovers an international dynasty of blood diamonds sales and its links to a foreign civil war."
      },
      {
        "id": "tvmaze:52586",
        "title": "Possession",
        "season": 12,
        "episode": 5,
        "released": "2001-10-31",
        "overview": "Investigating the murder of a woman in a rent-controlled apartment, Green and Briscoe initially turn their attention to janitor Roberto Ramos, who had been given a cash gift of $5,000 by the deceased but claimed he didn't remember her when questioned. But it isn't long before the detectives discover that she was engaged in a long-running battle with her landlord and had been blocking the potentially lucrative sale of the building."
      },
      {
        "id": "tvmaze:52587",
        "title": "Formerly Famous",
        "season": 12,
        "episode": 6,
        "released": "2001-11-07",
        "overview": "The shooting death of a former singer's wife leads the detectives to investigate his manager and sons after his explanation of the events surrounding her death have no credibility."
      },
      {
        "id": "tvmaze:52588",
        "title": "Myth of Fingerprints",
        "season": 12,
        "episode": 7,
        "released": "2001-11-14",
        "overview": "A murder investigation uncovers deliberately faulty forensics in the wrongful conviction of two men 12 years earlier in the case that paved the way for Van Buren's promotion."
      },
      {
        "id": "tvmaze:52589",
        "title": "The Fire This Time",
        "season": 12,
        "episode": 8,
        "released": "2001-11-21",
        "overview": "When a building is set ablaze, a girl must be identified despite her fatal burns. Through further investigation, it turns out that an extreme environmentalist group struck the match."
      },
      {
        "id": "tvmaze:52590",
        "title": "3 Dawg Night",
        "season": 12,
        "episode": 9,
        "released": "2001-11-28",
        "overview": "When a celebrity is implicated in a nightclub murder, McCoy and Southerlyn battle the flaks who attempt to insulate their client from any involvement or interrogation."
      },
      {
        "id": "tvmaze:52591",
        "title": "Prejudice",
        "season": 12,
        "episode": 10,
        "released": "2001-12-12",
        "overview": "The murder of a magazine publishing company's black CEO leads to a suspect who has a clear streak of racism and whose attorney intends on using that as a mental defect."
      },
      {
        "id": "tvmaze:52592",
        "title": "The Collar",
        "season": 12,
        "episode": 11,
        "released": "2002-01-09",
        "overview": "The death of a cleric leads the detectives to a priest who was given information by a murder suspect outside of the church but insists that he can't discuss anything about it, bringing McCoy to question whether the confessional seal should apply."
      },
      {
        "id": "tvmaze:52593",
        "title": "Undercovered",
        "season": 12,
        "episode": 12,
        "released": "2002-01-16",
        "overview": "The father of a dying girl gets his revenge on an insurance executive who denied a leukemia treatment for his daughter. One problem arises when the father is technically on both sides of the law."
      },
      {
        "id": "tvmaze:52594",
        "title": "DR 1-102",
        "season": 12,
        "episode": 13,
        "released": "2002-01-30",
        "overview": "The bludgeoning of two women in their apartment leads the detectives to a suspect who has taken a hostage while demanding legal representation. Southerlyn's actions, while heroic, result in disbarment proceedings against her for violation of Disciplinary Rule 1-102."
      },
      {
        "id": "tvmaze:52595",
        "title": "Missing",
        "season": 12,
        "episode": 14,
        "released": "2002-02-06",
        "overview": "When a girl's parents frantically search for her, Briscoe and Green see that the girl's belongings were packed up in her apartment. They learn that the girl had been seeing a married man — her boss. When the boss is brought up on charges, his wife sheds some new evidence."
      },
      {
        "id": "tvmaze:52596",
        "title": "Access Nation",
        "season": 12,
        "episode": 15,
        "released": "2002-02-27",
        "overview": "The murder of a psychologist leads to a case involving a computer company that sells information and their responsibility in shielding their clients' history in order to serve their needs."
      },
      {
        "id": "tvmaze:52597",
        "title": "Born Again",
        "season": 12,
        "episode": 16,
        "released": "2002-03-06",
        "overview": "The investigation into the death of an 11-year-old girl uncovers the possible culpability of the child's mother and a rebirthing therapist."
      },
      {
        "id": "tvmaze:52598",
        "title": "Girl Most Likely",
        "season": 12,
        "episode": 17,
        "released": "2002-03-27",
        "overview": "When a high school student is found dead in an apartment building, Briscoe and Green suspect that the murder was a result of her getting a message board shut down. As McCoy and Southerlyn investigate the case further, they realize that her best friend, who was reluctant to come forward as a witness, may be the answer to the murder."
      },
      {
        "id": "tvmaze:52599",
        "title": "Equal Rights",
        "season": 12,
        "episode": 18,
        "released": "2002-04-03",
        "overview": "A stock analyst's murder leads the detectives to a corporation whose stock had fallen."
      },
      {
        "id": "tvmaze:52600",
        "title": "Slaughter",
        "season": 12,
        "episode": 19,
        "released": "2002-04-10",
        "overview": "The investigation of a student's killing leads to a case involving meat contamination at a food service."
      },
      {
        "id": "tvmaze:52601",
        "title": "Dazzled",
        "season": 12,
        "episode": 20,
        "released": "2002-04-24",
        "overview": "When a \"gold digging\" wife is found dead, there are plenty of possible perpetrators. Her husband has become \"whipped\" and blinded by his young wife and then messes up his story to Briscoe and Green. When he finally comes around, it seems that the wife's ex-boyfriend was getting revenge for being fired from a contracting job. The medical examiner uncovers some more clues which point to a bitter alcoholic ex-wife. Eventually, the criminal comes forward but the only crime she has committed is trying to save her family."
      },
      {
        "id": "tvmaze:52602",
        "title": "Foul Play",
        "season": 12,
        "episode": 21,
        "released": "2002-05-01",
        "overview": "The investigation into the death of a private investigator uncovers corruption, deceit, and immigration fraud in a Youth Baseball League whose manager will go to any lengths to win."
      },
      {
        "id": "tvmaze:52603",
        "title": "Attorney Client",
        "season": 12,
        "episode": 22,
        "released": "2002-05-08",
        "overview": "The wife of an attorney with many disgruntled clients is killed, but the detectives believe that he was the intended target as he was willing to reveal information despite confidentiality agreements. As the investigation continues, his tumultuous love life is exposed and the prosecutors are suspicious of his desire to return to the courtroom."
      },
      {
        "id": "tvmaze:52604",
        "title": "Oxymoron",
        "season": 12,
        "episode": 23,
        "released": "2002-05-15",
        "overview": "The murder of a young doctor leads Briscoe and Green to her involvement in an underground oxycodone ring, of which the leaders have hatched a plan to con McCoy and Southerlyn out of a trial."
      },
      {
        "id": "tvmaze:52605",
        "title": "Patriot",
        "season": 12,
        "episode": 24,
        "released": "2002-05-22",
        "overview": "A tenement building explodes and the lone victim is Joseph Haden. The building was rent controlled and there had been a tenant strike, so the police initially suspect arson. But the landlord doesn't have insurance, ruling out their arson theory, and the medical examiner discovers that Haden's neck was broken and he was tied up before the explosion happened. Trying to figure out Haden is even more difficult. He didn't appear to have a family or a girlfriend and never got any substantial mail. He worked at the Jiffy Job service station making minimum wage, yet had $90,000 in the bank. Briscoe and Green do some more digging and find out that Haden was using an alias, and his real name was Yusuf Haddad."
      },
      {
        "id": "tvmaze:52606",
        "title": "American Jihad",
        "season": 13,
        "episode": 1,
        "released": "2002-10-02",
        "overview": "An American Muslim becomes the prime suspect in a double murder after an academic challenges his religious beliefs."
      },
      {
        "id": "tvmaze:52607",
        "title": "Shangri-La",
        "season": 13,
        "episode": 2,
        "released": "2002-10-09",
        "overview": "The murder of a female high school English teacher uncovers a love triangle that includes a female student and a male teacher, both of whom become suspects. The prosecutors have to deal with the student's multiple identities and refusal to live past adolescence."
      },
      {
        "id": "tvmaze:52608",
        "title": "True Crime",
        "season": 13,
        "episode": 3,
        "released": "2002-10-16",
        "overview": "Investigating the death of a rock band singer who had large amounts of cocaine and heroin in her system, the detectives question a former boyfriend who was a disgruntled band mate of her late husband. The prosecutors are hampered by the actions of a retired detective-turned-writer, who worked a case with Briscoe several years back and whose unconventional research tactics make him a suspect as well."
      },
      {
        "id": "tvmaze:52609",
        "title": "Tragedy on Rye",
        "season": 13,
        "episode": 4,
        "released": "2002-10-30",
        "overview": "A struggling actress is murdered in an apparent robbery-homicide where a videotape, made by a couple touring the city and sold to a local news station, shows three suspects loading the stolen property into an SUV. They are charged with felony murder, a capital crime, and this causes unrest with Southerlyn surrounding the death penalty."
      },
      {
        "id": "tvmaze:52610",
        "title": "The Ring",
        "season": 13,
        "episode": 5,
        "released": "2002-11-06",
        "overview": "The discovery of a body in Hell's Kitchen that had been wearing a $40,000 diamond ring leads Briscoe and Green back to the September 11th attacks, as the victim had been reported to have died on the 89th floor of the World Trade Center. The ensuing investigation leads to a fiancee and a lover and the determination that the events of 9/11 may have been convenient timing to hide the fact that she was murdered the night before."
      },
      {
        "id": "tvmaze:52611",
        "title": "Hitman",
        "season": 13,
        "episode": 6,
        "released": "2002-11-13",
        "overview": "The execution-style shooting of a city contractor leads Briscoe and Green to suspect a professional hitman. They first focus upon possible enemies of the victim, but end up suspecting the victim's wife and her boyfriend of hiring the killer. However, as they investigate every possibility, the evidence leads McCoy and Southerlyn to a conspirator that no one had suspected."
      },
      {
        "id": "tvmaze:52612",
        "title": "Open Season",
        "season": 13,
        "episode": 7,
        "released": "2002-11-20",
        "overview": "A defense attorney who had just acquitted a cop-killer is gunned down outside a Manhattan restaurant. The detectives start with police officers in the precinct of the injured officer, then to his brother, before they are led to a white supremacist who is part of a national network. McCoy is faced with the unlikely prospect that the defendant's attorney, his friend of 20 years and a friend of the slain lawyer, played a part in the murder of a Florida district attorney following the defendant's arrest. McCoy is able to make a deal that preserves the integrity of his adversary, but not without a cost."
      },
      {
        "id": "tvmaze:52613",
        "title": "Asterisk",
        "season": 13,
        "episode": 8,
        "released": "2002-11-27",
        "overview": "A star baseball player becomes the prime suspect in the murder of his limousine driver when it is discovered that the driver regularly supplied steroids to the sports icon. The subsequent investigation reveals blackmail as the underlying motive for the murder."
      },
      {
        "id": "tvmaze:52614",
        "title": "The Wheel",
        "season": 13,
        "episode": 9,
        "released": "2002-12-11",
        "overview": "The smoldering corpse of an Asian girl found outside the Chinese consul general's apartment leads the detectives to believe she had immolated herself to make a political statement. When forensics shows that she had been murdered beforehand, they find themselves in the middle of a religious conflict, with the consul general their prime suspect and his attorney an old friend of DA Branch."
      },
      {
        "id": "tvmaze:52615",
        "title": "Mother's Day",
        "season": 13,
        "episode": 10,
        "released": "2003-01-08",
        "overview": "The hit-and-run death of a popular high-school student leaves the detectives suspecting the girl's father was the real target. When evidence reveals that the death was possibly a random killing, they are able to track down their suspect to his apartment. However, things get complicated when their killer is murdered, and the person who committed the crime happens to be the victim's mother."
      },
      {
        "id": "tvmaze:52616",
        "title": "Chosen",
        "season": 13,
        "episode": 11,
        "released": "2003-01-15",
        "overview": "The murder of a bookie with a high-class clientele leads the detectives to arrest his partner. Charged with first-degree murder, his attorney puts forth an unusual defense strategy that turns the trial into a political statement."
      },
      {
        "id": "tvmaze:52617",
        "title": "Under God",
        "season": 13,
        "episode": 12,
        "released": "2003-02-05",
        "overview": "A drug dealer is killed and suspicion falls on a dead teenager's father. Briscoe, still mourning his daughter, is unusually sympathetic. But before the police can prove it, his priest confesses — claiming that God told him to do it."
      },
      {
        "id": "tvmaze:52618",
        "title": "Absentia",
        "season": 13,
        "episode": 13,
        "released": "2003-02-12",
        "overview": "When the witness in a jewelry store robbery-homicide fails to appear in court, McCoy suspects foul play until he discovers that the man is a fugitive in a 20-year-old murder case."
      },
      {
        "id": "tvmaze:52619",
        "title": "Star Crossed",
        "season": 13,
        "episode": 14,
        "released": "2003-02-19",
        "overview": "The bludgeoning of a luxury sports car dealer leads the detectives to a mentally challenged man and his girlfriend, who is extremely attractive and whose expensive tastes lead her to be equally manipulative."
      },
      {
        "id": "tvmaze:52620",
        "title": "Bitch",
        "season": 13,
        "episode": 15,
        "released": "2003-02-26",
        "overview": "The death of a stockbroker leads the detectives to his girlfriend, whose mother is a cosmetics mogul who has a longstanding friendship with DA Arthur Branch and will stop at nothing to protect her corporate image by using hormone replacement therapy withdrawal as the basis for her defense."
      },
      {
        "id": "tvmaze:52621",
        "title": "Suicide Box",
        "season": 13,
        "episode": 16,
        "released": "2003-03-26",
        "overview": "A media-savvy attorney defends a black teenager accused of shooting an off-duty police officer."
      },
      {
        "id": "tvmaze:52622",
        "title": "Genius",
        "season": 13,
        "episode": 17,
        "released": "2003-04-02",
        "overview": "Investigating the murder of a cab driver, the detectives come to suspect a famous author and his protege, a former child prodigy."
      },
      {
        "id": "tvmaze:52623",
        "title": "Maritime",
        "season": 13,
        "episode": 18,
        "released": "2003-04-17",
        "overview": "A missing football player becomes the prime suspect in the murder of a woman whose body is discovered floating in the East River, but when his yacht is found with all the guests missing the detectives suspect that he was a victim himself of his problematic brother."
      },
      {
        "id": "tvmaze:52624",
        "title": "Seer",
        "season": 13,
        "episode": 19,
        "released": "2003-04-23",
        "overview": "The prime suspect in the murder of a woman outside a sex club claims to have merely witnessed the crime via a psychic vision."
      },
      {
        "id": "tvmaze:52625",
        "title": "Kid Pro Quo",
        "season": 13,
        "episode": 20,
        "released": "2003-04-30",
        "overview": "The murder of an admissions director of a private school leads the detectives to investigate a pair of angry parents whose children were denied admission, but then they set their sights on the headmaster when they discover that the victim was about to go public with the denied admissions."
      },
      {
        "id": "tvmaze:52626",
        "title": "House Calls",
        "season": 13,
        "episode": 21,
        "released": "2003-05-07",
        "overview": "The suspicious death of a Russian model leads the detectives to suspect medical malpractice."
      },
      {
        "id": "tvmaze:52627",
        "title": "Sheltered",
        "season": 13,
        "episode": 22,
        "released": "2003-05-14",
        "overview": "It's a race against time as the detectives go on the hunt for a sniper whose victims are shot in broad daylight."
      },
      {
        "id": "tvmaze:52628",
        "title": "Couples",
        "season": 13,
        "episode": 23,
        "released": "2003-05-21",
        "overview": "One of the few episodes that deviates from the usual formula. Briscoe and Green catch four murders and a kidnapping on the same day, and get handed confessions in each case. The DA's office only features minimally."
      },
      {
        "id": "tvmaze:52629",
        "title": "Smoke",
        "season": 13,
        "episode": 24,
        "released": "2003-05-21",
        "overview": "Briscoe and Green are assigned to a case involving an eccentric comedian who may have killed his young son by dangling him off a ledge."
      },
      {
        "id": "tvmaze:52630",
        "title": "Bodies",
        "season": 14,
        "episode": 1,
        "released": "2003-09-24",
        "overview": "While investigating the death of a teenaged girl, the detectives stumble on a pattern of crimes that indicate they are after a serial killer. The suspect, however, puts the prosecutors through an ethical wringer when he discloses his attorney's knowledge of the victims and their whereabouts."
      },
      {
        "id": "tvmaze:52631",
        "title": "Bounty",
        "season": 14,
        "episode": 2,
        "released": "2003-10-01",
        "overview": "The investigation into the murder of a bounty hunter leads to a reporter with compromised ethics and a dubious defense strategy."
      },
      {
        "id": "tvmaze:52632",
        "title": "Patient Zero",
        "season": 14,
        "episode": 3,
        "released": "2003-10-08",
        "overview": "The investigation into the carjacking of a vehicle containing vials of a deadly virus leads the detectives on a search for the first person infected with the virus and a biochemist whose sinister motivations were driven by passion."
      },
      {
        "id": "tvmaze:52633",
        "title": "Shrunk",
        "season": 14,
        "episode": 4,
        "released": "2003-10-22",
        "overview": "The police and prosecutors investigate the connection between an award-winning songwriter and the young woman found murdered in his home to discover who would profit by her death at his hands."
      },
      {
        "id": "tvmaze:52634",
        "title": "Blaze",
        "season": 14,
        "episode": 5,
        "released": "2003-10-29",
        "overview": "A teenager's need for parental love, acceptance, and recognition sets in motion the events leading to the deaths of 23 concert-goers in a blaze started by a rock band's illegal pyrotechnics."
      },
      {
        "id": "tvmaze:52635",
        "title": "Identity",
        "season": 14,
        "episode": 6,
        "released": "2003-11-05",
        "overview": "When a man is found murdered shortly after depositing almost $400,000 in his savings account, the investigation into the source of funds reveals that the victim ran an identity theft scam which left an elderly man homeless and impoverished."
      },
      {
        "id": "tvmaze:52636",
        "title": "Floater",
        "season": 14,
        "episode": 7,
        "released": "2003-11-12",
        "overview": "The husband of a woman whose partially decomposed body is found floating in the Hudson River becomes the prime suspect in her murder until the prosecutors uncover a connection between her prospective attorney and a judge who has heard a suspiciously high number of his cases."
      },
      {
        "id": "tvmaze:52637",
        "title": "Embedded",
        "season": 14,
        "episode": 8,
        "released": "2003-11-19",
        "overview": "After a reporter accused of causing the deaths of soldiers with whom he was embedded in Iraq by reporting on their troop movements is shot and wounded on the eve of his return to the front, the ballistics report indicates that the gun belonged to one of the dead soldiers, leading the detectives to uncover who brought the gun back from the front and committed the crime."
      },
      {
        "id": "tvmaze:52638",
        "title": "Compassion",
        "season": 14,
        "episode": 9,
        "released": "2003-11-26",
        "overview": "When a con man passing himself off as a grief counselor is poisoned by a respected doctor he victimized, McCoy must determine whether revenge or insanity prompted the crime."
      },
      {
        "id": "tvmaze:52639",
        "title": "Ill-Conceived",
        "season": 14,
        "episode": 10,
        "released": "2003-12-03",
        "overview": "The owner of a clothing company with alien immigrant workers is found murdered which sends the detectives on a search for an unidentified evening caller whose girlfriend, also a worker in the factory, recently gave birth. Upon discovery that the victim was also the baby's father, the boyfriend is arrested with the motive being an office affair until the victim's widow discloses that it was a surrogate arrangement."
      },
      {
        "id": "tvmaze:52640",
        "title": "Darwinian",
        "season": 14,
        "episode": 11,
        "released": "2004-01-07",
        "overview": "The apparent hit-and-run of a homeless man sends the detectives on a search for the driver, a high-profile female publicist, which fuels the fire for the prosecutors to obtain a murder conviction. However, an autopsy reveals that the victim died as a result of a beating, which had to have taken place hours before the car accident, which leads to a suspect within the homeless community."
      },
      {
        "id": "tvmaze:52641",
        "title": "Payback",
        "season": 14,
        "episode": 12,
        "released": "2004-01-14",
        "overview": "The investigation into the murder of a former bookie turned mob informant reveals a disturbing new wrinkle in organized crime involving legitimate businessmen moonlighting as contract hitmen in a battle for mob leadership, and ends with a Federal ploy to nullify the plea bargain in the case, leaving McCoy seething and two more people dead."
      },
      {
        "id": "tvmaze:52642",
        "title": "Married with Children",
        "season": 14,
        "episode": 13,
        "released": "2004-02-04",
        "overview": "The death of a woman who fell from a hotel balcony leads to a case involving a lesbian couple and a state law banning gay adoption."
      },
      {
        "id": "tvmaze:52643",
        "title": "City Hall",
        "season": 14,
        "episode": 14,
        "released": "2004-02-11",
        "overview": "A city employee's clerical error sets in motion a chain of events which culminates in a fatal shooting at City Hall and a secret federal court proceeding with sinister implications."
      },
      {
        "id": "tvmaze:52644",
        "title": "Veteran's Day",
        "season": 14,
        "episode": 15,
        "released": "2004-02-18",
        "overview": "A decorated Gulf War veteran, grief-stricken over the Afghanistan combat death of his son, murders an anti-war protester, claiming at trial that he acted under extreme emotional distress."
      },
      {
        "id": "tvmaze:52645",
        "title": "Can I Get a Witness?",
        "season": 14,
        "episode": 16,
        "released": "2004-02-25",
        "overview": "McCoy faces an uphill battle in proving that witnesses to the murder of a drug mule were bribed, intimidated, and eventually murdered on the orders of the drug dealer accused of the crime."
      },
      {
        "id": "tvmaze:52646",
        "title": "Hands Free",
        "season": 14,
        "episode": 17,
        "released": "2004-03-03",
        "overview": "Some of a man's body parts are found in separate garbage cans and Briscoe and Green go searching for a woman who killed and dismembered her boyfriend, and instead find a man who murdered his wife. When McCoy fails to win a murder conviction against the eccentric cross-dressing millionaire, he redoubles the effort to convict the man for murdering his second wife years earlier by demonstrating that he murdered a witness to the crime."
      },
      {
        "id": "tvmaze:52647",
        "title": "Evil Breeds",
        "season": 14,
        "episode": 18,
        "released": "2004-03-24",
        "overview": "A Holocaust survivor is murdered on the eve of her testimony in the deportation trial of a former concentration camp guard. McCoy must not only put the murderer on trial, but also the former guard who stood to gain the most from the survivor's death, even though evidence is limited."
      },
      {
        "id": "tvmaze:52648",
        "title": "Nowhere Man",
        "season": 14,
        "episode": 19,
        "released": "2004-03-31",
        "overview": "The District Attorney's Office is set on its ear when the investigation into the death of an A.D.A. uncovers a scandal that could imperil hundreds of cases."
      },
      {
        "id": "tvmaze:52649",
        "title": "Everybody Loves Raimondo's",
        "season": 14,
        "episode": 20,
        "released": "2004-04-14",
        "overview": "Greed, treachery and disrespect shape the motives for murder when two men are gunned down at an exclusive restaurant."
      },
      {
        "id": "tvmaze:52650",
        "title": "Vendetta",
        "season": 14,
        "episode": 21,
        "released": "2004-04-21",
        "overview": "The investigation into a barroom brawl fatality reveals a detective's decades-old vendetta against a petty criminal turned murderer who was falsely accused of one murder after evading conviction on another."
      },
      {
        "id": "tvmaze:52651",
        "title": "Gaijin",
        "season": 14,
        "episode": 22,
        "released": "2004-04-28",
        "overview": "Van Buren has reservations about Branch's tactics in luring a Ginza nightclub owner back to New York after the Japanese government is unwilling to extradite him to face charges of conspiracy and murder in the death of his wife on a New York City vacation."
      },
      {
        "id": "tvmaze:52652",
        "title": "Caviar Emptor",
        "season": 14,
        "episode": 23,
        "released": "2004-05-12",
        "overview": "When a caviar importer is murdered the day after his wedding to a much-younger woman, the large pool of suspects includes his new wife, his children, and his chief competitor, each of whom has a compelling motive for committing the crime."
      },
      {
        "id": "tvmaze:52653",
        "title": "C.O.D.",
        "season": 14,
        "episode": 24,
        "released": "2004-05-19",
        "overview": "Briscoe bids farewell to the 27 as the prosecution of two women for killing each other's husbands comes to a successful conclusion."
      },
      {
        "id": "tvmaze:52654",
        "title": "Paradigm",
        "season": 15,
        "episode": 1,
        "released": "2004-09-22",
        "overview": "Detective Joe Fontana transfers to the 27th precinct, a stylish veteran uneasily paired with Detective Green when a former female Guardsman from the second Gulf War is found murdered -- and evidence points to the vengeful Iraqi sister of an ex-inmate at infamous Abu Ghraib prison. However, when D.A.s McCoy and Southerlyn begin to prosecute, they discover that the suspect's lawyer boldly plans to defend his client as an \"enemy soldier\" -- subject only to the terms of the Geneva Convention."
      },
      {
        "id": "tvmaze:52655",
        "title": "The Dead Wives Club",
        "season": 15,
        "episode": 2,
        "released": "2004-09-22",
        "overview": "When a woman is found dead after a ferry collides with a Manhattan dock, Detectives Fontana and Green become suspicious when they learn that the victim sustained a blow to the head and was seen in the water just before the accident, and the likely suspect is the ex-wife of a firefighter who left her to marry a rich \"9/11\" widow. But EADA McCoy soon learns that the defendant's crafty lawyer intends to position her as a victim of post-traumatic stress syndrome owing to 9/11, meaning that McCoy has to overcome extreme emotions common to every New Yorker."
      },
      {
        "id": "tvmaze:52656",
        "title": "The Brotherhood",
        "season": 15,
        "episode": 3,
        "released": "2004-09-29",
        "overview": "When a prison gang puts out a contract on a Sing Sing corrections officer and his family, assigning the job to a newly released ex-con, the terrified officer pleads preemptive self-defense after he's brought to trial for the parolee's murder. As the trial proceeds, the gang attempts to affect the outcome of the case by sending a death threat to the presiding judge, who refuses to be intimidated. Shortly after the conclusion of the trial, McCoy discovers that the defendant's fears about the power and the reach of the gang were well-placed."
      },
      {
        "id": "tvmaze:52657",
        "title": "Coming Down Hard",
        "season": 15,
        "episode": 4,
        "released": "2004-10-06",
        "overview": "When two college students take flying leaps to their deaths, Detectives Fontana and Green discover that both students were participants in a secret testing program on a new anti-depressant run by a large drug manufacturer that has yielded a high rate of suicides, and more attempted suicides. EADA McCoy decides to vigorously pursue the CEO of the pharmaceutical firm for second-degree murder but his case hinges on convincing the judge to admit guarded clinical trial info."
      },
      {
        "id": "tvmaze:52658",
        "title": "Gunplay",
        "season": 15,
        "episode": 5,
        "released": "2004-10-20",
        "overview": "The NYPD gears up to find the cop-killers who murdered two officers during an illegal firearms buy-and-bust sting, putting Detectives Fontana and Green on the trail of two suspects as Green risks his life to pose as a gun buyer, to gather evidence on the gun dealers. They soon discover the killers were tipped off to the victims' identities by a website displaying photos of undercover cops. Turns out the website is financed by a vengeful defense attorney (Isiah Whitlock, Jr.) whose criminal stepson was killed by the police; and now claims that he is protected by the First Amendment as McCoy and Southerlyn prepare to prosecute. McCoy is able to connect the hit men to the attorney who paid them to avenge the death of his gun-running stepson at the hands of the same detectives during a similar buy-and-bust several years earlier."
      },
      {
        "id": "tvmaze:52659",
        "title": "Cut",
        "season": 15,
        "episode": 6,
        "released": "2004-10-27",
        "overview": "After a bestselling pulp-fiction novelist is found dead in her hotel bathroom, Detectives Fontana and Green investigate and discover that the deceased recently had a liposuction operation performed by a careless plastic surgeon (Bruce Altman). EADA McCoy decides whether or not the case should be pursued in civil, not criminal court. But when District Attorney Branch sees a recurring thread of negligence in the doctor's past, McCoy files charges and bases much of his argument on the fact that the obsessed victim's many beauty procedures required psychological counseling that her greedy surgeon never suggested."
      },
      {
        "id": "tvmaze:52660",
        "title": "Gov Love",
        "season": 15,
        "episode": 7,
        "released": "2004-11-10",
        "overview": "In a controversial episode torn from recent headlines, Detectives Fontana and Green follow the sensational murder of the wife of Connecticut Governor Riordan (Robin Thomas), but their spadework turns up a corrupt developer (as Kaplan, Zeljko Ivanek) whose business and romantic links to Riordan cause the official to step down in shame. However, EADA McCoy is stymied when he can't get a third man (Jeremy Webb) to testify against the crooked business exec after he claims to have already married him, forcing the dogged McCoy to take the crucial gay marriage issue before the state's supreme court and Kaplan's defense attorney (Chris Sarandon)."
      },
      {
        "id": "tvmaze:52661",
        "title": "Cry Wolf",
        "season": 15,
        "episode": 8,
        "released": "2004-11-17",
        "overview": "A street thug-turned-radio personality (Jose Zuniga) who had a penchant for attracting headlines through \"publicity stunt muggings\" is thought to be faking again when he's shot and almost killed. However, when other bodies start to stack up, Detectives Fontana and Green now must believe the danger is for real, they begin to believe his story after they discover that the married jock was involved with a mobster's mistress."
      },
      {
        "id": "tvmaze:52662",
        "title": "All in the Family",
        "season": 15,
        "episode": 9,
        "released": "2004-11-24",
        "overview": "After four people, including tourists, are shot dead on the same sidewalk, Detectives Fontana and Green learn that one was a philandering jeweler with criminal ties to the Russian mob who was cooperating with federal authorities, until someone close to the victim \"ratted him out.\" In the meantime, the investigators find the hitmen, but EADA McCoy must wrestle with the federal prosecutor over jurisdiction; and both cases might hinge on the fact that the jeweler was an Orthodox Jew."
      },
      {
        "id": "tvmaze:52663",
        "title": "Enemy",
        "season": 15,
        "episode": 10,
        "released": "2004-12-01",
        "overview": "In the bloody wake of a massacre of heroin dealers, Detectives Fontana and Green track through a list of international criminals until they target their primary suspect, a drug-dealing Afghan warlord (as Khaleel, Christopher Maher) who's aided U.S. forces in Afghanistan and claims diplomatic immunity. But EADA McCoy and ADA Southerlyn fearlessly prosecute despite State Department pressure and a defense lawyer who claims his Afghan client was forced to push drugs in order to maintain his cover, and ultimately continue to aid American military efforts."
      },
      {
        "id": "tvmaze:52664",
        "title": "Fixed",
        "season": 15,
        "episode": 11,
        "released": "2004-12-08",
        "overview": "When a convicted child murderer (David Groh) is struck and left for dead by a motorist just weeks after his prison release, Detectives Fontana and Green are not enthused about finding out who ran him over. When the murderer dies, they look inside the prison where he served his sentence, and they find evidence that leads EADA Jack McCoy to make a startling discovery."
      },
      {
        "id": "tvmaze:52665",
        "title": "Mammon",
        "season": 15,
        "episode": 12,
        "released": "2005-01-05",
        "overview": "Not long after a wealthy venture capitalist is found slain in his spacious home, Detectives Fontana and Green suspect the victim's feckless young wife (as Marley,Andrea Roth), as well as the handsome contractor (as Tremont, Daniel Sunjata) who installed the security system and was romantically dallying with the wannabe widow. On the legal side, DA's McCoy and Southerlyn seek to turn the cheating wife against her ex-beau, but the bad boy's many \"alibi girlfriends\" and a second unexpected crime severely hamstring their prosecution."
      },
      {
        "id": "tvmaze:52666",
        "title": "Ain't No Love",
        "season": 15,
        "episode": 13,
        "released": "2005-01-12",
        "overview": "Detectives Fontana and Green move to the beat of hip-hop when a legendary rapper is shot to death and evidence points to the victim's young protege (as Shawn,Sean Nelson) who was known to be cutting his own music on bootlegged street CD's, and more clues can be found in one song's lyrics that describe a similar killing. As police tie in another previous murder, DA's McCoy and Southerlyn seek the e-mail addresses from a thuggish record label's web site that could unlock the case, even as the two prosecutors clash over admissible facts, as the investigation unfolds, Southerlyn's opinions put her sharply at odds with both McCoy and Branch, the latter of whom begins to feel that Southerlyn is not cut out to work in the DA's office."
      },
      {
        "id": "tvmaze:52667",
        "title": "Fluency",
        "season": 15,
        "episode": 14,
        "released": "2005-01-19",
        "overview": "When nine afflicted people suddenly die, Detectives Fontana and Green discover that the victims were injected with fake flu vaccine that did not protect them, leading the police to arrest a career con man (Rob Sedgwick) who's counterfeited everything, including what should have been life-saving vaccine. But while EADA Jack McCoy is getting over the departure of ADA Southerlyn, he is joined by confident new Assistant D.A. Alexandra Borgia, who boldly promises justice to the victims' relatives that will be difficult for the prosecutor to fulfill after vital search warrant evidence is tossed out."
      },
      {
        "id": "tvmaze:52668",
        "title": "Obsession",
        "season": 15,
        "episode": 15,
        "released": "2005-02-09",
        "overview": "After a controversial and conservative talk show host is shot to death, Detectives Fontana and Green consider a wealth of likely suspects but focus on Miranda (Paula Devicq), who would inherit his estate only upon death, as well as on Karen (Dana Eskelson), a tormented woman who claims she had an affair with the new widow. As new ADA Borgia sizes up the case, she finds disturbing evidence that Karen was stalking the widow, whose secret love life yields a treasure trove of evidence."
      },
      {
        "id": "tvmaze:52669",
        "title": "The Sixth Man",
        "season": 15,
        "episode": 16,
        "released": "2005-02-16",
        "overview": "When a loner is found strangled to death in his rent-controlled apartment, Detectives Fontana and Green focus on both the victim's gambling habit and the building's owner who wants to convert it into a co-op, but the cops hit paydirt when they discover the dead man's nasty running feud with a spoiled pro basketball player. When the detectives find the athlete's fingerprints at the scene, prosecutors McCoy and Borgia must fight to keep the evidence from being tossed out on a technicality."
      },
      {
        "id": "tvmaze:52670",
        "title": "License to Kill",
        "season": 15,
        "episode": 17,
        "released": "2005-02-23",
        "overview": "After a wild car chase through Manhattan's streets leaves one man dead and a teen injured, Detectives Fontana and Green connect some dots and discover that the chase began in upstate New York after a hunting party was massacred by the now deceased driver, but finding the man who chased the murderer puts prosecutors in a bind. As the reluctant hero (as Stoller, Mike Pniewski) is publicly lauded for his efforts, prosecutors McCoy and Borgia carefully make their case that his poor decisions only endangered other lives."
      },
      {
        "id": "tvmaze:52671",
        "title": "Dining Out",
        "season": 15,
        "episode": 18,
        "released": "2005-03-02",
        "overview": "When a TV network executive is found murdered, Detectives Fontana and Green suspect twins who were stealing from the organization until they discover a celebrity chef with whom the married victim shared an affair. The nimble and charming chef is adroit at cultivating relationships with judges and juries alike, but prosecutor McCoy intends to reveal that the suspect's cooking show was about to be canceled by his late lover."
      },
      {
        "id": "tvmaze:52672",
        "title": "Sects",
        "season": 15,
        "episode": 19,
        "released": "2005-03-30",
        "overview": "Detectives Fontana and Green are repulsed when they investigate the murder of a woman by a suicidal young man (Austin Lysy) and discover a cult which encourages adult-child sexual relations, and prosecutor Borgia is determined to nail the mesmerizing but formidable woman (Deborah Hedwall) who heads it. Aided by fellow EADA McCoy, Borgia traces a string of suicides from the surviving youths and searches for a secretive \"Book of Daniel\" that could wipe out the perverted sect forever."
      },
      {
        "id": "tvmaze:52673",
        "title": "Tombstone",
        "season": 15,
        "episode": 20,
        "released": "2005-04-13",
        "overview": "Green is shot while taking a murder witness to trial, leading Fontana to team up with Salazar and uncover ties to a porn magnate."
      },
      {
        "id": "tvmaze:52674",
        "title": "Publish and Perish",
        "season": 15,
        "episode": 21,
        "released": "2005-04-20",
        "overview": "The murders of an infamous porn actress and a maverick publisher, Devries (Randy Graff) plunge Detectives Fontana and his temporary partner Nick Falco (Michael Imperioli) into a sensational case that spirals upward to an ambitious and powerful police commissioner (Kevin Dunn) who's up for the nation's top security post. But as District Attorney Branch warns, McCoy and the police must tread lightly given the high-profile players, especially when they discover a more intimate link."
      },
      {
        "id": "tvmaze:52675",
        "title": "Sport of Kings",
        "season": 15,
        "episode": 22,
        "released": "2005-05-04",
        "overview": "The shooting death of a Panamanian horse jockey puts Detectives Fontana and Falco on the track of a pack of colorful suspects who inhabit the competitive racing world, forcing them to nudge jockeys, trainers, and even a rich owner; to discover who would murder the rider over his desire to ride one particular horse. However, their probe reveals that the victim challenged the registry and selling details of the prized three-year-old, leading the cops and EADA McCoy to a corporate head who bought the thoroughbred with stolen funds."
      },
      {
        "id": "tvmaze:52676",
        "title": "In God We Trust",
        "season": 15,
        "episode": 23,
        "released": "2005-05-11",
        "overview": "Detectives Fontana and Falco arrest an arsonist after a blaze killed a fireman, and discover a charred pistol that leads them to re-open a cold case murder of an African-American. Their remorseful prime suspect (Jim True-Frost) not only confesses but pleads not guilty due to his newfound faith and changed life. Even the skeptical EADA McCoy cannot ignore the \"Clayton motion\" filed by the defense attorney that asks for the case to be dismissed while church and public support build for the former racist who has worked hard for children's charities in the years since."
      },
      {
        "id": "tvmaze:52677",
        "title": "Locomotion",
        "season": 15,
        "episode": 24,
        "released": "2005-05-18",
        "overview": "A commuter train is violently derailed when it strikes an SUV parked on the tracks, resulting in 12 deaths, leaving Detectives Fontana and Falco sifting through massive debris, until they lock onto a depressed construction worker who maintains he only intended to commit suicide, not homicide. EADA McCoy cannot wait to get his hands on the case but his grip gets more slippery when the accused's attorney hints at an insanity defense, and the suspect later shocks everyone in court."
      },
      {
        "id": "tvmaze:52678",
        "title": "Red Ball",
        "season": 16,
        "episode": 1,
        "released": "2005-09-21",
        "overview": "When a 5-year-old girl is abducted from her mother in broad daylight during an apparent car jacking, Detectives Fontana and Green canvass the streets, only to uncover a more sinister motive when they discover the car intact but no trace of the girl. The investigators soon unearth an ex-convict with the child's bloodied dress; but he won't talk until he's guaranteed release. With time and leads running out and the prospect of the girl's safe return looking unlikely, EADA McCoy and ADA Borgia consider a deal with severe legal and political ramifications."
      },
      {
        "id": "tvmaze:52679",
        "title": "Flaw",
        "season": 16,
        "episode": 2,
        "released": "2005-09-28",
        "overview": "A mother-daughter con team get away with fraud, then are tried for murder."
      },
      {
        "id": "tvmaze:52680",
        "title": "Ghosts",
        "season": 16,
        "episode": 3,
        "released": "2005-10-05",
        "overview": "A criminal makes a surprising deathbed confession that compels Detective Fontana to re-open his own 10-year-old cold case file concerning the murder of a 12-year-old girl. Instead of the victim's father, whom Fontana is certain committed the crime, the new prime suspect is a former drug-addict whose jailhouse confession to the prosecution's most viable witness is disqualified on the grounds it was made in a spiritual context. Despite dwindling options, Executive Assistant D.A. McCoy continues to pursue a murder-two conviction despite a stern warning from his wary boss, District Attorney Branch, who cautions against the fallout of losing this high-profile case again."
      },
      {
        "id": "tvmaze:52681",
        "title": "Age of Innocence",
        "season": 16,
        "episode": 4,
        "released": "2005-10-12",
        "overview": "A car bomb kills the husband of an incapacitated woman shortly before the victim planned to disconnect her feeding tube, and when Detectives Fontana and Green wade into the politically charged case, they find the bombmaker who points them to suspects that include the woman's angry family and clergy. As national media arrive, EADA McCoy and ADA Borgia engage in a frustrating shell game where each suspect seems to have a mutually bulletproof alibi."
      },
      {
        "id": "tvmaze:52682",
        "title": "Life Line",
        "season": 16,
        "episode": 5,
        "released": "2005-10-19",
        "overview": "When the body of undercover reporter Teresa Richter is discovered, police soon realize her death is connected to the story she was working on about a Latin gang, L-12. Their investigation leads them to Kevin Drucker, a businessman who reported his car stolen but who was really paying off members of L-12 not to hurt his son Patterson, who was imprisoned on the same cell block with many of the gang members. McCoy and Borgia realize that the only way they can get to L-12, who ordered the hit on Richter, is to get Drucker to testify. Drucker is reluctant to do so, however, unless his son's safety can be guaranteed."
      },
      {
        "id": "tvmaze:52683",
        "title": "Birthright",
        "season": 16,
        "episode": 6,
        "released": "2005-11-02",
        "overview": "Teenage suspect Traci Sands dies in police custody after being arrested for the murder of the man who reported her to child protective services. Rodgers reveals that she died because someone outfitted her with a benecrine I.U.D. that reacted with Sands' sickle system and ended up killing her. Fontana and Green follow the trail to a charitable clinic and nurse Gloria Rhodes, who believes she is saving the world by sterilizing women that she does not believe are worthy of having children. McCoy faces former assistant district attorney Paul Robinette (Richard Brooks) in court as Robinette defends Rhodes."
      },
      {
        "id": "tvmaze:52684",
        "title": "House of Cards",
        "season": 16,
        "episode": 7,
        "released": "2005-11-09",
        "overview": "Fontana and Green investigate when the body of a young mother who had recently cleaned up her life is found in her apartment, with her five-day-old infant son Nicholas missing. Detectives soon track down Arlene Tarrington and ascertain that the infant she is claiming is hers is really baby Nicholas, but after her lawyers make a claim of post-partum psychosis and another man comes forward claiming to be the child's father, McCoy and Borgia are forced to decide which of the two they would rather lock up for the crime."
      },
      {
        "id": "tvmaze:52685",
        "title": "New York Minute",
        "season": 16,
        "episode": 8,
        "released": "2005-11-16",
        "overview": "When the owner of a big-rig trucking company is shot to death, Detectives Fontana and Green learn that the victim was hauling illegal aliens and suspect a member (Daniel Roebuck) of a citizen's border patrol group; but their only witness is an undocumented Hispanic woman (Aixa Rosario Medina) who risks deportation if she testifies. Meanwhile, prosecutor McCoy is incensed when the witness is physically intimidated as he tries to turn one organization member against the other in court."
      },
      {
        "id": "tvmaze:52686",
        "title": "Criminal Law",
        "season": 16,
        "episode": 9,
        "released": "2005-11-23",
        "overview": "The deaths of three women with the same name lead Fontana and Green to the nine-year-old conviction of Leland Barnes, who had shot and killed his wife in an office full of people. With two of the three witnesses against him dead and Jack McCoy on the hit list, the detectives struggle to determine how Barnes, who has been in prison the entire time, got someone on the outside to kill the only people who could keep him in jail. The investigation leads them to Leland's two sons, with surprising results."
      },
      {
        "id": "tvmaze:52687",
        "title": "Acid",
        "season": 16,
        "episode": 10,
        "released": "2005-11-30",
        "overview": "After the daughter of one of Van Buren's college friends is found dead in her room, a suicide, Van Buren joins Green and Fontana in hunting down the man who burned her face with acid months earlier, ultimately leading to her suicide. Van Buren is unsuccessful in getting a lot of help from her friend, who is terrified that the man who destroyed her elder daughter's life will destroy her younger daughter as well. McCoy and Borgia's case hits a snag when Van Buren takes the stand and comes close to committing perjury to keep Jason Corley behind bars."
      },
      {
        "id": "tvmaze:52688",
        "title": "Bible Story",
        "season": 16,
        "episode": 11,
        "released": "2005-12-07",
        "overview": "Jeffrey Kilgore is found murdered after destroying the Speicher Chumash, which had been brought to America from Poland years earlier. Green and Fontana follow the trail of evidence to Barry Speicher, who confesses to the murder, but it's his cousin Eric that McCoy has his eye on after Barry's wife tells them that Eric had everything to gain by Barry going to prison. McCoy and Borgia pursue the matter to trial, but their star witness turns on them."
      },
      {
        "id": "tvmaze:52689",
        "title": "Family Friend",
        "season": 16,
        "episode": 12,
        "released": "2006-01-11",
        "overview": "After Philip and Valerie Messick are attacked in their home, Green and Fontana follow the trail to a small-time thug named Jay Fleckner. After Valerie's testimony unintentionally helps free Fleckner, he is found dead, and detectives soon realize that Bob Cerullo, a family friend of Valerie and her late husband, was the triggerman. Unfortunately, when McCoy attempts to prosecute Cerullo, a retired cop, he threatens to claim that he deliberately planted evidence in his past cases in an attempt to get McCoy to drop all the charges."
      },
      {
        "id": "tvmaze:52690",
        "title": "Heart of Darkness",
        "season": 16,
        "episode": 13,
        "released": "2006-01-18",
        "overview": "A journalist's suicide becomes suspect after Green and Fontana find evidence at the scene suggesting that it was not a suicide after all. Their suspicions turn to the reporter's girlfriend after learning that he was still sleeping with his ex, but their investigation soon leads them in a different direction."
      },
      {
        "id": "tvmaze:52691",
        "title": "Magnet",
        "season": 16,
        "episode": 14,
        "released": "2006-02-08",
        "overview": "Detectives Fontana and Green investigate the strangling of a promising Hispanic student at a private magnet school. The men soon learn the victim was selling test answers and writing term papers for more privileged students, including their prime suspect, Greg Loomis (Jaime McAdams), a trouble-prone senior who would kill just to graduate. After Loomis' arrest, Jack McCoy spurns any deal with his high-powered attorney Rebecca Shane (Kathleen Turner) but has to overcome her vigorous defense that her client himself was a victim of medication side effects."
      },
      {
        "id": "tvmaze:52692",
        "title": "Choice of Evils",
        "season": 16,
        "episode": 15,
        "released": "2006-03-01",
        "overview": "After the body of a teenage boy is found dead in a warehouse, detectives use DNA to connect the boy to a convicted rapist and serial killer, then to the boy's mother, Allison Ashburn, the convict's ex-wife. While trying to solve Danny's murder, Fontana and Green learn that he recently got his girlfriend Tina pregnant, and his mother had seen him recently when she had given him money despite having claimed she had not seen him for months. Allison finally admits that she murdered her son after the police arrest her new husband John, but claims she did it to save the world from her son, whom she was convinced would become a monster just like his biological father. Borgia and McCoy face an uphill battle trying to convict the perfect soccer mom."
      },
      {
        "id": "tvmaze:52693",
        "title": "Cost of Capital",
        "season": 16,
        "episode": 16,
        "released": "2006-03-08",
        "overview": "After a young African-American banking associate is found murdered, Detectives Fontana and Green discover that he had hundreds of thousands of dollars in his checking account. The detectives suspect the victim was having an affair with his high-powered boss Sophia (Lisa Zane) who killed him out of fear and rage. As the police and EADA Jack McCoy build their case, everything hinges on using either the executive's estranged husband or their shaky teenaged daughter Katie (Sarah Steele) as their star witness."
      },
      {
        "id": "tvmaze:52694",
        "title": "America, Inc.",
        "season": 16,
        "episode": 17,
        "released": "2006-03-22",
        "overview": "After Jeffrey Pope, a private military contractor, is found dead, suspicion eventually leads Green and Fontana to Robbie Howell, the younger brother of a man who died because of Pope's incompetence, and Kevin Boatman, Nick Howell's former co-worker who had witnessed the tragic events in Iraq. Danielle Melnick returns to defend Robbie and Kevin, and in the courtroom Kevin drops the bombshell that he knows where Pope and his men were keeping an Iraqi prisoner of war, a wanted terrorist. McCoy and Branch butt heads over whether or not to let Kevin Boatman get away with murder in order to get their hands on the prisoner."
      },
      {
        "id": "tvmaze:52695",
        "title": "Thinking Makes It So",
        "season": 16,
        "episode": 18,
        "released": "2006-03-29",
        "overview": "Fontana and Green investigate when a bank manager is involved in the robbing of his own bank and learn that his daughter is being held hostage and that he had to go along with the robbery or risk losing his daughter. One man is killed in the robbery, but the two detectives track down his accomplice and, while alone with Mitchell Lowell, Fontana uses extreme force to get the answers he needs, prompting Lowell's lawyer to claim that all the information Fontana obtained is fruit of the poison tree. McCoy works to fight the claim of police brutality while also trying to find a way to get around Fontana's actions."
      },
      {
        "id": "tvmaze:52696",
        "title": "Positive",
        "season": 16,
        "episode": 19,
        "released": "2006-04-05",
        "overview": "When a teenage boy commits suicide after firing on a doctor and hitting an innocent party, Fontana and Green investigate why he was after the doctor to begin with and learn that Jeremy Miller's younger sister had recently died of AIDS. Throughout the course of the investigation, detectives are led to Dr. Andrew Copelan, the doctor in charge of Emily Miller's care, who had been giving her an experimental AIDS drug not yet approved for usage on humans, ostensibly to find a cure for his own AIDS."
      },
      {
        "id": "tvmaze:52697",
        "title": "Kingmaker",
        "season": 16,
        "episode": 20,
        "released": "2006-05-03",
        "overview": "After undercover cop Dana Baker is murdered, Fontana and Green learn that the man who killed her had discovered her identity after seeing a photograph of her in the paper revealing her as an undercover police officer, not the heroin dealer she was posing as. Investigating the story leads detectives to Eric Lund, one of the workers in Congressman Prescott's office, but Lund seems to have an ironclad alibi after an e-mail he sent comes to light."
      },
      {
        "id": "tvmaze:52698",
        "title": "Hindsight",
        "season": 16,
        "episode": 21,
        "released": "2006-05-10",
        "overview": "Detectives Fontana and Green are skeptical when Detective Falco (Michael Imperioli) finds a young woman he took home the night before slashed to death in his bathroom. Anxious to exonerate himself of this crime, Falco takes steps that could be indicative of a cover-up instead of an unauthorized pursuit of the true culprit. Fortunately, Detectives Fontana and Green believe their colleague was drugged by the victim in a plan to rob him but was instead dispatched by a violent female rival. Proving it in court is difficult for Jack McCoy, who must sort through a family of cons and ex-cons, some with ties to Falco, all resulting in a final twist of fate."
      },
      {
        "id": "tvmaze:52699",
        "title": "Invaders",
        "season": 16,
        "episode": 22,
        "released": "2006-05-17",
        "overview": "The latest murder victims of two home invaders are the family members of a man who once sold fake D.E.A. badges to the killers and then began secretly cooperating with police. The case takes a harrowing turn when one of the law enforcement teams is put in the line of fire. In a legal gambit, Executive ADA Jack McCoy must then risk his career, and those of others, as well; bending the rules and using corrupt DEA Agent Almonte (Ritchie Coster) to lure out the sadistic psychopaths. Meanwhile, the police and the DAs have to deal with the loss of one of their own in the midst of this high-profile case."
      },
      {
        "id": "tvmaze:52700",
        "title": "Fame",
        "season": 17,
        "episode": 1,
        "released": "2006-09-22",
        "overview": "Green and Cassady investigate the death of a cop accidentally killed during a botched robbery which leads them to stolen photographs of a celebrity mother married to a player."
      },
      {
        "id": "tvmaze:52701",
        "title": "Avatar",
        "season": 17,
        "episode": 2,
        "released": "2006-09-29",
        "overview": "Green and Cassady investigate after the photograph of a dead woman is found on a popular website, B-Frendz.com. Their investigation leads them to a mentally disturbed young man who the teenage daughter of the victim claims kidnapped and raped her, but his lawyer offers up an even greater incentive—the supposed kidnapping victim, Molly Preston."
      },
      {
        "id": "tvmaze:52702",
        "title": "Home Sweet",
        "season": 17,
        "episode": 3,
        "released": "2006-10-06",
        "overview": "When eight-year-old Jenna Wechsler dies as a result of a building explosion, Green and Cassady follow the trail of evidence to Rosalie Schaffner, the owner's ex-wife. McCoy and Rubirosa pursue Rosalie Schaffner despite a lack of concrete evidence, but the case takes a turn when Rubirosa finds a piece of evidence that points them in a new direction."
      },
      {
        "id": "tvmaze:52703",
        "title": "Fear America",
        "season": 17,
        "episode": 4,
        "released": "2006-10-13",
        "overview": "After Eric Khabaly is seen being murdered on tape in what appears to be an American movement against Islam, Green and Cassady investigate the case which leads them to Khabaly's cousin, Ben Faoud, who appears to be connected to a terrorist cell functioning inside New York. Unfortunately, the best link to Faoud appears to surround a recent shipment of uranium, which McCoy and Rubirosa are forbidden to mention by the federal government. When news of the uranium leaks out, McCoy and Rubirosa find themselves the victims of intense federal scrutiny, and Paul Robinette's (Richard Brooks) vigorous defense of young Faoud does not help matters."
      },
      {
        "id": "tvmaze:52704",
        "title": "Public Service Homicide",
        "season": 17,
        "episode": 5,
        "released": "2006-10-20",
        "overview": "When Carl Mullaly is discovered murdered in his apartment, Green and Cassady learn that he had recently been profiled on HardFocus, a tabloid talk show that exposes sex offenders who are caught via the ScumWatch website. With an eight-year-old girl as the only eyewitness, detectives arrest the murderer, but McCoy and Rubirosa soon learn that HardFocus is a lot more involved than they claim."
      },
      {
        "id": "tvmaze:52705",
        "title": "Profiteer",
        "season": 17,
        "episode": 6,
        "released": "2006-10-27",
        "overview": "The shooting of a local businessman is linked to a killing in Iraq, and McCoy and Rubirosa refuse to allow the killer to plead out."
      },
      {
        "id": "tvmaze:52706",
        "title": "In Vino Veritas",
        "season": 17,
        "episode": 7,
        "released": "2006-11-03",
        "overview": "A has-been actor wearing bloodstained clothing arrested for drunken driving reveals religious prejudices during his rantings."
      },
      {
        "id": "tvmaze:52707",
        "title": "Release",
        "season": 17,
        "episode": 8,
        "released": "2006-11-10",
        "overview": "After Hudson Moore is found bludgeoned in the back of the Babes Being Bad bus, suspicion initially turns to the company's creator, Chris Drake, until video footage leads detectives to a young woman who was with Moore the night that he died. After concentrating their investigation on the young woman, the reasons behind Moore's murder soon become apparent, and McCoy and Rubirosa struggle to prosecute a man who, while not directly responsible for the murder, may have been responsible for the incidents that led up to it."
      },
      {
        "id": "tvmaze:52708",
        "title": "Deadlock",
        "season": 17,
        "episode": 9,
        "released": "2006-11-17",
        "overview": "Green and Cassady hunt mass murderer Leon Vorgitch, who recently escaped from prison. The finally corner Vorgitch in a school with a room full of hostages, and before surrendering himself to police, Vorgitch shoots a number of innocent children, killing four. His unwillingness to accept a deal infuriates McCoy, as it gives him more time to escape prison again. When the father of one of his victims takes justice into his own hands and ends up being used as a campaign slogan for a local politician, McCoy and Rubirosa try to convince Robert Purcell not to let himself be a scapegoat for a political platform."
      },
      {
        "id": "tvmaze:52709",
        "title": "Corner Office",
        "season": 17,
        "episode": 10,
        "released": "2006-12-08",
        "overview": "After corporate attorney Charles Dillon is discovered dead in a hotel room, Green and Cassady investigate and learn that the company he was working for is in the process of being indicted. Their investigation leads them to a high-priced callgirl, Julia Veloso, who turns out to have been romantically involved with the company's CEO, Samantha Weaver. McCoy and Rubirosa find themselves at odds as Rubirosa wonders if McCoy's prosecution of Weaver has more to do with her gender than her guilt."
      },
      {
        "id": "tvmaze:52710",
        "title": "Remains of the Day",
        "season": 17,
        "episode": 11,
        "released": "2007-01-05",
        "overview": "After Michael Jones dies in his mother's hospital room with no immediate explanation, his mother Ashley accuses her former husband's adult children, Miles and Hillary Foster, who are fighting her for control of their father's substantial fortune. The autopsy rules out the Fosters, and points Green and Cassady in the direction of illegally harvested donor bones, which Jones had received in a transplant eighteen months prior. McCoy and Rubirosa struggle to prosecute the case after it becomes clear the only way they will get the evidence they need is to test another young man who received bone grafts from the same woman who had given Michael Jones his legs."
      },
      {
        "id": "tvmaze:52711",
        "title": "Charity Case",
        "season": 17,
        "episode": 12,
        "released": "2007-01-12",
        "overview": "Green and Cassady investigate after Sean Archer, a producer who had recently adopted a child from Africa with his wife, well-known actress Sofia (Jennifer Beals), is gunned down outside an ice cream shop while holding baby Christopher. The shooting is soon linked to the recent adoption of Christopher, which had received international scrutiny because it appeared to have been pushed through based on the couple's celebrity status. McCoy and Rubirosa initially investigate the murder of Sean Archer, which soon turns into an investigation of a child's death when the identity of baby Christopher comes under question."
      },
      {
        "id": "tvmaze:52712",
        "title": "Talking Points",
        "season": 17,
        "episode": 13,
        "released": "2007-02-02",
        "overview": "The shooting of university student Jason Miles at a political rally hosted by controversial speaker Judith Barlow leaves any number of suspects, but after Green and Cassady prove that two of the people they've questioned are lying about their alibis, they turn their attention to Malcom Yates, a grad student who claimed to be with Jason's girlfriend at the time of his death. McCoy and Rubirosa realize that Yates went after Barlow because of her open criticism of stem-cell research, something that Yates had high hopes could help find a cure for his own Parkinsons."
      },
      {
        "id": "tvmaze:52713",
        "title": "Church",
        "season": 17,
        "episode": 14,
        "released": "2007-02-09",
        "overview": "A reverend confesses to the murder of a young gay actor, but McCoy and Rubirosa soon learn that he may not be the guilty party."
      },
      {
        "id": "tvmaze:52714",
        "title": "Melting Pot",
        "season": 17,
        "episode": 15,
        "released": "2007-02-16",
        "overview": "After an actress is found dead in her apartment, Green and Cassady attempt to prove that her death was not a suicide."
      },
      {
        "id": "tvmaze:52715",
        "title": "Murder Book",
        "season": 17,
        "episode": 16,
        "released": "2007-02-23",
        "overview": "After publisher Serena Darby is found murdered in her apartment, suspicion turns to J.P. Lange, a former professional baseball player acquitted of his wife's murder who had written a book hypothesizing how he would have committed the murder. Green and Cassady follow the trail of evidence from Lange to Gerald Stockwell, a former ghostwriter on the book, but Stockwell tries to clear himself by offering McCoy and Rubirosa proof that one of the jurors in Lange's trial was paid off to force an acquittal."
      },
      {
        "id": "tvmaze:52716",
        "title": "Good Faith",
        "season": 17,
        "episode": 17,
        "released": "2007-03-30",
        "overview": "Green and Cassady investigate an arson turned homicide when a body found in a burned church turns out to have been murdered before the fire started."
      },
      {
        "id": "tvmaze:52717",
        "title": "Bling",
        "season": 17,
        "episode": 18,
        "released": "2007-04-06",
        "overview": "Green and Cassady follow the clues in the shooting death of female rapper Clarice James, \"Sweet Clarice\", first to a sketchy music producer and then to a jeweler who claims Clarice owed him a great deal of cash."
      },
      {
        "id": "tvmaze:52718",
        "title": "Fallout",
        "season": 17,
        "episode": 19,
        "released": "2007-04-27",
        "overview": "Green and Cassady get mixed up with the Russian consulate after Peter Rostov dies of ricin poisoning. Their investigation leads them first to his work, where they learn he spent a great deal of time traveling back and forth between Russia, and secondly to his brother, Karl. It is not long before they link the Rostov brothers to an illegal prostitution ring trafficking in young Russian woman, but McCoy is faced with trying to get the remaining Rostov brother to testify so he can prosecute Brezin, the father of one of the trafficked girls."
      },
      {
        "id": "tvmaze:52719",
        "title": "Captive",
        "season": 17,
        "episode": 20,
        "released": "2007-05-04",
        "overview": "When a young boy is found murdered, Green and Cassady follow the leads to a suspected serial pedophile/murderer."
      },
      {
        "id": "tvmaze:52720",
        "title": "Over Here",
        "season": 17,
        "episode": 21,
        "released": "2007-05-11",
        "overview": "The detectives link the deaths of two homeless men to the war in Iraq."
      },
      {
        "id": "tvmaze:52721",
        "title": "The Family Hour",
        "season": 17,
        "episode": 22,
        "released": "2007-05-18",
        "overview": "When Nicole Bailey, the ex-wife of a respected former senator, is found murdered and brutalized in her home, Green and Cassady look first at the senator, but follow the trail of clues to a dysfunctional family with a number of potentially embarrassing secrets. McCoy finds himself in the hot seat when he is forced to argue the case in front of a judge more interested in public relations than justice."
      },
      {
        "id": "tvmaze:52722",
        "title": "Called Home",
        "season": 18,
        "episode": 1,
        "released": "2008-01-02",
        "overview": "Det. Cyrus Lupo returns to New York after serving four years abroad in the Intelligence division after learning his brother committed suicide. Lupo and Green reluctantly partner up to investigate another suicide committed the same way and soon find a suspect in a parolee known as \"Dr. Death\"."
      },
      {
        "id": "tvmaze:52723",
        "title": "Darkness",
        "season": 18,
        "episode": 2,
        "released": "2008-01-02",
        "overview": "Lupo and Green's first official case together is a kidnapping that happened during a citywide blackout; a housekeeper is slain and a mother and daughter are kidnapped. The evidence that links all the kidnappers is the father and husband of the kidnap victims. When they search the kidnappers' hideout, they find preparations which implies that the kidnappers knew that the blackout was coming. Cutter must convince the man to testify after he has lied about a search warrant to save the man's daughter, or else the kidnappers will all go free. Issues of a warrantless search arise. Courtroom scenes revolve around questions of Enron-like manipulation of energy."
      },
      {
        "id": "tvmaze:52724",
        "title": "Misbegotten",
        "season": 18,
        "episode": 3,
        "released": "2008-01-09",
        "overview": "Green and Lupo investigate after a package explodes at a scientific research lab, resulting in the injury of a pregnant security guard. The investigation soon turns to the scientist's latest experiments."
      },
      {
        "id": "tvmaze:52725",
        "title": "Bottomless",
        "season": 18,
        "episode": 4,
        "released": "2008-01-16",
        "overview": "The investigation into a pair of missing pants leads to the murder of a young lawyer. Lupo and Green soon turn their suspicions to a businessman who works for a shady multinational corporation called SavingsMart."
      },
      {
        "id": "tvmaze:52726",
        "title": "Driven",
        "season": 18,
        "episode": 5,
        "released": "2008-01-23",
        "overview": "Lupo and Green investigate after a white teenager (David Kendall) and a young black girl (Tanya Anderson) are shot and killed in a local neighborhood. The investigation stalls when no one is willing to talk, but the detectives later learn that the victim had earlier had an altercation with someone in the neighborhood that led to a surprising altercation later that evening."
      },
      {
        "id": "tvmaze:52727",
        "title": "Political Animal",
        "season": 18,
        "episode": 6,
        "released": "2008-01-30",
        "overview": "A triple homicide has ties to a politician, but he may be just the first step toward the truth and a killer who will take desperate measures to keep his freedom."
      },
      {
        "id": "tvmaze:52728",
        "title": "Quit Claim",
        "season": 18,
        "episode": 7,
        "released": "2008-02-06",
        "overview": "A hit-and-run investigation leads back to a title company, but Green, Rubirosa and Lupo's undercover work takes a surprising twist that pits McCoy against the U.S. Attorney's office."
      },
      {
        "id": "tvmaze:52729",
        "title": "Illegal",
        "season": 18,
        "episode": 8,
        "released": "2008-02-13",
        "overview": "A riot at an immigration rally ends in murder, and the political climate causes McCoy to assign a special prosecutor increasing tensions at the office."
      },
      {
        "id": "tvmaze:52730",
        "title": "Executioner",
        "season": 18,
        "episode": 9,
        "released": "2008-02-20",
        "overview": "A case of mistaken identity leads Green and Lupo to suspect that a murdered doctor may have been in the wrong place at the wrong time."
      },
      {
        "id": "tvmaze:52731",
        "title": "Tango",
        "season": 18,
        "episode": 10,
        "released": "2008-02-27",
        "overview": "A high school party turns tragic when a teenager is found dead, and the detectives end up playing games with the two leading suspects to find out the real story. Unfortunately, unwanted attention from a juror for A.D.A. Rubirosa may disrupt the trial."
      },
      {
        "id": "tvmaze:52732",
        "title": "Betrayal",
        "season": 18,
        "episode": 11,
        "released": "2008-03-05",
        "overview": "The murder of a psychiatrist focuses the suspect list to his clients and wife, and the defense of the murderer will challenge the D.A.'s office to somehow show the jury that a bad childhood is not a justification for crime."
      },
      {
        "id": "tvmaze:52733",
        "title": "Submission",
        "season": 18,
        "episode": 12,
        "released": "2008-03-12",
        "overview": "When the police shut down a dog-fighting ring, the investigation becomes a murder case after a woman's finger is found inside one of the dogs; things get more complicated as the case deepens, and the interest of a pushy reporter is sparked."
      },
      {
        "id": "tvmaze:52734",
        "title": "Angelgrove",
        "season": 18,
        "episode": 13,
        "released": "2008-03-19",
        "overview": "A recorded conversation has Lupo and Green delving into the personal and family life of a murdered art dealer, and suspected connections to terrorist activity."
      },
      {
        "id": "tvmaze:52735",
        "title": "Burn Card",
        "season": 18,
        "episode": 14,
        "released": "2008-04-23",
        "overview": "Internal Affairs takes a special interest in Detective Green after he shoots a gambler that may be connected to a current case. The investigation turns up a part of his past he's taken pains to conceal."
      },
      {
        "id": "tvmaze:52736",
        "title": "Bogeyman",
        "season": 18,
        "episode": 15,
        "released": "2008-04-30",
        "overview": "A novelist's apparent suicide changes to a murder investigation. The suspects include a cult and her husband. Cutter's case is jeopardized by the defense attorney's indirect juror tampering tactics of scaring the jurors."
      },
      {
        "id": "tvmaze:52737",
        "title": "Strike",
        "season": 18,
        "episode": 16,
        "released": "2008-05-07",
        "overview": "A legal aid strike ends in the death of a paralegal, and the investigation leads to a golf pro who proclaims his innocence, again. Then the case takes an even stranger twist when Rubirosa is pitted against Cutter because of the strike that started it all."
      },
      {
        "id": "tvmaze:52738",
        "title": "Personae Non Grata",
        "season": 18,
        "episode": 17,
        "released": "2008-05-14",
        "overview": "An online romance may be at the heart of a mechanic's murder, but Detectives Lupo and Bernard must unravel some truly bizarre developments before the full story is known."
      },
      {
        "id": "tvmaze:52739",
        "title": "Excalibur",
        "season": 18,
        "episode": 18,
        "released": "2008-05-21",
        "overview": "A jeweler's murder may have ties to a prostitution ring. Once the case goes to trial, D.A. McCoy's job is on the line as favors are called in."
      },
      {
        "id": "tvmaze:52740",
        "title": "Rumble",
        "season": 19,
        "episode": 1,
        "released": "2008-11-05",
        "overview": "A stockbroker is beaten to death and the investigation leads to an illegal street-fighting ring. Issues around misuse of terrorism statutes are explored."
      },
      {
        "id": "tvmaze:52741",
        "title": "Challenged",
        "season": 19,
        "episode": 2,
        "released": "2008-11-12",
        "overview": "The detectives hope that a mentally challenged patient can help them solve the case of a man found murdered in a park, but the patient's family may be responsible for the crime."
      },
      {
        "id": "tvmaze:52742",
        "title": "Lost Boys",
        "season": 19,
        "episode": 3,
        "released": "2008-11-19",
        "overview": "A young man's murder is linked to a woman who has escaped from a polygamous religious cult."
      },
      {
        "id": "tvmaze:52743",
        "title": "Falling",
        "season": 19,
        "episode": 4,
        "released": "2008-11-26",
        "overview": "A crane falls and kills a man and the detectives find evidence of foul play."
      },
      {
        "id": "tvmaze:52744",
        "title": "Knock Off",
        "season": 19,
        "episode": 5,
        "released": "2008-12-03",
        "overview": "A tourist is murdered and the detectives suspect that corrupt law enforcement officers from a small town are involved. Meanwhile, the governor threatens to nominate a new District Attorney for the upcoming election."
      },
      {
        "id": "tvmaze:52745",
        "title": "Sweetie",
        "season": 19,
        "episode": 6,
        "released": "2008-12-10",
        "overview": "A well-known memoir writer who wrote a book about his early life as a male prostitute is found dead, but as the detectives investigate they discover that the book was based on the life of another person."
      },
      {
        "id": "tvmaze:52746",
        "title": "Zero",
        "season": 19,
        "episode": 7,
        "released": "2008-12-17",
        "overview": "A woman's body is found in a city garden, leaving Bernard and Lupo to sort through her contradictory life and her ties to a cop's death in New Jersey. Then Cutter's case is jeopardized by a law clerk with a crush whose judge requires an unusual amount of assistance."
      },
      {
        "id": "tvmaze:52747",
        "title": "Chattel",
        "season": 19,
        "episode": 8,
        "released": "2009-01-07",
        "overview": "A pair of divorce lawyers are murdered in their home and the investigation leads to a possible cover-up involving the abuse of adopted Haitian children."
      },
      {
        "id": "tvmaze:52748",
        "title": "By Perjury",
        "season": 19,
        "episode": 9,
        "released": "2009-01-14",
        "overview": "A plaintiff in a class-action suit against an airline is murdered and the murder may have been committed by a lawyer linked to many other murders in the past."
      },
      {
        "id": "tvmaze:52749",
        "title": "Pledge",
        "season": 19,
        "episode": 10,
        "released": "2009-01-21",
        "overview": "Harold Foley and his wife Joyce, both biologists at a local university, come home to find their son and their housekeeper murdered. The case leads to a man obsessed with a certain sorority."
      },
      {
        "id": "tvmaze:52750",
        "title": "Lucky Stiff",
        "season": 19,
        "episode": 11,
        "released": "2009-01-28",
        "overview": "A murdered truck driver has ties to the Russian mob."
      },
      {
        "id": "tvmaze:52751",
        "title": "Illegitimate",
        "season": 19,
        "episode": 12,
        "released": "2009-02-04",
        "overview": "A police officer who has been having financial problems takes hostages at gunpoint and is then killed by fellow officers. He has the keys to an apartment that is not his primary residence; detectives Lupo and Bernard search the apartment and find a dead body and valuable stolen documents that have been stolen by a man who needs them to prove that he is the illegitimate son of John F. Kennedy."
      },
      {
        "id": "tvmaze:52752",
        "title": "Crimebusters",
        "season": 19,
        "episode": 13,
        "released": "2009-02-11",
        "overview": "After an Army recruitment center is bombed an unconscious woman and her dead baby who were sleeping at the place are found in the wreckage. The case gets even more complicated after a group of voluntary vigilantes interfere in the investigation and both of the prime suspects, including the baby's own mother, have equal motives for the crime."
      },
      {
        "id": "tvmaze:52753",
        "title": "Rapture",
        "season": 19,
        "episode": 14,
        "released": "2009-02-18",
        "overview": "The creator of a religious website is murdered and the trail leads to a corrupt charitable organization who was stealing from his clients. When the detectives are ready to arrest him the suspect seeks asylum in the Embassy of Iran claiming to be victim of a Zionist conspiracy."
      },
      {
        "id": "tvmaze:52754",
        "title": "Bailout",
        "season": 19,
        "episode": 15,
        "released": "2009-03-11",
        "overview": "The mistress of the CEO of a failed bank is killed in a hit-and-run and the investigation leads to a kidnapping and extortion plot."
      },
      {
        "id": "tvmaze:52755",
        "title": "Take-Out",
        "season": 19,
        "episode": 16,
        "released": "2009-03-18",
        "overview": "A writer is murdered after investigating an espionage case involving the Chinese government that led to the imprisonment of a man many years ago."
      },
      {
        "id": "tvmaze:52756",
        "title": "Anchors Away",
        "season": 19,
        "episode": 17,
        "released": "2009-03-25",
        "overview": "Detectives Lupo and Bernard investigate the murder of a television reporter who was involved in a love triangle with one of her co-workers."
      },
      {
        "id": "tvmaze:52757",
        "title": "Promote This!",
        "season": 19,
        "episode": 18,
        "released": "2009-04-29",
        "overview": "The detectives investigate the vicious beating of an Hispanic illegal immigrant who may be linked to a series of other hate crimes."
      },
      {
        "id": "tvmaze:52758",
        "title": "All New",
        "season": 19,
        "episode": 19,
        "released": "2009-05-06",
        "overview": "Firefighter Thomas Cooper and his wife Linda are tortured and murdered in their new townhouse. The murders are thought to be linked to an old unsolved drug case, but then the detectives learn about a firefighter named Nick Spence, who had just joined Cooper's company and was being severely hazed. The investigation suffers a setback when Spence dies in a fire under suspicious circumstances."
      },
      {
        "id": "tvmaze:52759",
        "title": "Exchange",
        "season": 19,
        "episode": 20,
        "released": "2009-05-13",
        "overview": "Two engaged scientists die in a fire and their mentally challenged neighbor is injured while trying to help them. The detectives discover that the couple was stabbed before the fire and this leads them to a disturbed and extremely jealous woman."
      },
      {
        "id": "tvmaze:52760",
        "title": "Skate or Die",
        "season": 19,
        "episode": 21,
        "released": "2009-05-20",
        "overview": "Detectives Lupo and Bernard investigate a serial killer who targets homeless men and discover that a copycat may be at work, but to arrest the murderers they need the testimony of a bipolar skater who is having a psychotic attack."
      },
      {
        "id": "tvmaze:52761",
        "title": "The Drowned and the Saved",
        "season": 19,
        "episode": 22,
        "released": "2009-06-03",
        "overview": "A prominent charity executive is murdered and claims of stalking and blackmail surface during the investigation. The case then leads to Rita Shalvoy, the wife of governor Donald Shalvoy, and once again Jack McCoy must know if he is willing to prosecute his old friend."
      },
      {
        "id": "tvmaze:52762",
        "title": "Memo from the Dark Side",
        "season": 20,
        "episode": 1,
        "released": "2009-09-25",
        "overview": "When young war veteran Greg Tanner (Creighton James) is found murdered in a Hudson University parking garage, Detectives Cyrus Lupo and Kevin Bernard connect the murder to law professor Kevin Franklin, an attorney who formerly worked for the Department of Justice. But when the case is brought to court, it seems Tanner may have been more affected by the war than his discharge stated. Lupo and Bernard find that the pieces start to fit when Franklin's memos from the Bush Administration are leaked. Meanwhile, Lieutenant Van Buren announces some very shocking news to her squad, concerning her health, and District Attorney Jack McCoy deals with the stress of winning the election."
      },
      {
        "id": "tvmaze:52763",
        "title": "Just a Girl in the World",
        "season": 20,
        "episode": 2,
        "released": "2009-10-02",
        "overview": "After crime scene unit investigator Daisy Chao is found murdered in her apartment, Detectives Lupo and Bernard suspect her fiance, Jim Anderson , may not be telling the whole truth about his involvement with the murder. When young journalist Emma Kim is attacked by a cab driver, DNA found at both crime scenes seems to implicate the same man for the attacks. The investigators become personally involved with the case as Detective Lupo gets close with Emma, and ethical questions arise, which puts Detective Cyrus Lupo's career on the line."
      },
      {
        "id": "tvmaze:52764",
        "title": "Great Satan",
        "season": 20,
        "episode": 3,
        "released": "2009-10-09",
        "overview": "When an aspiring musician is found dead behind a trash can, Detectives Lupo and Bernard find a bag full of cash, leading them to a slew of suspects, including Don Sorenson. Sorenson confesses to shooting the musician when it is revealed that his daughter is thought kidnapped, but the clues don't seem to match up when his daughter, Jill Sorenson, appears back at home after losing her cell phone. Using the stolen cell phone as a guide, the detectives link the case with a bigger terrorist scheme, which could put lives in danger. Meanwhile, Lt. Van Buren begins to seek treatment for her cancer."
      },
      {
        "id": "tvmaze:52765",
        "title": "Reality Bites",
        "season": 20,
        "episode": 4,
        "released": "2009-10-16",
        "overview": "When Larry Johnson drives home from picking up his adopted, physically disabled children from school, he discovers his wife's dead body on the floor of their home. Detectives Lupo and Bernard question Vaughn, who explains that he and his wife had adopted a child with special needs and felt it was their calling, so they adopted nine more children. While the detectives question the children for suspects and a motive, they uncover an affair and an offer for the Vaughn family to appear in a reality show, causing tension in the household and with another family, whose mother has strong ambitions to be on the reality show."
      },
      {
        "id": "tvmaze:52766",
        "title": "Dignity",
        "season": 20,
        "episode": 5,
        "released": "2009-10-23",
        "overview": "When Doctor Walter Benning (Matthew Boston) is killed in church, Detectives Lupo and Kevin Bernard arrive at the scene and are informed a white male was seen fleeing in a dark sedan. The minister tells the detectives that Dr. Benning was a late-term abortion doctor and had been shot at before and threatened many times, and his wife, Phyllis Benning (Tracy Sallows), is convinced it is a pro-life zealot who is responsible. While the detectives scan the several protester suspects, Lt. Van Buren gets more bad news and ADA Rubirosa faces a moral dilemma, causing tension among the team."
      },
      {
        "id": "tvmaze:52767",
        "title": "Human Flesh Search Engine",
        "season": 20,
        "episode": 6,
        "released": "2009-10-30",
        "overview": "When Sid Maxwell (René Ifrah), owner of a fashion company, is found dead, Detectives Lupo and Bernard assume asphyxia. But when fashion photographer Terry Clark (Jeremy Beiler) leads the detectives to an alarming discovery of Maxwell's true identity, they uncover a suspicious website with threatening web posts. Executive ADA Cutter takes on the operator of the website, Jim Leary (Rob Corddry), who is dedicated to righting social wrongs, after a delusional woman used information gathered on the website to kill Maxwell. But as the owner of the website is charged and put on trial, he uses his defense to go after Detective Bernard, uncovering a deep secret that he never wanted to be known to anyone."
      },
      {
        "id": "tvmaze:52768",
        "title": "Boy Gone Astray",
        "season": 20,
        "episode": 7,
        "released": "2009-11-06",
        "overview": "When a young woman is found dead in her apartment, a few tell-tale signs quickly lead Detectives Lupo and Bernard to believe that the killer was not after her wealth. After finding suitcases filled with money and drugs in one of the victim's apartments, the detectives watch a security video from her lobby. The video exposes two potential suspects, leading the detectives to a drug cartel. ADA Rubirosa winds up getting a personal stake in the case as she tries her best to help Rafa Alvarez (Mario Quinonez Jr.), a young man who involuntarily got pulled into the cartel, testify against the drug lord, who has a rich and powerful defense attorney, who has crossed paths with Rubirosa before, Marcus Woll (Jonathan Cake)."
      },
      {
        "id": "tvmaze:52769",
        "title": "Doped",
        "season": 20,
        "episode": 8,
        "released": "2009-11-06",
        "overview": "A deadly drunk-driving car accident brings Detectives Lupo and Bernard to the scene when a suspicious nasal spray is found. After the medical examiner realizes the nasal spray is a powerful anesthetic that could easily disorient its user, the detectives learn that the victim was about to blow the whistle on the pharmaceutical company she worked for, causing the detectives to become suspicious of her boss, Zach Marshall (Rich Sommer)."
      },
      {
        "id": "tvmaze:52770",
        "title": "For the Defense",
        "season": 20,
        "episode": 9,
        "released": "2009-11-13",
        "overview": "After a key witness for a murder trial is found dead outside her hotel room, Detectives Lupo and Bernard become involved in a spiraling case that unravels into an intricate conspiracy, leaving additional witnesses' lives in danger and ADA Rubirosa in the crossfire. Black market dealings, affairs and drug cartels intertwine to expose the risk of taking the stand as a witness when corrupt officials control the court, EADA Cutter does his best to get down to the truth in court, putting his partnership with Rubirosa on ice, especially after learning about Rubirosa's past with dirty prosecutor-turned-defense attorney, Marcus Woll (Jonathan Cake)."
      },
      {
        "id": "tvmaze:52771",
        "title": "Shotgun",
        "season": 20,
        "episode": 10,
        "released": "2009-11-20",
        "overview": "When an elderly man, Stan Harkavy (Elliott Gould), a small businessman in Spanish Harlem, defends his shop from an armed robbery, Detectives Bernard and Lupo suspect that this incident could have been an inside job. However, the investigation later discovers that there are holes in his story; they learn that the mugging might have been a scare tactic for a shakedown, and that Mr. Harkavy's shooting may not have been a case of self-defense."
      },
      {
        "id": "tvmaze:52772",
        "title": "Fed",
        "season": 20,
        "episode": 11,
        "released": "2009-12-11",
        "overview": "As election day rapidly approaches, Detectives Lupo and Bernard discover the disfigured remains of a man with the word \"FED\" written across his bare chest. Missing a crucial piece of evidence, the detectives decide to retrace the steps of the victim, a campaign volunteer, to home in on the challenging investigation. After the victim's perplexing past emerges and the list of suspects multiplies, the detectives find themselves dealing with more than just dirty politics. They learn that the victim was secretly gathering incriminating information about the organization he worked for. Meanwhile, in the middle of the investigation, Lt. Van Buren gets a call from Rey Curtis (Benjamin Bratt), who is in town with some bad news."
      },
      {
        "id": "tvmaze:52773",
        "title": "Blackmail",
        "season": 20,
        "episode": 12,
        "released": "2010-01-15",
        "overview": "When Lupo and Bernard find journalist Megan Kerr (Amy Rutberg) dead in an abandoned apartment, the detectives learn of a relationship between the victim and daytime talk show host Vanessa Carville (Samantha Bee). Upon further investigation, the detectives encounter Carville in a meeting with DA Jack McCoy, and Carville admits to a series of workplace affairs and a blackmail threat, leaving the detectives suspicious of Carville and her co-workers."
      },
      {
        "id": "tvmaze:52774",
        "title": "Steel-Eyed Death",
        "season": 20,
        "episode": 13,
        "released": "2010-03-01",
        "overview": "When a family of four is found murdered in their home, Detectives Lupo and Bernard discover that the deaths may be related to the deceased teenage daughter's troubled friend, Bonnie Jones (Emily Meade). As Lupo and Bernard track down Bonnie, the detectives become aware of another suspect, Justin Sachs (Michael Oberholtzer), who suffers from post-traumatic stress disorder, making the case more complicated when both suspects' mental states come into question. As the case is tried in court, EADA Mike Cutter is up against a famous defense attorney, Veronica Masters (Rebecca Creskoff), who had a history with Detective Cyrus Lupo, who reveals a secret to his partner, Bernard."
      },
      {
        "id": "tvmaze:52775",
        "title": "Boy on Fire",
        "season": 20,
        "episode": 14,
        "released": "2010-03-01",
        "overview": "When Lupo and Bernard come upon the burning body of Cesar Ramirez (Noel Rodriguez), a sixteen-year-old charter school student from a bad neighborhood, they begin to question his young mentee Moses (Aaron Shaw), who was the last person to see him alive. After evidence leads the detectives to a shocking cell phone video of the crime being committed, they soon realize that the four people in the video may be in cahoots with an unexpected ally. The investigation leads the detectives to the high school principal, Martha Woodside (Debra Winger), who has all of the right answers. With a shady educator, tampered alibis and jealous schoolboys all coming into play, the detectives discover that their case may be more than elementary, and until new evidence comes to light, there is no one that ADAs Cutter and Rubirosa can put on trial."
      },
      {
        "id": "tvmaze:52776",
        "title": "Brilliant Disguise",
        "season": 20,
        "episode": 15,
        "released": "2010-03-08",
        "overview": "After a young woman, Justine Stebbins (Laura Campbell), is found brutally murdered in a hotel and her body stashed away on a food service cart, evidence leads Detectives Lupo and Kevin Bernard to a young medical school student. When a crafty lawyer, Ray Backlund (Timothy Busfield), becomes involved, the detectives realize that it is going to take more than superficial evidence to put the murderer behind bars. This quickly becomes a case of mind over matter."
      },
      {
        "id": "tvmaze:52777",
        "title": "Innocence",
        "season": 20,
        "episode": 16,
        "released": "2010-03-15",
        "overview": "Detectives Lupo and Bernard detain a man who is tried and found guilty of killing a gay man as a hate crime. Shortly after, one of Cutter's former law professors, Emily Ryan (Amy Madigan) steps in with The Innocence Collective, determined to prove his innocence and reverse the verdict. Cutter soon discovers that Emily's overeager student assistant, Lisa Klein (Anna Chlumsky), may have crossed the line to get a testimony in her client's favor. Before long, personal relationships are threatened as the integrity of the entire trial is called into question. As a defense on for her client, Emily Ryan uses the status of EADA Cutter's law license to say that her client, among others, deserve new trials; Cutter races to figure out a way to keep a mistrial from occurring and letting the defendant walk away from a brutal hate crime."
      },
      {
        "id": "tvmaze:52778",
        "title": "Four Cops Shot",
        "season": 20,
        "episode": 17,
        "released": "2010-03-22",
        "overview": "Lieutenant Anita Van Buren is told by her doctor Valerie Knight (Deirdre O'Connell) that she came off her radiation just fine and her hemoglobin levels are up. She's set to go back to her doctor in three months to see if the tumor has shrunk. Meanwhile, Detectives Lupo and Bernard are called to a scene where four police officers were shot and killed, at a local pizzeria. With a room full of witnesses, they have a small description of the culprit but that's all. The case becomes even more confusing when they discover that the police officers may have known the shooter. The investigation quickly leads them to a drug cartel, a jealous husband, and a penitent judge who are all linked together. Tensions rise from both the homicide units, the DA's office, and even to the U.S. Attorney."
      },
      {
        "id": "tvmaze:52779",
        "title": "Brazil",
        "season": 20,
        "episode": 18,
        "released": "2010-03-29",
        "overview": "When an environmental scientist, Dr. Oscar Silva (Elliot Villar), is poisoned during a global warming symposium, Detectives Bernard and Lupo initially suspect competitors from Dr. Silva's field of study. It is soon discovered that Dr. Silva is involved in a messy custody battle with his wife's (Tammy Blanchard) ex-husband, Phillip Shoemaker (Tony Hale), and the focus of the investigation quickly shifts to the victim's family. Meanwhile, the case becomes personal for EADA Cutter as it stirs up unpleasant memories from his own past."
      },
      {
        "id": "tvmaze:52780",
        "title": "Crashers",
        "season": 20,
        "episode": 19,
        "released": "2010-05-03",
        "overview": "When the body of young model Brenna Lane (Sabina Gadecki) is found burning in an alley, Detectives Lupo and Bernard search for her killer. With no witnesses, the detectives must retrace the victim's last steps to get insight into her final days before her death. They quickly discover that just before her death, Brenna crashed an upscale political event, hosted by Senator Peterson (Tony Roberts) and his wife, Camille (Kathy Baker). As secrets unfold, Lupo and Bernard realize that they must untangle an intricate web of lies to obtain the truth about Brenna Lane's murder."
      },
      {
        "id": "tvmaze:52781",
        "title": "The Taxman Cometh",
        "season": 20,
        "episode": 20,
        "released": "2010-05-10",
        "overview": "Lupo and Bernard are called in to investigate the death of a young heiress, Annie Douglas (Morgan Lynch), who died of an apparent drug overdose. The detectives begin to suspect her cousin, Randy Colwyn (Daniel Abeles), whose inheritance was increased due to Annie's death. As the investigation continues, Annie's greedy relatives reveal another recent loss in the group. The case becomes more than a family matter as an experimental cancer clinic, fraudulent adoptions and unborn children are tied into the case."
      },
      {
        "id": "tvmaze:52782",
        "title": "Immortal",
        "season": 20,
        "episode": 21,
        "released": "2010-05-17",
        "overview": "When Jerome Turner (Terence Archie) dies of stab wounds upon arrival at a hospital, Lupo and Bernard are called in to investigate his stabbing. They soon discover that, unknown to everyone, Turner was leading a double life. Family tensions escalate as the detectives begin to unravel secrets of an exploited family. In search for the truth, EADA Cutter crosses a line with Lt. Van Buren during trial."
      },
      {
        "id": "tvmaze:52783",
        "title": "Love Eternal",
        "season": 20,
        "episode": 22,
        "released": "2010-05-17",
        "overview": "When a television crew from a style show goes in search of a fashion victim, Marielle Di Napoli (Anna Gunn), they find a murder victim instead. As Detectives Lupo and Bernard investigate this unusual crime, they begin to suspect the victim's wife, who has a violent and peculiar past. The case is further complicated when detectives discover the truth behind the victim's financial situation: they learn that the victim may have backed out of a conspiracy with fellow husbands to hide assets from their wives until their divorces."
      },
      {
        "id": "tvmaze:52784",
        "title": "Rubber Room",
        "season": 20,
        "episode": 23,
        "released": "2010-05-24",
        "overview": "When Lieutenant Van Buren discovers a blog site featuring video of an alarming amount of explosives, Detectives Lupo and Bernard race against time to find the anonymous blogger before plans to blow up a school are put into action. The Department of Education's refusal to take the threat seriously and resistance from the teachers' union further complicate the investigation. Fortunately, an administrative assistant at the teachers' union, Alicia (Lindsey Vonn), gives the detectives a tip to lead them in the right direction. Meanwhile, Lieutenant Van Buren struggles to keep her personal issues from becoming public and due to the ignorance of the people possibly revolving around the blogger's terrorist act, they push District Attorney McCoy's buttons."
      },
      {
        "id": "tvmaze:2215388",
        "title": "The Right Thing",
        "season": 21,
        "episode": 1,
        "released": "2022-02-24",
        "overview": "Newly acquainted partners Bernard and Cosgrove investigate the murder of a notorious entertainer. A dispute over throwing out a confession creates a rift in the DA's office."
      },
      {
        "id": "tvmaze:2264354",
        "title": "Impossible Dream",
        "season": 21,
        "episode": 2,
        "released": "2022-03-03",
        "overview": "The COO of a major tech company is found murdered in Central Park. DA Nolan Price and ADA Samantha Maroun work to untangle a web of deceit to expose a cunning narcissist."
      },
      {
        "id": "tvmaze:2264353",
        "title": "Filtered Life",
        "season": 21,
        "episode": 3,
        "released": "2022-03-10",
        "overview": "Bernard and Cosgrove investigate the disappearance of a social media star whose case takes the internet by storm. Price and Maroun must weigh their decisions regarding the case against the wishes of the missing woman's family."
      },
      {
        "id": "tvmaze:2264355",
        "title": "Fault Lines",
        "season": 21,
        "episode": 4,
        "released": "2022-03-17",
        "overview": "After a family court judge is murdered, Bernard and Cosgrove dig into the many grievances against him. When the DA's office is faced with unforeseen challenges, Maroun takes matters into her own hands to save the case."
      },
      {
        "id": "tvmaze:2264352",
        "title": "Free Speech",
        "season": 21,
        "episode": 5,
        "released": "2022-04-07",
        "overview": "Bernard and Cosgrove investigate the murder of a congressional candidate. ADAs Price and Maroun contend with an extremist plot hellbent on thwarting the candidate's agenda by any means necessary."
      },
      {
        "id": "tvmaze:2264356",
        "title": "Wicked Game",
        "season": 21,
        "episode": 6,
        "released": "2022-04-14",
        "overview": "When a young man is found dead of an apparent overdose, Dixon fiercely pursues a homicide investigation as an old unsolved case comes back to haunt her. Price and Maroun risk putting a witness in harm's way to expose their suspect and reveal the monster underneath."
      },
      {
        "id": "tvmaze:2301941",
        "title": "Legacy",
        "season": 21,
        "episode": 7,
        "released": "2022-04-28",
        "overview": "Bernard and Cosgrove are confronted with a plethora of suspects in the shooting of a headmaster at an elite private school. A teenager's life hangs in the balance as Price and Maroun debate who's more culpable – the shooter or the enabler."
      },
      {
        "id": "tvmaze:2303793",
        "title": "Severance",
        "season": 21,
        "episode": 8,
        "released": "2022-05-05",
        "overview": "When the CFO of a Fortune 500 company is found strangled in her home, Bernard and Cosgrove work to connect multiple dead ends to find her killer. The prosecution is faced with an uphill battle as McCoy and Price butt heads over a choice that could cost them the case."
      },
      {
        "id": "tvmaze:2303794",
        "title": "The Great Pretender",
        "season": 21,
        "episode": 9,
        "released": "2022-05-12",
        "overview": "Bernard and Cosgrove must sift through fact and fiction to find the killer of a young Manhattan socialite. The murder trial takes a turn that becomes personal for Price and puts Maroun in a compromising situation."
      },
      {
        "id": "tvmaze:2308806",
        "title": "Black and Blue",
        "season": 21,
        "episode": 10,
        "released": "2022-05-19",
        "overview": "The murder of an off-duty NYPD detective threatens to tear the city apart. Cosgrove mourns the loss of a friend and asks Capt. Benson for help solving the case. McCoy and Price disagree on how to prosecute the culprit, sparking sharp condemnation from all sides."
      },
      {
        "id": "tvmaze:2355074",
        "title": "Gimme Shelter, Part III",
        "season": 22,
        "episode": 1,
        "released": "2022-09-22",
        "overview": "A young girl is shot and Cosgrove teams with Det. Jalen Shaw to track down her killer. Benson and Stabler assist and realize it's more than a typical homicide.  McCoy and Price seek justice against an international crime ring, but complications threaten the case."
      },
      {
        "id": "tvmaze:2390638",
        "title": "Battle Lines",
        "season": 22,
        "episode": 2,
        "released": "2022-09-29",
        "overview": "A politician's daughter is found dead after an apparent mugging; once Cosgrove and Shaw start to unravel the details behind her trip, they realize this isn't a random act of violence; Price makes a risky move; Maroun works to salvage their case."
      },
      {
        "id": "tvmaze:2390639",
        "title": "Camouflage",
        "season": 22,
        "episode": 3,
        "released": "2022-10-06",
        "overview": "A deadly shooting has Cosgrove and Shaw racing to find the culprit before another attack is orchestrated. Price struggles to put his ethical principles aside when the US Attorney's office pushes for the death penalty in the case."
      },
      {
        "id": "tvmaze:2390640",
        "title": "Benefit of the Doubt",
        "season": 22,
        "episode": 4,
        "released": "2022-10-13",
        "overview": "When the young author of a tell-all book is found dead, Cosgrove asks a former mentor for help with the case. Price has an uphill battle in court when a search and seizure is deemed illegal."
      },
      {
        "id": "tvmaze:2412235",
        "title": "12 Seconds",
        "season": 22,
        "episode": 5,
        "released": "2022-10-27",
        "overview": "Cosgrove and Shaw piece together the clues of what happened to a murdered law student, uncovering a web of blackmail and lies. Price fights to have a piece of shocking testimony thrown out."
      },
      {
        "id": "tvmaze:2390641",
        "title": "Vicious Cycle",
        "season": 22,
        "episode": 6,
        "released": "2022-11-03",
        "overview": "When a fashion designer is killed on the night of his boutique opening, Cosgrove and Shaw must track down a suspect with very little evidence and no witnesses. Maroun is shocked to find her own name on the defense's witness list."
      },
      {
        "id": "tvmaze:2420396",
        "title": "Only the Lonely",
        "season": 22,
        "episode": 7,
        "released": "2022-11-10",
        "overview": "A crisis consultant who's made many enemies on behalf of her clients is murdered. Price and Maroun must set aside the potential damage to a witness's reputation in order to strengthen their case."
      },
      {
        "id": "tvmaze:2424651",
        "title": "Chain of Command",
        "season": 22,
        "episode": 8,
        "released": "2022-11-17",
        "overview": "When a decorated military veteran is found murdered in his own home, Cosgrove and Shaw work with his daughter to uncover an important clue. Price and Maroun must untangle the stories of other service members connected to the victim to make their case."
      },
      {
        "id": "tvmaze:2427586",
        "title": "The System",
        "season": 22,
        "episode": 9,
        "released": "2022-12-08",
        "overview": "A suspect arrested for murder escapes police custody after months of waiting for his day in court. As a hostage situation erupts, Shaw must re-examine his conduct as the arresting officer. Price questions his faith in the justice system."
      },
      {
        "id": "tvmaze:2427587",
        "title": "Land of Opportunity",
        "season": 22,
        "episode": 10,
        "released": "2023-01-05",
        "overview": "When a homeless migrant is murdered, evidence leads Cosgrove and Shaw to a mysterious cover-up at a construction site. Price and Maroun push a key witness to testify knowing that speaking out could lead to legal consequences."
      },
      {
        "id": "tvmaze:2448453",
        "title": "Second Chance",
        "season": 22,
        "episode": 11,
        "released": "2023-01-12",
        "overview": "When an ex-con is found beaten to death, Cosgrove and Shaw arrest an unlikely culprit. Maroun must put her personal feelings for the suspect aside and take the lead in court when she and Price can't agree on the best trial strategy."
      },
      {
        "id": "tvmaze:2460677",
        "title": "Almost Famous",
        "season": 22,
        "episode": 12,
        "released": "2023-01-26",
        "overview": "After a teenager is killed, Cosgrove and Shaw discover what lengths kids will go to these days to become Internet famous. Price and Maroun take a risk to go after who they believe is the real criminal in the case, but wind up back where they started."
      },
      {
        "id": "tvmaze:2474309",
        "title": "Mammon",
        "season": 22,
        "episode": 13,
        "released": "2023-02-02",
        "overview": "When a graduate student is found dead, Cosgrove and Shaw follow the evidence to a suspect with no clear motive. Price and Maroun uncover a money-grabbing scheme within a close-knit church. McCoy warns them to focus on the suspects and not the institution."
      },
      {
        "id": "tvmaze:2481596",
        "title": "Heroes",
        "season": 22,
        "episode": 14,
        "released": "2023-02-16",
        "overview": "After shots are fired in a popular nightclub, Cosgrove and Shaw suspect the spree was a ruse to target a sole victim. When security footage mysteriously disappears, Price and Maroun must rely on a witness who values his reputation over the facts."
      },
      {
        "id": "tvmaze:2482606",
        "title": "Fear and Loathing",
        "season": 22,
        "episode": 15,
        "released": "2023-02-23",
        "overview": "Cosgrove and Shaw must unravel a string of false crime reports to get to the truth surrounding a respected doctor's murder. Shaw becomes the target of retaliation when he files a complaint against two patrol officers."
      },
      {
        "id": "tvmaze:2489497",
        "title": "Deadline",
        "season": 22,
        "episode": 16,
        "released": "2023-03-23",
        "overview": "When a celebrated journalist is killed, Cosgrove and Shaw explore an unpublished report involving a prominent politician. Price and Maroun fight an uphill battle when their only credible witness is currently awaiting trial for another heinous crime."
      },
      {
        "id": "tvmaze:2506056",
        "title": "Bias",
        "season": 22,
        "episode": 17,
        "released": "2023-03-30",
        "overview": "When a public defender is murdered, Cosgrove and Shaw are surprised to find Price at the crime scene. His involvement in the trial compromises the case."
      },
      {
        "id": "tvmaze:2509761",
        "title": "Collateral Damage",
        "season": 22,
        "episode": 18,
        "released": "2023-04-06",
        "overview": "When a young woman dies a slow and painful death from an untreated infection, Cosgrove and Shaw suspect she was under the influence of a powerful cult. Price and Maroun put pressure on its members to find the cult's true mastermind."
      },
      {
        "id": "tvmaze:2517632",
        "title": "Private Lives",
        "season": 22,
        "episode": 19,
        "released": "2023-04-27",
        "overview": "Cosgrove and Shaw investigate the murder of a family physician whose outspoken politician wife suspects she was the intended target. Price and Maroun's case hangs in the balance when the defense calls one of the doctor's young patients to testify as a witness."
      },
      {
        "id": "tvmaze:2517634",
        "title": "Class Retreat",
        "season": 22,
        "episode": 20,
        "released": "2023-05-04",
        "overview": "When a respected businessman is found murdered, his surprising connection to Cosgrove's daughter helps the police make a break in the case. Price and Maroun disagree on how to proceed at trial when the defendant's age brings up legal precedent they must follow."
      },
      {
        "id": "tvmaze:2517640",
        "title": "Appraisal",
        "season": 22,
        "episode": 21,
        "released": "2023-05-11",
        "overview": "Cosgrove and Shaw suspect an art dealer was murdered but can't make an arrest until they locate her body. Price and Maroun must go to trial with a circumstantial case and a suspect with unlimited resources. The squad celebrates a birthday."
      },
      {
        "id": "tvmaze:2517645",
        "title": "Open Wounds",
        "season": 22,
        "episode": 22,
        "released": "2023-05-18",
        "overview": "When a senator is gunned down at his daughter's wedding, McCoy pushes for a severe sentence and squares up against a formidable defense attorney — his own daughter. Price aims to stay neutral but can't help but empathize with the defendant over a shared trauma."
      },
      {
        "id": "tvmaze:2691509",
        "title": "Freedom of Expression",
        "season": 23,
        "episode": 1,
        "released": "2024-01-18",
        "overview": "In the wake of a murder, the line between free speech and hate speech at a university is examined."
      },
      {
        "id": "tvmaze:2699572",
        "title": "Human Innovation",
        "season": 23,
        "episode": 2,
        "released": "2024-01-25",
        "overview": "When a prominent tech CEO is killed, Shaw and Riley untangle multiple leads to reveal a plot for retribution. Price and Maroun debate whether a possibly faked piece of evidence should be submitted to the jury."
      },
      {
        "id": "tvmaze:2732679",
        "title": "Turn the Page",
        "season": 23,
        "episode": 3,
        "released": "2024-02-01",
        "overview": "When a young woman is strangled, Yee connects the MO to a potential serial offender, leading Riley to revisit a case that went cold on his watch. Price makes a risky move to bait one of their own on the stand."
      },
      {
        "id": "tvmaze:2746741",
        "title": "Unintended Consequences",
        "season": 23,
        "episode": 4,
        "released": "2024-02-08",
        "overview": "Shaw and Riley investigate a real estate agent's murder; after they speak with prominent clients, an unexpected witness appears; Price and Maroun struggle to convince a jury of motive and face a difficult decision about their only witness."
      },
      {
        "id": "tvmaze:2746742",
        "title": "Last Dance",
        "season": 23,
        "episode": 5,
        "released": "2024-02-22",
        "overview": "When a woman is found murdered in Central Park, evidence points to two frequent park-goers - a street vendor and tech billionaire. In the face of extreme political pressure, McCoy takes drastic action to make the case."
      },
      {
        "id": "tvmaze:2746743",
        "title": "On the Ledge",
        "season": 23,
        "episode": 6,
        "released": "2024-02-29",
        "overview": "When NYPD responds to the scene of an active shooter in a nearby hospital, Shaw is shocked at his connection to the suspect. Maroun and Price face a difficult trial when the defendant offers up an insanity plea."
      },
      {
        "id": "tvmaze:2749782",
        "title": "Balance of Power",
        "season": 23,
        "episode": 7,
        "released": "2024-03-14",
        "overview": "When a successful Wall Street investor is murdered in his home, Shaw and Riley dig into his professional and personal lives to identify his killer. DA Baxter puts pressure on Price and Maroun to make sure his first case in office is a success."
      },
      {
        "id": "tvmaze:2783719",
        "title": "Facade",
        "season": 23,
        "episode": 8,
        "released": "2024-03-21",
        "overview": "Shaw and Riley investigate the death of a comedian after a subway altercation. When a suspect is arrested, Baxter insists they increase the charges despite Price's apprehension. At trial, a new witness comes forward to throw the case into question."
      },
      {
        "id": "tvmaze:2799243",
        "title": "Family Ties",
        "season": 23,
        "episode": 9,
        "released": "2024-04-11",
        "overview": "When a congressman's aide is found dead after testifying in a corruption case, Shaw and Riley discover the suspect may be someone close to home. As Price solidifies his case against the defendant, Baxter proposes they go after an accomplice as well."
      },
      {
        "id": "tvmaze:2812325",
        "title": "Inconvenient Truth",
        "season": 23,
        "episode": 10,
        "released": "2024-04-18",
        "overview": "Shaw and Riley investigate the death of a prominent chef when he's stabbed in his own restaurant. Price has hesitations about prosecuting the defendant after new evidence comes to light."
      },
      {
        "id": "tvmaze:2828148",
        "title": "Castle in the Sky",
        "season": 23,
        "episode": 11,
        "released": "2024-05-02",
        "overview": "When a real estate developer is found dead in one of his buildings, Shaw and Riley sift through a long list of suspects. Concerned for the welfare of the defendant's young daughter, Dixon and her son plead with Price and Maroun for help."
      },
      {
        "id": "tvmaze:2837636",
        "title": "No Good Deed",
        "season": 23,
        "episode": 12,
        "released": "2024-05-09",
        "overview": "Shaw and Riley investigate the death of a therapist with a long list of troubled clients. Baxter takes over Price's chair when a disturbing connection to the defendant is discovered during the trial."
      },
      {
        "id": "tvmaze:2843367",
        "title": "In Harm's Way",
        "season": 23,
        "episode": 13,
        "released": "2024-05-16",
        "overview": "When a sports star is killed, Shaw and Riley suspect the shooter missed their intended target. Baxter's daughter comes forward as a witness, but her public testimony could impact his re-election campaign with the confession of a family secret."
      },
      {
        "id": "tvmaze:2939429",
        "title": "Catch and Kill",
        "season": 24,
        "episode": 1,
        "released": "2024-10-03",
        "overview": "When a Brooklyn prosecutor is found slain in her apartment, Maroun takes drastic action to convince an eyewitness to come forward. Riley struggles to adjust to the new lieutenant in charge."
      },
      {
        "id": "tvmaze:2988320",
        "title": "The Perfect Man",
        "season": 24,
        "episode": 2,
        "released": "2024-10-10",
        "overview": "When the founder of an AI-infused dating app is murdered, Shaw and Riley delve into who would want the love-obsessed man dead; Capt. Benson surprises Price and Maroun when she becomes a witness for the defense."
      },
      {
        "id": "tvmaze:2988321",
        "title": "Big Brother",
        "season": 24,
        "episode": 3,
        "released": "2024-10-17",
        "overview": "Riley's personal and professional lives clash when his brother is connected to a murder investigation; Price takes a chance on a witness who can testify to a hidden motive."
      },
      {
        "id": "tvmaze:2989194",
        "title": "The Meaning of Life",
        "season": 24,
        "episode": 4,
        "released": "2024-10-24",
        "overview": "When a bomb goes off in a brownstone, Shaw and Riley must determine which of its inhabitants -- an author or fertility doctor -- was the target; Price and Maroun try to bring murder charges against the suspect, even though the victim is still alive."
      },
      {
        "id": "tvmaze:3015757",
        "title": "Report Card",
        "season": 24,
        "episode": 5,
        "released": "2024-10-31",
        "overview": "A student is accused of killing his teacher; when the suspect's age puts the case in limbo, Price and Maroun put the school's policies on trial; Shaw's attempts to connect with the suspect backfire."
      },
      {
        "id": "tvmaze:3031822",
        "title": "Time Will Tell",
        "season": 24,
        "episode": 6,
        "released": "2024-11-07",
        "overview": "When the dean of a swanky prep school is murdered, Shaw and Riley must dig into the toxic system of pressure on the students to succeed; Brady's son asks for a favor."
      },
      {
        "id": "tvmaze:3037920",
        "title": "Truth and Consequences",
        "season": 24,
        "episode": 7,
        "released": "2024-11-14",
        "overview": "When tragedy strikes the family of a prominent judge, Brady must determine if the murder is connected to any of the judge's rulings; Baxter steps in when a key witness refuses to testify; Maroun tries to protect another witness's privacy."
      },
      {
        "id": "tvmaze:3044395",
        "title": "Bad Apple",
        "season": 24,
        "episode": 8,
        "released": "2024-11-21",
        "overview": "After a narcotics officer is shot in the back, Brady returns to her old precinct to investigate the murder; when the suspect's story doesn't add up, she enlists Shaw and Riley to discover the truth."
      },
      {
        "id": "tvmaze:3060139",
        "title": "Enemy of the State",
        "season": 24,
        "episode": 9,
        "released": "2025-01-16",
        "overview": "Shaw and Riley discover a shocking motive after a young man is pushed in front of a train; when the trial hinges on a piece of legislation that Baxter wrote, Price must convince Baxter to testify to the legislation's uses and abuses."
      },
      {
        "id": "tvmaze:3103884",
        "title": "Greater Good",
        "season": 24,
        "episode": 10,
        "released": "2025-01-23",
        "overview": "When a music mogul is found dead, Shaw and Riley clash with an undercover officer unwilling to cooperate. Price and Baxter disagree on how the victim's reputation could sway the jury's verdict in the case."
      },
      {
        "id": "tvmaze:3108704",
        "title": "The Hardest Thing",
        "season": 24,
        "episode": 11,
        "released": "2025-01-30",
        "overview": "When a wealthy man is executed in his home, Shaw and Riley aim to determine who was greedy enough to want him dead. Price must try a difficult case amidst his father's failing health."
      },
      {
        "id": "tvmaze:3124435",
        "title": "Duty to Protect",
        "season": 24,
        "episode": 12,
        "released": "2025-02-13",
        "overview": "When a teenage girl is found dead, the squad struggles to find a motive without knowing her identity; Price and Maroun must pick up the broken pieces of their case after a shocking courtroom revelation."
      },
      {
        "id": "tvmaze:3124436",
        "title": "In God We Trust",
        "season": 24,
        "episode": 13,
        "released": "2025-02-20",
        "overview": "A young lawyer with a secret past is found dead; Price and Baxter debate the pros and cons of prison as a punishment versus alternative justice options."
      },
      {
        "id": "tvmaze:3143527",
        "title": "A Price to Pay",
        "season": 24,
        "episode": 14,
        "released": "2025-02-27",
        "overview": "An actor's foray into experimental drug therapy leads to his murder; Shaw reconnects with a mentor who may hold the key to identifying a suspect."
      },
      {
        "id": "tvmaze:3157255",
        "title": "Crossing Lines",
        "season": 24,
        "episode": 15,
        "released": "2025-03-13",
        "overview": "When an up-and-coming politician is found dead, Shaw and Riley untangle the victim's personal life to identify a suspect; Baxter recuses himself to help Price make the case."
      },
      {
        "id": "tvmaze:3164007",
        "title": "Folk Hero",
        "season": 24,
        "episode": 16,
        "released": "2025-03-20",
        "overview": "When a murder suspect becomes an underground hero, Brady seeks help from a former colleague to track down a culprit who seems to be in multiple locations. Baxter, Price and Maroun disagree on the best way forward when public interest heightens."
      },
      {
        "id": "tvmaze:3176893",
        "title": "A Perfect Family",
        "season": 24,
        "episode": 17,
        "released": "2025-04-03",
        "overview": "When a student is thrown to her death, Riley zeros in on a family secret to piece together her last moments. Price and Maroun must rely on the eyewitness account of a young child to determine if an unlikely suspect should be charged with murder."
      },
      {
        "id": "tvmaze:3177975",
        "title": "Inherent Bias",
        "season": 24,
        "episode": 18,
        "released": "2025-04-10",
        "overview": "A rising basketball star is shot dead, leaving the squad in a desperate scramble for leads. When the capture of a suspect doesn't go as planned, Shaw and Riley each take a firm stand on what they believe they witnessed."
      },
      {
        "id": "tvmaze:3181179",
        "title": "Play With Fire Part 1",
        "season": 24,
        "episode": 19,
        "released": "2025-04-17",
        "overview": "A mysterious phone call to Capt. Benson of the Special Victims Unit leads detectives to the scene of a brutal murder."
      },
      {
        "id": "tvmaze:3190562",
        "title": "Sins of the Father",
        "season": 24,
        "episode": 20,
        "released": "2025-05-01",
        "overview": "When a car mechanic is murdered execution-style, Shaw and Riley suspect his job was a cover for more sinister talents; as the trail gets underway for the arrested suspect, Baxter, Price and Maroun are faced with who should answer for the crime."
      },
      {
        "id": "tvmaze:3190563",
        "title": "Tough Love",
        "season": 24,
        "episode": 21,
        "released": "2025-05-08",
        "overview": "A tough-love sports agent is found stabbed to death, leaving the squad with a trail of suspects who wanted him gone; despite a wealth of evidence, Price and Maroun worry that a lack of motive will tank their case."
      },
      {
        "id": "tvmaze:3203419",
        "title": "Look the Other Way",
        "season": 24,
        "episode": 22,
        "released": "2025-05-15",
        "overview": "When a model is murdered, Shaw and Riley believe their suspect may have escalated an obsession to violence; Maroun's efforts to place the suspect near the scene of the crime leave Price in a bind when the evidence may not hold up in court."
      },
      {
        "id": "tvmaze:3316795",
        "title": "Street Justice",
        "season": 25,
        "episode": 1,
        "released": "2025-09-25",
        "overview": "When Brady's squad investigates the death of an exonerated murder suspect, a major lead points to ADA Maroun; Price wrestles with the potential consequences of a guilty verdict."
      },
      {
        "id": "tvmaze:3346128",
        "title": "Hindsight",
        "season": 25,
        "episode": 2,
        "released": "2025-10-02",
        "overview": "Brady and Riley must sort through a list of rivals to pinpoint a suspect when a star music student is murdered on the way home from school; Price finds a surprising name on the defense's witness list."
      },
      {
        "id": "tvmaze:3368355",
        "title": "White Lies",
        "season": 25,
        "episode": 3,
        "released": "2025-10-09",
        "overview": "A bulldog investment fund manager is murdered in the midst of a client's big takeover; Price goes to desperate lengths to prove the suspect's motive."
      },
      {
        "id": "tvmaze:3384740",
        "title": "Two And Twenty",
        "season": 25,
        "episode": 4,
        "released": "2025-10-16",
        "overview": "A billionaire banker is murdered and the 2-7 must investigate his many clients and employees; Price and Maroun struggle to keep the jury's focus on the crime and not the victim's darker side."
      },
      {
        "id": "tvmaze:3395496",
        "title": "Bend the Knee",
        "season": 25,
        "episode": 5,
        "released": "2025-10-23",
        "overview": "A law partner with prominent government clients is murdered. Baxter must consider making political concessions for the case to be a success."
      },
      {
        "id": "tvmaze:3389659",
        "title": "Brotherly Love",
        "season": 25,
        "episode": 6,
        "released": "2025-10-30",
        "overview": "A respected restauranteur with a gambling problem is murdered, and Baxter and Price disagree on the best approach to a conviction; Riley's brother is released from prison."
      },
      {
        "id": "tvmaze:3395497",
        "title": "Guardian",
        "season": 25,
        "episode": 7,
        "released": "2025-11-13",
        "overview": "When a high school sports star is murdered, the police find several suspects trying to make money off the victim's talent; Riley gets a new partner."
      },
      {
        "id": "tvmaze:3431231",
        "title": "Parasite",
        "season": 25,
        "episode": 8,
        "released": "2025-11-20",
        "overview": "When a rich CEO is murdered the night before his wedding, Riley and Walker suspect the key to an arrest is in the details of the victim's will; Price and Maroun argue the benefits and drawbacks of damaging the suspect's reputation in court."
      },
      {
        "id": "tvmaze:3439695",
        "title": "TBA",
        "season": 25,
        "episode": 9,
        "released": "2026-01-08",
        "overview": ""
      }
    ]
  }
}