{
  "meta": {
    "id": "tvmaze:14013",
    "type": "series",
    "name": "Tyler Perry's House of Payne",
    "description": "Tyler Perry's House of Payne is a comedy series about a multigenerational, working class family who experiences all of life's struggles with faith, love and most importantly humor. Curtis, the uncle and head of the household, has his life and home turned upside down when an unexpected event forces his nephew, CJ, played by Allen Payne, and CJ's kids to move into the house, putting three generations under one roof. This chaotic living situation takes its toll on cranky Pops, who is reluctant to have his routine disturbed. In addition to CJ's family, Curtis and Ella's son, Calvin, a wise-cracking college kid with no money, hangs out at home which makes it impossible for Pops to have any peace and quiet. It soon becomes evident just how wide the generation gap is, as the family tries to find a way to coexist through all of life's hilarious ups and downs.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/502/1256067.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/502/1256067.jpg",
    "videos": [
      {
        "id": "tvmaze:3466357",
        "title": "A Chicken Dinner",
        "season": 14,
        "episode": 17,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3456143",
        "title": "Hanging Solo",
        "season": 14,
        "episode": 16,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3456142",
        "title": "Can We Have Dinner",
        "season": 14,
        "episode": 15,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:645750",
        "title": "Bully and the Beast",
        "season": 1,
        "episode": 1,
        "released": "2007-06-06",
        "overview": "In the series premiere, Curtis becomes tired of all the people in his house. Meanwhile, Malik is being bullied by a girl at school who is taking his lunch money. Curtis tries to reconcile the situation but doesn't get a long with the girl's foster mother, Madea."
      },
      {
        "id": "tvmaze:645751",
        "title": "I Can Cry If I Want To",
        "season": 1,
        "episode": 2,
        "released": "2007-06-06",
        "overview": "While the family tries to plan a surprise party for Curtis' 50th birthday, Curtis tries to regain his youth. During the party the guys are called out for a fire that ends up being at C.J. and Janine's house."
      },
      {
        "id": "tvmaze:645752",
        "title": "More Than Meets the Eye",
        "season": 1,
        "episode": 3,
        "released": "2007-06-13",
        "overview": "C.J. finds out the fire at his house was arson. Meanwhile, Janine's strange behavior is questioned by the family, especially Curtis, who thinks Janine is cheating on C.J. with her mysterious friend Blue."
      },
      {
        "id": "tvmaze:645753",
        "title": "Busted",
        "season": 1,
        "episode": 4,
        "released": "2007-06-13",
        "overview": "The family continues to question Janine's odd behavior before realizing she is on drugs. Meanwhile, Calvin sells knock off designer purses to make some extra money."
      },
      {
        "id": "tvmaze:645754",
        "title": "Lost and Found",
        "season": 1,
        "episode": 5,
        "released": "2007-06-20",
        "overview": "Curtis is required to take an anger management class, but the upbeat instructor doesn't seem to suppress his anger. Later, the guys go to the crack house to help bring Janine home. Janine agrees to go to rehab but the family wakes up to find her missing."
      },
      {
        "id": "tvmaze:645755",
        "title": "Down and Outted",
        "season": 1,
        "episode": 6,
        "released": "2007-06-20",
        "overview": "Curtis thinks Malik is gay after seeing him wear a tutu. Meanwhile, Curtis offers some of his and Ella's retirement money to C.J. in order to jump start him and the kids moving out."
      },
      {
        "id": "tvmaze:645756",
        "title": "No Money, Mo' Problems",
        "season": 1,
        "episode": 7,
        "released": "2007-06-27",
        "overview": "C.J. accepts Curtis and Ella's money offer, but when he uses the money to put Janine in rehab she checks herself out, causing C.J. to lose the money and find a way to break the news to Curtis. Meanwhile, Calvin shows off Curtis and Ella's house as his own to impress a girl."
      },
      {
        "id": "tvmaze:645757",
        "title": "Just Say No",
        "season": 1,
        "episode": 8,
        "released": "2007-06-27",
        "overview": "A school assembly about \"Say No To Drugs\" upsets Jazmine, because of Janine's drug problems. Meanwhile, the firefighters protest after Curtis refuses to replace the broken television at the firehouse."
      },
      {
        "id": "tvmaze:645758",
        "title": "Surprise, Surprise",
        "season": 1,
        "episode": 9,
        "released": "2007-07-04",
        "overview": "Janine's parents show up looking for her. Claretha believes she knows Janine's father."
      },
      {
        "id": "tvmaze:645759",
        "title": "Father Knows Best",
        "season": 1,
        "episode": 10,
        "released": "2007-07-04",
        "overview": "Janine's parents return and want custody of the kids. The firefighters \"misplace\" the fire truck."
      },
      {
        "id": "tvmaze:645760",
        "title": "I Keep Coming Up Short",
        "season": 1,
        "episode": 11,
        "released": "2007-07-11",
        "overview": "Curtis has impotency issues. Meanwhile, C.J. tries to work out his debt."
      },
      {
        "id": "tvmaze:645761",
        "title": "The Buck Stops Here",
        "season": 1,
        "episode": 12,
        "released": "2007-07-11",
        "overview": "The firefighters do a pinup calendar as a fundraiser and are surprised when a new firefighter assigned to the house is a woman named Angel. Meanwhile, Jazmine sells candy for her school."
      },
      {
        "id": "tvmaze:645762",
        "title": "Wax On, Wax Off",
        "season": 1,
        "episode": 13,
        "released": "2007-07-18",
        "overview": "Malik's going through puberty and the women in the house are clueless. Meanwhile, a failing inspection at the firehouse is Curtis's fault."
      },
      {
        "id": "tvmaze:645763",
        "title": "Head of the Class",
        "season": 1,
        "episode": 14,
        "released": "2007-07-18",
        "overview": "Jazmine runs for class president. Meanwhile, Curtis and Ella take an art class together with models."
      },
      {
        "id": "tvmaze:645764",
        "title": "Paternity and Fraternity, Pt. 1",
        "season": 1,
        "episode": 15,
        "released": "2007-07-25",
        "overview": "An old high school flame of C.J.'s comes back in his life with a claim that is bound to rock his world. Meanwhile, Malik's hanging around a bad group of kids and gets into trouble."
      },
      {
        "id": "tvmaze:645765",
        "title": "Paternity and Fraternity, Pt. 2",
        "season": 1,
        "episode": 16,
        "released": "2007-07-25",
        "overview": "C.J. gets the results of the paternity test. Meanwhile, Bart does some extreme stunts while the firefighters place bets on him."
      },
      {
        "id": "tvmaze:645766",
        "title": "Cracking Under Pressure",
        "season": 1,
        "episode": 17,
        "released": "2007-08-01",
        "overview": "Janine and her associates from the crack-house break in and steal from the Payne's house. Meanwhile, Calvin trains for a marathon."
      },
      {
        "id": "tvmaze:645767",
        "title": "Club PCP",
        "season": 1,
        "episode": 18,
        "released": "2007-08-01",
        "overview": "Calvin plans a house party when the rest of the family visits relatives in Florida."
      },
      {
        "id": "tvmaze:645768",
        "title": "Sadly Mistaken",
        "season": 1,
        "episode": 19,
        "released": "2007-08-08",
        "overview": "Janine's associate, Beverly, steals Ella's identity, causing Ella to be briefly jailed for check kiting. Afterward, Ella feels compelled to confront Janine at the crack house. Meanwhile, Calvin crams for mid-terms."
      },
      {
        "id": "tvmaze:645769",
        "title": "And Justice for All",
        "season": 1,
        "episode": 20,
        "released": "2007-08-08",
        "overview": "Malik and Kevin meet someone on the Internet, who turns out to be a pedophile. Meanwhile, Curtis and Claretha have jury duty together."
      },
      {
        "id": "tvmaze:645770",
        "title": "I Got the Hook Up",
        "season": 1,
        "episode": 21,
        "released": "2007-08-15",
        "overview": "Everyone tries to hook C.J. up on a date. Meanwhile, a woman who's HIV-positive volunteers at the Help Center."
      },
      {
        "id": "tvmaze:645771",
        "title": "Absolutely Positive",
        "season": 1,
        "episode": 22,
        "released": "2007-08-15",
        "overview": "Curtis gets a colonoscopy and thinks he's dying. Meanwhile, Calvin goes on a date with Karen, the woman who's HIV-positive."
      },
      {
        "id": "tvmaze:645772",
        "title": "Teacher's Pet",
        "season": 1,
        "episode": 23,
        "released": "2007-08-22",
        "overview": "After Jazmine \"rescues\" a hamster from her school, assistant principal Nicole Jamieson comes to the Payne household to investigate, sparking a schoolboy crush from Malik. When Malik finds out that Jazmine did abscond with the hamster, the two kids make a pact to keep it a secret. Soon, Calvin gets involved, and mayhem becomes the order of the day."
      },
      {
        "id": "tvmaze:645773",
        "title": "The Perfect Storm",
        "season": 1,
        "episode": 24,
        "released": "2007-08-22",
        "overview": "The firehouse is overwhelmed by a nasty storm that hits Atlanta. Miscommunication about retrieving the kids from school causes a mix up that leads to sparks flying between C.J. and the assistant principal."
      },
      {
        "id": "tvmaze:645774",
        "title": "Sad, Sad Leroy Brown, Pt. 1",
        "season": 1,
        "episode": 25,
        "released": "2007-08-29",
        "overview": "A neighbor moves in with the Paynes after a fire renders his home uninhabitable, but the man soon emerges as an annoying houseguest. Elsewhere, Calvin finds romance---with a con artist."
      },
      {
        "id": "tvmaze:645775",
        "title": "Sad, Sad Leroy Brown, Pt. 2",
        "season": 1,
        "episode": 26,
        "released": "2007-08-29",
        "overview": "Tension escalates between Curtis and Mr. Brown, a Payne houseguest in the wake of his home fire. Meanwhile, Malik gets a tattoo and comes to regret that decision."
      },
      {
        "id": "tvmaze:645776",
        "title": "Weeping May Endure for a Night",
        "season": 1,
        "episode": 27,
        "released": "2007-09-05",
        "overview": "Mr. Brown, Cora and Will come by the Paynes after Pop Brown's funeral. Brown is upset because Pop Brown left him his run down house, which makes him think his Daddy really hates him. After going on another bad date, Calvin starts a website called \"She's A Whack\" dot com, only for it to backfire on him."
      },
      {
        "id": "tvmaze:645777",
        "title": "The Big Test",
        "season": 1,
        "episode": 28,
        "released": "2007-09-05",
        "overview": "C.J. has a date with Nicole who tells him she is waiting until she is married before having sex. Meanwhile, Jazmine cheats on a test."
      },
      {
        "id": "tvmaze:645778",
        "title": "Balancing Act",
        "season": 1,
        "episode": 29,
        "released": "2007-09-12",
        "overview": "C.J. tries to find time for Nicole without neglecting the children. Meanwhile, Jazmine hopes a new look will attract the attention of Malik's friend."
      },
      {
        "id": "tvmaze:645779",
        "title": "Why Can't We Be Friends",
        "season": 1,
        "episode": 30,
        "released": "2007-09-12",
        "overview": "Jazmine's friend, Tiffany, convinces Jazmine that C.J. is going to marry Nicole and move to San Francisco with Nicole just like her Dad did when he remarried. Jazmine and Tiffany devise a plan to break up C.J. and Nicole. Meanwhile, Curtis and Malik clean out the attic and bond."
      },
      {
        "id": "tvmaze:645780",
        "title": "Dog Day Afternoon",
        "season": 1,
        "episode": 31,
        "released": "2007-09-19",
        "overview": "While Malik must make a documentary for a school assignment, Curtis is unknowingly roped into assisting a bank robber."
      },
      {
        "id": "tvmaze:645781",
        "title": "New Beginnings",
        "season": 1,
        "episode": 32,
        "released": "2007-09-19",
        "overview": "When his divorce from Janine is at last finalized, C.J. attempts to start life anew, and his firehouse buddies urge him to savor the single life. Meanwhile, Janine tries to reconnect with the Paynes."
      },
      {
        "id": "tvmaze:645782",
        "title": "Heavy Petting",
        "season": 1,
        "episode": 33,
        "released": "2007-09-19",
        "overview": "When an old friend of C.J.'s turns up, they stir up jealousy in Nicole which causes C.J. and Nicole's budding romance to hit a bump. In the meantime, the Payne children push to get a pooch."
      },
      {
        "id": "tvmaze:645783",
        "title": "The Fast and the Furious",
        "season": 1,
        "episode": 34,
        "released": "2007-09-19",
        "overview": "Curtis must take an online driving course after he gets a speeding ticket. Meanwhile, Claretha, and Ella clash over playing the lottery."
      },
      {
        "id": "tvmaze:645784",
        "title": "Gone in 60 Seconds",
        "season": 1,
        "episode": 35,
        "released": "2007-09-26",
        "overview": "Curtis surprises the family with a new motorcycle, but his new bike causes more trouble than anyone could ever imagine. Malik's new friend from New York convinces him to steal Curtis' motorcycle, leaving Curtis no choice but to press charges, causing Ella to kick him out of the house. (Part one of three.)"
      },
      {
        "id": "tvmaze:645785",
        "title": "Lost Without You",
        "season": 1,
        "episode": 36,
        "released": "2007-09-26",
        "overview": "C.J. and Nicole's relationship is seriously tested when Nicole's jealousy gets out of hand, but that's the least of C.J.'s problems. Curtis filled charges against Malik, who faces time in prison for stealing and wrecking Curtis' motorcycle. Meanwhile, the firehouse crew must find a way to get Curtis back into the house that Ella kicked him out of before they go insane."
      },
      {
        "id": "tvmaze:645786",
        "title": "I Rest My Case",
        "season": 1,
        "episode": 37,
        "released": "2007-09-26",
        "overview": "Malik and his friend Kyle go to a court hearing for stealing and wrecking Curtis' bike, but Curtis' plan to teach the boys a lesson backfires when Malik and Kyle are sent to prison. (Part three of three)"
      },
      {
        "id": "tvmaze:645787",
        "title": "A House is Not a Home",
        "season": 2,
        "episode": 1,
        "released": "2007-12-05",
        "overview": "C.J. thinks they he may have found the perfect new apartment for he and the kids, but he soon learns that his dream home is too good to be true. Curtis is ecstatic that C.J. and the kids are finally getting out of his house. Meanwhile, Ella has had enough of Janine once she learns that she has been taking advantage of her."
      },
      {
        "id": "tvmaze:645788",
        "title": "Home Alone",
        "season": 2,
        "episode": 2,
        "released": "2007-12-05",
        "overview": "Just as C.J. and the kids adjust to their new surroundings, an unexpected break in changes everything. Meanwhile, Curtis and Ella are thrilled to have their home all to themselves again."
      },
      {
        "id": "tvmaze:645789",
        "title": "The Wench Who Saved Christmas",
        "season": 2,
        "episode": 3,
        "released": "2007-12-05",
        "overview": "Christmas has arrived and everyone is excited...except for Curtis. When he learns that Ella decided to cancel their holiday vacation to help celebrate C.J. and the kids spending Christmas without Janine, Curtis throws a Scrooge-like tantrum. He returns to reality after being in a dream state where Madea haunts him into realizing the true meaning of the holiday season."
      },
      {
        "id": "tvmaze:645790",
        "title": "Trial by Fire Pt. 1",
        "season": 2,
        "episode": 4,
        "released": "2007-12-05",
        "overview": "When a raging house fire is reported in the neighborhood, Curtis and the other firefighters rush to the scene. Calvin believes that he has finally found the right opportunity to prove to himself what he can do in a perilous situation. A miscalculated move results in Calvin rushing to safety and C.J. remaining trapped inside underneath the rumble. Meanwhile, Malik tries to impress a girl."
      },
      {
        "id": "tvmaze:645791",
        "title": "Trial by Fire Pt. 2",
        "season": 2,
        "episode": 5,
        "released": "2007-12-12",
        "overview": "Curtis and his team continue to strategize the best way in order to rescue C.J., who remains trapped in the burning house unconscious. Meanwhile, Malik continues to win over his new crush, Taylor."
      },
      {
        "id": "tvmaze:645792",
        "title": "Trial by Fire Pt. 3",
        "season": 2,
        "episode": 6,
        "released": "2007-12-12",
        "overview": "As C.J. fights for his life, he regains consciousness while awaiting the help from the other firefighters."
      },
      {
        "id": "tvmaze:645793",
        "title": "Crazy in Love",
        "season": 2,
        "episode": 7,
        "released": "2007-12-12",
        "overview": "An old friend of Curtis is on town and begins to set his sights on Claretha, much to the dismay of Ella. Meanwhile, C.J. is being stalked by a mentally unstable woman he rescued."
      },
      {
        "id": "tvmaze:645794",
        "title": "Reality Check",
        "season": 2,
        "episode": 8,
        "released": "2007-12-12",
        "overview": "The firehouse becomes the subject of a new reality series about firefighters, but the producer of the show tampers with everyone's interviews by showing them in a not-so perfect image. Meanwhile, C.J. and Ella are at odds when Ella decides to takes the children to see their mother without C.J.'s consent."
      },
      {
        "id": "tvmaze:645795",
        "title": "Piece of Mind",
        "season": 2,
        "episode": 9,
        "released": "2007-12-19",
        "overview": "Deciding on the best way to handle some of their brooding issues, the Payne household decide to seek a family therapist. After each member of the family has their one-on-one time with the therapist, the final result proves that the doctor is need of some psychiatric assistance of his own."
      },
      {
        "id": "tvmaze:645796",
        "title": "There's No Place Like Home",
        "season": 2,
        "episode": 10,
        "released": "2007-12-19",
        "overview": "Janine is discharged from the rehabilitation center after successfully completing her program. She seeks help from Ella as she is nervous about her impending job interview and needs a place to stay for the night. Reluctantly, Ella goes beyond C.J.'s wishes and allows her to bunk on the couch, unbeknownst to the rest of the family. Meanwhile, Curtis decides to go on a diet after failing a physical exam."
      },
      {
        "id": "tvmaze:645797",
        "title": "Mommie Dearest",
        "season": 2,
        "episode": 11,
        "released": "2007-12-26",
        "overview": "C.J. is at odds with the family as they continue to allow Janine to live with them. The Payne family ties are once again tested when Malik becomes embarrassed by Janine's arrival as he wants to avoid being taunted by his classmates because of his troubled mother."
      },
      {
        "id": "tvmaze:645798",
        "title": "You Big Dummy",
        "season": 2,
        "episode": 12,
        "released": "2007-12-26",
        "overview": "Janine and C.J. are at odds when she takes the children out to an amusement park without C.J.'s consent. But the drama ensues when C.J. discovers that Calvin has been dating Tracie behind his back. Meanwhile, Curtis guides the firehouse into a mandatory CPR certification."
      },
      {
        "id": "tvmaze:645799",
        "title": "It's a Boy",
        "season": 2,
        "episode": 13,
        "released": "2008-01-02",
        "overview": "While the crew responds to an emergency call, Curtis finds himself all alone at the firehouse with a very pregnant woman. Meanwhile, Calvin and Tracie's relationship begins to wilt when Tracie questions if Calvin's ready for a mature relationship."
      },
      {
        "id": "tvmaze:645800",
        "title": "Aches and Paynes",
        "season": 2,
        "episode": 14,
        "released": "2008-01-02",
        "overview": "Jazmine reveals her fear of visiting the dentist when she develops a painful toothache. Meanwhile, Calvin is devastated once he receives the news that Tracie wants to see other people and end their relationship."
      },
      {
        "id": "tvmaze:645801",
        "title": "The Big Bang Theory",
        "season": 2,
        "episode": 15,
        "released": "2008-01-09",
        "overview": "Blue, Janine's former drug dealer, demands that he receives the money that she owes him or he will threaten to harm the family. Meanwhile, another bully at Malik's school starts to harass him. But he finds Curtis' gun in the closet and soon believes that he's found the answer to his problem."
      },
      {
        "id": "tvmaze:645802",
        "title": "Step It Up",
        "season": 2,
        "episode": 16,
        "released": "2008-01-09",
        "overview": "Curtis and Ella's niece comes to town for a scholarship interview, but her appearance and attitude hurt her chances of getting it. Aunt Ella and Janine help her work the judges, but it's them that end up learning a lesson. Meanwhile, Bart's obnoxious nephew hangs out at the firehouse and challenges Malik to a firefighter battle."
      },
      {
        "id": "tvmaze:645803",
        "title": "No Payne No Gain",
        "season": 2,
        "episode": 17,
        "released": "2008-01-16",
        "overview": "Jazmine is scheduled for surgery when she has an appendix attack, and she milks it for all she can. Even Malik is forced to abide by her wishes. Meanwhile, Curtis is on the hunt for a pesky rat which is roaming the firehouse."
      },
      {
        "id": "tvmaze:645804",
        "title": "Devil in a Blue Suit",
        "season": 2,
        "episode": 18,
        "released": "2008-01-16",
        "overview": "Janine acts strangely, leading her family to think she is using drugs again. With Blue back in her life, the family must find a way to fix Janine's past. Meanwhile, Malik gets a paper route to pay for sneakers."
      },
      {
        "id": "tvmaze:645805",
        "title": "Bad Influence",
        "season": 2,
        "episode": 19,
        "released": "2008-01-23",
        "overview": "Ella has the flu, which means Curtis is in charge of the cleaning and cooking. Soon, he's also having to nurse Malik, C.J. and Janine after they catch Ella's bug. Jazmine, meanwhile, has been chosen to play the princess in her school play, but after her parents try to help her prepare, she winds up getting demoted. But Calvin has the perfect advice for her."
      },
      {
        "id": "tvmaze:645806",
        "title": "Play on Playa",
        "season": 2,
        "episode": 20,
        "released": "2008-01-23",
        "overview": "Calvin misreads a relationship counselor's signals when she invites him to her house for dinner; Curtis does not let anything interfere with the firehouse's poker party."
      },
      {
        "id": "tvmaze:645807",
        "title": "Its Getting Hot in Here",
        "season": 2,
        "episode": 21,
        "released": "2008-01-30",
        "overview": "C.J. catches the eye of a lovely woman at a wedding, where he gets a little frisky with Janine. Meanwhile, Calvin's friends volunteer at the firehouse."
      },
      {
        "id": "tvmaze:645808",
        "title": "Don't Get It Twisted",
        "season": 2,
        "episode": 22,
        "released": "2008-01-30",
        "overview": "The family grills Janine and C.J. after they spend the night together. But Curtis has problems of his own, when a man thinks his wife is having an affair with him."
      },
      {
        "id": "tvmaze:645809",
        "title": "Wife Swap",
        "season": 3,
        "episode": 1,
        "released": "2008-03-05",
        "overview": "Curtis and Ella's relationship hits a bump when Ella claims that Curtis takes her for granted. Curtis learns his lesson when the always sassy Madea materializes in one of his dreams as his wife. Elsewhere, Malik takes up football in order to woo a cheerleader."
      },
      {
        "id": "tvmaze:645810",
        "title": "Stop Being All Funky",
        "season": 3,
        "episode": 2,
        "released": "2008-03-05",
        "overview": "Janine dates an ex-football star, and CJ goes out with Tanya. CJ starts to feel uncomfortable when Janine's date gives out lavish gifts to Malik and Jazmine. Meanwhile, Curtis develops a man crush on Janine's date."
      },
      {
        "id": "tvmaze:645811",
        "title": "Guess Who's Coming to Dinner?",
        "season": 3,
        "episode": 3,
        "released": "2008-03-12",
        "overview": "As Malik invites his new girlfriend to a Payne family dinner, Calvin again woos Miranda, who ripped him off during a previous romance but now insists she's changed her ways. Miranda's acceptance back into the Payne house is slow at first, but eventually she charms her way back. Meanwhile, Malik's new girlfriend has a surprise that beats Miranda's return. Will the Paynes ever have a normal day?"
      },
      {
        "id": "tvmaze:645812",
        "title": "Game Over",
        "season": 3,
        "episode": 4,
        "released": "2008-03-12",
        "overview": "The men and women prepare for game night at the Payne house. Meanwhile, Ella's old college friend comes to visit, and she brings with her an old secret about her and Curtis that upsets Ella. The secret also sparks an argument among all the younger couples. The Payne house has never been so heated."
      },
      {
        "id": "tvmaze:645813",
        "title": "Can I Get a Witness?",
        "season": 3,
        "episode": 5,
        "released": "2008-03-19",
        "overview": "Ella heads to the hospital after a lump is found in her breast. She confides in Janine but hides it from the rest of the family. Meanwhile, another crisis develops when Calvin witnesses a neighborhood crime, and is urged to go under witness protection."
      },
      {
        "id": "tvmaze:645814",
        "title": "Commencement Day",
        "season": 3,
        "episode": 6,
        "released": "2008-03-19",
        "overview": "Calvin finds out that he's graduating from college and tells everyone and later learns that the school made a mistake. Meanwhile, Ella must keep Janine's secret to herself, but not telling anyone about Janine being pregnant is harder than she thought."
      },
      {
        "id": "tvmaze:645815",
        "title": "A Shock to the System",
        "season": 3,
        "episode": 7,
        "released": "2008-03-26",
        "overview": "Malik's best pal, Kevin, is injured in a hit-and-run accident, while staying at the Payne residence. Malik struggles with the possibility of losing his best friend. Meanwhile, Calvin scores a job at a most unusual place, and Curtis is instantly the happiest man on the planet. But Calvin's old ways get the best of him causing him to get fired from his new position."
      },
      {
        "id": "tvmaze:645816",
        "title": "Compromising Position",
        "season": 3,
        "episode": 8,
        "released": "2008-03-26",
        "overview": "Curtis is offered a desirable job, but it's in Los Angeles, and Ella firmly opposes moving. Meanwhile, CJ has a close encounter with Tanya's overly assertive gal pal."
      },
      {
        "id": "tvmaze:645817",
        "title": "Moral Dilemma",
        "season": 3,
        "episode": 9,
        "released": "2008-04-02",
        "overview": "When $50,000 is found in CJ's truck, a moral dilemma about what to do with the cash begins tearing the Paynes apart. Of course, Curtis wants it as payment for housing CJ's family, but the Paynes can always rely on Ella to lead them to do the right thing."
      },
      {
        "id": "tvmaze:645818",
        "title": "Sex, Lies and Videotapes",
        "season": 3,
        "episode": 10,
        "released": "2008-04-02",
        "overview": "CJ corners Tanya about her appearance in a racy music video. In other events, the FBI keeps a hard eye on a Payne neighbor and seeks to use the Payne house as a stakeout post, which draws the attention of Claretha."
      },
      {
        "id": "tvmaze:645819",
        "title": "Time to Clean House",
        "season": 3,
        "episode": 11,
        "released": "2008-04-09",
        "overview": "The family has had it with Calvin's shenanigans, so they lay down some house rules. Calvin decides to move in with his girlfriend, who finds out just how dependent he is. Meanwhile, Malik and Jazmine help Claretha clean house."
      },
      {
        "id": "tvmaze:645820",
        "title": "Living with Liz",
        "season": 3,
        "episode": 12,
        "released": "2008-04-09",
        "overview": "Janine's mother, Liz, comes for a surprise visit, but she brings with her an attitude that needs readjusting. Fortunately, the Paynes are all about readjusting attitudes, especially Curtis. The Paynes discover that Janine's father threw Liz out of the house, so they attempt to bring the two back together. Meanwhile, Janine's having a hard time hiding that she's pregnant."
      },
      {
        "id": "tvmaze:645821",
        "title": "Beat Down",
        "season": 3,
        "episode": 13,
        "released": "2008-04-16",
        "overview": "Ella and Claretha offer support to an abuse victim, but things get hairy when the abuser comes to take his girl away from Ella and Claretha. Unfortunately, he doesn't know who he's messing with."
      },
      {
        "id": "tvmaze:645822",
        "title": "Expectations",
        "season": 3,
        "episode": 14,
        "released": "2008-04-16",
        "overview": "Janine, CJ, and their respective dates attend a party, but revelations about Janine's pregnancy cause complications. Elsewhere, when the TV fades out, Curtis connects with the cable guy."
      },
      {
        "id": "tvmaze:645823",
        "title": "Cheers",
        "season": 3,
        "episode": 15,
        "released": "2008-04-23",
        "overview": "Malik puts into motion a scheme to score the phone numbers of the entire cheerleading squad. His plan: to become a cheerleader himself. Elsewhere, Janine must bid adieu to the children as her relationship with Bryan moves to the next level."
      },
      {
        "id": "tvmaze:645824",
        "title": "R-E-S-P-E-C-T Me",
        "season": 3,
        "episode": 16,
        "released": "2008-04-23",
        "overview": "The guys' objectification of women at the firehouse flusters Angel, who turns to Ella and Claretha for advice. Meanwhile, Malik gets drunk with power when he babysits Jazmine."
      },
      {
        "id": "tvmaze:645825",
        "title": "Driving Me Crazy",
        "season": 4,
        "episode": 1,
        "released": "2008-06-04",
        "overview": "Calvin babysits Miranda's nephew Brandon who is a total nightmare. Meanwhile, Claretha's car is stolen."
      },
      {
        "id": "tvmaze:645826",
        "title": "Reunited and… It Don't Feel So Good",
        "season": 4,
        "episode": 2,
        "released": "2008-06-04",
        "overview": "Curtis, Ella, and Claretha host a mixer for their college reunion. CJ tries to baby-sit Malik and Jazmine alone with disastrous results."
      },
      {
        "id": "tvmaze:645827",
        "title": "What the --?",
        "season": 4,
        "episode": 3,
        "released": "2008-06-04",
        "overview": "Dana finally decides to settle down and date one guy; everyone is happy for her except for Kiki when she finds out that Dana is dating her younger brother."
      },
      {
        "id": "tvmaze:645828",
        "title": "Guys' Night Out, Girls Night In",
        "season": 4,
        "episode": 4,
        "released": "2008-06-04",
        "overview": "Malik reluctantly goes on his first camping trip. Jazmine is upset she's not allowed to go, but lightens up when she finds out she'll get to have a girls night in."
      },
      {
        "id": "tvmaze:645829",
        "title": "How Do You Spell… It's All About Me?",
        "season": 4,
        "episode": 5,
        "released": "2008-06-11",
        "overview": "Ella is spending a lot of time away from home and Curtis is beginning to wonder if she is having an affair. Meanwhile, Jazmine participates in a spelling bee."
      },
      {
        "id": "tvmaze:645830",
        "title": "And… Cut!",
        "season": 4,
        "episode": 6,
        "released": "2008-06-11",
        "overview": "Ella makes the family give up the use of all electronic devices; CJ learns a surprising secret; a Hollywood actor does research at the barbershop for his next movie."
      },
      {
        "id": "tvmaze:645831",
        "title": "Old School vs. New School",
        "season": 4,
        "episode": 7,
        "released": "2008-06-18",
        "overview": "It's Malik's birthday and he's being a brat about the kind of party and gifts he wants. Meanwhile, with Miranda's help, Calvin invests in the barbershop and becomes a partner."
      },
      {
        "id": "tvmaze:645832",
        "title": "Fire and Disire",
        "season": 4,
        "episode": 8,
        "released": "2008-06-18",
        "overview": "Ella is going through menopause and the entire household is suffering with her."
      },
      {
        "id": "tvmaze:645833",
        "title": "Unsung Heros",
        "season": 4,
        "episode": 9,
        "released": "2008-06-25",
        "overview": "Calvin plans a surprise party when he learns his friend is coming home from Iraq. Meanwhile, Malik has to write a school paper about his role model, Curtis and CJ try to bribe him into choosing one of them."
      },
      {
        "id": "tvmaze:645834",
        "title": "Pissed, Poor and Paranoid",
        "season": 4,
        "episode": 10,
        "released": "2008-06-25",
        "overview": "Curtis teaches Jazmine and Malik a valuable lesson on what it means to do without the comforts of home. Meanwhile, the barbers find out that Delante has been living in the barbershop."
      },
      {
        "id": "tvmaze:645835",
        "title": "True Lies",
        "season": 4,
        "episode": 11,
        "released": "2008-07-02",
        "overview": "Kevin and Malik skip school with the intention of seducing their girlfriends. Meanwhile, Peanut uses the Paynes as his family to impress a girl."
      },
      {
        "id": "tvmaze:645836",
        "title": "That Sounds Sweet",
        "season": 4,
        "episode": 12,
        "released": "2008-07-02",
        "overview": "After a successful bake sale, Claretha convinces Ella to start her own business, and pretty soon, things get out of hand. Meanwhile, Malik enters a talent show to impress a girl."
      },
      {
        "id": "tvmaze:645837",
        "title": "Meet the Lucases",
        "season": 4,
        "episode": 13,
        "released": "2008-07-09",
        "overview": "The Paynes meet Miranda's family, and in the middle of a heated discussion between Curtis and Calvin, Curtis has a heart attack and collapses."
      },
      {
        "id": "tvmaze:645838",
        "title": "Out on a Limb",
        "season": 4,
        "episode": 14,
        "released": "2008-07-09",
        "overview": "Calvin is ready to propose and buys a ring for Miranda that is more than he can afford. Ella and Claretha go with Jazmine and her Girl Scout troop to the mountains, and end up getting the troop lost."
      },
      {
        "id": "tvmaze:645839",
        "title": "Can't Buy Me Love",
        "season": 4,
        "episode": 15,
        "released": "2008-07-16",
        "overview": "Calvin makes plans at a fancy restaurant to propose to Miranda but starts to question if he'll be rich enough to support her."
      },
      {
        "id": "tvmaze:645840",
        "title": "To Have and to Hold",
        "season": 4,
        "episode": 16,
        "released": "2008-07-16",
        "overview": "After two attempts at proposing, Calvin decides to keep it simple and propose at home. But it gets complicated when Jazmine loses the ring while playing with it."
      },
      {
        "id": "tvmaze:645841",
        "title": "Unexpected Results",
        "season": 4,
        "episode": 17,
        "released": "2008-07-23",
        "overview": "Jazmine gets a perfect score on an aptitude test which wreaks havoc on the family. CJ and Tanya break up."
      },
      {
        "id": "tvmaze:645842",
        "title": "Let's Get Ready to Rumble",
        "season": 4,
        "episode": 18,
        "released": "2008-07-23",
        "overview": "Curtis and Malik are left to chaperon Jazmine's slumber party when CJ and Janine get held up at the barber shop."
      },
      {
        "id": "tvmaze:645843",
        "title": "Father's Day",
        "season": 4,
        "episode": 19,
        "released": "2008-07-30",
        "overview": "Grandpa Kelly comes to town, and upon meeting Miranda, realizes he knew her in a past life. Meanwhile, the barbers befriend a homeless man who is searching for his son."
      },
      {
        "id": "tvmaze:645844",
        "title": "Whose Wedding Is It Anyway?",
        "season": 4,
        "episode": 20,
        "released": "2008-07-30",
        "overview": "Ella goes with Miranda to the mall to complete her wedding registry, but things get out of hand when Ella takes over."
      },
      {
        "id": "tvmaze:645845",
        "title": "All Is Not Lost!",
        "season": 4,
        "episode": 21,
        "released": "2008-07-30",
        "overview": "When things start to go awry with Calvin and Miranda's wedding plans, Calvin gets cold feet. Meanwhile, we see that Curtis has gained weight since his last tuxedo fitting."
      },
      {
        "id": "tvmaze:645846",
        "title": "Party Over Here!",
        "season": 4,
        "episode": 22,
        "released": "2008-08-06",
        "overview": "The guys want to throw Calvin a bachelor party, but Miranda won't hear of it."
      },
      {
        "id": "tvmaze:645847",
        "title": "The Last Supper",
        "season": 4,
        "episode": 23,
        "released": "2008-08-06",
        "overview": "The rehearsal dinner turns chaotic when Miranda passes out and uninvited guests show up."
      },
      {
        "id": "tvmaze:645848",
        "title": "We've Come This Far by Faith, Pt. 1",
        "season": 4,
        "episode": 24,
        "released": "2008-08-06",
        "overview": "It's the wedding day! Calvin writes his wedding vows only to pass out each time he says or hears the word \"forever.\""
      },
      {
        "id": "tvmaze:645849",
        "title": "We've Come This Far by Faith, Pt. 2",
        "season": 4,
        "episode": 25,
        "released": "2008-08-06",
        "overview": "The wedding ceremony finally begins, but before Calvin and Miranda can get to their vows, CJ interrupts with a plan of his own."
      },
      {
        "id": "tvmaze:645850",
        "title": "Labor Paynes, Pt. 1",
        "season": 5,
        "episode": 1,
        "released": "2008-12-03",
        "overview": "Janine goes into labor, resulting in surprises and white-knuckle moments, as a double wedding uniting CJ and Janine, plus Calvin and Miranda, swiftly changes locations to the hospital."
      },
      {
        "id": "tvmaze:645851",
        "title": "Labor Paynes, Pt. 2",
        "season": 5,
        "episode": 2,
        "released": "2008-12-03",
        "overview": "While in labor, Janine worries about her baby being born out of wedlock, so the double wedding is moved to the hospital."
      },
      {
        "id": "tvmaze:645852",
        "title": "Your Wife's a Payne",
        "season": 5,
        "episode": 3,
        "released": "2008-12-10",
        "overview": "Calvin and Miranda move into their new digs, but Miranda's shadowy past life as a con artist comes to the fore. Elsewhere, it gets snippy at the barbershop when the couple quarrels over business plans."
      },
      {
        "id": "tvmaze:645853",
        "title": "Casa de Payne",
        "season": 5,
        "episode": 4,
        "released": "2008-12-10",
        "overview": "Claretha gets the royal treatment when she becomes engaged to an African prince. Planning a move to Africa, she sells her home to a new family. Meanwhile, Curtis blows a gasket when he receives a slew of parking tickets; Calvin and Miranda return from their honeymoon; and Jazmine journeys to a boarding school in North Carolina."
      },
      {
        "id": "tvmaze:645854",
        "title": "It's a Payne Growing Up",
        "season": 5,
        "episode": 5,
        "released": "2008-12-17",
        "overview": "Malik's friend Kevin has an intimate relationship with a woman who has syphilis. C.J. counsel's Malik which leads to a misunderstanding. Meanwhile, Calvin is pressured by Miranda to be more thoughtful towards their marriage."
      },
      {
        "id": "tvmaze:645855",
        "title": "Payne and Prejudice",
        "season": 5,
        "episode": 6,
        "released": "2008-12-17",
        "overview": "The Payne's are invited for dinner at the Hernadez home which leads to a culture clash. Dana's falsehood's come back to haunt her at the barbershop."
      },
      {
        "id": "tvmaze:645856",
        "title": "Payneful News",
        "season": 5,
        "episode": 7,
        "released": "2009-02-11",
        "overview": "Calvin and Miranda are trying to have a baby, but they run into problems when they discover that Calvin isn't \"firing on all cylinders.\""
      },
      {
        "id": "tvmaze:645857",
        "title": "Payneful Loss",
        "season": 5,
        "episode": 8,
        "released": "2009-02-11",
        "overview": "Ella and Rosie conspire to get themselves and their husbands to lose weight and get healthy. Meanwhile, Malik and Kevin get in over their heads when they throw a house party while house sitting for Calvin and Miranda."
      },
      {
        "id": "tvmaze:645858",
        "title": "Payneful Employment",
        "season": 5,
        "episode": 9,
        "released": "2009-02-18",
        "overview": "CJ gets a very important job interview in another city which excites Curtis, who begins to think he might finally have the house to himself again."
      },
      {
        "id": "tvmaze:645859",
        "title": "Slightly Payneful Truth",
        "season": 5,
        "episode": 10,
        "released": "2009-02-18",
        "overview": "Malik, as a favor to Alexandra, helps Consuela prepare for her U.S. citizenship test. Curtis jumps in to help when Malik gets sick."
      },
      {
        "id": "tvmaze:645860",
        "title": "Joy and Payne",
        "season": 5,
        "episode": 11,
        "released": "2009-02-25",
        "overview": "Curtis, Calvin and the rest of the Paynes are caught in the middle of a Hernandez family confrontation between Carlos and his son, Diego."
      },
      {
        "id": "tvmaze:645861",
        "title": "A Sisters Payne",
        "season": 5,
        "episode": 12,
        "released": "2009-02-25",
        "overview": "Kiki's brother, Darnell, returns to the shop. Malik and Alex find a way around the 'no date' rule by having a date in Malik's back yard."
      },
      {
        "id": "tvmaze:645862",
        "title": "A Grand Payne",
        "season": 5,
        "episode": 13,
        "released": "2009-03-04",
        "overview": "Malik asks Alex out on a date, but their parents insist that they be supervised; Janine's parents visit to see the new twins."
      },
      {
        "id": "tvmaze:645863",
        "title": "Games People Play",
        "season": 5,
        "episode": 14,
        "released": "2009-03-04",
        "overview": "The Payne's love their annual tailgating shindig, but when Miranda finds out about Calvin and Mercedes kiss, she becomes ill. Meanwhile, Diego becomes agitated and starts fighting with people."
      },
      {
        "id": "tvmaze:645864",
        "title": "Help Wanted",
        "season": 5,
        "episode": 15,
        "released": "2009-04-08",
        "overview": "Miranda runs into her successful, good looking ex-fiance, and it drives Calvin crazy. To show that he is doing something with his life, Calvin takes a job at Mercedes company."
      },
      {
        "id": "tvmaze:645865",
        "title": "Old Lady Paynes",
        "season": 5,
        "episode": 16,
        "released": "2009-04-08",
        "overview": "When Ella's demanding mother arrives, the elder exhibits a lapse of memory, causing Ella to worry that she has Alzheimer's disease. Meanwhile, there's a hair-raising quandary at the barbershop when Floyd's supposedly dead first wife emerges."
      },
      {
        "id": "tvmaze:645866",
        "title": "I Don't Know This Payne",
        "season": 5,
        "episode": 17,
        "released": "2009-04-15",
        "overview": "Ella and Rosie get jobs working at a boutique at the mall, while Curtis and Carlos enjoy their new man world."
      },
      {
        "id": "tvmaze:645867",
        "title": "Paul Mall",
        "season": 5,
        "episode": 18,
        "released": "2009-04-15",
        "overview": "Curtis may need to be careful after Ella meets a handsome and charming man at the mall. Meanwhile, Diego asks for Calvin and Miranda's help in scrutinizing Mercedes newest man."
      },
      {
        "id": "tvmaze:645868",
        "title": "With Friends Like These",
        "season": 5,
        "episode": 19,
        "released": "2009-04-22",
        "overview": "Malik makes a friend, Jeremy, who is HIV-positive. When Jeremy gets harassed at school, Malik comes to his defense. Meanwhile, Rosie gets sick and Consuela becomes her temporary replacement at the boutique."
      },
      {
        "id": "tvmaze:645869",
        "title": "The Talent Show",
        "season": 5,
        "episode": 20,
        "released": "2009-04-22",
        "overview": "Due to city budget cuts, the firehouse is closing down. Everyone bands together to try and raise money for the laid-off firefighters. A very special guest (Gladys Knight) saves the day."
      },
      {
        "id": "tvmaze:645870",
        "title": "Bringing Down the House",
        "season": 5,
        "episode": 21,
        "released": "2009-04-29",
        "overview": "The foundation of the Payne house needs desperate repair. Curtis tries to save money by hiring a jackleg contractor, who ends up doing more damage and the Paynes have to move out of their house. Meanwhile, Ella grows closer to Paul, the man at the mall."
      },
      {
        "id": "tvmaze:645871",
        "title": "Moving Day",
        "season": 5,
        "episode": 22,
        "released": "2009-04-29",
        "overview": "Curtis, Ella and Malik are moving out of the house, CJ, Janine and the babies have gone to stay at Janine's parents in Florida. Ella is devastated. They have to move into Calvin and Miranda's condo and Calvin turns the table on Curtis and treats him the way he was treated when he lived at home."
      },
      {
        "id": "tvmaze:645872",
        "title": "Moving Out",
        "season": 5,
        "episode": 23,
        "released": "2009-05-27",
        "overview": "Miranda becomes upset with Calvin and the escapades with Mercedes, plus allowing his family to live at their house. Meanwhile, a quarrel over Ella's job has Curtis and Ella's marriage on shaky ground."
      },
      {
        "id": "tvmaze:645873",
        "title": "Back Where We Belong",
        "season": 5,
        "episode": 24,
        "released": "2009-05-27",
        "overview": "Curtis and Calvin move into the barbershop due to their marriage problems, which causes hair raising havoc in the process. Meanwhile, Floyd blows up when he learns of Zach and Olivia's act of love."
      },
      {
        "id": "tvmaze:645874",
        "title": "Surprise! Pt. 1",
        "season": 5,
        "episode": 25,
        "released": "2009-06-03",
        "overview": "Calvin has gotten the $20,000 needed to repair his parent's house and surprises them with the check. Meanwhile, Janine reveals that CJ is in Chicago interviewing for a new job."
      },
      {
        "id": "tvmaze:645875",
        "title": "Surprise! Pt. 2",
        "season": 5,
        "episode": 26,
        "released": "2009-06-03",
        "overview": "Calvin tries to fix the mess he is in with Miranda and the conflict only gets worse. Meanwhile, Janine, the twins and Malik are preparing to move."
      },
      {
        "id": "tvmaze:645876",
        "title": "Where's the Payne?",
        "season": 6,
        "episode": 1,
        "released": "2009-11-04",
        "overview": "A forced retirement for Curtis creates obstacles, but the drama spikes when Miranda goes missing. Elsewhere, Claretha returns without her said husband and moves in with Curtis and Ella."
      },
      {
        "id": "tvmaze:645877",
        "title": "Recurring Paynes",
        "season": 6,
        "episode": 2,
        "released": "2009-11-04",
        "overview": "Miranda remains missing, and her mother storms on over to the house. She blames Calvin for her disappearance and even called the police on him! She believes Calvin is a suspect in her vanishing. Meanwhile, CJ, Janine and Jazmine return, hoping to stay with Curtis and Ella. And a secret is unearthed regarding Curtis's forced retirement. Also, Jazmine has become very intelligent due to her being at a school for gifted children but it concerns the family because she is acting so weird."
      },
      {
        "id": "tvmaze:645878",
        "title": "Wigging Out",
        "season": 6,
        "episode": 3,
        "released": "2009-11-11",
        "overview": "Miranda finally returns and tells Calvin there is no baby. Despite his pleads, begs, and understanding Miranda refuses to let Calvin stay in the condo therefore, shocked and confused, Calvin must move back in with Curtis and Ella.Claretha decides to start a home business."
      },
      {
        "id": "tvmaze:645879",
        "title": "Payne Speaking",
        "season": 6,
        "episode": 4,
        "released": "2009-11-11",
        "overview": "Curtis protests his retirement at City Hall and C.J. reveals to Curtis that he's taking Curtis's job at the firehouse. Meanwhile, Ella battles with an innovative new pastor who plans to shut down the help center to make way for a new multi-media outreach program."
      },
      {
        "id": "tvmaze:645880",
        "title": "Parental Payne",
        "season": 6,
        "episode": 5,
        "released": "2009-11-18",
        "overview": "Calvin confronts Miranda, thinking she had an abortion. Meanwhile, the school casts Malik in its production of Othello but the supposedly bigot father of the white girl cast opposite Malik won't allow Malik to kiss her in the play."
      },
      {
        "id": "tvmaze:645881",
        "title": "Payne, Payne Go Away",
        "season": 6,
        "episode": 6,
        "released": "2009-11-18",
        "overview": "It's a revolving door at the Payne house when CJ, Janine and the children move out, and Floyd in turn moves in because of his divorce. Then there's Jazmine. The youngster, feeling ignored and jealous, makes the choice to run away."
      },
      {
        "id": "tvmaze:645882",
        "title": "Marriage Paynes",
        "season": 6,
        "episode": 7,
        "released": "2009-11-25",
        "overview": "All three of the Payne couples (Curtis and Ella, C.J.and Janine, and Calvin and Miranda) go on an eye-opening marriage retreat. At the end of the retreat, Miranda asks Calvin for a divorce. Meanwhile, Claretha and Floyd babysit for the twins while everyone is out of the house."
      },
      {
        "id": "tvmaze:645883",
        "title": "Ms. Curtis",
        "season": 6,
        "episode": 8,
        "released": "2009-12-02",
        "overview": "It's an awkward up-and-down meeting for Calvin and Miranda when they get trapped in an elevator together, their first encounter after she asked for a divorce. Meanwhile, Curtis unwittingly takes Ella's estrogen pills. At the end Miranda and Calvin finally overcome their marriage problems before they reach the dreaded \"33rd Floor\"."
      },
      {
        "id": "tvmaze:645884",
        "title": "Oh Christmas Payne",
        "season": 6,
        "episode": 9,
        "released": "2009-12-09",
        "overview": "Family and friends share their different versions of the Nativity story when Jazmine fails to appreciate her gift from Ella (a wooden version of the Nativity scene)."
      },
      {
        "id": "tvmaze:645885",
        "title": "Til Payne Do Us Part",
        "season": 6,
        "episode": 10,
        "released": "2009-12-23",
        "overview": "Curtis and Ella are shocked to learn that their not legally married, so Claretha and Floyd convince them to enjoy single life."
      },
      {
        "id": "tvmaze:645886",
        "title": "Payneful Reunion",
        "season": 6,
        "episode": 11,
        "released": "2010-03-03",
        "overview": "When Ella tries to arrange a family reunion, a chagrined Jazmine opposes the idea of connecting with her extended family. As such, Curtis and Ella set out to teach her a valuable lesson about honoring her family heritage."
      },
      {
        "id": "tvmaze:645887",
        "title": "From the Mouths of Babes",
        "season": 6,
        "episode": 12,
        "released": "2010-03-03",
        "overview": "The issue of birth control creates divisions between CJ and Janine. Meanwhile, surprise developments transpire when Calvin and Miranda spend a day with Jazmine."
      },
      {
        "id": "tvmaze:645888",
        "title": "Blackout X 3",
        "season": 6,
        "episode": 13,
        "released": "2010-03-10",
        "overview": "A blackout ironically sheds light on all three Payne couples when Curtis, CJ and Calvin are taken away from their televised football game and keep company with their wives."
      },
      {
        "id": "tvmaze:645889",
        "title": "Lady Sings to Blue",
        "season": 6,
        "episode": 14,
        "released": "2010-03-10",
        "overview": "The Paynes worry that the newly happy Janine might be returning to drugs after her erstwhile dealer arrives. And Curtis is turning Japanese---that is, he becomes captivated by Japanese culture"
      },
      {
        "id": "tvmaze:645890",
        "title": "Something Brewing",
        "season": 6,
        "episode": 15,
        "released": "2010-03-17",
        "overview": "Janine cares for her dying former dealer, jeopardizing her relationship with C.J.; Floyd and Curtis launch a beer-brewing business. While at the help center C.J. and Janine pray that Blue will be led to Heaven while dying."
      },
      {
        "id": "tvmaze:645891",
        "title": "Seal of Approval",
        "season": 6,
        "episode": 16,
        "released": "2010-03-17",
        "overview": "Malik decides to join the ROTC, upsetting Janine. And Curtis is fired up when he's hired by the fire department---but it's not in the capacity he expected."
      },
      {
        "id": "tvmaze:645892",
        "title": "Payneful Pie",
        "season": 6,
        "episode": 17,
        "released": "2010-03-25",
        "overview": "Ella breaks some news, which only creates a downturn in Curtis' financial plans. Elsewhere, Calvin squares off against Miranda's critical mother."
      },
      {
        "id": "tvmaze:645893",
        "title": "How Do You Like Your Roast?",
        "season": 6,
        "episode": 18,
        "released": "2010-03-25",
        "overview": "Curtis is the man of honor at a surprise retirement party. In other developments, a case of puppy love blooms for Jazmine."
      },
      {
        "id": "tvmaze:645894",
        "title": "Curtis Sings the Blues",
        "season": 6,
        "episode": 19,
        "released": "2010-03-31",
        "overview": "Curtis spirals into a depressive funk following successive life-altering events, but he gets support from a very unlikely source. In other developments, Calvin and Miranda compete against CJ and Janine in a bid for a weekend getaway."
      },
      {
        "id": "tvmaze:645895",
        "title": "Firestorm",
        "season": 6,
        "episode": 20,
        "released": "2010-03-31",
        "overview": "During a fire routine a fireman dies under CJ's authority and he blames himself. Meanwhile, Ella studies a book at school and recommends the literary work to Miranda and Claretha."
      },
      {
        "id": "tvmaze:645896",
        "title": "Heartbeat",
        "season": 6,
        "episode": 21,
        "released": "2010-04-07",
        "overview": "A pregnancy scare upends Calvin and Miranda's world. Elsewhere, Curtis' sales scheme lands him in trouble with the law."
      },
      {
        "id": "tvmaze:645897",
        "title": "Through the Fire",
        "season": 6,
        "episode": 22,
        "released": "2010-04-07",
        "overview": "Janine's mother (Anne-Marie Johnson) arrives, to a downcast CJ's immense annoyance. Elsewhere, Curtis is a flop during his guest-star role on a morning TV show."
      },
      {
        "id": "tvmaze:645898",
        "title": "The Bible: King Payne's Version",
        "season": 6,
        "episode": 23,
        "released": "2010-04-14",
        "overview": "Ella futilely tries to fit in with college-age peers in her study group; Curtis offers his own unique spin on religion when he teaches at Jazmine's Bible school."
      },
      {
        "id": "tvmaze:645899",
        "title": "Matured Investment",
        "season": 6,
        "episode": 24,
        "released": "2010-04-14",
        "overview": "A different side of Calvin opens up when he cares for Calvin Jr. Elsewhere, new neighbors arrive---and they have unique notions about relationships."
      },
      {
        "id": "tvmaze:645900",
        "title": "Who's Your Daddy, Now?",
        "season": 6,
        "episode": 25,
        "released": "2010-04-21",
        "overview": "Daddy issues plague CJ, who at long last meets his birth father. Elsewhere, Curtis tries not to miss a beat when he helps Jazmine choose a musical instrument."
      },
      {
        "id": "tvmaze:645901",
        "title": "Feet of Clay",
        "season": 6,
        "episode": 26,
        "released": "2010-04-21",
        "overview": "Curtis' old pal resurfaces, only to emerge as a much different person than before. Additionally, Calvin works to awe a nursery-school recruiter in the hopes of getting his child enrolled."
      },
      {
        "id": "tvmaze:645902",
        "title": "Date Night X 3",
        "season": 6,
        "episode": 27,
        "released": "2010-04-28",
        "overview": "The Payne men are pressured to take their wives out on the town, resulting in some poor date fate."
      },
      {
        "id": "tvmaze:645903",
        "title": "Watch the Son Shine",
        "season": 6,
        "episode": 28,
        "released": "2010-04-28",
        "overview": "Calvin and Ella work on a school project. Meanwhile, Curtis anticipates his first post-retirement interview and gets pointers from Malik."
      },
      {
        "id": "tvmaze:645904",
        "title": "The Drinking Game",
        "season": 6,
        "episode": 29,
        "released": "2010-05-05",
        "overview": "Malik and a pal are home alone, and they exploit that freedom. Meanwhile, Curtis and Ella have dinner at a top-notch restaurant, but the evening lacks flavor when Curtis tangles with a snobby waiter."
      },
      {
        "id": "tvmaze:645905",
        "title": "Who's on Top?",
        "season": 6,
        "episode": 30,
        "released": "2010-05-05",
        "overview": "CJ meets his new boss. Meanwhile, Floyd's ex-wife reappears, pulling Ella and Curtis into the dramas of a messy love triangle."
      },
      {
        "id": "tvmaze:645906",
        "title": "Help! Help! Help!",
        "season": 6,
        "episode": 31,
        "released": "2010-05-12",
        "overview": "When the help center must close due to a flood, Ella is forced to work at home, resulting in a chagrined Curtis and a flow of dramas. Elsewhere, a serious accident affects the Paynes."
      },
      {
        "id": "tvmaze:645907",
        "title": "Stinging Payne",
        "season": 6,
        "episode": 32,
        "released": "2010-05-12",
        "overview": "CJ tries to create a trap for his new boss and enlists Curtis to help him. Elsewhere, Calvin and Miranda's financial condition worsens."
      },
      {
        "id": "tvmaze:645908",
        "title": "Worth Fighting For",
        "season": 6,
        "episode": 33,
        "released": "2010-05-19",
        "overview": "Malik tries to win over an upperclassman by dueling with a bully. Meanwhile, Calvin puts into motion a plan to solve his financial problems."
      },
      {
        "id": "tvmaze:645909",
        "title": "Who's Your Nanny?",
        "season": 6,
        "episode": 34,
        "released": "2010-05-19",
        "overview": "The mother of Calvin's child reappears and breaks stunning news. Meanwhile, the family must hire a nanny due to Janine's new work schedule."
      },
      {
        "id": "tvmaze:645910",
        "title": "The Chef",
        "season": 6,
        "episode": 35,
        "released": "2010-05-26",
        "overview": "Malik cooks up a scheme to impress his girlfriend, lying to her that he's a gourmet chef. Desperate, he then turns to Curtis to help him prepare a tasty dish. Meanwhile, Calvin's second job keeps him away from Miranda."
      },
      {
        "id": "tvmaze:645911",
        "title": "My Fair Curtis",
        "season": 6,
        "episode": 36,
        "released": "2010-05-26",
        "overview": "Floyd hopes to win Claretha's heart. Cut to Curtis and Ella, who are enlisted to help him. In addition, CJ's boss bombards him with more lusty advances."
      },
      {
        "id": "tvmaze:645912",
        "title": "Rest for the Weary",
        "season": 6,
        "episode": 37,
        "released": "2010-06-02",
        "overview": "Calvin falls into a perilous circumstance when he takes on two jobs. Meanwhile, Janine's home life suffers when she scores a promotion."
      },
      {
        "id": "tvmaze:645913",
        "title": "Thug Life",
        "season": 6,
        "episode": 38,
        "released": "2010-06-02",
        "overview": "Big Jesse reappears and inches closer to Ella, triggering jealousy in Curtis. Elsewhere, Malik faces the consequences of hanging out with some bad folks."
      },
      {
        "id": "tvmaze:645914",
        "title": "Rehabilitation",
        "season": 6,
        "episode": 39,
        "released": "2010-06-09",
        "overview": "CJ protests when Malik's crime partner makes an appearance. Meanwhile, Curtis starts a barbershop in the backyard."
      },
      {
        "id": "tvmaze:645915",
        "title": "A Payne in Need is a Pain Indeed",
        "season": 6,
        "episode": 40,
        "released": "2010-06-09",
        "overview": "Tracie's unexpected visits to the house come under scrutiny. Elsewhere, Curtis is enlisted as CJ and Janine's babysitter."
      },
      {
        "id": "tvmaze:645916",
        "title": "House Guest",
        "season": 6,
        "episode": 41,
        "released": "2011-01-05",
        "overview": "Ella provides assistance to a domestic-abuse victim named Monica. Monica turns out to be a friend of Janine's and moves in with her and C.J as their new nanny. In other events, Jazmine and CJ anticipate a father-daughter dance."
      },
      {
        "id": "tvmaze:645917",
        "title": "Payne Showers",
        "season": 6,
        "episode": 42,
        "released": "2011-01-05",
        "overview": "Ella and Miranda's mother complicates Miranda's baby shower. As for the men, Curtis throws Calvin a \"man shower\". Tracie makes moves at Calvin when she shows up to the party but when he pushes, she takes Calvin Jr. away from him and Miranda."
      },
      {
        "id": "tvmaze:645918",
        "title": "Playing with Fire",
        "season": 6,
        "episode": 43,
        "released": "2011-01-12",
        "overview": "Janine's friend, Monica, has moved in and transformed herself and the house. Meanwhile, Miranda confronts Tracie and she puts up drastic measures at suing Calvin for child support."
      },
      {
        "id": "tvmaze:645919",
        "title": "When the Payne's Away",
        "season": 6,
        "episode": 44,
        "released": "2011-01-12",
        "overview": "While Janine is taking an overnight trip with her boss, Monica keeps the house warm and cozy with C.J. Meanwhile, Calvin tries to help Miranda prepare for labor pains, but this preparation doesn't go as planned."
      },
      {
        "id": "tvmaze:645920",
        "title": "Beginnings",
        "season": 6,
        "episode": 45,
        "released": "2011-01-19",
        "overview": "Curtis and Ella think it is time to move. They soon realize that their house is the gem that holds their family together."
      },
      {
        "id": "tvmaze:645921",
        "title": "Payneful Resolution",
        "season": 6,
        "episode": 46,
        "released": "2011-01-19",
        "overview": "Calvin is graduating from school. Miranda is about to go into labor with their child, but Calvin is then arrested for back child support. Meanwhile, Janine shares an intimate moment with her boss, Roland. In the ending moments of the episode, CJ intentionally kisses Janine's friend Monica. Feeling guilty, Monica tries to leave but unfortunately, Janine is at the door, resulting in a cliffhanger."
      },
      {
        "id": "tvmaze:645922",
        "title": "Payneful Resolution Resolution",
        "season": 7,
        "episode": 1,
        "released": "2011-03-30",
        "overview": "Miranda goes into labor just as Calvin prepares for his graduation while C.J. and Janine's marriage reaches a breaking point. Meanwhile, Curtis and Ella get an offer they can't refuse for the Payne house."
      },
      {
        "id": "tvmaze:645923",
        "title": "Growing Paynes",
        "season": 7,
        "episode": 2,
        "released": "2011-03-30",
        "overview": "Jasmine starts wearing lipstick and hanging with the wrong crowd. Curtis and Ella have a weight loss competition."
      },
      {
        "id": "tvmaze:645924",
        "title": "Payne Protection",
        "season": 7,
        "episode": 3,
        "released": "2011-04-06",
        "overview": "Malik gets ready for college. The men offer him advice and buy him condoms."
      },
      {
        "id": "tvmaze:645925",
        "title": "Payneful Visit",
        "season": 7,
        "episode": 4,
        "released": "2011-04-06",
        "overview": "Claretha reveals she has leukemia. Miranda's cousin Vanessa hooks up with Calvin's friend."
      },
      {
        "id": "tvmaze:645926",
        "title": "Where There's a Will, There's a Way",
        "season": 7,
        "episode": 5,
        "released": "2011-04-13",
        "overview": "After the death of a young firefighter, Ella decides it's time for Curtis and Ella to do a will. Meanwhile, Miranda's mom pays a visit."
      },
      {
        "id": "tvmaze:645927",
        "title": "Epic Fail",
        "season": 7,
        "episode": 6,
        "released": "2011-04-13",
        "overview": "Ella is overwhelmed and falls behind in her studies due to church duties, household duties, taking care of Curtis and the rest of the family. Ella fails a test she needed to graduate and she snaps on the family. Meanwhile, Calvin and Miranda realize it's the day of their anniversary, and they both pretend they didn't forget."
      },
      {
        "id": "tvmaze:645928",
        "title": "Praying for Attention",
        "season": 7,
        "episode": 7,
        "released": "2011-04-20",
        "overview": "Jasmine prays to pass a test and no longer wants to apply herself. Meanwhile, Calvin grows jealous of the baby."
      },
      {
        "id": "tvmaze:645929",
        "title": "Shout Out",
        "season": 7,
        "episode": 8,
        "released": "2011-04-20",
        "overview": "C.J. and Janine go to marriage counseling. Then try the therapist's way. But in the end they yell and scream at each other and they feel better. CJ sexes up the reunion between him and Janine. Meanwhile, Ella misses her graduation because she has to take Claretha to the hospital."
      },
      {
        "id": "tvmaze:645930",
        "title": "Love Thy Neighbor",
        "season": 7,
        "episode": 9,
        "released": "2011-04-27",
        "overview": "The family befriends a sex offender who moves into the neighborhood and all hell breaks loose when they find out his secret. Meanwhile, C.J. and Janine decide to heed the advice of the marriage counselor. They go on a journey to find a hobby the two of them can share."
      },
      {
        "id": "tvmaze:645931",
        "title": "Dream Girls",
        "season": 7,
        "episode": 10,
        "released": "2011-04-27",
        "overview": "A music producer wants to sign Jasmine. Meanwhile, Calvin becomes frustrated with the job market and takes a job as a grocery store manager."
      },
      {
        "id": "tvmaze:645932",
        "title": "A Payneful Night Out",
        "season": 7,
        "episode": 11,
        "released": "2011-05-04",
        "overview": "Curtis and Ella decide to intervene when they see Janine and Roland at dinner until C.J. shows up with a woman. Meanwhile, Miranda goes on a grooming strike."
      },
      {
        "id": "tvmaze:645933",
        "title": "Payneful Assistance",
        "season": 7,
        "episode": 12,
        "released": "2011-05-04",
        "overview": "Miranda gets cooking advice after she makes a horrible dinner for Ella's club. Meanwhile, Curtis gets his tonsils pulled and can't talk."
      },
      {
        "id": "tvmaze:645934",
        "title": "House of Awkward",
        "season": 7,
        "episode": 13,
        "released": "2011-05-11",
        "overview": "After taking a hit from a vape pen Curtis seems to think he is now an addict."
      },
      {
        "id": "tvmaze:645935",
        "title": "Brain Payne",
        "season": 7,
        "episode": 14,
        "released": "2011-05-11",
        "overview": "Jayden may have autism. Janine blames herself. Meanwhile, Curtis lives by the rules of the Bible."
      },
      {
        "id": "tvmaze:645936",
        "title": "Foster Paynes",
        "season": 7,
        "episode": 15,
        "released": "2011-05-18",
        "overview": "Ella brings home a troubled youth from the Help Center. Meanwhile, Janine and Miranda compete to get in a competitive day care."
      },
      {
        "id": "tvmaze:645937",
        "title": "Talented Paynes",
        "season": 7,
        "episode": 16,
        "released": "2011-05-18",
        "overview": "As Claretha secretly deals with the possibility of losing her home, the family participates in a talent show."
      },
      {
        "id": "tvmaze:645938",
        "title": "Going, Going, Gone",
        "season": 7,
        "episode": 17,
        "released": "2011-05-25",
        "overview": "Janine is on the brink of a breakdown. Deshawn gets a lesson in the negro baseball league."
      },
      {
        "id": "tvmaze:645939",
        "title": "Mother's Day Out",
        "season": 7,
        "episode": 18,
        "released": "2011-06-01",
        "overview": "Deshawn's mother shows up at the Payne house. C.J. upgrades Janine's wedding ring."
      },
      {
        "id": "tvmaze:645940",
        "title": "So Hard to Say Goodbye",
        "season": 7,
        "episode": 19,
        "released": "2011-06-08",
        "overview": "Malik leaves for college. Meanwhile, Calvin Jr. comes to visit and Miranda is overwhelmed."
      },
      {
        "id": "tvmaze:645941",
        "title": "Payneful Rescue",
        "season": 7,
        "episode": 20,
        "released": "2011-06-15",
        "overview": "The aftershocks of a fire impact Miranda and Calvin; Tracie and her new boyfriend show up at the hospital causing a huge argument. In the ending moments, the baby seems to be fine."
      },
      {
        "id": "tvmaze:645942",
        "title": "A Mother's Payne",
        "season": 8,
        "episode": 1,
        "released": "2011-10-21",
        "overview": "Ella's mother comes to visit. Meanwhile, Janine texts C.J. a sexy picture of herself."
      },
      {
        "id": "tvmaze:645943",
        "title": "Up from the Ashes",
        "season": 8,
        "episode": 2,
        "released": "2011-10-21",
        "overview": "Calvin and Miranda salvage what they can from the remains of their burned condo, move in with C.J. and Janine, and gear up for a legal battle with Tracie over Calvin Jr."
      },
      {
        "id": "tvmaze:645944",
        "title": "The Payne Gang",
        "season": 8,
        "episode": 3,
        "released": "2011-10-28",
        "overview": "Deshawn joins a gang. Ella and Floyd do everything they can to stop him. Calvin gets on C.J.'s nerves after he and Miranda move in with C.J. and Janine."
      },
      {
        "id": "tvmaze:645945",
        "title": "The Gifted and the Grout",
        "season": 8,
        "episode": 4,
        "released": "2011-10-28",
        "overview": "One of Deshawn's teachers has a radical idea about helping Deshawn at school: The gifted program. Calvin and Miranda hire a contractor to start the renovations of their condo."
      },
      {
        "id": "tvmaze:645946",
        "title": "Do the Fight Thing",
        "season": 8,
        "episode": 5,
        "released": "2011-11-04",
        "overview": "Deshawn gets in trouble for bullying a kid at school. Miranda and Janine begin fighting over petty things."
      },
      {
        "id": "tvmaze:645947",
        "title": "1096",
        "season": 8,
        "episode": 6,
        "released": "2011-11-04",
        "overview": "C.J. forgets Janine's three year sober anniversary. Ella gets Deshawn an ugly outfit for school picture day."
      },
      {
        "id": "tvmaze:645948",
        "title": "Number Five's Fight",
        "season": 8,
        "episode": 7,
        "released": "2011-11-11",
        "overview": "After C.J. has to lay off firefighters due to budget cuts, Roland has to use his PR skills to avoid altercation."
      },
      {
        "id": "tvmaze:645949",
        "title": "The Best Surprise",
        "season": 8,
        "episode": 8,
        "released": "2011-11-11",
        "overview": "Calvin and Miranda plan Calvin Jr.'s birthday party. Curtis and Ella have trouble with the HOA."
      },
      {
        "id": "tvmaze:645950",
        "title": "Working Paynes",
        "season": 8,
        "episode": 9,
        "released": "2011-11-18",
        "overview": "CJ hires Calvin, but Calvin's job performance fails to impress. Meanwhile, a bored Curtis brushes off retirement by taking up painting."
      },
      {
        "id": "tvmaze:645951",
        "title": "Curtis Jefferson",
        "season": 8,
        "episode": 10,
        "released": "2011-11-18",
        "overview": "Curtis wakes up as a Jefferson."
      },
      {
        "id": "tvmaze:645952",
        "title": "Dead Wrong",
        "season": 8,
        "episode": 11,
        "released": "2011-11-25",
        "overview": "Miranda frets over her unemployment; C.J. looks into firefighter response times."
      },
      {
        "id": "tvmaze:645953",
        "title": "The Rich and Payneless",
        "season": 8,
        "episode": 12,
        "released": "2011-11-25",
        "overview": "Calvin is allowed supervised visits; Ella's friend Felicia visits."
      },
      {
        "id": "tvmaze:645954",
        "title": "Mentoring Paynes",
        "season": 8,
        "episode": 13,
        "released": "2011-12-02",
        "overview": "Janine sponsors a young girl; Curtis and Ella become DeShawn's foster parents."
      },
      {
        "id": "tvmaze:645955",
        "title": "Roommate Paynes",
        "season": 8,
        "episode": 14,
        "released": "2011-12-02",
        "overview": "C.J. and Janine are not comfortable with Malik's roommate; Claretha tries alternative cancer-fighting treatments."
      },
      {
        "id": "tvmaze:645956",
        "title": "Pledging Paynes",
        "season": 8,
        "episode": 15,
        "released": "2011-12-30",
        "overview": "Malik gets hazed."
      },
      {
        "id": "tvmaze:645957",
        "title": "Help Me, Ella",
        "season": 8,
        "episode": 16,
        "released": "2011-12-30",
        "overview": "Ella becomes director of the center; Malik mulls dropping out."
      },
      {
        "id": "tvmaze:645958",
        "title": "Paynefully Fit",
        "season": 8,
        "episode": 17,
        "released": "2012-01-06",
        "overview": "Curtis becomes a contestant on Paynefully Fit, while Deshawn get advice about girls"
      },
      {
        "id": "tvmaze:645959",
        "title": "Do the Hustle",
        "season": 8,
        "episode": 18,
        "released": "2012-01-06",
        "overview": "Miranda's new client hits on her while the family honors Curtis."
      },
      {
        "id": "tvmaze:645960",
        "title": "No More Payne",
        "season": 8,
        "episode": 19,
        "released": "2012-01-13",
        "overview": "Miranda takes over renovating the condo while Calvin and Deshawn bond."
      },
      {
        "id": "tvmaze:645961",
        "title": "God Bless the Paynes",
        "season": 8,
        "episode": 20,
        "released": "2012-01-13",
        "overview": "The Payne's say goodbye while praising God in church."
      },
      {
        "id": "tvmaze:645962",
        "title": "Do or Die",
        "season": 8,
        "episode": 21,
        "released": "2012-01-20",
        "overview": "Unaware that Calvin has been shot, Miranda takes out her fury on Curtis and Ella for Calvin missing Christian's christening and being unreachable."
      },
      {
        "id": "tvmaze:645963",
        "title": "R.I.P. - Rest in Payne",
        "season": 8,
        "episode": 22,
        "released": "2012-01-20",
        "overview": "As Calvin fights for his life in the hospital, Ella has had enough of Miranda's behavior, and Curtis and C.J. meet with the police to begin searching for the perpetrator."
      },
      {
        "id": "tvmaze:645964",
        "title": "Payne-ful Survival",
        "season": 8,
        "episode": 23,
        "released": "2012-01-27",
        "overview": "Calvin is still unconscious from being shot, but his gap in health insurance places the family in a financial dilemma, while a detective begins investigating Travis Harris."
      },
      {
        "id": "tvmaze:645965",
        "title": "Payneful Recovery",
        "season": 8,
        "episode": 24,
        "released": "2012-01-27",
        "overview": "Calvin regains consciousness and begins his slow recovery, as Curtis and Ella's coverage of his astronomical medical bills forces them to give up moving into their new house."
      },
      {
        "id": "tvmaze:645966",
        "title": "House of Nightmares",
        "season": 8,
        "episode": 25,
        "released": "2012-02-03",
        "overview": "With Calvin in pain, unable to remember his assailant and having nightmares about being shot, Curtis and Ella believe they are better equipped than Miranda to care for him."
      },
      {
        "id": "tvmaze:645967",
        "title": "In Payne",
        "season": 8,
        "episode": 26,
        "released": "2012-02-03",
        "overview": "Curtis and Ella are deeply concerned when despondent Calvin states he would have been better off dying, while DeShawn makes the decision to live with his mother again."
      },
      {
        "id": "tvmaze:645968",
        "title": "Payback",
        "season": 8,
        "episode": 27,
        "released": "2012-02-10",
        "overview": "Now remembering who shot him, Calvin plans to take the law into his own hands, as Curtis fakes illness to attend a baseball game instead of going to a brunch with Ella."
      },
      {
        "id": "tvmaze:645969",
        "title": "Daddy Day Scare",
        "season": 8,
        "episode": 28,
        "released": "2012-02-10",
        "overview": "Back in the condo with Miranda, Calvin doesn't have the heart to tell Ella she's no longer needed, while Curtis, C.J. and Floyd watch the twins during a big game."
      },
      {
        "id": "tvmaze:645970",
        "title": "Pills and Thrills",
        "season": 8,
        "episode": 29,
        "released": "2012-02-17",
        "overview": "Lethargic and unmotivated, Calvin gives in to Miranda and C.J.'s demands to return to work, and Curtis is convinced Floyd's new girlfriend is a former male firefighter."
      },
      {
        "id": "tvmaze:645971",
        "title": "Scars of Payne",
        "season": 8,
        "episode": 30,
        "released": "2012-02-17",
        "overview": "During a gun buyback program at the Help Center, Ella diffuses a potentially fatal situation, and Calvin works up the courage to speak about his recent experience being shot."
      },
      {
        "id": "tvmaze:645972",
        "title": "Payne vs. Payne",
        "season": 8,
        "episode": 31,
        "released": "2012-02-17",
        "overview": "When Curtis runs for president of the neighborhood watch, he's challenged by C.J., while Malik uses his emergency credit card irresponsibly to buy gifts for his girlfriend"
      },
      {
        "id": "tvmaze:645973",
        "title": "Guess Who Came to Breakfast",
        "season": 8,
        "episode": 32,
        "released": "2012-02-17",
        "overview": "When Malik brings his college girlfriend Summer home, the family has difficulty accepting her New Age energy-reading ways and Malik's plan to travel with her to Africa."
      },
      {
        "id": "tvmaze:645974",
        "title": "House of Force Closure",
        "season": 8,
        "episode": 33,
        "released": "2012-03-02",
        "overview": "As Calvin and Miranda are evicted from their condo due to bank foreclosure, Floyd sells Curtis on a home security system, concealing the fact that it's not legitimate."
      },
      {
        "id": "tvmaze:645975",
        "title": "If It Ain't Broke",
        "season": 8,
        "episode": 34,
        "released": "2012-03-02",
        "overview": "The opening of Ella's shelter for battered women is threatened when C.J. finds multiple fire code violations, while Curtis has Calvin at his beck and call for denting his car."
      },
      {
        "id": "tvmaze:645976",
        "title": "Neighborhood Crisis",
        "season": 8,
        "episode": 35,
        "released": "2012-03-09",
        "overview": "Curtis hopes to be honored by the mayor for his neighborhood patrolling prowess, as Malik works his school's crisis hotline and fields a call from a suicidal student."
      },
      {
        "id": "tvmaze:645977",
        "title": "Down for the Count",
        "season": 8,
        "episode": 36,
        "released": "2012-03-09",
        "overview": "While Curtis bonds with Miranda over man-centric activities, C.J.'s college buddy gives him a sports car and event tickets, expecting a significant favor in return."
      },
      {
        "id": "tvmaze:645978",
        "title": "Stop, Drop, and Roll",
        "season": 8,
        "episode": 37,
        "released": "2012-05-11",
        "overview": "Believing Janine's PR event idea doesn't have merit, C.J. overrides it with his own plan, and Ella is offended when Malik thinks critically about creationism and faith in God."
      },
      {
        "id": "tvmaze:645979",
        "title": "No Pass, No Play",
        "season": 8,
        "episode": 38,
        "released": "2012-05-11",
        "overview": "A television reporter twists Curtis's on-camera statement about C.J.'s job performance, while Malik tutors an illiterate football player and is asked to take a test for him."
      },
      {
        "id": "tvmaze:645980",
        "title": "Payneful Injection",
        "season": 8,
        "episode": 39,
        "released": "2012-05-18",
        "overview": "Malik is arrested while leading a student demonstration to prevent the execution of an arsonist, whom C.J. helped convict 12 years earlier."
      },
      {
        "id": "tvmaze:645981",
        "title": "Batter Up",
        "season": 8,
        "episode": 40,
        "released": "2012-05-18",
        "overview": "Unathletic Janine is thrilled to play on C.J. and Curtis's softball team, as Miranda fundamentally disagrees with Ella's philosophy of physically disciplining children."
      },
      {
        "id": "tvmaze:645982",
        "title": "Payneful Matrimony",
        "season": 8,
        "episode": 41,
        "released": "2012-05-25",
        "overview": "Curtis and Ella grow tired of Calvin and Miranda taking advantage of them, while C.J.'s advisement to Malik and Summer not to have premarital sex has an unexpected result."
      },
      {
        "id": "tvmaze:645983",
        "title": "What You Know About Me",
        "season": 8,
        "episode": 42,
        "released": "2012-05-25",
        "overview": "As C.J., Janine and Miranda throw a house party and agree to exclude Curtis and Ella, college newlyweds Malik and Miranda realize they don't know each other well."
      },
      {
        "id": "tvmaze:645984",
        "title": "Right Turn",
        "season": 8,
        "episode": 43,
        "released": "2012-06-01",
        "overview": "Curtis's lackluster community service work at the Help Center aggravates Ella, while Janine is disappointed when Miranda chooses Calvin to go to a concert."
      },
      {
        "id": "tvmaze:645985",
        "title": "The Loan Ranger",
        "season": 8,
        "episode": 44,
        "released": "2012-06-01",
        "overview": "When Ella borrows $200 from Curtis, he makes the dubious claim to C.J. and Calvin that she'll pay it back, and Malik is shocked to find out his longtime friend Rashard is gay."
      },
      {
        "id": "tvmaze:645986",
        "title": "Payneful Divorce",
        "season": 8,
        "episode": 45,
        "released": "2012-06-08",
        "overview": "Malik is devastated when Summer acts evasive and insists they end their marriage, while Miranda makes Janine jealous with her overachieving temp skills in the PR office."
      },
      {
        "id": "tvmaze:645987",
        "title": "Up to the Challenge",
        "season": 8,
        "episode": 46,
        "released": "2012-06-08",
        "overview": "Curtis gets a new appreciation for Ella's management of the Help Center when he covers for her, as Malik gets hopped-up on caffeine pills to manage work and studying."
      },
      {
        "id": "tvmaze:645988",
        "title": "House of Sabotage",
        "season": 8,
        "episode": 47,
        "released": "2012-06-15",
        "overview": "Janine and Miranda's clash of egos puts an important church sponsorship presentation in jeopardy, while Malik has trouble moving past his failed marriage to Summer."
      },
      {
        "id": "tvmaze:645989",
        "title": "Payneful Pop In",
        "season": 8,
        "episode": 48,
        "released": "2012-06-15",
        "overview": "C.J. and Janine are fed up with Curtis and Ella's unannounced visits, and Jazmine is caught with a cheat sheet at school."
      },
      {
        "id": "tvmaze:645990",
        "title": "House of OMG",
        "season": 8,
        "episode": 49,
        "released": "2012-06-22",
        "overview": "Mobile technology overtakes the family, when Jazmine communicates only in text speak, Curtis discovers the functionality of his tablet, and Ella becomes glued to her laptop."
      },
      {
        "id": "tvmaze:645991",
        "title": "Keep It Moving",
        "season": 8,
        "episode": 50,
        "released": "2012-06-22",
        "overview": "Curtis replaces C.J. as coach of Jazmine's winless soccer team, guides them to defeating the toughest team in the league and sets his sights on the state championship."
      },
      {
        "id": "tvmaze:645992",
        "title": "Bake, Rattle and Roll",
        "season": 8,
        "episode": 51,
        "released": "2012-06-29",
        "overview": "As Ella works with Jazmine to improve her baking skills, the family stages an intervention when Calvin's addiction to painkillers comes to light."
      },
      {
        "id": "tvmaze:645993",
        "title": "Dodging Bullies",
        "season": 8,
        "episode": 52,
        "released": "2012-06-29",
        "overview": "Jazmine's friend sends out email blasts with hurtful jokes about their classmate, while a pregnancy scare causes Miranda and Calvin's anger towards each other to surface."
      },
      {
        "id": "tvmaze:645994",
        "title": "Payneful Distance",
        "season": 8,
        "episode": 53,
        "released": "2012-07-06",
        "overview": "Janine is in disbelief when C.J. gives her below-average scores on her annual performance evaluation, as Miranda worries that Calvin is no longer the man she married."
      },
      {
        "id": "tvmaze:645995",
        "title": "Not in the Cards",
        "season": 8,
        "episode": 54,
        "released": "2012-07-06",
        "overview": "Hired by Ella to buff the floors of the Help Center, Floyd uses it as an opportunity to host a casino night, as C.J. and Janine teach Jazmine a lesson about talking in class."
      },
      {
        "id": "tvmaze:645996",
        "title": "All Work and No Play",
        "season": 8,
        "episode": 55,
        "released": "2012-07-20",
        "overview": "Spending a day in C.J. and Janine's office, Jazmine is bored until she watches them handle a crisis, while Calvin and Miranda struggle to find a new place."
      },
      {
        "id": "tvmaze:645997",
        "title": "Amazing Matriarchs",
        "season": 8,
        "episode": 56,
        "released": "2012-07-20",
        "overview": "Ella shows great composure when her mother Eunice passes away, but she is stunned when Evie discloses a long-held family secret that affects their inheritance."
      },
      {
        "id": "tvmaze:645998",
        "title": "The First Dance",
        "season": 8,
        "episode": 57,
        "released": "2012-07-27",
        "overview": "While Janine is away, Jazmine is asked by a boy to the school dance, and it's up to protective C.J. and Curtis to put him through an interrogation to earn their approval."
      },
      {
        "id": "tvmaze:645999",
        "title": "The Invention of Trust",
        "season": 8,
        "episode": 58,
        "released": "2012-07-27",
        "overview": "Floyd lists himself as the sole inventor of a product that Curtis helped him with, and Calvin discovers that Miranda has funds she intentionally hid from him."
      },
      {
        "id": "tvmaze:646000",
        "title": "Payneful Realization",
        "season": 8,
        "episode": 59,
        "released": "2012-08-03",
        "overview": "With Calvin and Miranda constantly arguing, Calvin plans a special night to reconnect with her, however their marriage may be past the point of saving."
      },
      {
        "id": "tvmaze:646001",
        "title": "Trial and Tribulation",
        "season": 8,
        "episode": 60,
        "released": "2012-08-03",
        "overview": "After Travis Harris's trial for the attempted murder of Calvin, the Paynes anxiously await the verdict and worry about the content of Calvin's victim impact statement."
      },
      {
        "id": "tvmaze:646002",
        "title": "The Call Back",
        "season": 8,
        "episode": 61,
        "released": "2012-08-10",
        "overview": "Harboring resentment since his forced retirement, Curtis balks at C.J.'s request for him to return to the fire department, while Floyd finds out he has royal lineage."
      },
      {
        "id": "tvmaze:646003",
        "title": "All's Well",
        "season": 8,
        "episode": 62,
        "released": "2012-08-10",
        "overview": "Before a fancy anniversary dinner, Miranda confesses to Janine that she doesn't see any reason to celebrate her marriage to Calvin, and she later walks out on him."
      },
      {
        "id": "tvmaze:1922446",
        "title": "A Wise Man's Opinion",
        "season": 9,
        "episode": 1,
        "released": "2020-09-02",
        "overview": "Malik unexpectedly returns home from college to tell his family life-changing news, but before he spills his secret, he turns to Calvin for advice."
      },
      {
        "id": "tvmaze:1922447",
        "title": "Delicious",
        "season": 9,
        "episode": 2,
        "released": "2020-09-02",
        "overview": "Curtis and Ella react to Malik's surprising confession, and Malik's girlfriend Lisa makes quite an impression on his aunt and uncle."
      },
      {
        "id": "tvmaze:1922887",
        "title": "By Your Side",
        "season": 9,
        "episode": 3,
        "released": "2020-09-09",
        "overview": "Malik's parents try to keep calm after finding out about Lisa's pregnancy, but Curtis and Ella are eager to gloat about the situation."
      },
      {
        "id": "tvmaze:1922888",
        "title": "The Old People Game",
        "season": 9,
        "episode": 4,
        "released": "2020-09-09",
        "overview": "After Janine lets slip about a baby on the way, Jazmine tries to coax the whole story out of Ella."
      },
      {
        "id": "tvmaze:1926940",
        "title": "Women of Today",
        "season": 9,
        "episode": 5,
        "released": "2020-09-16",
        "overview": "Jazmine confides in Ella that she's feeling pressured to have sex, and Ella gives her a lesson in love, relationships and self-respect."
      },
      {
        "id": "tvmaze:1926941",
        "title": "Mixed Emotions",
        "season": 9,
        "episode": 6,
        "released": "2020-09-16",
        "overview": "Calvin and Miranda's long, dragged-out divorce leads Malik to declare that he'll never get married, and Miranda confides in Janine about her own frustrations with the court proceedings."
      },
      {
        "id": "tvmaze:1930168",
        "title": "Love and Hate",
        "season": 9,
        "episode": 7,
        "released": "2020-09-23",
        "overview": "Curtis gets upset at Ella for counselling Miranda about her divorce, and Miranda tries to engineer an \"accidental\" run-in with Calvin."
      },
      {
        "id": "tvmaze:1930169",
        "title": "From Heart to Heart",
        "season": 9,
        "episode": 8,
        "released": "2020-09-23",
        "overview": "Calvin confronts his mom about taking to Miranda, and C.J. reveals that he's upset about how Lisa has taken over the house."
      },
      {
        "id": "tvmaze:1934467",
        "title": "Someone",
        "season": 9,
        "episode": 9,
        "released": "2020-09-30",
        "overview": "Miranda turns to Ella for advice, and Calvin introduces his new girlfriend Laura to his parents."
      },
      {
        "id": "tvmaze:1934468",
        "title": "Something's Rotten",
        "season": 9,
        "episode": 10,
        "released": "2020-09-30",
        "overview": "Miranda has an uncomfortable encounter with Laura, and C.J. urges Calvin to have a much-needed conversation with Ella."
      },
      {
        "id": "tvmaze:1940241",
        "title": "Hard Lessons",
        "season": 9,
        "episode": 11,
        "released": "2020-10-07",
        "overview": "A fight over breakfast leaves Ella feeling unappreciated, the house becomes a mess when Curtis is left to fend for himself, and Miranda confesses her feelings for Calvin."
      },
      {
        "id": "tvmaze:1944642",
        "title": "Lucky Cards",
        "season": 9,
        "episode": 12,
        "released": "2020-10-14",
        "overview": "Curtis looks for his lucky playing cards in anticipation of a game with the guys, and Ella's relationship advice creates an awkward confrontation."
      },
      {
        "id": "tvmaze:1949086",
        "title": "Moving On",
        "season": 9,
        "episode": 13,
        "released": "2020-10-21",
        "overview": "Ella accuses Miranda of trying to make Calvin jealous by going on a date with a professional football player, and Curtis hopes to use the athlete to get free tickets to games."
      },
      {
        "id": "tvmaze:1953149",
        "title": "Been a Long Time",
        "season": 9,
        "episode": 14,
        "released": "2020-10-28",
        "overview": "Curtis enlists C.J. and Calvin to help plan a surprise birthday party for Ella, and Janine discovers a vape pen and weed mints in Jazmine's pockets."
      },
      {
        "id": "tvmaze:1958152",
        "title": "J. Boogie",
        "season": 9,
        "episode": 15,
        "released": "2020-11-04",
        "overview": "Jazmine's insolent new boyfriend causes C.J. to lose his cool, and when Curtis is left alone with a vape pen, he decides to see what all the fuss is about."
      },
      {
        "id": "tvmaze:1963231",
        "title": "The Dinosaur and the Rabbit",
        "season": 9,
        "episode": 16,
        "released": "2020-11-11",
        "overview": "After trying Jazmine's vape pen, Curtis gets extremely high, and Ella is confused by his odd behavior."
      },
      {
        "id": "tvmaze:1967785",
        "title": "Dark Thirty",
        "season": 9,
        "episode": 17,
        "released": "2020-11-18",
        "overview": "Curtis and Ella continue to deal with their accidental highs, and C.J. confronts the dealer who gave the vape pen and weed mints to Jazmine in the first place."
      },
      {
        "id": "tvmaze:1971357",
        "title": "Out of Character",
        "season": 9,
        "episode": 18,
        "released": "2020-11-25",
        "overview": "As Curtis and Ella's high lingers, Floyd, C.J. and Kaleb look for the vape pen and weed mints they used, and the next morning, Curtis and Ella make a promise to one another."
      },
      {
        "id": "tvmaze:1974847",
        "title": "The Package",
        "season": 9,
        "episode": 19,
        "released": "2020-12-02",
        "overview": "Despite her dad's warnings, Kaleb keeps trying to see Jazmine, and Curtis asks Calvin to wait at his house for a mysterious package to arrive."
      },
      {
        "id": "tvmaze:1982743",
        "title": "If You Loved Me",
        "season": 9,
        "episode": 20,
        "released": "2020-12-09",
        "overview": "Calvin grills Kaleb and Jazmine after catching them together at his parents' house, leading Jazmine to realize what kind of guy her boyfriend really is."
      },
      {
        "id": "tvmaze:1982744",
        "title": "The Big Game",
        "season": 9,
        "episode": 21,
        "released": "2020-12-16",
        "overview": "C.J. tries to give Malik a lesson in compromise after Lisa takes over the only TV in the house, and Miranda makes it known to the family that she's going on a date."
      },
      {
        "id": "tvmaze:1986321",
        "title": "Give and Take",
        "season": 9,
        "episode": 22,
        "released": "2020-12-23",
        "overview": "When Lisa invites herself to stay with Ella and Curtis after a fight with Malik, the family forces the feuding couple to sit down and work things out."
      },
      {
        "id": "tvmaze:2083745",
        "title": "Parenting 101",
        "season": 9,
        "episode": 23,
        "released": "2020-12-30",
        "overview": "Miranda implores Curtis to babysit her son, C.J. pressures Malik to join the workforce, and Lisa and Malik get an unexpected crash course in parenting."
      },
      {
        "id": "tvmaze:1988990",
        "title": "Ya' Hearrrd Me",
        "season": 9,
        "episode": 24,
        "released": "2021-01-06",
        "overview": "Ella suspects there are deeper issues behind Lisa and Malik's fight over a toilet seat, and Curtis's relationship advice to his nephew backfires."
      },
      {
        "id": "tvmaze:2000315",
        "title": "Woman of the Night",
        "season": 9,
        "episode": 25,
        "released": "2021-01-13",
        "overview": "Ella is disturbed by what she finds when she drops in on Malik and Lisa, Miranda makes assumptions about her dinner date with Calvin, and C.J. responds to a red alert."
      },
      {
        "id": "tvmaze:2083668",
        "title": "Whiplash",
        "season": 10,
        "episode": 1,
        "released": "2021-05-25",
        "overview": "While recovering from his injuries, C.J. comes under investigation for his conduct during the fire, and Lisa feels judged by Malik's family."
      },
      {
        "id": "tvmaze:2095787",
        "title": "A Payneful Lesson",
        "season": 10,
        "episode": 2,
        "released": "2021-06-01",
        "overview": "Calvin tries to impress Laura by cooking her an elegant meal, and C.J. resists his family's attempts to help him while he recuperates."
      },
      {
        "id": "tvmaze:2102079",
        "title": "All Lumped Together",
        "season": 10,
        "episode": 3,
        "released": "2021-06-08",
        "overview": "Ella receives alarming news after a routine mammogram, and Malik is in danger of losing his scholarship after he's had to shoulder the responsibilities of his household."
      },
      {
        "id": "tvmaze:2105905",
        "title": "Back That Thang Up",
        "season": 10,
        "episode": 4,
        "released": "2021-06-15",
        "overview": "Calvin and Floyd help Ella around the house, C.J. seeks alternative treatments for his back problems, and a car robbery takes everyone by surprise."
      },
      {
        "id": "tvmaze:2110838",
        "title": "Sauce Bosses",
        "season": 10,
        "episode": 5,
        "released": "2021-06-22",
        "overview": "C.J. tries to talk Floyd out of selling the family barbecue sauce recipe, and Calvin grows concerned when he learns Miranda wants to buy a gun for protection."
      },
      {
        "id": "tvmaze:2115619",
        "title": "Missing Mustard Seeds",
        "season": 10,
        "episode": 6,
        "released": "2021-06-29",
        "overview": "Curtis offers to cook for Ella's event after his harsh review prompts her caterer to cancel, and Malik alarms his family members with philosophical questions about life and religion."
      },
      {
        "id": "tvmaze:2119237",
        "title": "In the Hot Seat",
        "season": 10,
        "episode": 7,
        "released": "2021-07-06",
        "overview": "As Calvin and Laura prepare for premarital counseling, Curtis steps in to give them relationship advice of his own, which leaves the couple at odds with each other."
      },
      {
        "id": "tvmaze:2123041",
        "title": "Karen",
        "season": 10,
        "episode": 8,
        "released": "2021-07-13",
        "overview": "Calvin's life is turned upside down when a white woman posts false theft accusations against him on social media, and C.J. is disappointed to learn that Malik doesn't vote."
      },
      {
        "id": "tvmaze:2184378",
        "title": "Me Against the World",
        "season": 10,
        "episode": 9,
        "released": "2021-10-12",
        "overview": "Ella plans a family game night, but things get awkward when Miranda shows up to the party, and Clarence suspects Floyd is trolling him online."
      },
      {
        "id": "tvmaze:2192174",
        "title": "Pow Wow at the Paynes",
        "season": 10,
        "episode": 10,
        "released": "2021-10-19",
        "overview": "After a police shooting at a music festival, Malik joins a protest to demand the release of bodycam footage, and Ella tries to be supportive of Lisa's jewelry-making ambitions."
      },
      {
        "id": "tvmaze:2196704",
        "title": "Bearer of Bad News",
        "season": 10,
        "episode": 11,
        "released": "2021-10-26",
        "overview": "Ella steps in as mediator when Miranda refuses to allow her son to participate in Calvin and Laura's upcoming wedding, and C.J. worries that Lisa may have betrayed Malik."
      },
      {
        "id": "tvmaze:2202272",
        "title": "Fake Newsletters",
        "season": 10,
        "episode": 12,
        "released": "2021-11-02",
        "overview": "Things get ugly between Curtis and C.J. as they face off against each other in a contentious local election, and Ella tries her hand as a life coach to Lisa."
      },
      {
        "id": "tvmaze:2207458",
        "title": "Home Invaders",
        "season": 10,
        "episode": 13,
        "released": "2021-11-09",
        "overview": "Ella's house is turned upside down thanks to a termite problem, and Malik tries to take control when his living situation with Lisa gets increasingly frustrating."
      },
      {
        "id": "tvmaze:2209766",
        "title": "DNAin't",
        "season": 10,
        "episode": 14,
        "released": "2021-11-16",
        "overview": "Floyd arranges genetic testing for the family to prove he has superior African DNA, and Calvin prepares Malik for his upcoming road trip across the country with Lisa."
      },
      {
        "id": "tvmaze:2215071",
        "title": "Stop Shop and Roll",
        "season": 10,
        "episode": 15,
        "released": "2021-11-23",
        "overview": "Floyd leads a home safety training session for the family, Ella covers up her online shopping addiction, and Lisa bets Malik that he can't stay off his phone for 24 hours."
      },
      {
        "id": "tvmaze:2219080",
        "title": "Paynefully Honest",
        "season": 10,
        "episode": 16,
        "released": "2021-11-30",
        "overview": "Calvin and Miranda struggle to navigate coparenting with Laura in the picture, and Ella plans an intimate night to reconnect with Curtis."
      },
      {
        "id": "tvmaze:2223686",
        "title": "Wondering Prince",
        "season": 10,
        "episode": 17,
        "released": "2021-12-07",
        "overview": "C.J.'s excited about his high school reunion, but his Prince versus Stevie Wonder debate with Floyd and Calvin may cost him his caterer, and Lisa teaches Miranda how to navigate dating apps."
      },
      {
        "id": "tvmaze:2230138",
        "title": "A Little Discipline",
        "season": 10,
        "episode": 18,
        "released": "2021-12-14",
        "overview": "Miranda flies off the handle when she learns Laura disciplined Christian, and Malik is conflicted when he suspects his prospective employer is racist."
      },
      {
        "id": "tvmaze:2234560",
        "title": "A Payneful Compromise",
        "season": 10,
        "episode": 19,
        "released": "2021-12-21",
        "overview": "Calvin, C.J. and Ella join forces to help Floyd get in better shape after finding out he is prediabetic, and Calvin grows increasingly frustrated with Miranda's frequent visits."
      },
      {
        "id": "tvmaze:2239949",
        "title": "Fine Wine",
        "season": 10,
        "episode": 20,
        "released": "2022-01-04",
        "overview": "Calvin assures his skeptical family he's ready to give up his playboy ways and settle down for good with Laura, but an encounter with a beautiful realtor tests his resolve."
      },
      {
        "id": "tvmaze:2245860",
        "title": "The First Day",
        "season": 10,
        "episode": 21,
        "released": "2022-01-11",
        "overview": "C.J. obsesses over being in tip-top shape for his first day back at work, and Miranda's request for more child support interferes with Calvin's and Laura's extravagant wedding plans."
      },
      {
        "id": "tvmaze:2248879",
        "title": "Payneful Suffering",
        "season": 10,
        "episode": 22,
        "released": "2022-01-18",
        "overview": "In preparation for Janine's early return home, Lisa insists on making a special dinner to impress her, Curtis and Ella catch wind of damaging family drama, and C.J. receives unexpected news."
      },
      {
        "id": "tvmaze:2297220",
        "title": "What's in a Payne Name",
        "season": 11,
        "episode": 1,
        "released": "2022-03-23",
        "overview": "Malik and Lisa can't agree on a name for their newborn baby, C.J. worries about Janine as reports of a plane incident come in, and Calvin offers relationship advice to Malik."
      },
      {
        "id": "tvmaze:2298245",
        "title": "Major Payne",
        "season": 11,
        "episode": 2,
        "released": "2022-03-30",
        "overview": "As the pressure mounts for Lisa to choose her college classes, she envisions what her future would be like down different career paths."
      },
      {
        "id": "tvmaze:2301775",
        "title": "Bag Men",
        "season": 11,
        "episode": 3,
        "released": "2022-04-06",
        "overview": "After Curtis starts a new family food truck business, his chief of operations Lisa is upset to learn that Malik is receiving a higher wage despite having a subordinate role."
      },
      {
        "id": "tvmaze:2305979",
        "title": "H.O. Hate",
        "season": 11,
        "episode": 4,
        "released": "2022-04-13",
        "overview": "Curtis sets his sights on retaliation when the new HOA president threatens to shut down the grand opening of his food truck."
      },
      {
        "id": "tvmaze:2310020",
        "title": "Meme, Myself and I",
        "season": 11,
        "episode": 5,
        "released": "2022-04-20",
        "overview": "CJ discovers more than he wants to know when he attempts to bond with his kids via social media, and fame goes to Curtis's head when his comical rants turn him into a viral sensation."
      },
      {
        "id": "tvmaze:2313322",
        "title": "Good Will Nothing",
        "season": 11,
        "episode": 6,
        "released": "2022-04-27",
        "overview": "Ella talks Curtis into writing his will after the sudden passing of a friend, and when the rest of the family realizes a potential inheritance is in play, they all start sucking up."
      },
      {
        "id": "tvmaze:2318319",
        "title": "Payne-Ting",
        "season": 11,
        "episode": 7,
        "released": "2022-05-04",
        "overview": "Calvin and Malik question everything they know about love and fidelity when they unearth Ella's old diary and find her passionate love poems addressed to someone other than Curtis."
      },
      {
        "id": "tvmaze:2322007",
        "title": "A Payne-Ful Interview",
        "season": 11,
        "episode": 8,
        "released": "2022-05-11",
        "overview": "Calvin and Ella help Curtis prepare for an interview to promote his BBQ sauce on one of Atlanta's hottest shows, and Malik learns about Lisa's responsibilities while taking care of MaLisa."
      },
      {
        "id": "tvmaze:2325027",
        "title": "Woman to Woman",
        "season": 11,
        "episode": 9,
        "released": "2022-05-18",
        "overview": "Malik educates C.J. and Lisa about criminal justice reform, and Miranda and Laura clash over a gift for Christian and their distinct roles in his life."
      },
      {
        "id": "tvmaze:2328476",
        "title": "It Was All a Dream",
        "season": 11,
        "episode": 10,
        "released": "2022-05-25",
        "overview": "Calvin sends flirty texts to Miranda after a raucous night out with his friends, and C.J. gives Malik an important lesson about marriage and fatherhood."
      },
      {
        "id": "tvmaze:2394177",
        "title": "Paynful Pain",
        "season": 11,
        "episode": 11,
        "released": "2022-10-12",
        "overview": "Curtis shows Ella how much he appreciates her by recreating their first date and planning a sweet surprise for their anniversary, and Laura takes offense to Calvin's constant teasing."
      },
      {
        "id": "tvmaze:2412328",
        "title": "Going to the Chapel and Not Getting Married",
        "season": 11,
        "episode": 12,
        "released": "2022-10-19",
        "overview": "Curtis's scheming and reluctance to spend money on his and Ella's vow renewal ceremony has Ella reconsidering her recommitment."
      },
      {
        "id": "tvmaze:2416501",
        "title": "Unwelcomed Neighbors",
        "season": 11,
        "episode": 13,
        "released": "2022-10-26",
        "overview": "Curtis draws the family into his web of paranoia when he spots unusual activity at the vacant house across the street, and Laura questions Calvin's financial generosity towards Miranda."
      },
      {
        "id": "tvmaze:2418671",
        "title": "Cracked Nest Egg",
        "season": 11,
        "episode": 14,
        "released": "2022-11-02",
        "overview": "Calvin injures his foot at the church's run-down help center, and Curtis and Ella argue about using their retirement funds to update the building."
      },
      {
        "id": "tvmaze:2422108",
        "title": "The Paranoid and the Private",
        "season": 11,
        "episode": 15,
        "released": "2022-11-09",
        "overview": "Curtis panics when he discovers a prized possession missing from his food truck, and Miranda's idea to send Christian to a private school leaves Calvin conflicted."
      },
      {
        "id": "tvmaze:2426252",
        "title": "Of Mice and Men",
        "season": 11,
        "episode": 16,
        "released": "2022-11-16",
        "overview": "When a mouse turns up in the house and disturbs Ella's peace, Curtis explores extermination methods and turns the house into a war zone, plus Malik lands a new job at a medical dispensary."
      },
      {
        "id": "tvmaze:2430292",
        "title": "Insecurity System",
        "season": 11,
        "episode": 17,
        "released": "2022-11-23",
        "overview": "Miranda helps Ella feng shui her living room, Malik lets Laura test-drive a drone from the fire department, and Calvin helps C.J. install a security system with audio-visual capabilities."
      },
      {
        "id": "tvmaze:2434767",
        "title": "Hashtag Help",
        "season": 11,
        "episode": 18,
        "released": "2022-11-30",
        "overview": "Ella enlists Lisa to create a viral campaign for the church's help center, and Calvin gives Curtis some pointers for launching his Sauce Boss brand."
      },
      {
        "id": "tvmaze:2437636",
        "title": "Mr. Bills",
        "season": 11,
        "episode": 19,
        "released": "2022-12-07",
        "overview": "Curtis regrets his overreaction to Ella's spending habits when she starts cutting back on luxuries like delicious food and premium channels, and C.J. dives into the world of cryptocurrency."
      },
      {
        "id": "tvmaze:2442549",
        "title": "Coco Parenting",
        "season": 11,
        "episode": 20,
        "released": "2022-12-14",
        "overview": "C.J. faces insecurity when Janine's new out-of-town job changes the roles at home, and Calvin and Miranda reevaluate their parenting when Christian is suspended for repeated bullying."
      },
      {
        "id": "tvmaze:2446503",
        "title": "So Nice to Meat You",
        "season": 11,
        "episode": 21,
        "released": "2022-12-21",
        "overview": "Curtis becomes suspicious when Glo presents him with an overly generous apology gift, while Calvin's friend Peanut thinks he may have found his sugar mama."
      },
      {
        "id": "tvmaze:2457641",
        "title": "Payneful Patriach",
        "season": 11,
        "episode": 22,
        "released": "2022-12-28",
        "overview": "Malik's promising new business opportunity leads to a complex political argument with C.J., and Curtis's dispute with bossy neighbor Glo over an HOA violation has shocking consequences."
      },
      {
        "id": "tvmaze:2502922",
        "title": "Like New Money",
        "season": 12,
        "episode": 1,
        "released": "2023-03-22",
        "overview": "Curtis suspects his food truck was blown up intentionally, and he starts investigating the incident; Calvin must get to the bottom of Calvin Jr.'s mischievous deeds."
      },
      {
        "id": "tvmaze:2508027",
        "title": "Just Payne Trippin",
        "season": 12,
        "episode": 2,
        "released": "2023-03-29",
        "overview": "The family has trouble adjusting to Jazmine's new found independence. Miranda gets an offer that Calvin would like for her to refuse."
      },
      {
        "id": "tvmaze:2511296",
        "title": "Les Boss Sauce",
        "season": 12,
        "episode": 3,
        "released": "2023-04-05",
        "overview": "Curtis becomes infuriated when his sauce gets bootlegged; Malik orchestrates a date night to rejuvenate his relationship with Lisa."
      },
      {
        "id": "tvmaze:2516981",
        "title": "One Legged Funeral Director",
        "season": 12,
        "episode": 4,
        "released": "2023-04-12",
        "overview": "Calvin's domineering side rears its ugly head when he begins coaching his son's soccer team; Miranda has everyone up in arms regarding a novel she's selfpublished."
      },
      {
        "id": "tvmaze:2521947",
        "title": "Forget Me Not",
        "season": 12,
        "episode": 5,
        "released": "2023-04-19",
        "overview": "Curtis is involved in an accident that alters his personality; C.J. takes over the twins' school project and strives for excellence."
      },
      {
        "id": "tvmaze:2525662",
        "title": "Encouragement",
        "season": 12,
        "episode": 6,
        "released": "2023-04-26",
        "overview": "Calvin hosts a dinner to meet Laura's parents for the first time; C.J. struggles with failing the physical aptitude test."
      },
      {
        "id": "tvmaze:2531172",
        "title": "Balancing Payne",
        "season": 12,
        "episode": 7,
        "released": "2023-05-03",
        "overview": "When Miranda askes Calvin to switch weekends with the boys, he agrees, totally disregarding the fact that he and Laura have plans. Meanwhile When Curtis and Floyd have a fight about business, Floyd decides to open his own food truck."
      },
      {
        "id": "tvmaze:2536790",
        "title": "Paynes in the Butt",
        "season": 12,
        "episode": 8,
        "released": "2023-05-10",
        "overview": "Ella decides to go against the grain and use technology instead of paying someone to do repairs. Malik and Lisa's argument causes discord between C.J. and Janine."
      },
      {
        "id": "tvmaze:2542122",
        "title": "Deena",
        "season": 12,
        "episode": 9,
        "released": "2023-05-17",
        "overview": "Lisa introduces the Paynes to her materialistic, larger-than-life mom Deena when she shows up unannounced, and Ella and Miranda create a vlog to raise money for the church's help center."
      },
      {
        "id": "tvmaze:2547009",
        "title": "The New Praisers",
        "season": 12,
        "episode": 10,
        "released": "2023-05-24",
        "overview": "Jazmine seeks Ella's guidance as she starts a Bible study group at her college, and Laura insists Calvin draws stronger boundaries with Miranda."
      },
      {
        "id": "tvmaze:2599854",
        "title": "Model Behavior",
        "season": 12,
        "episode": 11,
        "released": "2023-08-16",
        "overview": "A new smart home device makes Curtis paranoid about technology, and Malik grows suspicious after Lisa gets approached by a modeling photographer."
      },
      {
        "id": "tvmaze:2613849",
        "title": "I Am Handy Woman, Hear Me Roar",
        "season": 12,
        "episode": 12,
        "released": "2023-08-16",
        "overview": "C.J. and Janine get drawn into Malik and Lisa's disagreement about love languages, and Ella is determined to prove Curtis wrong when he casts doubt on her DIY home maintenance skills."
      },
      {
        "id": "tvmaze:2613850",
        "title": "Make It Rain",
        "season": 12,
        "episode": 13,
        "released": "2023-08-16",
        "overview": "Laura's discomfort with Calvin's bachelor party threatens to throw a wrench in his plans, and as Malik struggles to build a toy for MaLisa, Curtis and C.J. want to show him how it's done."
      },
      {
        "id": "tvmaze:2619262",
        "title": "Say My Name",
        "season": 12,
        "episode": 14,
        "released": "2023-08-23",
        "overview": "Miranda struggles to find her footing as she jumps back into the dating scene to get over Calvin, and C.J. fights off bad luck after a chain email seemingly works its magic on him."
      },
      {
        "id": "tvmaze:2619263",
        "title": "Out In the Open",
        "season": 12,
        "episode": 15,
        "released": "2023-08-23",
        "overview": "After a tragedy at work, CJ encourages his family to be more open about their mental health, and Miranda confides in Ella about missing the physical aspects of being in a relationship."
      },
      {
        "id": "tvmaze:2619264",
        "title": "Zaddy",
        "season": 12,
        "episode": 16,
        "released": "2023-08-23",
        "overview": "Jazmine considers dropping her educational ambitions when the glamorous influencer life tempts her, and CJ fights to convince her that fast fame and easy money aren't really so easy."
      },
      {
        "id": "tvmaze:2625018",
        "title": "El Capitan",
        "season": 12,
        "episode": 17,
        "released": "2023-08-30",
        "overview": "Curtis becomes the neighborhood watch Captain and the power goes to his head, much to the demise of the family. Meanwhile, Jazmine tries to convince CJ and Malik that they can enjoy the games with healthy food."
      },
      {
        "id": "tvmaze:2625019",
        "title": "To Jump or Not To Jump",
        "season": 12,
        "episode": 18,
        "released": "2023-08-30",
        "overview": "Laura grapples with anxiety over traditional marital expectations as her wedding date nears, and Curtis and Gloria face off after he asks Malik and Jazzy paint the front door."
      },
      {
        "id": "tvmaze:2625020",
        "title": "They Call Me Chef Payne",
        "season": 12,
        "episode": 19,
        "released": "2023-08-30",
        "overview": "C.J. and Jazmine help Jayden overcome his stage fright before he performs in a school play, and Calvin and Laura crush Curtis's dream of catering their wedding."
      },
      {
        "id": "tvmaze:2625021",
        "title": "Run Them Pockets",
        "season": 12,
        "episode": 20,
        "released": "2023-09-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2625022",
        "title": "Double Trouble",
        "season": 12,
        "episode": 21,
        "released": "2023-09-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2625023",
        "title": "True Measures",
        "season": 12,
        "episode": 22,
        "released": "2023-09-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2977665",
        "title": "Piece By Piece",
        "season": 13,
        "episode": 1,
        "released": "2024-08-13",
        "overview": "Calvin teams up with his ex-wife Miranda to get to the bottom of why Laura broke off their engagement, while also working with Ella to repair his relationship with Calvin Jr. Meanwhile, Curtis and Floyd attempt to get publicity for their BBQ sauce brand by hosting their own cooking show on TV... if only they can get out of their own way."
      },
      {
        "id": "tvmaze:2977887",
        "title": "Adjust Your Crown, Sis",
        "season": 13,
        "episode": 2,
        "released": "2024-08-20",
        "overview": "When Ella sponsors the membership of the new wife of a longtime dea-con into her social club, Incomparable Crowns, she begins to suspect something may be going on behind closed doors in the new marriage."
      },
      {
        "id": "tvmaze:2980846",
        "title": "No Bueno",
        "season": 13,
        "episode": 3,
        "released": "2024-08-27",
        "overview": "Jazmine reminds a forgetful C.J. about his first wedding anniversary. Curtis and Ella bring over a cake called No Bueno to celebrate, only to learn there is no celebration to be had."
      },
      {
        "id": "tvmaze:2983752",
        "title": "Failure to Succeed",
        "season": 13,
        "episode": 4,
        "released": "2024-09-03",
        "overview": "Malik is thrilled when he lands an interview with councilman he idolizes, but he finds out that getting the job is only half the battle; Curtis fails a health inspection, forcing him to modify his barbecue recipe to disastrous results."
      },
      {
        "id": "tvmaze:2989114",
        "title": "Love Yourz",
        "season": 13,
        "episode": 5,
        "released": "2024-09-10",
        "overview": "A concerned Calvin enlists his quirky friends Pookie and Peanut to help his struggling son, Calvin Jr., with math. Meanwhile, Malik's attempt to impress Councilman Dustman at a family dinner backfires due to his family's embarrassing behavior."
      },
      {
        "id": "tvmaze:2994612",
        "title": "The Chicken or the Egg",
        "season": 13,
        "episode": 6,
        "released": "2024-09-17",
        "overview": "Curtis searches for reasonably priced eggs in the middle of a city-wide egg shortage; Lisa attempts to gain professional work experience by going to work with the Paynes."
      },
      {
        "id": "tvmaze:3004014",
        "title": "I Wanna Dance With Somebody",
        "season": 13,
        "episode": 7,
        "released": "2024-09-24",
        "overview": "Calvin Jr.'s mom can't take him to the mother-son dance; Miranda and Laura compete to be her replacement."
      },
      {
        "id": "tvmaze:3006889",
        "title": "A Payneful Father's Day",
        "season": 13,
        "episode": 8,
        "released": "2024-10-01",
        "overview": "Ella organizes the women to plan a special Father's Day for the men in their lives; Floyd and Glo have their first argument as a couple."
      },
      {
        "id": "tvmaze:3013313",
        "title": "Hut-Hut Psyche",
        "season": 13,
        "episode": 9,
        "released": "2024-10-08",
        "overview": "Calvin wants Calvin Jr. to play football, but Ella thinks football is too dangerous and pushes him to play tennis instead."
      },
      {
        "id": "tvmaze:3024858",
        "title": "Final Answer",
        "season": 13,
        "episode": 10,
        "released": "2024-10-22",
        "overview": "Jazmine gets caught up in a cheating scandal at school; Curtis enlists the help of a vlogger to promote his food truck."
      },
      {
        "id": "tvmaze:3046855",
        "title": "All Hands on Deck",
        "season": 13,
        "episode": 11,
        "released": "2024-11-19",
        "overview": "Curtis calls on his family to help work the food truck. Malik is charged with creating a smear campaign and has a big decision to make."
      },
      {
        "id": "tvmaze:3053905",
        "title": "Breakup To Makeup",
        "season": 13,
        "episode": 12,
        "released": "2024-11-26",
        "overview": "When Miranda helps Calvin take care of a sick Christian, Calvin has a big realization."
      },
      {
        "id": "tvmaze:3076031",
        "title": "If It Ain't Broke",
        "season": 13,
        "episode": 13,
        "released": "2024-12-03",
        "overview": "Calvin and Jr. deal with the consequences of their big fight, and Miranda has to step in. CJ and Janine try to use some of the techniques they learned in couple's counseling as they put together a complicated entertainment center."
      },
      {
        "id": "tvmaze:3074808",
        "title": "House Of Funk",
        "season": 13,
        "episode": 14,
        "released": "2024-12-10",
        "overview": "Calvin and Laura try to teach the boys to clean up after themselves. Ella meets with the head deacon to discuss a tense situation, but she does not get the response she expected when she brings up some serious concerns."
      },
      {
        "id": "tvmaze:3078321",
        "title": "Barracuda Pool",
        "season": 13,
        "episode": 15,
        "released": "2024-12-17",
        "overview": "Curtis and Floyd go on a popular TV show where they pitch their BBQ sauce to potential investors, but their nonstop arguing puts their prospective deals in jeopardy."
      },
      {
        "id": "tvmaze:3084320",
        "title": "Paynefully Moving On",
        "season": 13,
        "episode": 16,
        "released": "2024-12-17",
        "overview": "Ella has become conflicted with the politics of her church and has to make a big decision."
      },
      {
        "id": "tvmaze:3172893",
        "title": "Tricks No Treats",
        "season": 13,
        "episode": 17,
        "released": "2025-03-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3181172",
        "title": "Love At First Swipe",
        "season": 13,
        "episode": 18,
        "released": "2025-04-01",
        "overview": ""
      },
      {
        "id": "tvmaze:3187350",
        "title": "House of Cards",
        "season": 13,
        "episode": 19,
        "released": "2025-04-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3199215",
        "title": "The Incomparable Ella",
        "season": 13,
        "episode": 20,
        "released": "2025-04-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3201603",
        "title": "Houston, We've Got a Problem",
        "season": 13,
        "episode": 21,
        "released": "2025-04-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3201604",
        "title": "House of Love",
        "season": 13,
        "episode": 22,
        "released": "2025-04-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3215535",
        "title": "House of Realization",
        "season": 14,
        "episode": 1,
        "released": "2025-04-30",
        "overview": "After a sit-down, Ella faces off with Elaine and confronts her about her true feelings towards Laura, and Malik gets creative about his parenting."
      },
      {
        "id": "tvmaze:3225328",
        "title": "Doing the Work",
        "season": 14,
        "episode": 2,
        "released": "2025-05-07",
        "overview": "Laura's temper gets the better of her in the wake of her unpleasant clash with the Paynes, and Ella's successful Bible study takes an unexpected turn when Mrs. Wellington arrives."
      },
      {
        "id": "tvmaze:3240908",
        "title": "House of Outrage",
        "season": 14,
        "episode": 3,
        "released": "2025-05-14",
        "overview": "Ella reveals her deep disdain for Laura, and C.J. and Curtis advise Calvin on the challenge of preserving his future marriage while also safeguarding his relationship with his mother."
      },
      {
        "id": "tvmaze:3233741",
        "title": "The Talk",
        "season": 14,
        "episode": 4,
        "released": "2025-05-21",
        "overview": "Ella confronts Laura in an attempt at reconciliation, and Janine must navigate unexpected challenges when Deena urgently requests to meet."
      },
      {
        "id": "tvmaze:3243443",
        "title": "House of Tough Decisions",
        "season": 14,
        "episode": 5,
        "released": "2025-05-28",
        "overview": "Tensions rise between Curtis and Floyd as a new potential business creates havoc, and Jazmine grapples with a challenging decision regarding a dishonest former classmate."
      },
      {
        "id": "tvmaze:3269613",
        "title": "House of Bad Neighbors",
        "season": 14,
        "episode": 6,
        "released": "2025-06-04",
        "overview": "The Payne family must innovate when Mrs. Wellington returns with a vengeance, and Calvin's relationship with Laura hits a turning point."
      },
      {
        "id": "tvmaze:3262074",
        "title": "Burying the Hatchet",
        "season": 14,
        "episode": 7,
        "released": "2025-06-11",
        "overview": "Ella seeks divine help when tempers flare between Laura and the Payne family, and Jazmine must decide whether to forgive her dishonest classmate."
      },
      {
        "id": "tvmaze:3270609",
        "title": "House of Probation",
        "season": 14,
        "episode": 8,
        "released": "2025-06-18",
        "overview": "Calvin and Laura receive unexpected news, Curtis and Glo join forces against Mrs. Wellington, and Calvin and Miranda navigate the complexities of co-parenting."
      },
      {
        "id": "tvmaze:3275571",
        "title": "House of Second Chances",
        "season": 14,
        "episode": 9,
        "released": "2025-06-25",
        "overview": "Jazmine grapples with a roller coaster of emotions during a group project, and Ella imparts crucial advice as Curtis and Floyd navigate the intricacies of business."
      },
      {
        "id": "tvmaze:3292540",
        "title": "Protector in Chief",
        "season": 14,
        "episode": 10,
        "released": "2025-07-02",
        "overview": "C.J. springs into action when tragedy strikes downtown, and Lisa is pulled from all angles at home."
      },
      {
        "id": "tvmaze:3424840",
        "title": "The Storm",
        "season": 14,
        "episode": 11,
        "released": "2025-11-05",
        "overview": "Sparks fly as Calvin and Miranda team up to express their disapproval of Laura's birthday gift for Christian. Calvin and Laura's relationship is on the rocks."
      },
      {
        "id": "tvmaze:3430499",
        "title": "House of Funk",
        "season": 14,
        "episode": 12,
        "released": "2025-11-12",
        "overview": ""
      },
      {
        "id": "tvmaze:3431486",
        "title": "House of Final Chapters",
        "season": 14,
        "episode": 13,
        "released": "2025-11-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3441637",
        "title": "A Brother's Love",
        "season": 14,
        "episode": 14,
        "released": "2025-11-26",
        "overview": ""
      }
    ]
  }
}