{
  "meta": {
    "id": "tvmaze:3248",
    "type": "series",
    "name": "Southern Charm",
    "description": "Southern Charm goes behind the walls of Charleston, South Carolina's most aristocratic families to reveal a world of exclusivity, money and scandal that goes back generations. The fast-paced, drama-filled docu-series follows six Charleston singles — Craig Conover, Cameran Eubanks, Jenna King, Thomas Ravenel, Shepard \"Shep\" Rose, and Whitney Sudler Smith — struggling with the constraints of this tight-knit, posh society. The cast, some descendants of Vice Presidents and four-term Senators, and others from \"new money,\" is comprised of Southern bachelors who suffer from \"Peter Pan Syndrome\" by refusing to settle down; and the women in their lives who challenge them to grow up. Viewers will see them launch political careers, build businesses, break hearts, and chase true love -- all while struggling to preserve their family names. Because in Charleston, you're only as good as your last garden party and one social screw-up can taint generations to come.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/598/1496648.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/598/1496648.jpg",
    "videos": [
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3443689",
        "title": "A Novel Approach",
        "season": 11,
        "episode": 3,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:219234",
        "title": "Peter Pan Sin-drome",
        "season": 1,
        "episode": 1,
        "released": "2014-03-02",
        "overview": "We meet our 6th generation (at least) Southern Charmers in all of their glory as they hit on women, roll their eyes at the guys who hit on women, drink profusely, and generally exercise bad judgment."
      },
      {
        "id": "tvmaze:219235",
        "title": "Sh-epic Fail!",
        "season": 1,
        "episode": 2,
        "released": "2014-03-10",
        "overview": "Thomas' search for a wife continues when he takes out a woman more age appropriate and thinks she could be the one...until she questions his felony past. Shep winds up breaking the bro code with Craig when a few cocktails lead to questionable decisions."
      },
      {
        "id": "tvmaze:219236",
        "title": "In the Cups",
        "season": 1,
        "episode": 3,
        "released": "2014-03-17",
        "overview": "Thomas brushes up on his French to take one more swing with Dani at a local French restaurant. Shep sits down with an old girlfriend to discuss the future of his rapscallion lifestyle. Jenna hosts a pool party to welcome folks to her new house south of Broad. Kathryn shows up with Whitney and drops a bomb on Thomas."
      },
      {
        "id": "tvmaze:219237",
        "title": "Is She or Isn't She?",
        "season": 1,
        "episode": 4,
        "released": "2014-03-24",
        "overview": "Is Kathryn pregnant? Is it Shep's or Thomas' baby? What should we wear to a white tie Carolina Day party? Tough questions. Fun times."
      },
      {
        "id": "tvmaze:219238",
        "title": "White Ties and White Lies",
        "season": 1,
        "episode": 5,
        "released": "2014-03-31",
        "overview": "Carolina Day is celebrated with a glamorous white tie party. Thomas decides to bring Kathryn as his official date, Whitney brings his assistant, Jenna and Cameran come together, Shep surprisingly doesn't bring MJ, and someone is threatened to be \"bitch slapped.\""
      },
      {
        "id": "tvmaze:219239",
        "title": "The Glass Menagerie is Half Full",
        "season": 1,
        "episode": 6,
        "released": "2014-04-07",
        "overview": "Thomas, wanting to make sure his friends don't make the same mistakes he has made, hosts a dinner to share with them his thoughts on their lives. Is there someone better to give people advice on relationships? Most certainly!"
      },
      {
        "id": "tvmaze:219240",
        "title": "The Third Man",
        "season": 1,
        "episode": 7,
        "released": "2014-04-14",
        "overview": "The crew escapes to Shep's family plantation for a pig hunt followed by a pig roast. They shoot guns, they meet the Boykin family historian, and Whitney reveals a disturbing secret to Thomas."
      },
      {
        "id": "tvmaze:219241",
        "title": "One of the Lost Boys Leaves Neverland",
        "season": 1,
        "episode": 8,
        "released": "2014-04-21",
        "overview": "It's July 4th and independence is on the mind. First for Whitney who shows off his new apartment away from Mom, second for Shep who makes sure that all of the women he's sleeping with attend Whitney's party, and third for Thomas -- fireworks fly and as one chapter ends and a brand new one begins."
      },
      {
        "id": "tvmaze:219242",
        "title": "Reunion",
        "season": 1,
        "episode": 9,
        "released": "2014-04-28",
        "overview": "The cast comes together for the first time to reveal what's new in their lives and to discuss some of the most-talked about moments this season. Plus, the relationship rollercoaster between Kathryn and Thomas takes center stage as the two reveal the current status of their love life. Andy Cohen hosts the Charleston crew as they chat about the highs and lows of the season."
      },
      {
        "id": "tvmaze:219243",
        "title": "Secrets Revealed",
        "season": 1,
        "episode": 10,
        "released": "2014-05-05",
        "overview": "Bravo will air Southern Charm's \"Secrets Revealed,\" an hour special which takes a look back at lost footage from Season 1 with never-before-seen cast interviews. From a fun weekend booze cruise and spooky sleepovers at Jenna's house, to the ultimate introduction of the season…adorable baby Kensington!"
      },
      {
        "id": "tvmaze:219244",
        "title": "Return to Neverland",
        "season": 2,
        "episode": 1,
        "released": "2015-03-16",
        "overview": "Why have one christening when you can have two? Kathryn and Thomas must plan a second christening of their daughter, Kensington Calhoun Ravenel, because the first godmother might have gotten a little too frisky with Thomas for Kathryn's liking and a new godmother has been chosen. Shep invites an old friend, Landon, to join him out at the plantation for the big day and Whitney, who disapproves of Thomas and Kathryn's relationship, makes a point of showing up late."
      },
      {
        "id": "tvmaze:219245",
        "title": "Guess Who's Coming to Dinner",
        "season": 2,
        "episode": 2,
        "released": "2015-03-23",
        "overview": "Thomas invites the gang to another one of his unpredictable dinner parties and this time he and Kathryn have some big news to share. As Cameran continues chasing her real estate dreams, Craig refuses to settle into office life. Meanwhile, Landon is ready to leave her old LA life behind and get back a Southern Lifestyle."
      },
      {
        "id": "tvmaze:219246",
        "title": "Raising the Roof",
        "season": 2,
        "episode": 3,
        "released": "2015-03-30",
        "overview": "Shep and Whitney finally move into their beach house as Kathryn confronts Jennifer Snowden about the true nature of her relationship with Thomas. Meanwhile, Cameran gives Craig some sisterly advice, which promptly goes in one ear and out the other. And after Thomas enlists Whitney's help in making the perfect campaign commercial his relationship with Kathryn takes a turn for the worse."
      },
      {
        "id": "tvmaze:219247",
        "title": "No Good Deed",
        "season": 2,
        "episode": 4,
        "released": "2015-04-06",
        "overview": "After Thomas tells Kathryn about his \"Raise the Roof\" campaign ad, she ditches him to spend the night with a friend before turning her ire towards the real culprit, Whitney. Meanwhile, Landon helps Cooper prep for his upcoming fashion show and Craig decides not to study for the bar in order to focus on his newly found passion for modeling. Cameran enlists Shep's help in her quest to get Craig back on the path to ambition and Whitney comes under attack when he comes face to face with Kathryn at Thomas' fundraiser."
      },
      {
        "id": "tvmaze:219248",
        "title": "Shep-istotle",
        "season": 2,
        "episode": 5,
        "released": "2015-04-13",
        "overview": "After another fundraiser goes awry, Thomas realizes it's time for Kathryn to get a hobby, so she won't further exacerbate his campaign stress and he agrees to move her downtown into a house she can decorate. Meanwhile, on the eve of Cooper and Landon's fashion show, Shep decides to stage an intervention with Craig before he becomes a lost cause. And Whitney vows to avoid Kathryn at all costs at the fashion show."
      },
      {
        "id": "tvmaze:219249",
        "title": "In the Cups",
        "season": 2,
        "episode": 6,
        "released": "2015-04-20",
        "overview": "As Shep plans his 35th birthday party, Cameran decides it might be time to get a dog so she can put off having a baby for just a little longer. Meanwhile, Thomas and Kathryn move downtown just as the campaign starts heating up. Despite hoping this will improve their relationship Kathryn starts to realize Thomas' campaign manager has other ideas. And when the gang finally gets together to celebrate at Shep's party things get old school."
      },
      {
        "id": "tvmaze:219250",
        "title": "Better Late Than Never",
        "season": 2,
        "episode": 7,
        "released": "2015-04-27",
        "overview": "Patricia hosts an all-male dinner party to avoid the drama that women can bring and Whitney and Thomas end up fighting like a couple of girls. Meanwhile, Craig is homesick for the Delaware and invites Shep and Whitney to his parents' house for the weekend, but not before Craig gets some potentially devastating news. When the gang gets dressed in their finest formal attire to attend Cooper's first annual Founders' Ball, Kathryn ends up home alone waiting for her Prince Charming, a.k.a. Thomas, to arrive."
      },
      {
        "id": "tvmaze:219251",
        "title": "Unaware in Delaware",
        "season": 2,
        "episode": 8,
        "released": "2015-05-04",
        "overview": "After the Founders Ball, Craig comes face-to-face with his boss and finally learns the consequences of his partying ways. Meanwhile, Kathryn resolves to become a different person and put her troubles with Thomas behind her. When Shep and Whitney head to Delaware to spend some quality time with the Conover clan, tensions run high as secrets are revealed and friendships are tested."
      },
      {
        "id": "tvmaze:219252",
        "title": "Jekyll and Snide",
        "season": 2,
        "episode": 9,
        "released": "2015-05-11",
        "overview": "Landon invites the gang to her hometown down in Georgia for a weekend getaway, but the mood changes when Shep's big brotherly advice turns into a sibling rivalry with Craig. Meanwhile, Whitney finds himself on the receiving end of Kathryn's wrath once again and after Craig and Kathryn spend the night on the beach alone rumors start flying until an explosive accusation threatens to upend Thomas' political aspirations."
      },
      {
        "id": "tvmaze:219253",
        "title": "Election Day",
        "season": 2,
        "episode": 10,
        "released": "2015-05-18",
        "overview": "As Election Day approaches, Thomas deals with the aftermath of the accusations against him and Kathryn makes a decision that could impact her family and relationship forever. Meanwhile, Whitney suspects Kathryn is behind the allegations and when the gang gathers at Sermets to hear the election results it turns out that no one is in the mood to celebrate."
      },
      {
        "id": "tvmaze:219254",
        "title": "Dysfunction Junction",
        "season": 2,
        "episode": 11,
        "released": "2015-05-25",
        "overview": "As Thomas adjusts to his new post-election life, Kathryn can't seem to let go of their old life together. Meanwhile, Patricia organizes a charity event to benefit \"Wounded Warriors\" and gets everyone involved; Whitney's band plays, and Shep and Craig agree to a date auction. When things don't go exactly as planned, relationships are pushed to the brink -- perhaps to never recover."
      },
      {
        "id": "tvmaze:219255",
        "title": "Reunion",
        "season": 2,
        "episode": 12,
        "released": "2015-06-01",
        "overview": "Kathryn Calhoun Dennis, Landon Clements, Craig Conover, Cameran Eubanks, Thomas Ravenel, Shepard \"Shep\" Rose and Whitney Sudler-Smith come together for the first time to divulge what's new in their lives and discuss some of the most-talked about highlights from this season. Andy Cohen hosts the Charleston crew as they set the record straight on all the drama and take a look back at some of the most memorable moments from season two."
      },
      {
        "id": "tvmaze:663512",
        "title": "HashtagNewCraig",
        "season": 3,
        "episode": 1,
        "released": "2016-04-04",
        "overview": "Craig returns to Charleston determined to prove he's a changed man. Together with his new girlfriend, Craig throws himself a \"welcome back\" party at his new digs and invites the gang to get back together again. Unfortunately, the feeling isn't mutual as Shep and Craig's bromance is still on the rocks. Meanwhile, Thomas and Kathryn have officially called it quits, with baby #2 on the way their tumultuous romance continues to create a wedge between them and their circle of friends."
      },
      {
        "id": "tvmaze:663513",
        "title": "Miss Domesticated",
        "season": 3,
        "episode": 2,
        "released": "2016-04-11",
        "overview": "As Thomas slowly comes to the realization that he and Kathryn need to co-parent peacefully, Cameran decides to show off her burgeoning domestic skills by throwing a dinner party. Unfortunately, the guest list isn't as inclusive as some would like and tensions flare as Craig is put in the awkward position of coming to Kathryn's defense. Meanwhile, Shep continues to play the field and Landon starts to feel the economic pinch of her divorce."
      },
      {
        "id": "tvmaze:694496",
        "title": "Hold Your Horses",
        "season": 3,
        "episode": 3,
        "released": "2016-04-18",
        "overview": "As Craig settles in to his new job working for JD, Cameran recruits Shep to be her real estate partner. Meanwhile, Landon hits her dad up for cash and Kathryn begs Thomas to co-sign the lease on her new house, but that deal comes with strings attached. So, when Kathryn and Kensie head out of town to watch Thomas play polo a family day turns into an epic showdown."
      },
      {
        "id": "tvmaze:694497",
        "title": "Birds of a Feather...",
        "season": 3,
        "episode": 4,
        "released": "2016-04-25",
        "overview": "When Kathryn's pregnancy complications motivate Thomas to finally co-sign the lease on her new house, JD and Landon question the veracity of Kathryn's claims. Meanwhile, Cameran considers going to a therapist to help her understand her reluctance about motherhood. Craig stirs the pot when he questions Thomas' commitment to his baby mama, which, in turn, causes Thomas to unleash his wrath on Kathryn's BFF, Jennifer Snowden at Patricia's Flamingo party."
      },
      {
        "id": "tvmaze:704644",
        "title": "Invite-gate",
        "season": 3,
        "episode": 5,
        "released": "2016-05-02",
        "overview": "While Craig continues to question the real reason why Kathryn is on the outs, Shep considers settling down with one lucky lady. Meanwhile, Kathryn comes to terms with her volatile past and attempts to make her way back into the group by reaching out to Cameran. Landon prepares for a \"Shepic\" birthday party, which leaves Shep wondering if Landon even knows him at all."
      },
      {
        "id": "tvmaze:750883",
        "title": "Beast of Bourbon",
        "season": 3,
        "episode": 6,
        "released": "2016-05-09",
        "overview": "After experiencing a string of rejections, Kathryn reaches out to an old friend in hopes of making amends. Meanwhile, Landon nervously heads to New York for the opportunity of a lifetime as Thomas grows increasingly fearful for the health of his unborn child and turns to Shep for help. When Craig takes a big step forward in his relationship with Naomie, he receives a crushing blow from JD at work that sets him two steps back."
      },
      {
        "id": "tvmaze:751039",
        "title": "Blue Ridge Mountain Blues",
        "season": 3,
        "episode": 7,
        "released": "2016-05-16",
        "overview": "Tired of the anti-Kathryn brigade, Craig digs deep into the past to get to the root of all the animosity. Meanwhile, Cameran reveals more than she bargained for in her first therapy session and Thomas wonders if Kathryn is sincere when she gives him the okay to go to North Carolina. And just as the gang settles into the serenity of the mountains, it all unravels as secrets are revealed and friendships tested."
      },
      {
        "id": "tvmaze:751050",
        "title": "Whit's End",
        "season": 3,
        "episode": 8,
        "released": "2016-05-23",
        "overview": "When Craig voices his theory about Whitney and Kathryn, he learns that not everyone shares his opinion. With the mountain trip ruined and the group dynamic strained, Craig embarks on a road to redemption to salvage his friendships with Cameran and Whitney before he becomes odd man out. Meanwhile, back in Charleston Kathryn breaks the news to Thomas that the baby is coming ahead of schedule, thwarting his plans for a guys' weekend in L.A."
      },
      {
        "id": "tvmaze:751061",
        "title": "Saint and Sinners",
        "season": 3,
        "episode": 9,
        "released": "2016-05-30",
        "overview": "As Thomas and Kathryn get ready to welcome their son into the world, JD questions whether Thomas is actually the father. Meanwhile, Craig leaves his Gentry responsibilities behind and heads to LA for a boys' weekend and to make amends with Whitney. And as Shep enjoys the single life in LA, Landon reveals to Cameran that she's been harboring feelings for her bestie all along."
      },
      {
        "id": "tvmaze:783884",
        "title": "From Here to Paternity",
        "season": 3,
        "episode": 10,
        "released": "2016-06-06",
        "overview": "With the arrival of their son St. Julien, Thomas and Kathryn begin taking 'baby' steps towards a possible reconciliation. Meanwhile, Shep is dealt a blow in his relationship with Bailey, but will a surprising declaration from Landon help mend his broken heart? Meanwhile, Craig reconnects with his former boss to get advice about returning to the world of law, and a talk between Cameran and her mom about having children leads to an unexpected conclusion. And when Patricia hosts an all male dinner honoring Thomas' newborn son, shocking revelations and fiery accusations give the proud father little reason to celebrate."
      },
      {
        "id": "tvmaze:783902",
        "title": "Words of Wisdom",
        "season": 3,
        "episode": 11,
        "released": "2016-06-13",
        "overview": "After questions about Baby Julien's paternity arise, Thomas is determined to prove that Kathryn and the kids should not be overlooked. Meanwhile, Patricia takes Landon under her wing to show her how to make Shep swoon. And when Thomas hosts a dinner party to celebrate his new house and new family, a toast that's meant to bring the gang together, just might tear them apart forever."
      },
      {
        "id": "tvmaze:783913",
        "title": "Founder's Brawl",
        "season": 3,
        "episode": 12,
        "released": "2016-06-20",
        "overview": "In the aftermath of T-Rav's dinner party, Kathryn relishes the fact that Thomas finally had her back against Landon. Meanwhile, JD and Whitney stage an intervention to air their concerns over Thomas' erratic behavior. And just as things in Charleston seem to be simmering down, the gang gets together at the second annual Founder's Ball where all the tension comes to a boil."
      },
      {
        "id": "tvmaze:786180",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 13,
        "released": "2016-06-27",
        "overview": "The cast of Southern Charm rehashes the tumultuous season in the first episode of the two-part reunion. #NewCraig is put in the hot seat, Cameran gets called out for being a mean girl and Shep recounts a surprise prison stint. And as Thomas and Kathryn's touchy relationship continues to be in the news thanks to new allegations, it's the simmering resentment between Landon and Kathryn that forces one cast member to walk off set."
      },
      {
        "id": "tvmaze:848013",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 14,
        "released": "2016-07-05",
        "overview": "On the dramatic conclusion of the Southern Charm reunion, Kathryn and Landon continue to argue over the details of Landon and Thomas' alleged relationship. Meanwhile, Jennifer Snowden admits a shocking new twist in her liaison with Thomas. Shep and Craig try to stay above the fray and in doing so expose their true allegiances. And, a surprise reconciliation between two former foes has Cameran speechless."
      },
      {
        "id": "tvmaze:1075500",
        "title": "While the Kat's Away...",
        "season": 4,
        "episode": 1,
        "released": "2017-04-03",
        "overview": "Summer is over and the hot mess express has rolled back into town. Thomas has full custody of his two children and has risen to the challenge of being a single dad, by mostly giving up his former playboy lifestyle. Shep, however continues to be Charleston's perennial bachelor and now, thanks to Craig's lying ways, has a new wingman, Austen. Not only does Austen look like a younger version of Shep, he's also giving him a run for his money with the ladies. Cameran, meanwhile, is still determined to see Shep settle down and is convinced she knows just the girl who can reel him in. On the other side of town Landon, who after fleeing the rumors unleashed by Kathryn's accusations, is back in Charleston with a new boyfriend and determined to turn her travel website, into a success. Meanwhile, after a stint in rehab over the summer Kathryn has returned, and according to Thomas, refusing to take a drug test. Or is she?"
      },
      {
        "id": "tvmaze:1112258",
        "title": "Roamin' Holiday",
        "season": 4,
        "episode": 2,
        "released": "2017-04-10",
        "overview": "As Cameran gets a sneak peek at motherhood, Kathryn's trip to Malibu proved to be more than just sun bathing and surfing. Meanwhile, Shep confronts Craig once again about the true nature of his legal career, but leaves their friendship on the field. And as Landon prepares to launch her website, a new romance begins to percolate as Thomas realizes he needs a step-mother for his children."
      },
      {
        "id": "tvmaze:1112259",
        "title": "Step and Release",
        "season": 4,
        "episode": 3,
        "released": "2017-04-17",
        "overview": "Craig attempts to \"adult\" by helping Naomie throw a fundraiser, but the differences in their planning styles threatens to expose the cracks in their relationship. Meanwhile, Kathryn takes steps to become more responsible, just as Thomas decides it's time to rekindle his friendship with Landon. Later, it seems that Cameran's matchmaking skills are finally paying off after Shep and Chelsea share a romantic evening together. But when Shep leaves town without making his intentions known, Austen swoops in to take his place."
      },
      {
        "id": "tvmaze:1112260",
        "title": "Shepwrecked",
        "season": 4,
        "episode": 4,
        "released": "2017-04-24",
        "overview": "Kathryn struggles with supervised visitation with her children as Craig judges Thomas' parenting style. However, while Craig meddles in the affairs of his friends, his life with Naomie is slowly starting to fall apart. Meanwhile, at Shep's 37th birthday party Whitney confronts Landon about her true feelings for Thomas, while Cameran tries to convince Shep it's not too late to win Chelsea back before she sails off into the sunset with Austen."
      },
      {
        "id": "tvmaze:1149992",
        "title": "Craig of All Trades, Master of None",
        "season": 4,
        "episode": 5,
        "released": "2017-05-01",
        "overview": "Cameran turns to the supernatural in hopes of finding her life's purpose, while Thomas takes a leap of faith by asking Landon out on a date. Shep confronts Austen about his bro-code violation over a game of basketball and faces a health scare in the process. Naomie reaches her boiling point when she learns of Craig's latest endeavor, and tensions rise when she questions his plans for the future."
      },
      {
        "id": "tvmaze:1149995",
        "title": "To Liver and Die in Charleston",
        "season": 4,
        "episode": 6,
        "released": "2017-05-08",
        "overview": "After going to the doctor, Shep receives some shocking news about his health causing him to take a step back from his party boy ways. Meanwhile, love is in the air as Austen and Chelsea deepen their romantic bond, and Thomas and Landon's connection is tested over a casual dinner at Patricia's house. And when Jennifer hosts a Sip and See to celebrate her new baby, Craig finally seals the deal on an investment property while his relationship with Naomie continues to unravel."
      },
      {
        "id": "tvmaze:1149997",
        "title": "Fowl Play",
        "season": 4,
        "episode": 7,
        "released": "2017-05-15",
        "overview": "As Kathryn contemplates a reunion with the father of her children, Patricia continues to push Landon and Thomas closer together. Craig and Naomie attempt to reconcile after their latest blow up, and Shep plans a hunting getaway for the group. Meanwhile, Cameran, ever hopeful that Shep and Chelsea will find true love, has to admit defeat when Chelsea falls for Austen's hunting prowess. And as the two love birds head off to their love shack, Shep's pursuit of health and happiness seems to come to an end."
      },
      {
        "id": "tvmaze:1167539",
        "title": "Sari, Not Sari...",
        "season": 4,
        "episode": 8,
        "released": "2017-05-22",
        "overview": "Craig and Naomie visit a therapist to help save their increasingly rocky relationship while Austen and Chelsea continue to grow closer. But after, Shep runs into Austen and Landon at a bar, he's convinced there's more going on between them than meets the eye. Meanwhile, Kathryn writes Thomas a letter in the hopes that they can finally move forward and co-parent. Patricia hosts an Indian themed dinner in honor of her new caftan line, and invites an Indian healer who reveals the gangs' future. But it's Whitney's revelation that Kathryn has also reached out to him that shocks the group the most."
      },
      {
        "id": "tvmaze:1167540",
        "title": "Guess Who's Coming to Lunch",
        "season": 4,
        "episode": 9,
        "released": "2017-05-29",
        "overview": "After the chaos of Patricia's dinner, it seems some fortunes are coming true. Cameran agrees to see if Kathryn has really changed her ways, and brings along a surprise guest. Meanwhile, Austen and Craig discuss the possibility that Shep may still have his heart set on Chelsea. Landon prepares to squash a potential relationship, but it seems she can't escape her fate."
      },
      {
        "id": "tvmaze:1179341",
        "title": "The Hangover",
        "season": 4,
        "episode": 10,
        "released": "2017-06-05",
        "overview": "As Thomas and Kathryn break their year-long standoff to celebrate their son's first birthday together, Patricia continues her quest to make Landon Saint and Kensie's new step-mother. Cameran begins to rethink motherhood and Craig proves he's finally all grown up when he gets the keys to his new house. Meanwhile, after Shep decides that he needs to get out of downtown Cameran offers to show him a house and quickly discovers that he may be in need of more than just a new address."
      },
      {
        "id": "tvmaze:1199775",
        "title": "Boys Gone Wild",
        "season": 4,
        "episode": 11,
        "released": "2017-06-12",
        "overview": "After Thomas agrees to let Kathryn do a photo shoot with Kensie, the reality of their situation becomes impossible to ignore. Meanwhile, Craig and Naomie question whether they should even continue to be a couple. When Chelsea tells Austen of a late night encounter with Shep, friendships are pushed to the brink."
      },
      {
        "id": "tvmaze:1208178",
        "title": "A Tribe Called Key West",
        "season": 4,
        "episode": 12,
        "released": "2017-06-19",
        "overview": "Tensions are high as the group heads further down south for Cam's birthday trip to Key West. Austen questions Chelsea's commitment to their relationship after she changes her story about the incident with Shep, and Craig finds himself on thin ice with Naomie. Meanwhile, Kathryn reveals shocking new information about Thomas and Landon's relationship. And when she confronts Landon face to face at a group dinner chaos ensues after Craig intervenes and Thomas witnesses the ultimate betrayal."
      },
      {
        "id": "tvmaze:1211932",
        "title": "Ain't No Thang Like a Chicken Wing",
        "season": 4,
        "episode": 13,
        "released": "2017-06-26",
        "overview": "In the season finale, Landon and Kathryn's Key West apology sends shockwaves through the South leaving Thomas a gentleman scorned and the rest of the Charleston crew in bizzaro-land. Meanwhile, as Chelsea and Austen struggle to define their relationship, Craig and Naomie decide the fate of theirs. Kathryn and Thomas seem to finally be on the up and up while Shep continues to spiral down, down, down. When the group gathers for JD's party, old tensions are renewed when Craig is pushed to his limit by Shep."
      },
      {
        "id": "tvmaze:1230675",
        "title": "Reunion Part 1",
        "season": 4,
        "episode": 14,
        "released": "2017-07-10",
        "overview": "The cast of Southern Charm rehashes the season in the first episode of the two-part reunion. Cameran unveils her latest accessory, as Craig and Naomie reveal the status of their relationship. Meanwhile, Shep continues to give Craig and Landon a hard time as Austen proves himself to be a more sympathetic version of his mentor. Kathryn and Jennifer confront their past friendship and Thomas issues a threat that leaves the cast speechless."
      },
      {
        "id": "tvmaze:1233375",
        "title": "Reunion Part 2",
        "season": 4,
        "episode": 15,
        "released": "2017-07-17",
        "overview": "On the dramatic conclusion of the Southern Charm reunion, Kathryn and Landon argue over the details of Landon and Thomas' alleged three day tryst. And as Chelsea confronts Shep about the infamous night at the Commodore, Whitney reveals why he thought Austen was overreacting. Also, Andy tries to resolve the issue of which one of the guys was being the meaner drunk and presents a sneak peek at the new series Relationshep."
      },
      {
        "id": "tvmaze:1421895",
        "title": "The Break-Up Bunch Part 1",
        "season": 5,
        "episode": 1,
        "released": "2018-04-05",
        "overview": "There have been a lot of changes in Charleston! As Cameran prepares for the birth of her baby girl, her favorite man-child, Shep, confesses to the downfall of his relationship following his summer quest to find love. Despite giving it their best shot, both couples Craig and Naomie and Austen and Chelsea have finally called it quits. Meanwhile, Kathryn is celebrating her second year of sobriety and finally has a place of her own near her children. Thomas has a new love interest, and all of Charleston is buzzing about what will happen when she finally meets Kathryn."
      },
      {
        "id": "tvmaze:1440876",
        "title": "The Break-Up Bunch Part 2",
        "season": 5,
        "episode": 2,
        "released": "2018-04-12",
        "overview": "Shep hosts his first ever \"adult\" dinner party where Craig's anxieties over seeing Naomie mount and Austen remains hopeful that he can win Chelsea back. Kathryn finally meets Ashley, the woman determined to be the next Mrs. Ravenel. Meanwhile, the girls ban together in support of one another and Naomie stands up to JD in defense of Elizabeth; leading to the ultimate BBQ showdown."
      },
      {
        "id": "tvmaze:1440877",
        "title": "Groovy Baby",
        "season": 5,
        "episode": 3,
        "released": "2018-04-19",
        "overview": "Patricia surprises Cameran by planning a glamorous retro baby shower, but not everyone gets an invite. At the shower, Craig and Naomie fall back into old habits and an unexpected guest turns the event on its head. As Cameran begins to face the realities of becoming a new mother, Kathryn makes up for lost time with her kids. Meanwhile, Thomas considers his future with Ashley."
      },
      {
        "id": "tvmaze:1452235",
        "title": "All Talk No Action",
        "season": 5,
        "episode": 4,
        "released": "2018-04-26",
        "overview": "Kathryn takes the high road by inviting Thomas' new girlfriend, Ashley, to lunch. Meanwhile, as Cameran's due date approaches, her anxieties over becoming a mom subside. After spending time with Cameran, Chelsea begins to fear motherhood may never be in her future. Austen concocts a plan to get Craig back in the dating saddle. Unfortunately, Craig's sights are set on winning Naomie back until a heated conversation between the pair threatens their future."
      },
      {
        "id": "tvmaze:1454291",
        "title": "Pulp Friction",
        "season": 5,
        "episode": 5,
        "released": "2018-05-03",
        "overview": "As Thomas ponders his next steps with Ashley, Patricia encourages him to propose. Austen's parents push him to make some strides professionally, while Craig hires a coach to help him get his life on track. Naomie gets wind of Craig's new crush, and turns Austen's Halloween party into a house of horrors when she comes face to face with the woman."
      },
      {
        "id": "tvmaze:1459774",
        "title": "Exes on the Half Shell",
        "season": 5,
        "episode": 6,
        "released": "2018-05-10",
        "overview": "Naomie prepares to open her family's new restaurant, and finally comes to terms with the fact that she isn't over Craig. Meanwhile, Patricia and Craig have a heart-to-heart about relationships. Cameran tries an old fashioned trick to get baby Palmer to make an appearance with the gang. Thomas gets himself into hot water with Ashley after she sees him flirting with Kathryn. Meanwhile, Shep steps in to help Austen and Chelsea define their relationship."
      },
      {
        "id": "tvmaze:1468780",
        "title": "Kat's Got Your Tongue",
        "season": 5,
        "episode": 7,
        "released": "2018-05-17",
        "overview": "Cameran suspects that she may be experiencing labor pains. Kathryn prepares for her first day of work, while  Craig helps Austen realize things are over with Chelsea and refocuses on wooing Victoria. Patricia tries to make Ashley into the perfect Southern Belle and hosts a dinner party with the men of Charleston to test her skills. At the party, it seems Thomas only has eyes for Kathryn...and he may not be the only one."
      },
      {
        "id": "tvmaze:1468781",
        "title": "What Da Fuskie",
        "season": 5,
        "episode": 8,
        "released": "2018-05-24",
        "overview": "Cameran plays the pregnancy waiting game while the rest of the gang prepares for a trip to Shep and Chelsea's hometown, Hilton Head. Meanwhile, feuding exes, Craig and Naomie, attempt to act civil with the help of an old furry friend. Austen decides to rekindle his romance with Victoria, but fears Chelsea's reaction. As Kathryn plans her son's birthday, Thomas' girlfriend gets sour from the invitation snub. Tensions flare at a beachfront argument, changing one relationship for good."
      },
      {
        "id": "tvmaze:1468782",
        "title": "Hilton Head-ache",
        "season": 5,
        "episode": 9,
        "released": "2018-05-31",
        "overview": "Emotions run high during the gang's first night in Hilton Head, when Ashley confronts Kathryn. After the group is forced to pick sides, everyone is walking on eggshells for the rest of the weekend. When the last flare up comes, it's Austen who gets burned when a flirtation with Chelsea comes back to haunt him."
      },
      {
        "id": "tvmaze:1471766",
        "title": "Family Ties",
        "season": 5,
        "episode": 10,
        "released": "2018-06-07",
        "overview": "As the Hilton Head trip comes to an end, Shep visits his mom and finally admits some truths about himself, as Chelsea takes a trip down memory lane and opens up about her past. Meanwhile, back in Charleston, Austen attempts to make amends with Victoria, and Cameran finally welcomes her new bundle of joy. When everyone comes together to celebrate Saint's second birthday, Thomas and Kathryn finally find the sweet spot with their co-parenting. Ashley, on the other hand, has a bone to pick that might just send her packing."
      },
      {
        "id": "tvmaze:1477531",
        "title": "Beer and Trembling",
        "season": 5,
        "episode": 11,
        "released": "2018-06-14",
        "overview": "Austen prepares to debut his beer to his family and friends and Craig makes progress on his pillows for Patricia. Cameran tries to adjust to her new life with baby Palmer, while Kathryn and Shep spend some quality time together. Ashley returns from California, but her relationship with Thomas is still on the rocks. Meanwhile, Chelsea and Victoria finally cross paths at Austen's beer tasting event, putting him on the spot about their relationships."
      },
      {
        "id": "tvmaze:1477532",
        "title": "Gone Girl",
        "season": 5,
        "episode": 12,
        "released": "2018-06-21",
        "overview": "After basking in the glory of his successful beer event, Austen is hit with romantic reality and Craig faces some harsh truths. Meanwhile, as Thomas and Ashley struggle to resolve their issues, Chelsea feels vindicated when she hears some news from Shep. Cameran finally gets to enjoy some freedom from motherhood, Kathryn goes MIA and her friends fear the worst."
      },
      {
        "id": "tvmaze:1483066",
        "title": "Game Changer",
        "season": 5,
        "episode": 13,
        "released": "2018-06-28",
        "overview": "Thomas continues to pressure Ashley to get a job in Charleston, leaving them in relationship limbo. Meanwhile, Chelsea and Austen come to terms with the state of their friendship, while Craig and Naomie, once again, try to navigate dating post break-up. After Thomas invites the gang to watch him play in his last polo match out at Brookland Plantation, Kathryn must face her fears of returning to the place she thought would be her happily ever after."
      },
      {
        "id": "tvmaze:1487370",
        "title": "Ho, Ho, Ho",
        "season": 5,
        "episode": 14,
        "released": "2018-07-12",
        "overview": "After 5 years of constant tension, Patricia finally extends an olive branch and invites Kathryn to her Winter Ball. As these two former enemies make peace, the delicate truce between Craig and Naomie blows up when he brings a date to the Ball. Meanwhile, as Austen tries to warn Thomas that there's a nasty rumor circulating about Ashley, he's the one that gets burned by Ashley. When Kathryn and Ashley finally sit down to talk for the first time since Hilton Head, their conversation quickly turns combative."
      },
      {
        "id": "tvmaze:1502774",
        "title": "Southern Charm Reunion Part 1",
        "season": 5,
        "episode": 15,
        "released": "2018-07-19",
        "overview": "After a season of betrayals, accusations and stunning revelations, the cast of Southern Charm come together to face the music and each other, minus one Charmer. When Naomie explains why she was on the offensive this season, Craig takes a page from the #meanNaomie handbook and lashes out. Meanwhile, as Kathryn celebrates her personal growth, a rare emotional outburst from Cameran proves that motherhood has brought the two women closer and united them against common foe."
      },
      {
        "id": "tvmaze:1502775",
        "title": "Southern Charm Reunion Part 2",
        "season": 5,
        "episode": 16,
        "released": "2018-07-26",
        "overview": "On the dramatic conclusion of the Southern Charm reunion, Austen and Chelsea finally put to rest whether they will ever be more than just friends. Meanwhile, Shep gets candid about his personal activities with Kathryn. As soon as Ashley goes toe to toe with the entire cast, major revelations come to light which turn the tables in an unexpected direction and leaving Kathryn to intervene."
      },
      {
        "id": "tvmaze:1634480",
        "title": "RSVPeeved",
        "season": 6,
        "episode": 1,
        "released": "2019-05-15",
        "overview": "As Charleston reels over Thomas' arrest, a distraught Kathryn deals with conflicting emotions and the possibility of getting full custody of her kids. Cameran learns you can't have it all as she struggles to balance motherhood and her career, while Naomie has no issues juggling a hunky new boyfriend and a thriving new business Craig, got his groove back after a summer stint in the Bahamas this summer, while Austen was caught in a compromising position. But as everyone gathers at Patricia's dinner party, it's another secret romp that has everyone shocked."
      },
      {
        "id": "tvmaze:1657161",
        "title": "Kat's Out of the Bag",
        "season": 6,
        "episode": 2,
        "released": "2019-05-22",
        "overview": "Cameran gives Eliza an earful about her brash behavior at Patricia's dinner party. Austen and Craig meet Whitney for lunch, he is in the hot seat over some rumors of his current relationship status. Meanwhile, Kathryn and Chelsea settle into new homes. When Chelsea hosts a house warming party to show off her new digs, Cameran spills the beans on Whitney and Kathryn's secret liaison."
      },
      {
        "id": "tvmaze:1657162",
        "title": "Slide in to Your DMs Like...",
        "season": 6,
        "episode": 3,
        "released": "2019-05-29",
        "overview": "Cameran continues to struggle with being a stay at home mom, while Naomie juggles her burgeoning clothing company and her family's restaurant empire. As Kathryn opens up about her new boyfriend, Craig becomes the resident town gossip, spreading rumors not only about Kat's new man but Austen's girlfriend. When Shep hears the rumors, he and Craig go on the offensive to try to protect their friend."
      },
      {
        "id": "tvmaze:1660156",
        "title": "Barking Up the Wrong Tree House",
        "season": 6,
        "episode": 4,
        "released": "2019-06-05",
        "overview": "Austen has second thoughts about breaking up with Madison, but he has bigger problems when Chelsea learns he's been badmouthing her around town. Meanwhile, a shocking experience gives Eliza a new lease on life. After Kathryn pulls another one of her MIA stunts before the girls' trip, Danni and Naomie insist on holding her accountable."
      },
      {
        "id": "tvmaze:1665285",
        "title": "In Sew Deep",
        "season": 6,
        "episode": 5,
        "released": "2019-06-12",
        "overview": "Kathryn and Danni leave the girls' trip on frosty terms, as Cameran realizes she needs to get back to work. Meanwhile, Craig is way behind on pillow orders and decides to host a party to trick his friends into helping him sew. The party takes a turn for the worse when Chelsea lays into Austen for talking behind her back, and Kathryn and Danni confront their friendship issues head on."
      },
      {
        "id": "tvmaze:1665286",
        "title": "A Salt and Battery",
        "season": 6,
        "episode": 6,
        "released": "2019-06-19",
        "overview": "To get Austen's mind off his ex, the boys rent an RV, and head to the great outdoors. Chelsea steps up her hair game, Eliza tries to mend friendships, and Cam finally asks for help with Palmer. Meanwhile, Kathryn and Danni's friendship is at an icy standstill."
      },
      {
        "id": "tvmaze:1674961",
        "title": "Dick Moves and Dick Pics",
        "season": 6,
        "episode": 7,
        "released": "2019-06-26",
        "overview": "The boys hit the town in Nashville, in their ongoing attempt to get Austen over Madison. Meanwhile, Patricia hosts a female-only dinner party, which is even raunchier than the boys' night out, as the girls share some secrets of their own, and Kathryn tries to reconcile her friendship with Danni."
      },
      {
        "id": "tvmaze:1676229",
        "title": "New Craig, Who Dis?",
        "season": 6,
        "episode": 8,
        "released": "2019-07-03",
        "overview": "Shep adjusts to life with his new puppy, Little Craig. Chelsea holds Austen's feet to the fire, while Kathryn and Naomie get enlightened. When Cameran hosts an oyster roast for her 35th birthday party, she gets turnt, and Craig the human gets livid."
      },
      {
        "id": "tvmaze:1678571",
        "title": "Sorry Not Sorry",
        "season": 6,
        "episode": 9,
        "released": "2019-07-10",
        "overview": "The group decides to take a trip to Colorado to help Cameran rediscover her mojo. Naomie refuses to go because she doesn't want to spend a long weekend with her ex, Craig, and his unresolved feelings for her. Meanwhile, Eliza hosts the gang out at her family's plantation for a day of skeet shooting and invites a blast from the past, which backfires big time."
      },
      {
        "id": "tvmaze:1682904",
        "title": "Rocky Mountain High Part 1",
        "season": 6,
        "episode": 10,
        "released": "2019-07-17",
        "overview": "As Charleston deals with the fallout from Ashley's \"apology tour\" at Eliza's luncheon, Kathryn confronts Whitney about their summer romance rumor. Cameran reveals to Shep that she's invited Madison, to her birthday ski trip in Colorado, much to his chagrin. Meanwhile, the trip gets off to a rocky start as a frustrated Craig unleashes his pent up fury on the gang. As everyone settles into the Steamboat Springs chalets, all eyes are on Austen and Madison as they spend their first night together under one roof since their breakup."
      },
      {
        "id": "tvmaze:1682905",
        "title": "Rocky Mountain High Part 2",
        "season": 6,
        "episode": 11,
        "released": "2019-07-24",
        "overview": "Chelsea, Cameran, Eliza, Danni and Kathryn hit the slopes for their first ever ski lesson, while Craig, Austen and Madison snowboard. When Austen and Madison's relationship starts to heat back up, Kathryn reveals more dirt on her hook up with Whitney. Later, tensions rise when the gang enjoys a cannabis infused dinner, and Kathryn is confronted with her past mistakes. Meanwhile, back in Charleston, Naomie gets an unexpected phone call from Ashley."
      },
      {
        "id": "tvmaze:1688305",
        "title": "Who Put the 'Mad' in Madison",
        "season": 6,
        "episode": 12,
        "released": "2019-07-31",
        "overview": "After a raucous night in Colorado, Cameran and Whitney decide to hightail it back to Charleston while the rest of the gang hits the hot springs. When it becomes clear that Austen and Madison's road to reconciliation won't be an easy one, Shep gloats. An infuriated Madison repeats a rumored secret that not only throws Shep under the bus, but Danni too. After this bomb is dropped, Austen is left to pick up the pieces, and the rest of the Charmers to take sides."
      },
      {
        "id": "tvmaze:1690527",
        "title": "Outfoxed",
        "season": 6,
        "episode": 13,
        "released": "2019-08-07",
        "overview": "Shep's ultimatum to Austen is tested after he and Madison reconcile. Meanwhile, Ashley resurfaces asking for a ‘second' second-chance, which Eliza obliges with an invitation to her Fox Hunt. When Ashley and Kathryn come face-to-face for the first time in a year, the gang prepares for the brawl of the century."
      },
      {
        "id": "tvmaze:1690528",
        "title": "White Gloves Off",
        "season": 6,
        "episode": 14,
        "released": "2019-08-14",
        "overview": "The Charleston socialites get ready for another grand event hosted by Miss Patricia, and battle lines are drawn when Austen learns that Shep and Craig's dates are the girls from his infamous threesome video. Shep and Craig aren't the only ones causing trouble as Ashley, against Eliza's advice, considers crashing the event to confront Patricia over her \"lies.\""
      },
      {
        "id": "tvmaze:1691162",
        "title": "Reunion Part 1",
        "season": 6,
        "episode": 15,
        "released": "2019-08-21",
        "overview": "On the first part of the Southern Charm Reunion, Naomie defends her boyfriend from accusations that he is controlling and Shep admits he has anger issues that stem from his elitism. Meanwhile, Cameran accuses Craig of having an Adderall addiction and Austen questions Kathryn's sobriety."
      },
      {
        "id": "tvmaze:1691163",
        "title": "Reunion Part 2",
        "season": 6,
        "episode": 16,
        "released": "2019-08-28",
        "overview": "On the second hour of the Southern Charm Reunion, Danni tells Kathryn she is hurt by her newfound friendship with Madison. Meanwhile, Madison, Danni and Shep go head to head. Finally, Austen has to answer  the question of whether or not he made up the rumor about Shep and Danni."
      },
      {
        "id": "tvmaze:1943098",
        "title": "The Good Shephard",
        "season": 7,
        "episode": 1,
        "released": "2020-10-29",
        "overview": "Austen and Madison are back together, and their bond is stronger than ever – but it's Craig who's moved in with him after his house was damaged by a flood. Living with someone from her past, Kathryn reveals a bit of gossip to Craig and finds herself unprepared for the repercussions. With a new girlfriend and a therapist in tow, Shep's new and improved attitude leaves him determined to keep his nose out of his everyone's business. But an unexpected twist has his friends wondering if he's really changed at all."
      },
      {
        "id": "tvmaze:1963222",
        "title": "Charleston Whine and Food Festival",
        "season": 7,
        "episode": 2,
        "released": "2020-11-05",
        "overview": "Shep continues to spread gossip at his party, upsetting Madison and ultimately affecting his friendship with Austen. Meanwhile, Leva comes to Cameran's defense and confronts Kathryn for igniting the rumor mill. Patricia suggests John pursue Madison. With the biggest beer event of Austen's career on the horizon, he wonders if his friends will show up to support or sabotage his big day."
      },
      {
        "id": "tvmaze:1964133",
        "title": "A Pair and a Spare",
        "season": 7,
        "episode": 3,
        "released": "2020-11-12",
        "overview": "Leva hosts a Persian Dinner for the girls, while the boys go out and discover John doesn't honor bro-code. Meanwhile, pigs officially fly when Shep and Taylor double-date with Austen and Madison. And when Kathryn finds out a secret about Thomas, her fantasy of them getting back together crumbles."
      },
      {
        "id": "tvmaze:1964134",
        "title": "Single and Ready to Pringle",
        "season": 7,
        "episode": 4,
        "released": "2020-11-19",
        "overview": "The guys prepare for Patricia's annual dinner party, despite tensions among the group. John follows Patricia's advice and decides to pursue Madison, even though it means breaking bro-code with his friend Austen. Meanwhile, Kathryn refocuses her life after learning that Thomas has a new baby on the way. Everything comes to a screeching halt when Charleston is forced to deal with the onset of Coronavirus."
      },
      {
        "id": "tvmaze:1974761",
        "title": "Monumental Challenge",
        "season": 7,
        "episode": 5,
        "released": "2020-12-03",
        "overview": "The past two months have seen so many changes, not just in Charleston but around the world. A global pandemic. Schools, restaurants, and other public spaces closed. Residents asked to quarantine at home. Not to mention, political rallies and other protests. As Charleston reopens, everyone comes to grips with their \"new normal.\""
      },
      {
        "id": "tvmaze:1974865",
        "title": "Love Sick",
        "season": 7,
        "episode": 6,
        "released": "2020-12-10",
        "overview": "John cozies up to Madison as she reaches a decision about Austen. After Craig debuts his HSN line, Patricia has an announcement of her own. Meanwhile, Shep and his girlfriend struggle with the pressures of quarantine, and Leva confronts Kathryn over issues of race and privilege."
      },
      {
        "id": "tvmaze:1986307",
        "title": "Low Country Broil",
        "season": 7,
        "episode": 7,
        "released": "2020-12-17",
        "overview": "Shep tries to charm his way out of the doghouse with his girlfriend, Taylor. After an apology tour, Kathryn continues to face backlash for her exchange on social media. Austen refuses to accept that his relationship with Madison is over, pushing Craig to make an unexpected, last-ditch effort to help his friend."
      },
      {
        "id": "tvmaze:1993467",
        "title": "It's My Party and I'll Go If I Want To...",
        "season": 7,
        "episode": 8,
        "released": "2021-01-07",
        "overview": "On the heels of their break up, Madison invites everyone to what was supposed to be Austen's birthday party. After Craig advises her to disinvite the birthday boy, Austen decides to show up anyway. Meanwhile, Kathryn struggles in her friendships with Danni and Madison Simon, who are determined to have it out with her once and for all. When they all gather on Capers, a private island with no way in or out except by ferry, what could possibly go wrong?"
      },
      {
        "id": "tvmaze:2000321",
        "title": "Treehouse of Cards Part 1",
        "season": 7,
        "episode": 9,
        "released": "2021-01-14",
        "overview": "It's sink or swim on the two-part season finale opener, as Pringle and Shep cohost a \"good times\" pool party. Leva finally calls out the boys on their unyielding defense of Kathryn, and questions if they know all sides to the story. And while Craig may have found his storybook romance, Austen looks to close the chapter on Madison for good."
      },
      {
        "id": "tvmaze:2006525",
        "title": "Treehouse of Cards Pt. 2",
        "season": 7,
        "episode": 10,
        "released": "2021-01-21",
        "overview": "As the finale concludes, fireworks fly when Madison learns Austen has been hooking up with another woman. While Kathryn finally confronts her DM scandal, other fractures in the group threaten to finally break their friendships."
      },
      {
        "id": "tvmaze:2017811",
        "title": "Reunion Part 1",
        "season": 7,
        "episode": 11,
        "released": "2021-01-28",
        "overview": "The two-part Southern Charm reunion kicks off as the group comes together to rehash a shocking season that tested their friendships in more ways than one. Craig holds nothing back when confronting Madison for a snide comment she made about his relationship. A scorned Austen wastes no time fanning those flames, questioning his ex-girlfriend's motives while they were together. Meanwhile, Shep's fidelity to his girlfriend is called into question and Kathryn takes her friends to task about a rumor she claims did not start with her."
      },
      {
        "id": "tvmaze:2023642",
        "title": "Reunion Part 2",
        "season": 7,
        "episode": 12,
        "released": "2021-02-04",
        "overview": "The Southern Charm reunion concludes with a rollercoaster of emotions. As Craig stews over his strained friendship with Madison, newbie John finds himself in the hot seat for continuously breaking bro-code. Just as Austen finally comes to terms with his recent breakup, Madison shocks the group with news of another budding romance. Meanwhile, Leva and Kathryn desperately try to come to an understanding about the emoji controversy. Except this time, Kathryn is not the only one Leva calls out for living in a 'bubble of privilege.'"
      },
      {
        "id": "tvmaze:2030372",
        "title": "Secrets Revealed",
        "season": 7,
        "episode": 13,
        "released": "2021-02-11",
        "overview": "Southern Charm Season 7 comes to a close with never-before-seen footage and shocking revelations from Charleston's resident socialites. Watch as the group celebrates Republic's seventh anniversary, hear the lengths Pat went through to hire Michael, and find out what the guys really got up to during lockdown."
      },
      {
        "id": "tvmaze:2329224",
        "title": "Great Ex-pectations",
        "season": 8,
        "episode": 1,
        "released": "2022-06-23",
        "overview": "After a tumultuous year, the Charleston crew is back and ready for a fresh start; Kathryn throws herself a 30th birthday party to celebrate another decade and a clean slate with a new man by her side."
      },
      {
        "id": "tvmaze:2349157",
        "title": "Suspicious Minds",
        "season": 8,
        "episode": 2,
        "released": "2022-06-30",
        "overview": "Chleb is on the receiving end of Kathryn's anger and makes a big decision; Austen is hurt that Craig didn't tell him about hooking up with Naomie and suspects the former couple is hiding an even bigger secret."
      },
      {
        "id": "tvmaze:2353771",
        "title": "Barbecues, Breakups & Betrothals",
        "season": 8,
        "episode": 3,
        "released": "2022-07-07",
        "overview": "The boys have a barbecue and while the grill gets hot, the drama does too; Craig looks to Paige for advice on how to mend his friendship with Austen, but Austen's got bigger fish to fry when he learns some shocking news about Madison."
      },
      {
        "id": "tvmaze:2356438",
        "title": "It's My Party and I'll Fight if I Want To",
        "season": 8,
        "episode": 4,
        "released": "2022-07-14",
        "overview": "Austen gets emotional when he learns his parents are selling his childhood home; Chleb leans on his cousin for support in the wake of his breakup with Kathryn; Shep's past comes back to haunt him when Taylor voices her concerns for their future."
      },
      {
        "id": "tvmaze:2359885",
        "title": "Exes and Uh Oh's",
        "season": 8,
        "episode": 5,
        "released": "2022-07-21",
        "overview": "Madison and Venita's joint party takes a turn for the worse; Paige sets ground rules for her relationship with Craig; Shep struggles to get Taylor to trust him while he's away; Kathryn sets up a girls night out to celebrate her new status."
      },
      {
        "id": "tvmaze:2363405",
        "title": "Shuckers and Sinners",
        "season": 8,
        "episode": 6,
        "released": "2022-07-28",
        "overview": "Shep and Craig help Austen move things out of his childhood home; Taylor voices concerns about Shep's past infidelity back in Charleston; Olivia prepares to throw an oyster roast, and one guest's presence causes Austen to spiral."
      },
      {
        "id": "tvmaze:2370954",
        "title": "Clean Slates and Secret Dates",
        "season": 8,
        "episode": 7,
        "released": "2022-08-04",
        "overview": "After being excluded from Olivia's oyster roast, Venita looks within and spends time with her mom in hopes of gaining insight to her family's secret past; Craig may have a new secret of his own when he goes against Paige's wishes and meets Naomie."
      },
      {
        "id": "tvmaze:2373271",
        "title": "Holy Mutt-rimony",
        "season": 8,
        "episode": 8,
        "released": "2022-08-11",
        "overview": "The wedding countdown begins for Lil Craig and Peaches; Shep opens up to Whitney about his marriage fears; Austen sulks when Olivia arrives with a date; Craig and Naomie bump heads on boundaries; maid of honor Madison and best man Austen bump heads."
      },
      {
        "id": "tvmaze:2373782",
        "title": "Auldbrass Glitters is Not Gold",
        "season": 8,
        "episode": 9,
        "released": "2022-08-18",
        "overview": "The gang takes a much-needed break from Charleston and heads to Auldbrass, an estate designed by architect Frank Lloyd Wright; Naomie divulges her new love interest to Leva and Austen, who prove they are not the best at keeping secrets."
      },
      {
        "id": "tvmaze:2376780",
        "title": "Walking on Eggshells",
        "season": 8,
        "episode": 10,
        "released": "2022-08-25",
        "overview": "Tensions continue to rise on the group's trip to Auldbrass; Craig demands apologies; Olivia wrestles with her feelings about Austen; Whitney deals with the repercussions of breaking bro code; an egg toss scrambles Shep and Taylor's relationship."
      },
      {
        "id": "tvmaze:2381578",
        "title": "Guess Who's Coming to Friendsgiving",
        "season": 8,
        "episode": 11,
        "released": "2022-09-01",
        "overview": "The holiday season is off to a rocky start when the gang gets together for a Friendsgiving feast; Austen hosts and leaves certain people off the guest list; a newly single Kathryn searches for things to be grateful for; Paige comes to town."
      },
      {
        "id": "tvmaze:2381579",
        "title": "Guys and Dolls",
        "season": 8,
        "episode": 12,
        "released": "2022-09-08",
        "overview": "Patricia invites the guys over for a gentlemen's dinner. The ladies get together for a night out on the town. As the girls take the time to face their issues head on, a faux pas at Patricia's leaves Craig in major debt. Shep's honesty comes into question when past secrets surface online."
      },
      {
        "id": "tvmaze:2388206",
        "title": "St. Simon Says Fight!",
        "season": 8,
        "episode": 13,
        "released": "2022-09-15",
        "overview": "Shep tries to right his wrongs from Auldbrass and invites the gang on a trip to St. Simons Island, but his efforts are in vain when his emotions get the best of him. Austen expresses concern for Taylor's future with Shep. Craig loses his temper when Naomie's actions bring up wounds from the past."
      },
      {
        "id": "tvmaze:2388207",
        "title": "Trawlin' and Brawlin'",
        "season": 8,
        "episode": 14,
        "released": "2022-09-22",
        "overview": "Austen finds it hard to bite his tongue when Shep feels attacked by the group. After a day of golf and shrimping, an English countryside dinner sets standards high for a civilized evening, but some guests have other plans. Naomie leans on her friends for support when Craig lashes out, but finds Venita's allegiance is elsewhere."
      },
      {
        "id": "tvmaze:2392922",
        "title": "Wreck the Halls",
        "season": 8,
        "episode": 15,
        "released": "2022-09-29",
        "overview": "‘Tis the season to start some drama! Craig prepares for his Sewing Down South Holiday Gala and faces difficult decisions with the guest list. Shep reflects on his actions toward Taylor and proposes an idea that leads some to question his intentions. Venita worries about the state of her friendships with the group. Austen and Olivia make strides in their relationship while one guest takes bold strides on their way out of the party."
      },
      {
        "id": "tvmaze:2404201",
        "title": "Reunion Part 1",
        "season": 8,
        "episode": 16,
        "released": "2022-10-06",
        "overview": "Madison shocks the group with rumors about Olivia. Kathryn sets the record straight on her relationship with Chleb. Taylor puts Shep on blast and Olivia puts Austen in the hot seat, but an emotional discussion brings everyone to tears together."
      },
      {
        "id": "tvmaze:2404202",
        "title": "Reunion Part 2",
        "season": 8,
        "episode": 17,
        "released": "2022-10-13",
        "overview": "Craig faces the wrath of those he wronged at his holiday party. Venita faces the reality of her failing friendships. Leva gives us a peek into her new show. A scorned Taylor reveals the truth about the end of her relationship with Shep."
      },
      {
        "id": "tvmaze:2612699",
        "title": "Vows, Vendettas and Vibrators",
        "season": 9,
        "episode": 1,
        "released": "2023-09-14",
        "overview": "The Charmers celebrate Madison's marriage to her Prince Charming, but not everyone is in a festive mood. Austen comes face to face with multiple exes. Craig gets caught in the crossfire of an icy reunion between Shep and Taylor."
      },
      {
        "id": "tvmaze:2612887",
        "title": "Spilling the JT",
        "season": 9,
        "episode": 2,
        "released": "2023-09-21",
        "overview": "The spotlight is on the aftermath of accusations spilled at Madison's wedding party, but attention quickly turns when newcomer JT vocalizes his suspicions about Austen and Taylor to Shep."
      },
      {
        "id": "tvmaze:2612888",
        "title": "He Said, She Said",
        "season": 9,
        "episode": 3,
        "released": "2023-09-28",
        "overview": "The girls decide what Taylor needs is a good old-fashioned Southern soireé, swapping tales and spillin' tea. Shep kills the fun, however, when he delivers a scandalous rumor to Olivia's front door."
      },
      {
        "id": "tvmaze:2643969",
        "title": "In Vino Veritas",
        "season": 9,
        "episode": 4,
        "released": "2023-10-05",
        "overview": "After Olivia hears what went down between Austen and Taylor, she's unsure how to move forward. Taylor brings the group together for her first big work event and more rumors bubble to the surface. Shep wastes no time confronting Austen, who has found some liquid courage."
      },
      {
        "id": "tvmaze:2648272",
        "title": "Party Fowl",
        "season": 9,
        "episode": 5,
        "released": "2023-10-12",
        "overview": "Shep attempts to put the group's messiness aside and host a proper Southern dinner for his closest friends."
      },
      {
        "id": "tvmaze:2653481",
        "title": "Family Bonds",
        "season": 9,
        "episode": 6,
        "released": "2023-10-19",
        "overview": "The drama comes to a halt when a tragedy affects the Charmer's close circle and they rally to support Olivia."
      },
      {
        "id": "tvmaze:2664312",
        "title": "The Naked Truth",
        "season": 9,
        "episode": 7,
        "released": "2023-10-26",
        "overview": "Shep and Taylor try to move forward as friends while Olivia and Rod's romance continues to blossom."
      },
      {
        "id": "tvmaze:2664313",
        "title": "Bra-gate",
        "season": 9,
        "episode": 8,
        "released": "2023-11-02",
        "overview": "Shep decides the guys need a break from the chaos of Charleston, so they escape to his family home in the North Carolina mountains. When Rod finds out about a secret rendezvous between Olivia and Austen, all bets are off for a tranquil getaway."
      },
      {
        "id": "tvmaze:2668696",
        "title": "Strange Bedfellows",
        "season": 9,
        "episode": 9,
        "released": "2023-11-09",
        "overview": "The guys' weekend of fishing and debauchery is interrupted when Olivia and Taylor crash their mountain getaway."
      },
      {
        "id": "tvmaze:2668697",
        "title": "A Royal Reckoning",
        "season": 9,
        "episode": 10,
        "released": "2023-11-16",
        "overview": "When Patricia suffers a back injury, Whitney is forced to host the annual Gentleman's Dinner solo, but no amount of pomp and circumstance can distract from Austen and Shep's icy detente. Craig once again questions the timeline of Austen and Taylor's dalliance."
      },
      {
        "id": "tvmaze:2680822",
        "title": "Jamaican Me Crazy",
        "season": 9,
        "episode": 11,
        "released": "2023-11-30",
        "overview": "Craig decides that the perfect way for Paige to get to know his friends is a group getaway to Jamaica. As they touch down in paradise, Olivia questions where she stands with Austen. Shep keeps his distance from Taylor."
      },
      {
        "id": "tvmaze:2688914",
        "title": "Chasing Waterfalls",
        "season": 9,
        "episode": 12,
        "released": "2023-12-07",
        "overview": "The Charmers' first day in paradise is overshadowed by a salacious article that causes Olivia and Austen's progress to backslide. Madison enjoys her last hurrah before trying for Baby No. 2."
      },
      {
        "id": "tvmaze:2689429",
        "title": "Choppy Waters",
        "season": 9,
        "episode": 13,
        "released": "2023-12-14",
        "overview": "The crew spends a day partying on a yacht. Despite their fun in the sun, Austen and Shep finally come to blows."
      },
      {
        "id": "tvmaze:2696414",
        "title": "Playing House",
        "season": 9,
        "episode": 14,
        "released": "2023-12-21",
        "overview": "As the trip to Jamaica winds down, Olivia and Taylor's relationship comes to an explosive head. Back in Charleston, Madison plays host for Paige and Craig, who are who are confronting tough questions in their relationship."
      },
      {
        "id": "tvmaze:2710271",
        "title": "Beyond the Valley of the Southern Dolls",
        "season": 9,
        "episode": 15,
        "released": "2024-01-04",
        "overview": "Whitney throws a bash to celebrate his new man cave. Shep finally works through his feelings with Taylor. Austen confronts Olivia about simmering tensions. The party goes south when Austen and JT go head to head."
      },
      {
        "id": "tvmaze:2714470",
        "title": "Reunion Part 1",
        "season": 9,
        "episode": 16,
        "released": "2024-01-11",
        "overview": "The Charmers sit down for an epic reunion after a tumultuous season. Austen and JT see each other for the first time since their shocking faceoff. Shep finds himself in the hot seat. When the time comes for Taylor and Olivia to delve into the root of their broken relationship, a surprising revelation comes to light."
      },
      {
        "id": "tvmaze:2719686",
        "title": "Reunion Part 2",
        "season": 9,
        "episode": 17,
        "released": "2024-01-18",
        "overview": "The Southern Charm reunion continues as season newcomers Rod and Rodrigo join the group on the couch. After a surprising twist, Taylor and Olivia remain on tenterhooks. After all they've been through, the Charmers are left to consider if some old flames are worth rekindling and if their strained relationships are salvageable."
      },
      {
        "id": "tvmaze:3038586",
        "title": "Raising Cane",
        "season": 10,
        "episode": 1,
        "released": "2024-12-05",
        "overview": "After a rocky year, Shep, Austen and Craig try to forgive and forget; Madison hosts the Charmers at the Carolina Cup, but the festivities take an awkward turn when Miss Patricia is offered an unwelcome surprise gift."
      },
      {
        "id": "tvmaze:3064480",
        "title": "Off the Peep End",
        "season": 10,
        "episode": 2,
        "released": "2024-12-12",
        "overview": "The fallout from the Carolina Cup quickly becomes a game of telephone with JT on the receiving end; Miss Patricia hosts a soiree for Easter with rumors being the main course."
      },
      {
        "id": "tvmaze:3065433",
        "title": "Gone to the Dogs",
        "season": 10,
        "episode": 3,
        "released": "2024-12-19",
        "overview": "JT pens an apology to Miss Patricia; the group celebrates at a Doggy Parton-themed celebration; Shep debuts his new girlfriend; Taylor faces off with a flame from her boyfriend's past; Austen starts to question his friendship with Craig."
      },
      {
        "id": "tvmaze:3077408",
        "title": "Sew Not Invited",
        "season": 10,
        "episode": 4,
        "released": "2025-01-02",
        "overview": "Rodrigo confronts Taylor on the state of her relationship. Leva checks in on JT. Craig finds himself on the outside looking in as his friends celebrate the Grand Dame of Charleston at Miss Patricia's birthday dinner. Austen has a heart to heart with Craig, which quickly goes off the deep end."
      },
      {
        "id": "tvmaze:3081656",
        "title": "Beer and Loathing",
        "season": 10,
        "episode": 5,
        "released": "2025-01-09",
        "overview": "Madison reels from unexpected news; Craig enlists Paige to host a party where Austen is noticeably not invited, leaving Austen to confront the state of their friendship."
      },
      {
        "id": "tvmaze:3094081",
        "title": "Making a Splash",
        "season": 10,
        "episode": 6,
        "released": "2025-01-16",
        "overview": "Austen introduces his parents to his girlfriend; Craig and JT get together to put rumors to rest; Salley hosts a housewarming party."
      },
      {
        "id": "tvmaze:3094082",
        "title": "Overtures and Outbursts",
        "season": 10,
        "episode": 7,
        "released": "2025-01-23",
        "overview": "Craig and Austen continue to butt heads as Shep drops the L bomb with Sienna. When the gang gets together to support Molly at her tuba concert, drama takes centerstage at JT's afterparty."
      },
      {
        "id": "tvmaze:3116884",
        "title": "Red Flags",
        "season": 10,
        "episode": 8,
        "released": "2025-01-30",
        "overview": "Miss Patricia and Madison have a sleepover where champagne is poured and rumors are spilled. Shep starts to spiral over his girlfriend, Sienna. Austen and Craig finally have it out as Shep tries to play mediator."
      },
      {
        "id": "tvmaze:3116885",
        "title": "The Birds & The B's",
        "season": 10,
        "episode": 9,
        "released": "2025-02-06",
        "overview": "Craig and Paige set out to learn about beekeeping but end up at a crossroads regarding their future. Miss Patricia hosts her annual guys' dinner where Shep's relationship is the main topic of conversation."
      },
      {
        "id": "tvmaze:3116886",
        "title": "Bahama Blues",
        "season": 10,
        "episode": 10,
        "released": "2025-02-13",
        "overview": "The group heads to the Bahamas for a tropical getaway. Despite the fun in the sun, a dark cloud hangs over Shep's relationship with Sienna."
      },
      {
        "id": "tvmaze:3126246",
        "title": "Text Message in a Bottle",
        "season": 10,
        "episode": 11,
        "released": "2025-02-20",
        "overview": "Shep starts to spiral over his relationship and sends a text message that causes ripples among the group. Craig and Austen's tepid friendship truce starts to unravel. The crew eagerly awaits JT's arrival."
      },
      {
        "id": "tvmaze:3142019",
        "title": "Lost at Sea",
        "season": 10,
        "episode": 12,
        "released": "2025-02-27",
        "overview": "Tensions between JT and Craig finally come to a head. Madison and JT have a one-on-one. As the group embarks on a party boat trip, Shep feels adrift about Sienna."
      },
      {
        "id": "tvmaze:3142020",
        "title": "Sea's Just Not That Into You",
        "season": 10,
        "episode": 13,
        "released": "2025-03-06",
        "overview": "Shep reaches a heartbreaking conclusion about his relationship with Sienna. Venita reveals her true feelings about JT to Ryan and Salley. Craig and Austen have a heart-to-heart that changes everything."
      },
      {
        "id": "tvmaze:3146803",
        "title": "The Telephone Game",
        "season": 10,
        "episode": 14,
        "released": "2025-03-13",
        "overview": "Back in Charleston, Craig and Austen rekindle their bromance. Madison finally gets some good news. A wicked game of telephone threatens to undermine Venita and JT's situationship."
      },
      {
        "id": "tvmaze:3160984",
        "title": "Arrested Development",
        "season": 10,
        "episode": 15,
        "released": "2025-03-20",
        "overview": "Madison and Ryan host a black-tie summer soiree as tensions in the group run high. A new romance starts to sizzle and, in a shocking turn of events, another one fizzles."
      },
      {
        "id": "tvmaze:3167994",
        "title": "Reunion Part 1",
        "season": 10,
        "episode": 16,
        "released": "2025-03-27",
        "overview": "Madison surprises the group with exciting personal news. Craig opens up about his breakup with Paige. Shep and Molly reveal where they stand after their kiss. Venita and JT discuss their romantic entanglement."
      },
      {
        "id": "tvmaze:3167995",
        "title": "Reunion Part 2",
        "season": 10,
        "episode": 17,
        "released": "2025-04-03",
        "overview": "Miss Patricia arrives at her first reunion to celebrate 10 seasons; Taylor and Salley dive into the season's back-and-forth accusations; Craig continues to process his breakup; Austen gets brutally honest about his longstanding friendship with Craig."
      },
      {
        "id": "tvmaze:3391848",
        "title": "Single and Ready to Mingle",
        "season": 11,
        "episode": 1,
        "released": "2025-11-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3441444",
        "title": "Making Waves",
        "season": 11,
        "episode": 2,
        "released": "2025-11-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3443689",
        "title": "A Novel Approach",
        "season": 11,
        "episode": 3,
        "released": "2025-12-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3443690",
        "title": "A Moveable Beast",
        "season": 11,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3454453",
        "title": "Loose Lips and Deep Rifts",
        "season": 11,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      }
    ]
  }
}