{
  "meta": {
    "id": "tvmaze:40752",
    "type": "series",
    "name": "Rob and Romesh Vs...",
    "description": "Rob Beckett and Romesh Ranganathan are putting their friendship to the test as they travel the world to meet a host of international superstars. They are on a mission to immerse themselves in these stars' worlds as they attempt to get a glimpse into their extraordinary lives, follow in their footsteps and find out what makes them who they are. Will their friendship last the journey?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/601/1503900.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/601/1503900.jpg",
    "videos": [
      {
        "id": "tvmaze:3459091",
        "title": "Hip Hop",
        "season": 8,
        "episode": 2,
        "released": "2025-12-16",
        "overview": "Rob Beckett and Romesh Ranganathan head to New York City to immerse themselves in the world of rap. meeting the Wu Tang Clan's Raekwon, one of Romesh's heroes."
      },
      {
        "id": "tvmaze:3459092",
        "title": "The Jungle",
        "season": 8,
        "episode": 3,
        "released": "2025-12-23",
        "overview": "Rob Beckett and Romesh Ranganathan venture into the depths of the Sumatran jungle to find out if they can take a photo worth of entry to fWildlife Photographer of the Year."
      },
      {
        "id": "tvmaze:3459093",
        "title": "Shakespeare",
        "season": 8,
        "episode": 4,
        "released": "2025-12-30",
        "overview": "The duo prepare to perform in Romeo and Juliet at Shakespeare's Globe, with advice from the theatre's artistic director Michelle Terry, and actors Jessie Buckley and Martin Freeman."
      },
      {
        "id": "tvmaze:1600911",
        "title": "Usain Bolt",
        "season": 1,
        "episode": 1,
        "released": "2019-01-25",
        "overview": "Comedian mates Rob Beckett and Romesh Ranganathan head to Jamaica to meet sprint legend Usain Bolt - the fastest man ever to have lived."
      },
      {
        "id": "tvmaze:1600912",
        "title": "The NFL",
        "season": 1,
        "episode": 2,
        "released": "2019-02-01",
        "overview": "Comedian mates Rob and Romesh meet and train with some of the NFL's biggest stars. Then, they get kitted up for a match in front of 80,000 people."
      },
      {
        "id": "tvmaze:1600913",
        "title": "Fashion",
        "season": 1,
        "episode": 3,
        "released": "2019-02-08",
        "overview": "Rob and Romesh strut their stuff on the catwalk and meet male model David Gandy. Then, it's off to NYC to try and bag a gig on a real-life runway."
      },
      {
        "id": "tvmaze:1600914",
        "title": "Superstar DJs",
        "season": 1,
        "episode": 4,
        "released": "2019-02-15",
        "overview": "Pals Rob and Romesh dance into the jet-setting, deck-spinning world of superstar DJs as they meet some of the world's greatest mixmasters."
      },
      {
        "id": "tvmaze:1600915",
        "title": "Country Music",
        "season": 1,
        "episode": 5,
        "released": "2019-02-22",
        "overview": "There's more laughs as mates Rob and Romesh meet up with Shania Twain, head to Nashville and perform their very own country song."
      },
      {
        "id": "tvmaze:1600916",
        "title": "Anthony Joshua: Revisited",
        "season": 1,
        "episode": 6,
        "released": "2019-03-01",
        "overview": "The boys meet heavyweight champ Anthony Joshua, watch him in action and chat to his boxer mate Tony Bellew."
      },
      {
        "id": "tvmaze:1853743",
        "title": "Ballet",
        "season": 2,
        "episode": 1,
        "released": "2020-05-05",
        "overview": "Best friends Rob Beckett and Romesh Ranganathan are back as they dive into the world of ballet, including roles in a real performance of Swan Lake"
      },
      {
        "id": "tvmaze:1858254",
        "title": "NBA Basketball",
        "season": 2,
        "episode": 2,
        "released": "2020-05-12",
        "overview": "Rob and Romesh learn about basketball, a journey that takes them from the street courts of Los Angeles to the iconic Staples Center itself."
      },
      {
        "id": "tvmaze:1860256",
        "title": "Cricket: South Africa",
        "season": 2,
        "episode": 3,
        "released": "2020-05-19",
        "overview": "The guys go to South Africa to follow England's cricket team. There's commentary, a lesson with Kevin Pietersen - and even a safari."
      },
      {
        "id": "tvmaze:1860257",
        "title": "Cricket: The Test",
        "season": 2,
        "episode": 4,
        "released": "2020-05-26",
        "overview": "Part two of the tour for cricket newbies Rob and Romesh as they follow England's Test series. The match comes to a dramatic finale."
      },
      {
        "id": "tvmaze:2016284",
        "title": "Art",
        "season": 3,
        "episode": 1,
        "released": "2021-02-04",
        "overview": "Rob Beckett and Romesh Ranganathan are back to dip their toes into the unknown, beginning by delving into the world of art. Romesh takes Rob on his first-ever trip to a gallery, before they head to an art school to learn different disciplines, before each of them has to create an exhibition for the world-famous Saatchi Gallery."
      },
      {
        "id": "tvmaze:2016285",
        "title": "Golf",
        "season": 3,
        "episode": 2,
        "released": "2021-02-11",
        "overview": "Rob Beckett shares his newfound love of the sport with Romesh Ranganathan and tries to get to him to become his golfing buddy. They play a round at the home of golf at St Andrews, have a lesson from Olympic champion Justin Rose and then get to tee off at the world famous BMW PGA Championship - live on Sky Sports."
      },
      {
        "id": "tvmaze:2016828",
        "title": "Drag",
        "season": 3,
        "episode": 3,
        "released": "2021-02-18",
        "overview": "For the final show of the series, Rob and Romesh will become Drag Queens. They'll be getting a full make-over from the stars of Drag Race - The Vivienne and Baga Chipz. They meet icon Michelle Visage to find their drag personas. Before each of them perform their very own drag routine in front of live audience."
      },
      {
        "id": "tvmaze:2115923",
        "title": "Team GB, Part 1",
        "season": 3,
        "episode": 4,
        "released": "2021-07-08",
        "overview": "Rob and Romesh are on a mission to see if they can join the ranks Team GB! Sick of being useless at sport, the duo try to find the one that even they can master. The first discipline they will be attempting is the canoe slalom, where Mallory Franklin and Kimberley Woods will send them down some sub-zero rapids. Next, they will try their hands at weightlifting before seeing if they have what it takes to be hockey goalkeepers. Hockey gold medallist and hero of the Rio Olympics Maddie Hinch will step in as their coach."
      },
      {
        "id": "tvmaze:2115924",
        "title": "Team GB, Part 2",
        "season": 3,
        "episode": 5,
        "released": "2021-07-15",
        "overview": "Rob and Romesh's sporting journey continues as they continue their search to find a sport and join Team GB. The pair will attempt clay pigeon shooting with Aaron Heading, gymnastics with sporting hero Max Whitlock and athletics with gold medallist Denise Lewis. Will they find their sport?"
      },
      {
        "id": "tvmaze:2115925",
        "title": "Andy Murray",
        "season": 3,
        "episode": 6,
        "released": "2021-07-22",
        "overview": "In this very special edition, Rob and Romesh will be hanging out with British sporting legend, Sir Andy Murray. They'll catch up with him as he models his new sports wear range, before being pushed to their limits in a tennis training session and Andy's favourite hobby, road cycling. Their mission is to try to get to know what makes the greatest British tennis player of all time really tick."
      },
      {
        "id": "tvmaze:2310622",
        "title": "Strongman",
        "season": 4,
        "episode": 1,
        "released": "2022-04-28",
        "overview": "Comedians Rob Beckett and Romesh Ranganathan team up again to take on more challenges, beginning by entering the world of strongman competitions. On their journey they head to Iceland to train with former champion Magnus Ver Magnusson, all with the aim of competing at the Arnold Sports Festival to find out which of the two is the strongest."
      },
      {
        "id": "tvmaze:2315963",
        "title": "The West End",
        "season": 4,
        "episode": 2,
        "released": "2022-05-05",
        "overview": "Rob and Romesh are on a mission to crack the world of musicals and land a role in a blockbuster show in London's West End. With the help of Samantha Barks - who stars as Elsa in Frozen The Musical - she guides the boys with some tips and pulls some strings to sort out an audition for one of the West End's biggest productions - Disney's The Lion King."
      },
      {
        "id": "tvmaze:2315964",
        "title": "Restaurants: First Course",
        "season": 4,
        "episode": 3,
        "released": "2022-05-12",
        "overview": "Rob and Romesh are opening their own restaurant! In the first of a special two parter, this week they learn all about the restaurant industry to find out what they will do for their own establishment. With the help of Michelin starred chef Tom Kerridge, the lads learn everything from Front of House to Foraging, with the show culminating as the boys become chefs during a real service in a real restaurant."
      },
      {
        "id": "tvmaze:2315965",
        "title": "Restaurants: Second Course",
        "season": 4,
        "episode": 4,
        "released": "2022-05-19",
        "overview": "Rob and Romesh's journey into the restaurant business continues... and this week it's opening night! Having to do everything from find a location to shopping for their ingredients, this two parter culminates with the boys opening London's very first Hip Hop Curry House - Robandroms."
      },
      {
        "id": "tvmaze:2592336",
        "title": "Magic in Vegas",
        "season": 5,
        "episode": 1,
        "released": "2023-07-19",
        "overview": "Comedians Rob Beckett and Romesh Ranganathan team up again to take on more challenges, beginning as they are invited by Penn &amp; Teller to join Las Vegas's longest-running residency show, but have just three days to pull their act together."
      },
      {
        "id": "tvmaze:2599036",
        "title": "K-Pop",
        "season": 5,
        "episode": 2,
        "released": "2023-07-26",
        "overview": "Comedians Rob Beckett and Romesh Ranganathan enter the world of the music phenomenon of K-Pop. They start their journey at a sold-out NCT Dream gig at Wembley Arena, then head to South Korea to learn about the genre."
      },
      {
        "id": "tvmaze:2599037",
        "title": "Crufts",
        "season": 5,
        "episode": 3,
        "released": "2023-08-02",
        "overview": "Dog owners Rob Beckett and Romesh Ranganathan enter their pets in Crufts to see if their new best friends can learn a thing or two, Seven-time Crufts champion and Britain's Got Talent star Ashleigh Butler acts as their guide as they training their dogs and teach them the key principles of dog training ahead of competing in the agility tournament at the event."
      },
      {
        "id": "tvmaze:2599038",
        "title": "Classical Music",
        "season": 5,
        "episode": 4,
        "released": "2023-08-09",
        "overview": "For one night only, Rob and Romesh join the London Philharmonic Orchestra for what promises to be a memorable performance at a packed-out Royal Festival Hall."
      },
      {
        "id": "tvmaze:2693723",
        "title": "Lapland",
        "season": 6,
        "episode": 1,
        "released": "2023-12-17",
        "overview": "Rob &amp; Romesh are spending the festive season in Lapland. The domain of elves, reindeer, festive magic and Santa Claus, Rob and Romesh will be trying their hand at all these jobs to see if there's one Christmas activity that they have the Christmas spirit for."
      },
      {
        "id": "tvmaze:2769803",
        "title": "F1 Monaco: Part 1",
        "season": 6,
        "episode": 2,
        "released": "2024-02-15",
        "overview": "Rob Beckett and Romesh Ranganathan enter the world of Formula One, hanging out with the Mercedes team at the Monaco GP, where they meet drivers Lewis Hamilton and George Russell. They also spend time with team principal Toto Wolff, who puts them through their paces to see if they have what it takes to get a job on the team."
      },
      {
        "id": "tvmaze:2769804",
        "title": "F1 Monaco: Part 2",
        "season": 6,
        "episode": 3,
        "released": "2024-02-22",
        "overview": "Rob Beckett and Romesh Ranganathan continue their Formula 1 journey in Monaco, hanging out with driver George Russell, before Rob finally takes his manual driving test."
      },
      {
        "id": "tvmaze:2986334",
        "title": "Hollywood Stunts",
        "season": 7,
        "episode": 1,
        "released": "2024-08-28",
        "overview": "Rob Beckett and Romesh Ranganathan take on more challenges, beginning by heading off to Los Angeles to throw themselves into the world of Hollywood stuntmen. They meet The Fall Guy stars Ryan Gosling and Emily Blunt before training with the film's director David Leitch, then head back to the UK to perform a stunt on Hollyoaks."
      },
      {
        "id": "tvmaze:2986335",
        "title": "Heavy Metal",
        "season": 7,
        "episode": 2,
        "released": "2024-09-04",
        "overview": "Scottish band Bleed from Within try to educate Rob Beckett and Romesh Ranganathan in the ways of the headbanger in time for a surprise performance of Metallica's Enter Sandman at the Download festival in front of 4,000 fans. The boys also get some extra tips from US rock stars Wheatus and Queens of the Stone Age."
      },
      {
        "id": "tvmaze:2986338",
        "title": "UFC",
        "season": 7,
        "episode": 3,
        "released": "2024-09-11",
        "overview": "Comedians Rob Beckett and Romesh Ranganathan enter the world of mixed martial arts, visiting the Ultimate Fighting Championship's International Fight Week in Vegas to train with the stars before taking on a one-on-one UFC challenge on top of the Eiffel Tower."
      },
      {
        "id": "tvmaze:3459090",
        "title": "Bollywood",
        "season": 8,
        "episode": 1,
        "released": "2025-12-09",
        "overview": "Rob Beckett and Romesh Ranganathan travel to Mumbai with the aim of breaking into one of the world's biggest film industries and earning roles in a Bollywood movie."
      }
    ]
  }
}