{
  "meta": {
    "id": "tvmaze:79724",
    "type": "series",
    "name": "The Entertainment Mix",
    "description": "Michelle McManus serves up big-name interviews, features and the latest in entertainment and culture news from across Scotland.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491791.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491791.jpg",
    "videos": [
      {
        "id": "tvmaze:3446672",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2025-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3011009",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2024-10-24",
        "overview": "Michelle McManus serves up the best of entertainment in Scotland including chats with Paul Black, Robert Lindsay and Stevens &amp; McCarthy. Plus, a session with SAY Award nominee Becky Sikasa."
      },
      {
        "id": "tvmaze:3433369",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2024-10-31",
        "overview": "Talking about his career and hit show Rivals, Gary Lamont joins Michelle McManus in the studio. Jason Donovan chats to Zara Janjua about touring with the Rocky Horror Show again."
      },
      {
        "id": "tvmaze:3433370",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2024-11-07",
        "overview": "Michelle McManus and Zara Janjua serve up the best of entertainment in Scotland, chatting to Karen Dunbar, Rhod Gilbert, Rag'n'Bone Man and Jodi Picoult."
      },
      {
        "id": "tvmaze:3433371",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2024-11-14",
        "overview": "Michelle McManus chats to Rick Astley and The B-52's singer Kate Pierson. Plus Nathan Evans performs in studio with The Saint PHNX band."
      },
      {
        "id": "tvmaze:3433372",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2024-11-21",
        "overview": "Michelle McManus chats to Gregor Fisher and Greg McHugh about Only Child, comedian Larry Dean shares stories behind his tour, and Joan Armatrading chats about her latest solo album."
      },
      {
        "id": "tvmaze:3433373",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2024-11-28",
        "overview": "Actor and producer Sam Heughan chats about the hugely anticipated return of Outlander. Plus, award-winning stand-up Katherine Ryan shares the inspiration behind her latest tour, Battleaxe."
      },
      {
        "id": "tvmaze:3433374",
        "title": "Episode 7",
        "season": 1,
        "episode": 7,
        "released": "2024-12-05",
        "overview": "Michelle chats to comedian Jason Byrne, singer-songwriter Katie Gregson-MacLeod and actor Peter Duncan. Nicola Meighan is joined by Simple Minds frontman Jim Kerr."
      },
      {
        "id": "tvmaze:3433375",
        "title": "Episode 8",
        "season": 1,
        "episode": 8,
        "released": "2024-12-12",
        "overview": "Michelle McManus gets in the festive spirit with Midge Ure, Still Game's Jane McCarry and Mark Cox, the cast of Shetland and of The Rig. Plus a Christmas performance with her band."
      },
      {
        "id": "tvmaze:3433376",
        "title": "Episode 9",
        "season": 1,
        "episode": 9,
        "released": "2025-02-06",
        "overview": "Michelle McManus serves up big name interviews, features and the latest in entertainment and culture news from across Scotland."
      },
      {
        "id": "tvmaze:3433377",
        "title": "Episode 10",
        "season": 1,
        "episode": 10,
        "released": "2025-02-13",
        "overview": "A glittering array of guests include Hollywood stars Julianne Nicholson and James Marsden, The Chief cast Jack Docherty and Carmen Pieraccini, Patti Boulaye and Kyle Falconer."
      },
      {
        "id": "tvmaze:3433378",
        "title": "Episode 11",
        "season": 1,
        "episode": 11,
        "released": "2025-02-20",
        "overview": "Michelle McManus presents another stunning line-up of stars from music, entertainment and film, including KT Tunstall, James Arthur, Gladiator Sabre, Zoe Lyons and Becky Sikasa."
      },
      {
        "id": "tvmaze:3433379",
        "title": "Episode 12",
        "season": 1,
        "episode": 12,
        "released": "2025-02-27",
        "overview": "Michelle McManus shares interviews from an all-star line-up including: Gary Kemp, Mhairi Black, Nina Conti, Craig Hill and Supermann on Da Beat. Plus music from Bottle Rockets."
      },
      {
        "id": "tvmaze:3433380",
        "title": "Episode 13",
        "season": 1,
        "episode": 13,
        "released": "2025-03-06",
        "overview": "Michelle McManus presents all the latest in entertainment from Matt Goss, Callum Beattie, Glasgow Film Festival, Jojo Moyes and Chris Brookmyre, plus music from Fourth Daughter."
      },
      {
        "id": "tvmaze:3433381",
        "title": "Episode 14",
        "season": 1,
        "episode": 14,
        "released": "2025-03-13",
        "overview": "Michelle McManus with the latest in entertainment from James McArdle, Nick Mohammed, Nathan Carter, May and Robert Miller, and a celebration of all things country ahead of C2C Festival."
      },
      {
        "id": "tvmaze:3433382",
        "title": "Episode 15",
        "season": 1,
        "episode": 15,
        "released": "2025-03-20",
        "overview": "Michelle McManus chats to Grado and Judith Ralston, Russell Kane, Kim Blythe, Julianne Nicolson and Eilidh Fisher. Plus, Len Pennie meets Makar Peter Mackay."
      },
      {
        "id": "tvmaze:3433383",
        "title": "Episode 16",
        "season": 1,
        "episode": 16,
        "released": "2025-03-27",
        "overview": "Michelle McManus serves the best showbiz stories and big-name interviews from across Scotland. With Mark Bonnar, Matt Forde, Rebecca Vasmant, Tom Grennan, Susie McCabe and Lauren Mayberry."
      },
      {
        "id": "tvmaze:3433384",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2025-10-23",
        "overview": "Michelle's guests are Nathan Evans, Dan from Bastille, Siobhan McSweeney and Eric McCormack, Rianne Downey, and Nathan Sykes."
      },
      {
        "id": "tvmaze:3433385",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2025-10-30",
        "overview": "Michelle's guests include comedian Adam Hills, music icon Suzanne Vega, stand-up Stuart Mitchell and Transvision Vamp frontwoman Wendy James. Plus music from Butler, Blake &amp; Grant."
      },
      {
        "id": "tvmaze:3433386",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2025-11-06",
        "overview": "Michelle welcomes Amy Macdonald, Karen Dunbar, Laurie Kynaston and Alex Lawther. Plus, a preview of the Scottish Album of the Year Award in Dundee and a performance from Brooke Combe."
      },
      {
        "id": "tvmaze:3433387",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2025-11-13",
        "overview": "Michelle's guests are KT Tunstall, Shetland stars Alison O'Donnell and Steven Robertson, and UB40. Plus Judith Ralston and Phil Goodlad take on a Children in Need challenge."
      },
      {
        "id": "tvmaze:3433388",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2025-11-20",
        "overview": "Michelle's guests include RuPaul's Drag Race UK queen Elle Vosque, Aberdeenshire's Calum Bowie, and pop powerhouse Ella Eyre."
      },
      {
        "id": "tvmaze:3438848",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2025-11-27",
        "overview": "Michelle's guests include Line of Duty star Vicky McClure and husband Jonny Owen as they bring their hit daytime clubbing event back to Scotland."
      },
      {
        "id": "tvmaze:3440909",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2025-12-04",
        "overview": ""
      }
    ]
  }
}