{
  "meta": {
    "id": "tvmaze:24160",
    "type": "series",
    "name": "Rose Parade",
    "description": "The Rose Parade, also known as the Tournament of Roses Parade and the Rose Parade presented by Honda, is part of \"America's New Year Celebration\" held in Pasadena, California each year on New Year's Day (or on Monday, January 2 if New Year's Day falls on a Sunday). The parade includes flower-covered floats, marching bands, and equestrian units and is followed by the Rose Bowl college football game. It is produced by the nonprofit Pasadena Tournament of Roses Association. Originally started on January 1, 1890, the Rose Parade is watched in person by hundreds of thousands of spectators on the parade route, and is broadcast in the United States. It is seen by millions more on television worldwide in more than 100 international territories and countries. The Rose Bowl is a college football game that was added in 1902 to help fund the cost of staging the parade. Since 2011, the parade has been sponsored by Honda. Accordingly, the company has the parade's first float, which like all floats, follows the parade's theme. The 2017 parade will feature 44 floats, 19 equestrian units with approximately 400 horses, and 22 marching bands.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373649.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/549/1373649.jpg",
    "videos": [
      {
        "id": "tvmaze:3365836",
        "title": "137th Rose Parade",
        "season": 2026,
        "episode": 1,
        "released": "2026-01-01",
        "overview": ""
      },
      {
        "id": "tvmaze:1029816",
        "title": "The 128th Rose Parade",
        "season": 2017,
        "episode": 1,
        "released": "2017-01-02",
        "overview": "The annual march takes place in Pasadena, Calif.; Hannah Storm and John Anderson host."
      },
      {
        "id": "tvmaze:1359211",
        "title": "The 129th Rose Parade",
        "season": 2018,
        "episode": 1,
        "released": "2018-01-01",
        "overview": "The fun kicks off with an exciting opening celebration by Honda featuring \"Power of Dreams Express,\" the colorful lead float entry bringing together volunteers and philanthropic organizations working to make a difference in the lives of children. Other parade highlights include a majestic floral monument of Dr. Martin Luther King Jr. on the AIDS Healthcare Foundation float saluting the iconic civil rights crusader, a lively entry from the Los Angeles Forum celebrating the music and entertainment venue's 50-year anniversary, Lucy Pet Foundation's \"Paws for Life\" entry honoring heroic service animals from around the country, the UPS Store's whimsical sea monster float titled \"Books Bring Dreams to Life\" and Dole's \"Sharing Nature's Bounty\" entry featuring dazzling floral animals and a cascading waterfall.Adding to the fun will be 18 equestrian teams, including the world-famous Budweiser Clydesdales as well as miniature horses, as well as 22 incredible marching bands from the U.S. and as far away as Australia and Japan. This year's Rose Queen and her court will also appear.The Pasadena Police Department estimates that more than 700,000 spectators will line the five-and-a-half mile parade route. Tens of millions of people worldwide watch the telecast every year."
      },
      {
        "id": "tvmaze:1660746",
        "title": "The 130th Rose Parade",
        "season": 2019,
        "episode": 1,
        "released": "2019-01-01",
        "overview": ""
      },
      {
        "id": "tvmaze:1775144",
        "title": "The 131st Rose Parade",
        "season": 2020,
        "episode": 1,
        "released": "2020-01-01",
        "overview": "The 2020 telecast will mark Roker's 23rd year as host and the seventh year for Kotb. NBC is celebrating its 93rd year broadcasting the Rose Parade, beginning on radio in 1927 and then televising the popular annual event beginning in 1954.Rita Moreno, Gina Torres and Laurie Hernandez will serve as the 2020 Grand Marshals."
      },
      {
        "id": "tvmaze:1831284",
        "title": "The 133rd Rose Parade",
        "season": 2022,
        "episode": 1,
        "released": "2022-01-01",
        "overview": "Chrissy Metz and Susan Kelechi Watson will host this year's telecast from Pasadena, Calif.NBC is celebrating its 95th year broadcasting the Rose Parade, beginning on radio in 1927 and then televising the annual event beginning in 1954.Emmy and Peabody Award-winning actor, director, educator and lifelong children's literacy advocate LeVar Burton was previously announced by the Tournament of Roses as this year's Grand Marshal, along with this year's theme, \"Dream. Believe. Achieve.\"Nearly a thousand white-glove volunteers will spend more than 80,000 meticulous hours creating this year's masterpiece floral floats that will span up to 75-feet long and up to 35-feet high. The floats will feature effects such as pyrotechnics, smoke, waterfalls, streamers and bubbles. Beginning with a B-2 Spirit flyover, viewers will also enjoy hundreds of energetic performers and, as previously announced, 20 marching bands from the U.S. and around the world. Parade participants also include equestrian teams, the USMC Mounted Color Guard and of course, the famous Rose Queen and her Royal Court."
      },
      {
        "id": "tvmaze:2452991",
        "title": "The 134th Rose Parade",
        "season": 2023,
        "episode": 1,
        "released": "2023-01-02",
        "overview": "\"Access Hollywood\" and \"Access Daily with Mario &amp; Kit\" co-host Mario Lopez and \"American Auto\" star Ana Gasteyer will take the reins for this year's telecast from Pasadena, Calif."
      },
      {
        "id": "tvmaze:2682969",
        "title": "135th Rose Parade",
        "season": 2024,
        "episode": 1,
        "released": "2024-01-01",
        "overview": "The streets of Pasadena, Calif., are lined with thousands of parade fans as gorgeous rose-covered floats and marching bands partake in their annual New Year's holiday festivities. Hosted by \"TODAY\" anchors Hoda Kotb and Al Roker."
      },
      {
        "id": "tvmaze:3089576",
        "title": "136th Rose Parade",
        "season": 2025,
        "episode": 1,
        "released": "2025-01-01",
        "overview": ""
      }
    ]
  }
}