{
  "meta": {
    "id": "tvmaze:612",
    "type": "series",
    "name": "Expedition Unknown",
    "description": "In the hit series Expedition Unknown, Travel Channel's witty explorer Josh Gates seeks answers to some of the world's most captivating unsolved stories and legends. Gates is on a mission to find the truth behind each iconic legend, digging through years of historical evidence, facts and myths. Leaving no stone unturned, his adventures take him around the globe as he immerses himself in the core locales linked to each tale. From excavating ruins in search of the real Robin Hood to sailing the high seas investigating Christopher Columbus and exploring Nepal's \"sky caves\" for Shangri La, Gates' archaeological background and ubiquitous sense of humor generate a new take on age-old stories.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361732.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361732.jpg",
    "videos": [
      {
        "id": "tvmaze:3455284",
        "title": "Vanderbilt's Lost Steamship",
        "season": 16,
        "episode": 6,
        "released": "2025-12-10",
        "overview": "Josh braves Nicaragua's croc-infested waters and snake-filled jungle to find the wreckage of the Orus. Chasing Gold Rush-era fortune, Vanderbilt's ship crashed on its maiden attempt to create a new route between the Atlantic and Pacific."
      },
      {
        "id": "tvmaze:3455283",
        "title": "The Real Goonies Treasure",
        "season": 16,
        "episode": 5,
        "released": "2025-12-03",
        "overview": "For the 40th Anniversary of The Goonies, Josh braves the Oregon coast to search for pirate treasure that inspired his all-time favorite movie. On the rocky shores of the Pacific, he finds pieces of a Spanish galleon that wrecked in 1694."
      },
      {
        "id": "tvmaze:116549",
        "title": "Amelia Earheart",
        "season": 1,
        "episode": 1,
        "released": "2015-01-08",
        "overview": "Adventurer Josh Gates hunts down new evidence on the disappearance of Amelia Earhart. He treks to uncharted tribal lands in Papua New Guinea and ends his journey in Fiji, hoping to uncover the pilot's remains."
      },
      {
        "id": "tvmaze:116550",
        "title": "Temple of Doom",
        "season": 1,
        "episode": 2,
        "released": "2015-01-15",
        "overview": "Josh travels to the remote and land-mine-riddled jungles of Cambodia to investigate the lost city of the Khmer Empire and search for a mystical relic that gave its god king the power to incinerate his enemies more than 1,000 years ago."
      },
      {
        "id": "tvmaze:116551",
        "title": "World's 8th Wonder",
        "season": 1,
        "episode": 3,
        "released": "2015-01-22",
        "overview": "Josh is on the trail of Russia's missing Amber Panels, priceless pieces of art stolen by the Nazis during WWII. After starting in St. Petersburg, Russia, and getting exposed to the local culture, Josh makes a brief pit stop in Berlin to marvel at the city's amazing turnaround since the end of the Cold War."
      },
      {
        "id": "tvmaze:128617",
        "title": "The Legend of Jesse James",
        "season": 1,
        "episode": 4,
        "released": "2015-01-29",
        "overview": "Josh journeys across the Midwest in search of the legendary golden loot of famed American outlaw Jesse James. Along the way, Josh debunks myths about James, rappels off a cliff in the Wichita Mountains and follows treasure hunters into Buzzards Roost."
      },
      {
        "id": "tvmaze:128618",
        "title": "City of Gold",
        "season": 1,
        "episode": 5,
        "released": "2015-02-05",
        "overview": "Josh treks the stone-paved Inca Trail, ascending through the Andes and into the Peruvian Amazon in search of the undiscovered City of Gold. His road to riches takes a detour to the legendary ruins of Machu Picchu."
      },
      {
        "id": "tvmaze:140790",
        "title": "Viking Sunstone",
        "season": 1,
        "episode": 6,
        "released": "2015-02-12",
        "overview": "Josh travels to England and Norway to unlock the secrets of the Viking sunstone, a mystic crystal the Vikings used to conquer the seas. Before testing it, he explores a crypt in a Nordic church and descends 1,000 feet into a deserted mine."
      },
      {
        "id": "tvmaze:140791",
        "title": "Captain Morgan's Lost Gold",
        "season": 1,
        "episode": 7,
        "released": "2015-02-19",
        "overview": "Josh joins a team of archaeologists in Panama as they search for the Satisfaction, the sunken flagship of legendary pirate Captain Morgan. Using a magnetometer, which reads ferrous metals on the seafloor, they scour the reef for additional signs of wreckage."
      },
      {
        "id": "tvmaze:140792",
        "title": "Code to Gold",
        "season": 1,
        "episode": 8,
        "released": "2015-02-26",
        "overview": "Josh scours the Virginia backcountry in search of the legendary Thomas Beale treasure, which would be worth millions today. Since encrypted codes are hiding its whereabouts, Josh takes a detour to Philadelphia to uncover missing pieces of the puzzle."
      },
      {
        "id": "tvmaze:151425",
        "title": "Secrets of the Nazca",
        "season": 1,
        "episode": 9,
        "released": "2015-03-19",
        "overview": "Josh flies to Peru to investigate the giant geoglyphs drawn into earth by ancient Nazca tribes. By studying newly found lines and joining a Nazca psychedelic ritual, Josh uncovers the true meaning behind the mysterious tracings."
      },
      {
        "id": "tvmaze:151426",
        "title": "Mayan Apocalypse",
        "season": 1,
        "episode": 10,
        "released": "2015-03-05",
        "overview": "While investigating the fall of the remarkable Mayan Empire, Josh unearths human skulls and ancient Mayan sacrificial altars in the caverns underneath the jungles and ruins of Mexico."
      },
      {
        "id": "tvmaze:150804",
        "title": "Samurai Sword of Power",
        "season": 1,
        "episode": 11,
        "released": "2015-03-26",
        "overview": "Josh searches through various ancient shrines in Japan looking for the mystical Honjo Masamune sword. During his travels, Josh learns the ways of the samurai and is educated on how to forge his own sword."
      },
      {
        "id": "tvmaze:151427",
        "title": "Curse of the Golden Bell",
        "season": 1,
        "episode": 12,
        "released": "2015-04-02",
        "overview": "Josh joins local divers in the Southeast Asian country of Myanmar to search for the ancient cursed Great Bell of King Dhammazedi. To recover it, Josh dives into violent waters that have claimed the lives of several other divers."
      },
      {
        "id": "tvmaze:284804",
        "title": "The Quest for King Arthur",
        "season": 2,
        "episode": 1,
        "released": "2015-10-07",
        "overview": "Josh traverses England, Wales, and Scotland, wading through history and legend to search for evidence of a real King Arthur. In Wales, Josh has a close call rappelling into the hundreds of miles of underground caves."
      },
      {
        "id": "tvmaze:311628",
        "title": "Genghis Khan's Tomb",
        "season": 2,
        "episode": 2,
        "released": "2015-10-14",
        "overview": "Josh journeys into the heart of Mongolia in search of the fabled lost tomb of Genghis Khan. After encountering harsh weather and resistance from locals, can Josh enter Mongolia's \"Forbidden Zone\" to locate the burial grounds?"
      },
      {
        "id": "tvmaze:311630",
        "title": "Blackbeard's Hidden Gold",
        "season": 2,
        "episode": 3,
        "released": "2015-10-21",
        "overview": "Josh explores the ocean floor of the Cayman Islands and the coasts of North Carolina in his quest to find the lost treasure of the legendary pirate Blackbeard."
      },
      {
        "id": "tvmaze:335859",
        "title": "Hunting Vampires",
        "season": 2,
        "episode": 4,
        "released": "2015-10-28",
        "overview": "Josh explores the history of vampirism in Romania and Bulgaria."
      },
      {
        "id": "tvmaze:401184",
        "title": "The Real Robin Hood",
        "season": 2,
        "episode": 5,
        "released": "2015-11-04",
        "overview": "Josh travels to the English countryside in search of the real Robin Hood."
      },
      {
        "id": "tvmaze:457021",
        "title": "Finding Fenn's Fortune",
        "season": 2,
        "episode": 6,
        "released": "2015-11-18",
        "overview": "A $2 Million treasure hidden deep in the Rocky Mountains."
      },
      {
        "id": "tvmaze:480125",
        "title": "Secrets of Christopher Columbus",
        "season": 2,
        "episode": 7,
        "released": "2015-12-02",
        "overview": "Retracing Columbus' incredible voyages, the search for his final resting place and the search for the missing ship that altered the course of human history."
      },
      {
        "id": "tvmaze:480126",
        "title": "Columbus Unearthed",
        "season": 2,
        "episode": 8,
        "released": "2015-12-09",
        "overview": "The search for the missing bones of Columbus in the Caribbean and Spain."
      },
      {
        "id": "tvmaze:480127",
        "title": "Japan's Atlantis",
        "season": 2,
        "episode": 9,
        "released": "2015-12-16",
        "overview": "The sunken ruins called Japan's Atlantis."
      },
      {
        "id": "tvmaze:480128",
        "title": "True Cross of Christ",
        "season": 2,
        "episode": 10,
        "released": "2015-12-23",
        "overview": "The True Cross of Christ in Jerusalem and Istanbul."
      },
      {
        "id": "tvmaze:561270",
        "title": "The Sultan's Heart",
        "season": 2,
        "episode": 11,
        "released": "2016-01-06",
        "overview": "Traveling to Turkey and Hungary searching for the heart of a former ruler."
      },
      {
        "id": "tvmaze:553755",
        "title": "Africa's Gold Hoard",
        "season": 2,
        "episode": 12,
        "released": "2016-01-13",
        "overview": "The Kruger Millions in the harsh wild of South Africa."
      },
      {
        "id": "tvmaze:561269",
        "title": "Kalahari Desert's Lost City",
        "season": 2,
        "episode": 13,
        "released": "2016-01-27",
        "overview": "Josh traverses Africa's Kalahari Desert, looking for a fabled lost city."
      },
      {
        "id": "tvmaze:578010",
        "title": "Yamashita's Gold",
        "season": 2,
        "episode": 14,
        "released": "2016-02-10",
        "overview": "Searching for gold in the Philippines hidden by Japan in WWII"
      },
      {
        "id": "tvmaze:847413",
        "title": "Searching for Shangri-La",
        "season": 2,
        "episode": 15,
        "released": "2016-03-02",
        "overview": "Josh treks high into the Sky Caves of Nepal in search of the origins of the Shangri-La myth, the fabled heaven on earth."
      },
      {
        "id": "tvmaze:847427",
        "title": "Shangri-La Found",
        "season": 2,
        "episode": 16,
        "released": "2016-03-09",
        "overview": "Josh treks high into the Sky Caves of Nepal in search of the origins of the Shangri-La myth, the fabled heaven on earth."
      },
      {
        "id": "tvmaze:765140",
        "title": "Lost Mexican City",
        "season": 2,
        "episode": 17,
        "released": "2016-06-01",
        "overview": "Josh Gates searches Mexico for clues behind the mysterious rise and disappearance of Teotihuacan, a powerful civilization that predated the Aztecs in Mesoamerica. His search takes him under the largest pyramid in the world and to a dangerous mine that could explain their influence."
      },
      {
        "id": "tvmaze:765160",
        "title": "Incan King's Mummy",
        "season": 2,
        "episode": 18,
        "released": "2016-06-08",
        "overview": "Josh Gates ventures into the mysterious cloud forests of Ecuador's remote central highlands in search of the all-powerful mummy of the last Inca king, Atahualpa."
      },
      {
        "id": "tvmaze:765176",
        "title": "Nazi Gold Train",
        "season": 2,
        "episode": 19,
        "released": "2016-06-15",
        "overview": "Josh Gates travels to Europe to expose the last secrets of the Nazi empire. He searches for a buried train filled with stolen gold, explores the tunnels of the notorious Project Riese and hunts for a lost fortune at the bottom of a lake."
      },
      {
        "id": "tvmaze:765195",
        "title": "Hitler's Atomic Secrets",
        "season": 2,
        "episode": 20,
        "released": "2016-06-22",
        "overview": "Josh Gates travels to Austria to expose the secrets of the Third Reich. During his expedition, he dives into an Alpine lake to locate a lost fortune and goes underground to search for a top secret Nazi nuclear laboratory."
      },
      {
        "id": "tvmaze:961266",
        "title": "Plummer's Gold",
        "season": 3,
        "episode": 1,
        "released": "2016-11-02",
        "overview": "Josh Gates heads to Montana, the Gold Rush territory to search for the missing fortune of notorious Old West sheriff, Henry Plummer."
      },
      {
        "id": "tvmaze:968586",
        "title": "The Lost Tomb of Attila the Hun",
        "season": 3,
        "episode": 2,
        "released": "2016-11-09",
        "overview": "Josh travels to Hungary to join three separate archeological teams looking for the lost tomb of Attila the Hun; legends and ancient texts lead the search from the bottom of the Danube to the mountain forests just outside of Budapest."
      },
      {
        "id": "tvmaze:978807",
        "title": "The Vanished Empire",
        "season": 3,
        "episode": 3,
        "released": "2016-11-16",
        "overview": "Josh travels to Greece to explore Europe's first superpower and how it disappeared on the Mediterranean island of Crete."
      },
      {
        "id": "tvmaze:978808",
        "title": "The Lost Colony of Roanoke",
        "season": 3,
        "episode": 4,
        "released": "2016-11-23",
        "overview": "America's first missing-persons case, the Lost Colony of Roanoke, is investigated with newly discovered clues."
      },
      {
        "id": "tvmaze:993321",
        "title": "Cloning the Woolly Mammoth",
        "season": 3,
        "episode": 5,
        "released": "2016-12-28",
        "overview": "One of the most iconic creatures of the Ice Age, the Woolly Mammoth, has gone extinct and Joash and the team search for enough DNA to clone a woolly mammoth."
      },
      {
        "id": "tvmaze:1016954",
        "title": "Journey to the Ice Age",
        "season": 3,
        "episode": 6,
        "released": "2017-01-04",
        "overview": "Josh retrieves bone samples from the massive Batagay crater and gets DNA results to find out if the woolly mammoth will walk the earth again."
      },
      {
        "id": "tvmaze:1022607",
        "title": "Cracking the D.B. Cooper Case",
        "season": 3,
        "episode": 7,
        "released": "2017-01-11",
        "overview": "Josh Gates sets off on an expedition to crack the mystery behind the perpetrator of the only unsolved plane hijacking in U.S. history."
      },
      {
        "id": "tvmaze:1022608",
        "title": "Lasseter's Gold",
        "season": 3,
        "episode": 8,
        "released": "2017-01-18",
        "overview": "Josh Gates sets off deep into the Australian Outback, following the footsteps of legendary explorer Harold Lasseter, who claims to have found a vast field of gold."
      },
      {
        "id": "tvmaze:1039330",
        "title": "Tracking Tasmania's Tiger",
        "season": 3,
        "episode": 9,
        "released": "2017-01-25",
        "overview": "Josh Gates ventures to Australia's island state of Tasmania to investigate sightings of the supposedly extinct Thylacine, also known as the Tasmanian Tiger."
      },
      {
        "id": "tvmaze:1066943",
        "title": "Captain Kidd's Treasure",
        "season": 3,
        "episode": 10,
        "released": "2017-02-22",
        "overview": "Josh retraces the footsteps of the legendary Captain Kidd in the hopes of finding his buried treasure; from the East Coast to the Caribbean, the search takes him to a real pirate shipwreck and to the island hideout of the notorious buccaneer."
      },
      {
        "id": "tvmaze:1066944",
        "title": "Africa's Cursed Lake of Gold",
        "season": 3,
        "episode": 11,
        "released": "2017-03-01",
        "overview": "Josh Gates journeys to the wilds of Namibia to embark on a treacherously deep dive in Lake Otjikoto for a long lost World War I treasure."
      },
      {
        "id": "tvmaze:1080738",
        "title": "The Ark of the Covenant",
        "season": 3,
        "episode": 12,
        "released": "2017-03-08",
        "overview": "Josh Gates follows in the footsteps of Indiana Jones as he searches in Israel and Ethiopia for the lost Ark of the Covenant, the sacred relic said to contain the Ten Commandments and possess extraordinary powers."
      },
      {
        "id": "tvmaze:1080739",
        "title": "England's Vanished Crown Jewels",
        "season": 3,
        "episode": 13,
        "released": "2017-03-15",
        "overview": "Josh Gates goes on a quest to find the legendary lost treasure of King John; exploring the deadly marshlands of England to find the despised king's crown jewels, which were swept away in a freak tidal surge in the 13th century."
      },
      {
        "id": "tvmaze:1084866",
        "title": "Corsica's Nazi Treasure",
        "season": 3,
        "episode": 14,
        "released": "2017-03-22",
        "overview": "Josh Gates hunts for the hidden treasure of Erwin Rommel, a Nazi general who plundered the wealth of North Africa as his tank corps fled the continent; never-explored underground lakes and undersea relics of World War II."
      },
      {
        "id": "tvmaze:1171970",
        "title": "Italy's Barbarian Booty",
        "season": 3,
        "episode": 15,
        "released": "2017-05-31",
        "overview": "To find the plundered riches of the Roman Empire, Josh Gates must locate the tomb of the Visigoth king Alaric in Italy; the hunt extends from the capital of Rome to the southern city of Cosenza."
      },
      {
        "id": "tvmaze:1171971",
        "title": "India's Atlantis",
        "season": 3,
        "episode": 16,
        "released": "2017-06-07",
        "overview": "Josh Gates travels to India in search of Dwarka, a mythical kingdom swallowed by the ocean. To find find evidence that the golden city is real, Josh dives into the Arabian Sea and visits a dig site that could rewrite history."
      },
      {
        "id": "tvmaze:1198974",
        "title": "Lost Spanish Fortune, Found!",
        "season": 3,
        "episode": 17,
        "released": "2017-06-14",
        "overview": "Josh Gates travels down to the coast of Florida and to the recently opened Cuba in search of a sunken treasure from a fleet of Spanish ships that were sunk in 1715; the hunt takes in deep into the Atlantic and the National Archives of Cuba."
      },
      {
        "id": "tvmaze:1379670",
        "title": "Viking Secrets",
        "season": 4,
        "episode": 1,
        "released": "2017-12-27",
        "overview": "Josh investigates how a group of Norse tribesman gained power in medieval Europe. His search for answers begins in their one-time home base of Denmark and continues on to the first place they expanded off the continent, the remote island of Iceland."
      },
      {
        "id": "tvmaze:1379671",
        "title": "Vikings in America",
        "season": 4,
        "episode": 2,
        "released": "2018-01-03",
        "overview": "Josh traces the Vikings' westward expansion from the volcanic landscape of Iceland to a mysterious settlement in Greenland and into North America. He aims to find out if they landed in the United States over 500 years before any other Europeans."
      },
      {
        "id": "tvmaze:1379672",
        "title": "Origins of Stonehenge",
        "season": 4,
        "episode": 3,
        "released": "2018-01-10",
        "overview": "Josh travels to his ancestral home of Great Britain to explore the origins of Stonehenge. From high in the air to deep under the sea, he finds an unexpected network of monuments that could have inspired one of history's most mystical locations."
      },
      {
        "id": "tvmaze:1379673",
        "title": "The Secret",
        "season": 4,
        "episode": 4,
        "released": "2018-01-17",
        "overview": "Josh travels all over the US to find the treasures featured in The Secret, a cryptic book published in the 1980s. He meets with members of the book's cult following, who each think they're on the verge of finding one of the 10 remaining treasures."
      },
      {
        "id": "tvmaze:1379675",
        "title": "Butch Cassidy's Lost Loot",
        "season": 4,
        "episode": 5,
        "released": "2018-01-24",
        "overview": "Josh immerses himself in Wild West lore on a quest to find Butch Cassidy's missing money. He traces the iconic outlaw's footsteps through Colorado, Utah and Nevada, eventually learning that he may need to find the man himself to locate the lost loot."
      },
      {
        "id": "tvmaze:1402192",
        "title": "Hunt for the Metal Library",
        "season": 4,
        "episode": 6,
        "released": "2018-01-31",
        "overview": "Josh travels through the jungles of Ecuador to explore the watery depths of Tayos Cave for a legendary set of metal plates believed to be created by an advanced ancient civilization."
      },
      {
        "id": "tvmaze:1406994",
        "title": "Great Women of Ancient Egypt",
        "season": 4,
        "episode": 7,
        "released": "2018-02-07",
        "overview": "In this first installment of an epic two-part episode, Josh journeys through the land of the Nile to uncover the secrets of the most powerful, and most elusive, women in ancient Egypt -- Hatshepsut, Nefertiti and Cleopatra."
      },
      {
        "id": "tvmaze:1406995",
        "title": "Egypt's Lost Queens",
        "season": 4,
        "episode": 8,
        "released": "2018-02-14",
        "overview": "In the second installment of an epic two-part investigation, Josh continues his journey through Egypt to uncover the secrets, and possibly the final resting place, of ancient history's most powerful women rulers -- Nefertiti and Cleopatra."
      },
      {
        "id": "tvmaze:1406997",
        "title": "Secrets of Brother XII",
        "season": 4,
        "episode": 9,
        "released": "2018-02-28",
        "overview": "Josh Gates attempts to uncover a treasure left behind by the Aquarian Foundation, an isolated, insidious cult led by the notorious leader known as Brother XII."
      },
      {
        "id": "tvmaze:1474203",
        "title": "Legend of the Snake King, Part 1",
        "season": 5,
        "episode": 1,
        "released": "2018-05-29",
        "overview": "Josh Gates and his team join noted archaeologist Dr. Richard Hansen on an adventurous quest to the lost-city of El Mirador deep in the Guatemalan rainforest. Their mission: to find the hidden tombs of the mysterious Maya Snake Kings. Archaeologists have discovered that the sprawling ruins of this ancient mega-city are larger than Los Angeles and contain what might be the largest pyramid in the Americas. Josh explores overgrown temples, plaster-paved roads, and evidence of advanced engineering and art. Using advanced laser scanners and remote sensing technology, Josh and his team reveal the secrets of why this incredible civilization suddenly and completely vanished. Their search for the tombs of the elusive Snake Kings leads to a thrilling and dangerous adventure, and culminates in what may be the most significant discovery in Expedition Unknown history."
      },
      {
        "id": "tvmaze:1474204",
        "title": "Legend of the Snake King, Part 2",
        "season": 5,
        "episode": 2,
        "released": "2018-06-05",
        "overview": "After Josh Gates' epic investigations into the mysteries of the world, he sits down with his crew and specialists to discuss his greatest discoveries and most surprising revelations."
      },
      {
        "id": "tvmaze:1474205",
        "title": "Nazis in Argentina",
        "season": 5,
        "episode": 3,
        "released": "2018-06-12",
        "overview": "Josh treks to Argentina, which became a haven for many Nazi SS officers after World War II: he uncovers secret Nazi hideouts and investigates the conspiracy theory about Adolf Hitler's ultimate fate."
      },
      {
        "id": "tvmaze:1474206",
        "title": "Jean Lafitte's Treasure",
        "season": 5,
        "episode": 4,
        "released": "2018-06-19",
        "overview": "Josh Gates investigates the legends swirling around the storied life and death of French pirate Jean Lafitte who is reputed to have buried treasure at sites in coastal Louisiana."
      },
      {
        "id": "tvmaze:1474207",
        "title": "Mahogany Ship",
        "season": 5,
        "episode": 5,
        "released": "2018-06-26",
        "overview": "Josh goes down under to search along Australia's infamous Shipwreck Coast for the missing Mahogany Ship."
      },
      {
        "id": "tvmaze:1494865",
        "title": "Hunt for the Red Slippers",
        "season": 5,
        "episode": 6,
        "released": "2018-07-10",
        "overview": "Josh investigates the theft of one of the most iconic pieces of Hollywood memorabilia of all time -- the ruby slippers worn by Judy Garland in the 1939 classic movie, The Wizard of Oz."
      },
      {
        "id": "tvmaze:1526628",
        "title": "Solved: Mystery of the Lost Ruby Slippers",
        "season": 5,
        "episode": 7,
        "released": "2018-09-05",
        "overview": "With updates following the recovery of the ruby slippers - Josh investigates the theft of one of the most iconic pieces of Hollywood memorabilia of all time: the ruby slippers worn by Judy Garland in the 1939 classic movie, The Wizard of Oz."
      },
      {
        "id": "tvmaze:1638141",
        "title": "Deciphering the Last Nazi Code",
        "season": 6,
        "episode": 1,
        "released": "2019-04-10",
        "overview": "Josh Gates ventures into the former Third Reich in search of an elusive Nazi fortune hidden with a code allegedly created by Hitler's private secretary, and embedded into a piece of sheet music."
      },
      {
        "id": "tvmaze:1641662",
        "title": "Mysteries of Jesus",
        "season": 6,
        "episode": 2,
        "released": "2019-04-17",
        "overview": "Josh Gates journeys to the Holy Land to investigate a mystery of biblical proportions where was Jesus Christ actually born? The investigation leads to potentially explosive revelations that may change our understanding of Jesus' origin story."
      },
      {
        "id": "tvmaze:1645418",
        "title": "Atlantis of the Andes",
        "season": 6,
        "episode": 3,
        "released": "2019-04-24",
        "overview": "Josh Gates dives into a mystery below the surface of Lake Titicaca in South America; during the investigation, Josh discovers multiple structures of the ancient Tiwanaku people, including ruins hidden in the depths, dubbed the Atlantis of the Andes."
      },
      {
        "id": "tvmaze:1645419",
        "title": "Lost Gold of Scotland",
        "season": 6,
        "episode": 4,
        "released": "2019-05-01",
        "overview": "Hunting for a lost cache of gold, Josh Gates heads to the Scottish Highlands; his search focuses on a huge gold reserve hidden after the Jacobite Uprising of 1745 and never recovered; Josh joins treasure hunters chasing a lead across the Highlands."
      },
      {
        "id": "tvmaze:1653656",
        "title": "Ghost Ship of the Great Lakes",
        "season": 6,
        "episode": 5,
        "released": "2019-05-08",
        "overview": "Josh uses a state of the art two-man submersible to find The Griffon, the first ship to be lost in the Great Lakes."
      },
      {
        "id": "tvmaze:1653657",
        "title": "Legend of the Crystal Skull",
        "season": 6,
        "episode": 6,
        "released": "2019-05-15",
        "overview": "Josh Gates takes on Central America's jungles to investigate the legendary crystal skull discovered by a renowned adventurer who was the inspiration for the movie character, Indiana Jones."
      },
      {
        "id": "tvmaze:1660038",
        "title": "America's Lost WWII Hero",
        "season": 6,
        "episode": 7,
        "released": "2019-05-22",
        "overview": "Josh Gates explores the case of lost World War II hero Gertrude \"Tommy\" Tompkins of the Women Air Force Service Pilots, who went missing when her P-51 Mustang crashed. Josh joins search teams using cutting-edge technology to bring the lost hero home."
      },
      {
        "id": "tvmaze:1660039",
        "title": "The Hunt for the Golden Owl",
        "season": 6,
        "episode": 8,
        "released": "2019-05-29",
        "overview": "Josh uses a book of riddles with cryptic clues and joins treasure hunters using new leads to find the Golden Owl statuette hidden somewhere in France."
      },
      {
        "id": "tvmaze:1687226",
        "title": "Mysteries of the Dead Sea Scrolls",
        "season": 7,
        "episode": 1,
        "released": "2019-08-07",
        "overview": "Josh Gates travels to the Holy Land to unearth the mystery of the Dead Sea Scrolls with an archaeologist who has discovered new ones; Josh sees cutting-edge technology restore scroll fragments in a way that could change how people read the Bible."
      },
      {
        "id": "tvmaze:1696909",
        "title": "Treasure of the Copper Scroll",
        "season": 7,
        "episode": 2,
        "released": "2019-08-14",
        "overview": "Josh Gates investigates a unique Dead Sea Scroll etched with riddles that could lead to an ancient treasure. Following new leads, Josh treks into the punishing Jordanian desert in search of the potential fortune."
      },
      {
        "id": "tvmaze:1702186",
        "title": "Chasing the Fortune of Sir Francis Drake",
        "season": 7,
        "episode": 3,
        "released": "2019-08-21",
        "overview": "Josh Gates searches land and sea for the lost fortune of legendary pirate Sir Francis Drake. Joining treasure hunters and maritime archaeologists, Josh hunts for a lost cache of Spanish gold and the remains of Drake himself."
      },
      {
        "id": "tvmaze:1705990",
        "title": "Mystery of Dead Mountain",
        "season": 7,
        "episode": 4,
        "released": "2019-08-28",
        "overview": "Braving the sub-zero conditions of Siberia, Josh Gates investigates one of the strangest and most brutal cold cases: the Dyatlov Pass Incident. Nine Soviet hikers died suspiciously. Sixty years later, no one knows how or why."
      },
      {
        "id": "tvmaze:1705991",
        "title": "Siberia's Coldest Case",
        "season": 7,
        "episode": 5,
        "released": "2019-09-04",
        "overview": "Josh Gates concludes his in-depth investigation of the Dyatlov Pass Incident. Taking on Dead Mountain's brutal conditions, Josh and two investigators re-trace the last steps of the hikers. A big discovery could finally solve the mystery."
      },
      {
        "id": "tvmaze:1710067",
        "title": "The Search for Florida's Lost Pirate",
        "season": 7,
        "episode": 6,
        "released": "2019-09-11",
        "overview": "Josh Gates sets sail for Florida chasing the long-lost treasure of bloodthirsty pirate Jose Gaspar; Josh joins marine archaeologists and treasure hunters working to crack the mysteries of the pirate's life so they can find the riches he left behind."
      },
      {
        "id": "tvmaze:1714612",
        "title": "Hunt for the Chupacabra",
        "season": 7,
        "episode": 7,
        "released": "2019-09-18",
        "overview": "In the dark caves and thick jungles of Puerto Rico, Josh Gates tracks a modern-day mystery - the Chupacabra. Working with a wildlife biologist, a veterinarian and an investigator, Josh explores a recent wave of attacks to separate fact from fiction."
      },
      {
        "id": "tvmaze:1721781",
        "title": "Chasing the Snake Kings",
        "season": 7,
        "episode": 8,
        "released": "2019-09-25",
        "overview": "Josh Gates returns to Guatemala with a potential breakthrough in the search for a Snake King tomb."
      },
      {
        "id": "tvmaze:1726513",
        "title": "Cracking the Secret",
        "season": 7,
        "episode": 9,
        "released": "2019-10-02",
        "overview": "Josh Gates is on a nation-wide treasure hunt to solve a mystery no one has cracked for 40 years: The Secret. Josh travels coast-to-coast and back in time using cutting edge augmented reality and tapping into a network of obsessed Secret detectives."
      },
      {
        "id": "tvmaze:1731001",
        "title": "Gold Rush of the Atlantic",
        "season": 7,
        "episode": 10,
        "released": "2019-10-09",
        "overview": "Josh Gates has a fresh lead on the massive lost treasure of the shipwrecked 1715 Spanish fleet. Josh returns to the waters of Florida's Atlantic coast and dives in with a new expedition that uses the latest high tech to locate the fleet's flagship."
      },
      {
        "id": "tvmaze:1738391",
        "title": "Search for the Sultan's Heart",
        "season": 7,
        "episode": 11,
        "released": "2019-10-16",
        "overview": "Four years after Josh Gates went on a journey to find the lost heart of Sultan Suleiman the Magnificent, he travels to the newly rediscovered town of Turbek for some shocking new revelations about the case."
      },
      {
        "id": "tvmaze:1749794",
        "title": "The Secret Solved",
        "season": 7,
        "episode": 12,
        "released": "2019-10-30",
        "overview": "Breaking news sends Josh Gates racing across the globe. One of the wickedly hard puzzles of The Secret, which Josh has been chasing for years, might have been solved. He's been crisscrossing the US, but this solution is in Josh's hometown."
      },
      {
        "id": "tvmaze:1790645",
        "title": "D-Day Uncovered",
        "season": 8,
        "episode": 1,
        "released": "2020-02-05",
        "overview": "Gates travels to the D-Day battlefields and the beaches of Normandy where he joins investigators making history-changing discoveries about the Longest Day. Josh explores alongside military historians using cutting edge technology to uncover shocking secrets about the invasion, including a never-before-discovered complex of Nazi bunkers as well as an unexploded bomb frozen in time in the waters off Normandy's coast. Josh's in-depth investigation reveals forgotten mysteries surrounding the most important battle in modern history."
      },
      {
        "id": "tvmaze:1790646",
        "title": "Searching for America's Lost Flight",
        "season": 8,
        "episode": 2,
        "released": "2020-02-12",
        "overview": "Josh Gates investigates the most mysterious airline disaster in American history, searching for why Northwest Flight 2501 vanished taking the lives of all 58 people on-board. Later, Josh and his team examine sightings of the Mothman across the Midwest."
      },
      {
        "id": "tvmaze:1805191",
        "title": "The Hunt for Our Ancient Ancestors",
        "season": 8,
        "episode": 3,
        "released": "2020-02-19",
        "overview": "Josh Gates ventures to Africa, embedding with fierce warriors and squaring off with lions to investigate the mystery of humanity's origins. Then, Expedition X ventures into Cambodia's jungle searching for a monster that's haunted the area for centuries."
      },
      {
        "id": "tvmaze:1808341",
        "title": "Revealing Our Ancient Ancestors",
        "season": 8,
        "episode": 4,
        "released": "2020-02-26",
        "overview": "Josh Gates continues his epic investigation as he ranges across Africa to study wild chimpanzees and scales sheer cliffs on his quest for the missing links of human evolution. In Mexico City, the Expedition X investigation puts the team's safety at risk."
      },
      {
        "id": "tvmaze:1812408",
        "title": "The Warrior Queens Treasure",
        "season": 8,
        "episode": 5,
        "released": "2020-03-04",
        "overview": "Josh Gates takes on the Indian Ocean's punishing waters as he chases a lost treasure, rumoured to be worth more than a billion dollars; team Expedition X takes a risky helicopter flight to investigate a mountain peak known for UFO sightings."
      },
      {
        "id": "tvmaze:1816381",
        "title": "The Fortune of the Buzzard",
        "season": 8,
        "episode": 6,
        "released": "2020-03-11",
        "overview": "Josh Gates takes on the Indian Ocean's punishing waters as he chases the lost treasure of Oliver Levasseur, AKA \"The Buzzard\", rumored to be worth more than a billion dollars."
      },
      {
        "id": "tvmaze:1816391",
        "title": "Mysteries of Bermuda Triangle",
        "season": 8,
        "episode": 7,
        "released": "2020-03-18",
        "overview": "Josh Gates dives into the mysteries of the Bermuda Triangle. Searching for answers leads Josh to the ocean floor, the skies above and even the edges of space as he tackles some of the most intriguing disappearances in history."
      },
      {
        "id": "tvmaze:1816392",
        "title": "Revealing the Triangle",
        "season": 8,
        "episode": 8,
        "released": "2020-03-25",
        "overview": "In the conclusion of his epic investigation, Josh Gates uses cutting-edge technology to investigate the Triangle's most infamous shipwreck and lost flights. Will he find answers to just how the Triangle works or will it forever remain a mystery?"
      },
      {
        "id": "tvmaze:2136759",
        "title": "Dillinger's Lost Loot",
        "season": 9,
        "episode": 1,
        "released": "2021-07-21",
        "overview": "Josh Gates joins the hunt for notorious bank robber John Dillinger's fortune that's never been found. Chasing leads across the Midwest, Josh searches Public Enemy Number One's childhood home and dives a frigid lake at a remote Wisconsin lodge."
      },
      {
        "id": "tvmaze:2136760",
        "title": "The Lost Avenger",
        "season": 9,
        "episode": 2,
        "released": "2021-07-28",
        "overview": "A three-man crew of Navy pilots training for World War 2 crashed into the Pacific Ocean 75 years ago. Josh Gates teams up with Project Recover on a daring mission to find their plane and bring closure for the three souls who have never been found."
      },
      {
        "id": "tvmaze:2136761",
        "title": "Ransom in the Sky",
        "season": 9,
        "episode": 3,
        "released": "2021-08-04",
        "overview": "With brand-new evidence, Josh looks to finally crack the DB Cooper case, America's only unsolved skyjacking. A deathbed confession and cutting-edge forensics have Josh hot on the trail of the $200,000 ransom that's never been recovered."
      },
      {
        "id": "tvmaze:2146745",
        "title": "The Quest for El Dorado",
        "season": 9,
        "episode": 4,
        "released": "2021-08-11",
        "overview": "Josh treks into Colombia's deadly jungle to unravel the El Dorado myth and retrace the steps of Spanish conquistadors. And meets with the tribe that inspired the legend of a city of gold and unearths its treasure in a surprising location."
      },
      {
        "id": "tvmaze:2146746",
        "title": "Uncovering the Golden City",
        "season": 9,
        "episode": 5,
        "released": "2021-08-18",
        "overview": "The hunt for El Dorado is Josh's most grueling journey ever and one of the crew tumbles into a raging river. When cutting-edge aerial scans reveal a lost city, they push into the jungle to uncover El Dorado and the gold that comes with it."
      },
      {
        "id": "tvmaze:2164687",
        "title": "America's Titanic",
        "season": 9,
        "episode": 6,
        "released": "2021-08-25",
        "overview": "Josh Gates investigates the truth behind the world's most iconic and captivating legends. Leaving no stone unturned, his adventures take him around the globe as he immerses himself in the core locales linked to each tale."
      },
      {
        "id": "tvmaze:2333522",
        "title": "Buried Secrets of Hitler",
        "season": 10,
        "episode": 1,
        "released": "2022-05-25",
        "overview": "Chasing a lead, Josh Gates rushes to Poland to join locals opening a secret Nazi tunnel system dug into a dormant volcano; he helps remove the stone wall built by the retreating Germans and enters to see what's been hidden for more than 75 years."
      },
      {
        "id": "tvmaze:2338951",
        "title": "Buried Secrets of the Nazis",
        "season": 10,
        "episode": 2,
        "released": "2022-06-01",
        "overview": "Josh Gates rafts into an abandoned tunnel system to chase art and treasure stolen by the Third Reich. Then, the diary of a high-ranking SS officer leads to a search for tons of stolen gold. Later, Josh searches for a buried Nazi Enigma machine."
      },
      {
        "id": "tvmaze:2338952",
        "title": "Dalton Gang's Outlaw Fortune",
        "season": 10,
        "episode": 3,
        "released": "2022-06-08",
        "overview": "Josh Gates heads to the Wild West in search of the hidden loot heisted by infamous lawmen turned criminals, the Dalton Gang. Re-tracing the Gang's last steps and investigating their final, deadly shoot-out, Josh chases a fortune worth millions today."
      },
      {
        "id": "tvmaze:2348858",
        "title": "Lindbergh's Lost Rival",
        "season": 10,
        "episode": 4,
        "released": "2022-06-15",
        "overview": "Josh Gates goes on a worldwide search for aviation's most famous lost plane. Just before Lindbergh made history, two rivals attempted a Paris to New York transatlantic flight. Chasing new clues, Josh scours two continents to find the lost \"White Bird.\""
      },
      {
        "id": "tvmaze:2350093",
        "title": "The Hunt for Templar Treasure",
        "season": 10,
        "episode": 5,
        "released": "2022-06-22",
        "overview": "On the trail of the secretive Knights Templar, Josh chases the legendary warriors' lost fortune including the coveted Holy Grail. In England, Josh digs in to find a Templar buried tunnel. Then, he travels to Poland to excavate a rare Templar gravesite."
      },
      {
        "id": "tvmaze:2350094",
        "title": "The Bootlegger's Millions",
        "season": 10,
        "episode": 6,
        "released": "2022-06-29",
        "overview": "Josh Gates hunts the lost fortune of infamous bootlegger Dutch Schultz."
      },
      {
        "id": "tvmaze:2350095",
        "title": "Escaping the Rock",
        "season": 10,
        "episode": 7,
        "released": "2022-07-06",
        "overview": "Tackling the most famous prison break of all time, Josh retraces the 1962 Alcatraz escape; new leads take Josh from San Francisco to the jungles of Brazil, where he finds witnesses and evidence that rewrite the FBI's version of the story."
      },
      {
        "id": "tvmaze:2357652",
        "title": "Egypt's Lost Tombs",
        "season": 10,
        "episode": 8,
        "released": "2022-07-13",
        "overview": "With breakthrough discoveries in Egypt, Josh races to join an active dig of 4,000-year-old tombs; Josh gains exclusive access and uncovers mummies and treasure that could solve the mysterious collapse of ancient Egypt's Old Kingdom."
      },
      {
        "id": "tvmaze:2365504",
        "title": "Egypt's City of the Dead",
        "season": 10,
        "episode": 9,
        "released": "2022-07-20",
        "overview": "Investigating the mysterious collapse of Egypt's old kingdom, Josh completes his Saqqara necropolis dig; opening several tombs, Josh finds treasure, clues and haunting remains; testing results may prove they've discovered Egypt's oldest royal mummy."
      },
      {
        "id": "tvmaze:2366753",
        "title": "Chasing Everglades Treasure",
        "season": 10,
        "episode": 10,
        "released": "2022-08-03",
        "overview": "Josh digs deep into the swamp to hunt the lost fortune of notorious bootleggers and bank robbers the Ashley Gang. Josh needs to retrace the outlaw family's criminal empire, which included a blood feud with the local Florida sheriff."
      },
      {
        "id": "tvmaze:2366754",
        "title": "Mysteries of Moses",
        "season": 10,
        "episode": 11,
        "released": "2022-08-10",
        "overview": "Looking to answer enduring questions around Moses' existence and the story of Exodus, Josh takes an epic adventure that starts with opening an ancient Egyptian tomb and ends with trekking what could be the true Mount Sinai."
      },
      {
        "id": "tvmaze:2376426",
        "title": "Chasing the Mysteries of Moses",
        "season": 10,
        "episode": 12,
        "released": "2022-08-17",
        "overview": "In this conclusion of his two-part investigation, Josh Gates finishes retracing Moses' steps from the peak of Mount Sinai deep into the Israeli desert. To separate man from myth, Josh dives the Sea of Galilee and investigates what is said to be Moses' tomb."
      },
      {
        "id": "tvmaze:2377019",
        "title": "Donner Party Horror and Heroes",
        "season": 10,
        "episode": 13,
        "released": "2022-08-24",
        "overview": "Josh treks the punishing Donner Pass to uncover how desperate pioneers who were trapped by blizzards in the Sierra Nevada turned to cannibalism; in an unprecedented six-month investigation, Josh retraces the steps of the courageous rescue teams."
      },
      {
        "id": "tvmaze:2377021",
        "title": "Finding Italy's Lost Empire",
        "season": 10,
        "episode": 14,
        "released": "2022-08-31",
        "overview": "Searching a city of the dead, Josh unearths artifacts from the Etruscans who ruled central Italy before being conquered by the Roman Empire; a dig site unearths clues that reveal the Etruscans may have inspired Rome's greatest achievements."
      },
      {
        "id": "tvmaze:2540533",
        "title": "Sunken Pyramids of The Nile",
        "season": 11,
        "episode": 1,
        "released": "2023-05-24",
        "overview": "Josh Gates travels to the Kingdom of Kush to dive the flooded pyramid tomb of a king; the murky water provides zero visibility, and the pyramid is at risk of collapse; the dive could unlock the mystery of a civilization that once conquered Egypt."
      },
      {
        "id": "tvmaze:2556831",
        "title": "Mystery of the Flooded Pyramid",
        "season": 11,
        "episode": 2,
        "released": "2023-05-31",
        "overview": "The conclusion to Josh Gates' dive into a Kush king's flooded pyramid tomb; Josh scales a mountain to learn how the Kingdom of Kush conquered Egypt and braves the murky waters for one more dive to find the king's mummified remains."
      },
      {
        "id": "tvmaze:2564501",
        "title": "Lost City of the Gospels",
        "season": 11,
        "episode": 3,
        "released": "2023-06-07",
        "overview": "Josh travels to the Holy Land to find a lost city where Jesus performed many miracles and is also home to three apostles. While investigating competing sites that claim to be the lost city, Josh reveals an inscription that hasn't been seen in 1,400 years."
      },
      {
        "id": "tvmaze:2564502",
        "title": "Treasure of the Pirate King",
        "season": 11,
        "episode": 4,
        "released": "2023-06-14",
        "overview": "Josh finds treasure from the greatest score in pirate history; the most feared pirate of his time, Henry Avery stole a fortune worth more than $100 million today; Josh leaps into the frigid North Atlantic to recover Avery's riches."
      },
      {
        "id": "tvmaze:2571785",
        "title": "Great Lakes' Vanished Warships",
        "season": 11,
        "episode": 5,
        "released": "2023-06-21",
        "overview": "Diving into Lake Superior, Josh has brand-new intel that may finally solve a 100-year-old mystery: the resting place of two WW1 minesweepers; on their way to combat German mines in the Atlantic, the warships sank and took the lives of 79 sailors."
      },
      {
        "id": "tvmaze:2571962",
        "title": "Hunt for Spain's King Arthur",
        "season": 11,
        "episode": 6,
        "released": "2023-06-28",
        "overview": "Plunging hundreds of feet below ground, Josh explores Spain's treacherous La Garma cave system and finds a floor littered with human remains more than 1,000 years old; Josh's deep dive is a quest for scientific proof of Spain's legendary King Pelayo."
      },
      {
        "id": "tvmaze:2580553",
        "title": "Looted Treasures of Cambodia",
        "season": 11,
        "episode": 7,
        "released": "2023-07-05",
        "overview": "Pushing into remote jungles, Josh investigates one of the 20th century's biggest heists - looting of Cambodian statues worth hundreds of millions; Josh rappels into a crumbling pyramid and digs up a treasure trove of missing monuments."
      },
      {
        "id": "tvmaze:2581238",
        "title": "Cambodia's Stolen Monuments",
        "season": 11,
        "episode": 8,
        "released": "2023-07-12",
        "overview": "A clandestine meeting with a Cambodian looter puts Josh on the trail of multi-million-dollar stolen monuments; Josh dives into a murky moat, where he unearths a priceless lost statue and a missing piece of a national treasure."
      },
      {
        "id": "tvmaze:2674093",
        "title": "Missing Heroes of WW2",
        "season": 12,
        "episode": 1,
        "released": "2023-11-15",
        "overview": "Josh investigates America's daring response to Pearl Harbor, which destroyed a vital Japanese base in the South Pacific. Using brand-new intel, Josh dives in with Project Recover to find 40 planes and 200 American heroes lost in Operation Hailstone."
      },
      {
        "id": "tvmaze:2674094",
        "title": "Finding the Lost Pilots of WW2",
        "season": 12,
        "episode": 2,
        "released": "2023-11-22",
        "overview": "Josh Gates investigates the truth behind the world's most iconic and captivating legends. Leaving no stone unturned, his adventures take him around the globe as he immerses himself in the core locales linked to each tale."
      },
      {
        "id": "tvmaze:2688717",
        "title": "Lost City of the White Jaguar",
        "season": 12,
        "episode": 3,
        "released": "2023-11-29",
        "overview": "Trekking deep into Mexico's narco-controlled jungles, Josh hunts for the last Mayan stronghold to ward off the Spanish conquistadors. He joins an expedition braving snakes, spiders and jaguars to uncover the legendary Sac Balam."
      },
      {
        "id": "tvmaze:2688718",
        "title": "Riches of Spain's Pirate King",
        "season": 12,
        "episode": 4,
        "released": "2023-12-06",
        "overview": "Josh chases the treasure of the infamous Spanish pirate Amaro Pargo; an exhaustive hunt of Pargo's stomping grounds in the Canary Islands leads Josh beneath an active volcano to dive for the pirate's hoard."
      },
      {
        "id": "tvmaze:2696837",
        "title": "Chasing Bonnie and Clyde",
        "season": 12,
        "episode": 5,
        "released": "2023-12-13",
        "overview": "Tracking America's most infamous couple, Josh teams up with a former FBI agent to scour a legendary Bonnie and Clyde hideout; then Josh hits the road on a 700-mile trip through the heartland to the site of the outlaw duo's most notorious shootout."
      },
      {
        "id": "tvmaze:2696838",
        "title": "Sunken Treasure of the Bahamas",
        "season": 12,
        "episode": 6,
        "released": "2023-12-20",
        "overview": "Josh helps recover the richest stash of lost treasure in the Americas; deploying cutting-edge technology and an armada of boats, the team dives the Caribbean to bring coins and jewels from the legendary Spanish galleon Maravillas to the surface."
      },
      {
        "id": "tvmaze:2696839",
        "title": "Lost Tomb of the Viking King",
        "season": 12,
        "episode": 7,
        "released": "2023-12-27",
        "overview": "Josh chases the treasure of legendary Viking Harald Bluetooth Gormsson. The discovery of a mysterious gold artefact sends Josh on a journey through Scandinavia and into remote northern European forests to uncover Bluetooth's tomb and fortune."
      },
      {
        "id": "tvmaze:2696840",
        "title": "Hunt for the Secret Seaplane",
        "season": 12,
        "episode": 8,
        "released": "2024-01-03",
        "overview": "Josh searches for a top-secret WWII seaplane that crashed into the Pacific. Now, 70 years later, Josh joins a team scouring the ocean floor hundreds of feet below to find a lost aviation treasure -- the only XP5Y-1 still in existence."
      },
      {
        "id": "tvmaze:2895571",
        "title": "Hunt for Alexander the Great",
        "season": 13,
        "episode": 1,
        "released": "2024-06-19",
        "overview": "Josh is on the hunt for the lost tomb of Alexander the Great; he dives Egypt's coast, revealing ruins of Alexander's Royal Quarter; he tunnels under modern Alexandria, but a water pump malfunction puts everything at risk."
      },
      {
        "id": "tvmaze:2925466",
        "title": "Alexander's Lost Tomb",
        "season": 13,
        "episode": 2,
        "released": "2024-06-26",
        "overview": "Spanning Europe and Africa, Josh's chase for Alexander's remains and fortune ramps up. Clues mount in a flooded ruin beneath Alexandria, Egypt. Later, Josh gathers shocking evidence Alexander's body may actually lie in Venice's St. Mark's Cathedral."
      },
      {
        "id": "tvmaze:2925467",
        "title": "Traitors' Treasure of 1776",
        "season": 13,
        "episode": 3,
        "released": "2024-07-03",
        "overview": "Josh chases fortune stolen by loyalists to Britain's crown during the American Revolution. Jumping into two investigations of the infamous Doan Gang, Josh helps dig up a cache of plundered coins. Later, a cave search pinpoints the turncoats' hideout."
      },
      {
        "id": "tvmaze:2953740",
        "title": "Lost Bomber of World War II",
        "season": 13,
        "episode": 4,
        "released": "2024-07-17",
        "overview": "Josh meets the restoration team of the Fleet Air Arm Museum searching for parts of Fairey Barracudas, a model of British bombers of which no intact examples exist. He excavates a former airfield in St Andrews, Scotland then finds wreckage near Alta in the far north of Norway, where Barracudas once attacked the Nazi battleship Tirpitz."
      },
      {
        "id": "tvmaze:2953741",
        "title": "Chasing Africa's Atlantis",
        "season": 13,
        "episode": 5,
        "released": "2024-07-24",
        "overview": "The once-luxurious emporium of Rhapta disappeared in a cataclysm centuries ago. In search of Africa's Atlantis, Josh Gates dives into remote waters off of Zanzibar in search of ancient shipwrecks, exploring a possible ruin only visible at low tide."
      },
      {
        "id": "tvmaze:2955418",
        "title": "America's MIA Heroines",
        "season": 13,
        "episode": 6,
        "released": "2024-07-31",
        "overview": "Josh Gates travels to Cote d'Ivoire in West Africa to find the wreckage of an American military plane that disappeared in the closing days of World War II. Eighteen Women's Army Corps members were on board and are listed as MIA to this day."
      },
      {
        "id": "tvmaze:3017957",
        "title": "Hunt for Petra's Lost Tombs",
        "season": 14,
        "episode": 1,
        "released": "2024-10-09",
        "overview": "With unprecedented access, Josh digs in front of Petra's iconic Treasury. Searching for clues to the mysterious civilization that created one of the Seven New Wonders of the World, Josh rappels a seven-story cliff face to perform a high-tech scan."
      },
      {
        "id": "tvmaze:3017958",
        "title": "Petra's Secrets Revealed",
        "season": 14,
        "episode": 2,
        "released": "2024-10-16",
        "overview": "Rewriting history, Josh helps discover a tomb at Petra's iconic Treasury building. Twelve skeletons may belong to a royal family of Petra. State-of-the-art tech could finally decipher the charred fragments of ancient scrolls explaining Petra's fall."
      },
      {
        "id": "tvmaze:3017959",
        "title": "Search for Pan Am's Clipper",
        "season": 14,
        "episode": 3,
        "released": "2024-10-23",
        "overview": "Josh braves Puerto Rico's choppy seas to find a legendary missing plane. The crash of Pan Am's Clipper Endeavor changed commercial aviation forever. Josh and the team fight violent storms in the Atlantic as they hunt for the plane 2,000 feet below."
      },
      {
        "id": "tvmaze:3035197",
        "title": "America's First Train Robbers",
        "season": 14,
        "episode": 4,
        "released": "2024-11-06",
        "overview": "Josh tracks down the legend - and treasure - of an outlaw posse who terrorized the Midwest's railroads. The Reno Gang stole a fortune until a vigilante mob exacted violent justice. Josh tracks their lost loot to a cave hideout that could hold millions."
      },
      {
        "id": "tvmaze:3035198",
        "title": "Dive for America's Pirate Loot",
        "season": 14,
        "episode": 5,
        "released": "2024-11-13",
        "overview": "Josh braves the frigid, shark-infested waters off Cape Cod to dive the world's only confirmed pirate wreck. Joining a high-tech recovery mission, Josh chases the multi-million-dollar treasure of Black Sam Bellamy, including coins, gold and jewels."
      },
      {
        "id": "tvmaze:3035199",
        "title": "'Twas the Search for St. Nick",
        "season": 14,
        "episode": 6,
        "released": "2024-11-20",
        "overview": "In a holiday search spanning three continents, Josh chases the true history of St. Nicholas, the real-life saint who has become known as Santa Claus. Following clues from Turkey to Italy, Josh gathers DNA to try to identify the saint's missing remains."
      },
      {
        "id": "tvmaze:3246365",
        "title": "Hitler's Amerikabomber",
        "season": 15,
        "episode": 1,
        "released": "2025-06-18",
        "overview": "In the season premiere, Gates uncovers the truth about Adolf Hitler's terrifying Amerikabomber, a long-range airplane designed to bring the terror of the Third Reich to the United States and obliterate New York City. Unearthing still-sealed Nazi tunnels and long-lost top-secret weapons factories in Poland, he'll take viewers into a subterranean facility that may have been used to manufacture Hitler's dream killing machine."
      },
      {
        "id": "tvmaze:3275857",
        "title": "The Man-Eating Lions of Kenya",
        "season": 15,
        "episode": 2,
        "released": "2025-06-25",
        "overview": "Josh braves the African savanna to investigate the rampage of two lions who killed as many as 135 railroad workers in 1898. To prevent more bloodshed, Josh joins wildlife rangers tracking a pair of rogue lions who are on a modern-day killing spree."
      },
      {
        "id": "tvmaze:3288867",
        "title": "The Lost Grave of Buffalo Bill",
        "season": 15,
        "episode": 3,
        "released": "2025-07-02",
        "overview": "Josh saddles up to investigate a scandal over the remains of Buffalo Bill Cody. A first-hand account claims Bill's body was stolen and buried 500 miles away. With new leads and cadaver dogs, Josh digs for the cowboy's grave and the truth."
      },
      {
        "id": "tvmaze:3291015",
        "title": "Shipwreck Triangle of Greece",
        "season": 15,
        "episode": 4,
        "released": "2025-07-09",
        "overview": "Josh dives into a mysterious Greek sea passage known as the ancient world's shipwreck capital, claiming 58 ships and counting. Chasing truth and treasure, Josh separates fact from myth and learns what makes these waters as deadly as the Bermuda Triangle."
      },
      {
        "id": "tvmaze:3295223",
        "title": "Treasure of the Pirate Queen",
        "season": 15,
        "episode": 5,
        "released": "2025-07-16",
        "overview": "Josh braves the South Carolina swamps to search for the lost treasure of the infamous Anne Bonny. The Pirate Queen used her wits, beauty and daring to steal millions in booty. While recovering coins, Josh may have unearthed Anne's secret trading post."
      },
      {
        "id": "tvmaze:3306355",
        "title": "Searching for World War II's Lost Hero",
        "season": 15,
        "episode": 6,
        "released": "2025-07-30",
        "overview": "Armed with a new eyewitness account and cutting-edge tech, Josh travels to Micronesia and dives the Pacific to find a lost P-47 Thunderbolt. Piloted by an American hero, it took part in a daring raid during the final days of World War II."
      },
      {
        "id": "tvmaze:3306356",
        "title": "Mystery Ruins of the Stone Age",
        "season": 15,
        "episode": 7,
        "released": "2025-08-06",
        "overview": "Josh investigates rumors swirling around a Turkish dig site that is 6,000 years older than Stonehenge. Separating fact from fiction, they uncover evidence of tribal skull rituals, debunking the legend of an alien-constructed observatory."
      },
      {
        "id": "tvmaze:3433270",
        "title": "Mysteries of the Great Pyramid",
        "season": 16,
        "episode": 1,
        "released": "2025-11-05",
        "overview": ""
      },
      {
        "id": "tvmaze:3439759",
        "title": "Great Pyramid Secrets Revealed",
        "season": 16,
        "episode": 2,
        "released": "2025-11-12",
        "overview": ""
      },
      {
        "id": "tvmaze:3446863",
        "title": "The Great Gold Rush Shootout",
        "season": 16,
        "episode": 3,
        "released": "2025-11-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3452561",
        "title": "The Nazi's Lost Super Sub",
        "season": 16,
        "episode": 4,
        "released": "2025-11-26",
        "overview": ""
      }
    ]
  }
}