{
  "meta": {
    "id": "tvmaze:63266",
    "type": "series",
    "name": "Animal Control",
    "description": "Animal Control is a workplace comedy following a group of Animal Control workers whose lives are complicated by the fact that animals are simple, but humans are not.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/602/1507491.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/602/1507491.jpg",
    "videos": [
      {
        "id": "tvmaze:3438802",
        "title": "Bear Cubs and Broncos",
        "season": 4,
        "episode": 1,
        "released": "2025-12-28",
        "overview": "Tensions erupt when the two rival animal control precincts are forced to merge due to budget cuts; Frank and Templeton clash during a bear cub rescue as they fight for control; Emily and Shred try to hide their romance from the team."
      },
      {
        "id": "tvmaze:3438874",
        "title": "TBA",
        "season": 4,
        "episode": 2,
        "released": "2026-01-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438876",
        "title": "TBA",
        "season": 4,
        "episode": 3,
        "released": "2026-01-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3468729",
        "title": "TBA",
        "season": 4,
        "episode": 4,
        "released": "2026-01-29",
        "overview": ""
      },
      {
        "id": "tvmaze:2427408",
        "title": "Weasels and Ostriches",
        "season": 1,
        "episode": 1,
        "released": "2023-02-16",
        "overview": "Shred encounters a wild weasel in an attic. Frank slips his Slim Jim in Shred's back pocket as they approach a dozen ostriches."
      },
      {
        "id": "tvmaze:2479224",
        "title": "Rabbits and Pythons",
        "season": 1,
        "episode": 2,
        "released": "2023-02-23",
        "overview": "A tech geek tells Frank his rabbits got into his special chocolate bars. Frank and Shred find a python wrapped around a man's neck."
      },
      {
        "id": "tvmaze:2479225",
        "title": "Cougars and Kangaroos",
        "season": 1,
        "episode": 3,
        "released": "2023-03-02",
        "overview": "Animal Control dispatch radios with a cougar sighting. Amit squares off with a kangaroo."
      },
      {
        "id": "tvmaze:2492979",
        "title": "Dogs and Bears and Minks",
        "season": 1,
        "episode": 4,
        "released": "2023-03-09",
        "overview": "Animal Control receives a 9-1-1 call on a bear in a hot tub. Frank questions his night with Dolores."
      },
      {
        "id": "tvmaze:2499098",
        "title": "Cows and Raccoons",
        "season": 1,
        "episode": 5,
        "released": "2023-03-16",
        "overview": "Frank and Shred respond to a call of a distressed cow at a fraternity house. Patel learns a wholesome detail about Victoria's personal life."
      },
      {
        "id": "tvmaze:2492980",
        "title": "Skunks and Llamas",
        "season": 1,
        "episode": 6,
        "released": "2023-03-23",
        "overview": "Emily and Victoria assist Dr. Summers with an alpaca birth. Frank and Patel visit Frank's dad Jimmy."
      },
      {
        "id": "tvmaze:2492981",
        "title": "Peacocks and Pumas",
        "season": 1,
        "episode": 7,
        "released": "2023-03-30",
        "overview": "Frank and Victoria stakeout a squawking peacock. Emily and Patel attend to Shred."
      },
      {
        "id": "tvmaze:2492982",
        "title": "Hellhounds and Sturgeons",
        "season": 1,
        "episode": 8,
        "released": "2023-04-06",
        "overview": "Victoria and Patel encounter Fish and Game officers while on a call. Animal Control dispatch radios with a report of an aggressive attack dog on the loose."
      },
      {
        "id": "tvmaze:2505758",
        "title": "Dogs and Geese",
        "season": 1,
        "episode": 9,
        "released": "2023-04-13",
        "overview": "Animal Control dispatch radios with a goose on the loose. The precinct hosts an adoption day."
      },
      {
        "id": "tvmaze:2505759",
        "title": "Pigs and Minks",
        "season": 1,
        "episode": 10,
        "released": "2023-04-20",
        "overview": "The team welcomes back Patel even though he is still on suspension. Shred and Victoria are called into the principal's office on a school visit. Rick heads back into the field with Frank."
      },
      {
        "id": "tvmaze:2520275",
        "title": "Birds and Foxes",
        "season": 1,
        "episode": 11,
        "released": "2023-04-27",
        "overview": "Frank battles with the idea of getting older when Templeton benches him on the basketball team. Rick asks Emily out on a date, just as Shred realizes he might have a thing for her."
      },
      {
        "id": "tvmaze:2520948",
        "title": "Unicorns and Mountain Lions",
        "season": 1,
        "episode": 12,
        "released": "2023-05-04",
        "overview": "When the precinct's beloved mountain lion C-38 dies, Frank takes it especially hard. Shred tries to break up with Camilla before he ruins his chances with Emily."
      },
      {
        "id": "tvmaze:2691910",
        "title": "Raccoons and Mutts",
        "season": 2,
        "episode": 1,
        "released": "2024-03-06",
        "overview": "When Shred wallows over Emily's blossoming relationship with Rick, Frank decides to cheer him up with a special \"Shred's Day\" adventure. The group is shocked to learn Victoria is in a green card marriage, and her 'husband' wants a divorce. Emily spins out when she discovers that Animal Control Officers are not considered \"essential workers,\" and Patel tries desperately to satisfy his pregnant wife's craving for movie theater popcorn."
      },
      {
        "id": "tvmaze:2788259",
        "title": "Cats and Monkeys",
        "season": 2,
        "episode": 2,
        "released": "2024-03-13",
        "overview": "Shred's on the rebound, but Frank doesn't share his newfound enthusiasm for dating. Emily enlists the team's help beating Templeton's precinct in an animal adoption competition. Patel stumbles on an investment opportunity, and Victoria waits on the world's longest phone hold to set up her citizenship test."
      },
      {
        "id": "tvmaze:2788260",
        "title": "Tortoises and Labradors",
        "season": 2,
        "episode": 3,
        "released": "2024-03-20",
        "overview": "Frank unearths an illegal animal smuggling ring while Shred's first night shift introduces him to the world of Furry parties. Victoria has a secret admirer, and Emily is hellbent on helping her figure out who it is. Patel and Templeton get stuck working together for the day."
      },
      {
        "id": "tvmaze:2788261",
        "title": "Big Dogs and Mini Horses",
        "season": 2,
        "episode": 4,
        "released": "2024-03-27",
        "overview": "Frank is frustrated when Emily, who is a stickler for rules, accompanies him on an official Animal Control ride along but she ends up being an unlikely partner in his exotic animal ring investigation. Victoria and Patel go on a call to a local baseball stadium, where they discover Victoria's unique talent could be just the thing she needs to get her immigration visa. Shred and Patel become owners of their flip house and want to celebrate by throwing a party – unfortunately they pick the worst possible day to do it."
      },
      {
        "id": "tvmaze:2800624",
        "title": "Dogs & Chickens",
        "season": 2,
        "episode": 5,
        "released": "2024-04-10",
        "overview": "When Emily hires expert dog trainer Roman Park to help with the kennel dogs, Roman ends up disrupting the office dynamics. Frank is challenged for his long-held union rep position by Patel. Shred learns Bettany doesn't like him, so he sets out to figure out why and win her over. Emily must stand up to the neighbor who is complaining about the barking dogs."
      },
      {
        "id": "tvmaze:2810474",
        "title": "Bunnies and Veggies",
        "season": 2,
        "episode": 6,
        "released": "2024-04-17",
        "overview": "When Frank gets frustrated trying to meet women on dating apps, he asks Emily to set him up on an old-fashioned meet-in-person date. When they learn how expensive contractors are, Shred and Patel decide to start renovations on their investment property themselves and immediately run into problems."
      },
      {
        "id": "tvmaze:2810475",
        "title": "Skunks and Swans",
        "season": 2,
        "episode": 7,
        "released": "2024-04-24",
        "overview": "Frank and Shred head to a country club to take on an aggressive swan that Frank has a history with. At the golf course, Shred has a meet-cute with a mysterious woman. Emily makes a mistake that results in Victoria having very little time to prepare for her big citizenship exam. Patel enlists his father to help Victoria cram for the test."
      },
      {
        "id": "tvmaze:2827998",
        "title": "Bulls and Potbellies",
        "season": 2,
        "episode": 8,
        "released": "2024-05-01",
        "overview": "Frank and Emily get a break in their exotic animal ring case. Shred and Rick bond over their romantic woes. Victoria and Patel's father accidentally kiss."
      },
      {
        "id": "tvmaze:2827999",
        "title": "Beagles and Lemurs",
        "season": 2,
        "episode": 9,
        "released": "2024-05-08",
        "overview": "Frank's investigation reaches a thrilling conclusion, only for an unexpected twist to throw his victory into question. Emily finds herself in an awkward position when she realizes she still has feelings for Shred."
      },
      {
        "id": "tvmaze:3058704",
        "title": "Giraffes, Gorillas and Penguins",
        "season": 3,
        "episode": 1,
        "released": "2025-01-02",
        "overview": "After Animal Control must contain a freak zoo break, Frank realizes that he needs to break up with Yasmin 'the right way,' Patel's gorilla rescue goes viral and Emily finds an unexpected benefactor in a celebrity businesswoman."
      },
      {
        "id": "tvmaze:3090522",
        "title": "Rattlers and Gators",
        "season": 3,
        "episode": 2,
        "released": "2025-01-09",
        "overview": "Afraid he won't play nice with her rich new benefactor, Emily tries to keep Frank away from her, which only makes him determined to win her over. Also, Patel's newfound celebrity pushes Victoria's patience to the limit when he's chosen to throw out the first pitch at a minor league game."
      },
      {
        "id": "tvmaze:3095934",
        "title": "Goats, Snakes, and Dogs",
        "season": 3,
        "episode": 3,
        "released": "2025-01-16",
        "overview": "Frank is tasked with taking a dog to \"the farm,\" but instead tries to find it a new forever home."
      },
      {
        "id": "tvmaze:3107677",
        "title": "Baby Kangaroos and Chickens",
        "season": 3,
        "episode": 4,
        "released": "2025-01-23",
        "overview": "Frank and Victoria compete to win Fiona's affections at the new kennels' fundraiser, and Emily gets some very bad advice from Bettany on her speech. Also, just as Patel and Shred are ready to put their flipped house on the market, they find themselves facing the world's most charming squatter."
      },
      {
        "id": "tvmaze:3115608",
        "title": "Hot Dogs and Lobsters",
        "season": 3,
        "episode": 5,
        "released": "2025-01-30",
        "overview": "Trivia night turns wild for Animal Control when Frank and Emily team up to beat Shred and his girlfriend. Also, Victoria's sister visits from New Zealand and Patel finally garners attention when he subs in as bartender."
      },
      {
        "id": "tvmaze:3123357",
        "title": "Buffalo and Beavers",
        "season": 3,
        "episode": 6,
        "released": "2025-02-13",
        "overview": "Frank's ongoing prank war with Templeton reaches new heights; Victoria intervenes when Emily tries to get closer on her relationship with Rick; Patel's job as interim supervisor goes sideways."
      },
      {
        "id": "tvmaze:3138057",
        "title": "Ducks and Penguins",
        "season": 3,
        "episode": 7,
        "released": "2025-02-20",
        "overview": "When Emily faces mounting pressure from the head of Animal Control, Frank and Shred must finally wrangle the elusive escaped penguin Oreo; Victoria and Patel must deliver a dog across the border into Canada."
      },
      {
        "id": "tvmaze:3144945",
        "title": "Party Animals",
        "season": 3,
        "episode": 8,
        "released": "2025-02-27",
        "overview": "When Fiona breaks up with both Frank and Victoria, they throw a rager at her mansion in retaliation; Patel's vision for a quiet night in with Shred and Parker goes sideways."
      },
      {
        "id": "tvmaze:3154373",
        "title": "Retrievers and Fruit Bats",
        "season": 3,
        "episode": 9,
        "released": "2025-03-06",
        "overview": "Desperate to find a new benefactor for Emily's outdoor kennel initiative, Frank and Victoria make a last ditch appeal to an unlikely acquaintance. Also, at the open house for Shred and Patel's flipped home, Shred and Isabelle's relationship is tested when they pose as a married couple."
      },
      {
        "id": "tvmaze:3154374",
        "title": "Strays and Lovebirds",
        "season": 3,
        "episode": 10,
        "released": "2025-03-13",
        "overview": "On the day of the new kennel's groundbreaking ceremony, Animal Control discover that they don't have any dogs left for adoption and must scour the city to fill the kennel in time. Also, Frank is concerned when he realizes that he hasn't heard from his dad in a while."
      }
    ]
  }
}