{
  "meta": {
    "id": "tvmaze:76977",
    "type": "series",
    "name": "Extracted",
    "description": "Extracted features 12 untrained competitors attempting to survive extremely grueling conditions, perilous terrain, and the threat of fearsome predators in the unforgiving Canadian wilderness. Meanwhile, some miles away, their family members are locked down at a secluded headquarters watching them navigate their dangerous surroundings alone via a 24/7 live feed. The fate of each untrained contestant in the wilderness lies in the hands of their family members back in HQ. Each amateur survivalist's family has the power to decide whether their loved one has what it takes to brave the elements and fight to be the last one standing, or whether the family will push the ominous \"Extract\" button and remove their loved one and their whole family from the competition. Extracted begs the question: how far will their loved ones let them go for a chance for their family to win $250,000?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/553/1382701.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/553/1382701.jpg",
    "videos": [
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3075288",
        "title": "Survive the Night",
        "season": 1,
        "episode": 1,
        "released": "2025-02-10",
        "overview": "The survivalists arrive in Canada and spend their first night alone in the wilderness; as they attempt to build a shelter, their families watch from afar."
      },
      {
        "id": "tvmaze:3138039",
        "title": "Gimme Shelter",
        "season": 1,
        "episode": 2,
        "released": "2025-02-17",
        "overview": "Tensions mount as families compete for the power to send in life-saving supplies to their loved ones; several families are on the verge of extraction as their survivalist must figure out how to get across the lake to get the next drop of supplies."
      },
      {
        "id": "tvmaze:3145626",
        "title": "The Hunt",
        "season": 1,
        "episode": 3,
        "released": "2025-02-24",
        "overview": "Emotions between family members in HQ erupt when faced with another challenge; the starving survivalists compete for food, while family members draw maps to get their family members to a food source in the forest."
      },
      {
        "id": "tvmaze:3155072",
        "title": "Surviving the Storm",
        "season": 1,
        "episode": 4,
        "released": "2025-03-03",
        "overview": "The alliances at HQ are tested as families must anonymously provide critical supplies to one of the remaining survivalists; the survivalists face a decision that could affect both their fellow competitors in the wild and their families back at HQ."
      },
      {
        "id": "tvmaze:3164240",
        "title": "Burn Before Reading",
        "season": 1,
        "episode": 5,
        "released": "2025-03-10",
        "overview": "The members in HQ must unanimously rank all the survivalists from strongest to weakest; family members get a chance to write a letter to their survivalist; an unexpected twist causes some family members to lose their momentum."
      },
      {
        "id": "tvmaze:3170695",
        "title": "The Game Has Changed",
        "season": 1,
        "episode": 6,
        "released": "2025-03-24",
        "overview": "The survivalists attempt to hunt for food using the various weapons and tools their loved ones selected for them in the last supply drop; a family member at HQ must decide which of the remaining seven survivalists will receive critical supplies."
      },
      {
        "id": "tvmaze:3182751",
        "title": "Family vs. Family",
        "season": 1,
        "episode": 7,
        "released": "2025-03-31",
        "overview": "With limited energy left in them, the survivalists are put head-to-head in a swimming race to retrieve a bag of supplies located in the center of the lake; the battle continues in HQ as families are pitted against each other."
      },
      {
        "id": "tvmaze:3188194",
        "title": "Mystery Box",
        "season": 1,
        "episode": 8,
        "released": "2025-04-07",
        "overview": "A crucial supply box is stranded in the middle of a freezing lake, but only one survivalist can claim it in time; the families must guide their survivalists to crates filled with supplies using only a compass."
      },
      {
        "id": "tvmaze:3197095",
        "title": "Banished",
        "season": 1,
        "episode": 9,
        "released": "2025-04-14",
        "overview": "A mystery crate creates tension amongst the families as they either keep or trade the items inside the box; a hidden advantage is placed in HQ which will be powerful for whoever finds it first and detrimental to another family."
      },
      {
        "id": "tvmaze:3204956",
        "title": "The Final Drop",
        "season": 1,
        "episode": 10,
        "released": "2025-04-21",
        "overview": "The four remaining survivalists and their families at HQ go head-to-head; the survivalists must correctly guess a five-letter word chosen by their family at HQ to open the final supply drop; the survivalists must decipher a Morse code puzzle."
      },
      {
        "id": "tvmaze:3438804",
        "title": "TBA",
        "season": 2,
        "episode": 1,
        "released": "2026-01-26",
        "overview": ""
      }
    ]
  }
}