{
  "meta": {
    "id": "tvmaze:2883",
    "type": "series",
    "name": "Married to Medicine",
    "description": "On Married to Medicine, the ladies of Atlanta's exclusive medical inner circle Dr. Jacqueline Walters, Dr. Simone Whitmore, Dr. Heavenly Kimes, Toya Bush-Harris, Quad Webb-Lunceford and Lisa Nicole Cloud return with more patients, less patience and a few heart palpitations along the way.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/600/1500508.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/600/1500508.jpg",
    "videos": [
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454461",
        "title": "Makeups And Breakups",
        "season": 12,
        "episode": 2,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:206786",
        "title": "A Taste of Your Own Medicine",
        "season": 1,
        "episode": 1,
        "released": "2013-03-24",
        "overview": "Meet the strong, fierce, and funny women that make up Atlanta's medical world. Dr. Jackie and Dr. Simone have to navigate through obstacles they face as a wife, mother, friend, and successful OB-GYN while Mariah, Quad, Toya, and Kari show us that you pay a steep price for a life of privilege when you're married to medicine."
      },
      {
        "id": "tvmaze:206787",
        "title": "Mistress of Medicine",
        "season": 1,
        "episode": 2,
        "released": "2013-03-31",
        "overview": "After her disastrous birthday party, Mariah tries to make things right with the ladies. But sparks fly when Quad goes on the attack. When Kari fights back by disinviting Quad to an upcoming event her and Mariah are throwing, she not only ruffles Quad's feather she stings the queen bee herself. Meanwhile, Simone's patient deals with some potentially devastating news."
      },
      {
        "id": "tvmaze:206788",
        "title": "Queen Bee Sting",
        "season": 1,
        "episode": 3,
        "released": "2013-04-07",
        "overview": "Tensions are high at a heated wine tasting when Mariah confronts Kari about Quad's disinvite to their joint party. Later when Kari and Quad agree to meet to sort out their problematic past, the road to resolution is anything but smooth. Meanwhile, Doctor Simone's sister brings out Simone's competitive nature during a visit and Doctor Jackie reveals a shocking secret that takes Quad by surprise."
      },
      {
        "id": "tvmaze:206789",
        "title": "A Black Eye Event",
        "season": 1,
        "episode": 4,
        "released": "2013-04-14",
        "overview": "Toya reveals a secret from Mariah's past that infuriates her right in time for her husband's big birthday bash. Meanwhile tensions flair as Kari is setting up for the festivities and Mariah is nowhere to be found. When the queen bee herself show up two hours late the themed \"Hollywood Glam\" party turns into a \"Hollywood Bash\" that leaves guests in shock and a purse in the pool."
      },
      {
        "id": "tvmaze:206790",
        "title": "Resuscitating Reputations",
        "season": 1,
        "episode": 5,
        "released": "2013-04-21",
        "overview": "This prestigious circle of doctor's wives is shattered after Mariah and Toya's showdown at Duncan and Aydin's birthday party. As news of the fight spreads across the medical community, loyalties are in question and friendships are flat-lining as the women deal with the shocking aftermath. Will Toya and Mariah's reputations be salvaged, or did their behavior cause irreversible consequences to themselves and their husbands?"
      },
      {
        "id": "tvmaze:206791",
        "title": "Blood is Thicker Than Dog Water",
        "season": 1,
        "episode": 6,
        "released": "2013-04-28",
        "overview": "The fallout from the big brawl continues when Toya disinvites Mariah's family from her upcoming Spookey Ookey party. Simone tries to counsel a patient who wants to conceive in an unusual way and Quad has her paws full when she invites both Mariah and Toya to her Puppies in Paris soiree."
      },
      {
        "id": "tvmaze:206792",
        "title": "The Sour Squeeze",
        "season": 1,
        "episode": 7,
        "released": "2013-05-05",
        "overview": "The ladies are more divided than ever, so Jackie decides enough is enough and calls for a group intervention, which she calls a Lemon Squeeze, in an attempt to patch things up between Mariah and Toya. However, things quickly go sour when Kari puts Mariah in the hot seat and the real reason behind the fight with Toya is revealed."
      },
      {
        "id": "tvmaze:206793",
        "title": "Sip Happens",
        "season": 1,
        "episode": 8,
        "released": "2013-05-12",
        "overview": "When Dr. Jackie's Lemon Squeeze fails to get the ladies back on track, they give it one more try on a Georgia Wine trip together. With the serenity of the Georgia vineyards surrounding her, Dr. Simone musters up enough courage to talk to long-time friend Mariah for the first time since the fight. Mariah finally confronts Toya, face-to-face and things quickly escalate and get a little too close for comfort!"
      },
      {
        "id": "tvmaze:206794",
        "title": "Finale",
        "season": 1,
        "episode": 9,
        "released": "2013-05-19",
        "overview": "Although the Georgia wine tour ended on a sweet note, there are still some sour feelings among the ladies. While Jackie prepares for her spa grand opening, Toya shows off her husband's new business venture to the Atlanta elite. Kari ignites a new flame when she \"accidentally\" mentions that Mariah and Quad have not made it on Toya's guest list."
      },
      {
        "id": "tvmaze:206795",
        "title": "The Last Supper",
        "season": 1,
        "episode": 10,
        "released": "2013-05-21",
        "overview": "Quad and Toya have a showdown as accusations fly. Also, Mariah prepares a traditional dinner, and a bombshell about Quad's past emerges."
      },
      {
        "id": "tvmaze:206796",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 11,
        "released": "2013-05-26",
        "overview": "Hosted by Bravo's Andy Cohen, the reunion brings together Jacqueline Walters, Kari Wells, Mariah Huq, Quad Webb-Lunceford, Simone Whitmore and Toya Bush-Harris to discuss the season's drama."
      },
      {
        "id": "tvmaze:206797",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 12,
        "released": "2013-05-28",
        "overview": "Hosted by Bravo's Andy Cohen, the women gather in part two of the reunion to settle scores and clear the air."
      },
      {
        "id": "tvmaze:215510",
        "title": "Secrets Revealed",
        "season": 1,
        "episode": 13,
        "released": "2013-06-04",
        "overview": "Andy Cohen opens the Bravo vaults to reveal never-before-seen footage from the season."
      },
      {
        "id": "tvmaze:206798",
        "title": "Far from Heavenly",
        "season": 2,
        "episode": 1,
        "released": "2014-04-06",
        "overview": "The Queen Bees of medicine are back with a vengeance. Friendships have been broken as Quad discovers long-time BFF Mariah has been talking behind her back. Meanwhile, Dr. Jackie shocks Dr. Simone with news that she wants a baby. Later, at Dr. Heavenly's cocktail party, sparks fly as Toya accuses Dr. Simone of inappropriate behavior with Toya's husband."
      },
      {
        "id": "tvmaze:206799",
        "title": "Love and Basketball",
        "season": 2,
        "episode": 2,
        "released": "2014-04-13",
        "overview": "Jackie's date night with Curtis takes a surprising turn when she tells him about her plan to have a child. Meanwhile, Mariah talks her balding hubby into getting hair transplant surgery. After the showdown at Dr. Heavenly's, Toya and Dr. Simonemeet to hash out their issues, but end up embroiled in even bigger conflict."
      },
      {
        "id": "tvmaze:206800",
        "title": "A Steakhouse Beef",
        "season": 2,
        "episode": 3,
        "released": "2014-04-20",
        "overview": "A peace summit between Quad and Mariah turns into explosive confrontation that quickly spreads across the medical community. Dr. Jackie meets with Dr. Heavenly to hash out their issues, but realizes it's not exactly the resolution she was hoping for. Meanwhile, Toya hosts a birthday party for her son; its all fun and games until Quad and Mariah's feud becomes the talk of the party"
      },
      {
        "id": "tvmaze:206801",
        "title": "A Week of Impact",
        "season": 2,
        "episode": 4,
        "released": "2014-04-27",
        "overview": "As Mariah continues to deal with the fallout from her fight with Quad, Quad turns her focus to developing her puppy fashion line. Dr. Simone and Cecil's financial problems start to weigh heavily on their marriage. With Cecil away, Dr. Simone hosts a fun filled slumber party where she learns how to get her sexy back. Meanwhile, Lisa Nicole receives some devastating news that could turn her world upside down."
      },
      {
        "id": "tvmaze:206802",
        "title": "Chariot of Fiyah!",
        "season": 2,
        "episode": 5,
        "released": "2014-05-04",
        "overview": "Quad hires a new designer to help launch her puppy clothing line. Tensions flare at Lisa Nicole's speaking event when Toya confronts Dr. Simone on her bad behavior. The fighting continues to spiral out of control as Quad and Mariah come face to face in an explosive showdown."
      },
      {
        "id": "tvmaze:206803",
        "title": "Textual Healing",
        "season": 2,
        "episode": 6,
        "released": "2014-05-11",
        "overview": "The drama of the WEN Conference continues with more tears and accusations thrown out by Mariah and Quad. It's the big day for Lisa as she finally finds out whether or not she's cancer free. In a last ditch effort to save their friendship, Quad invites Mariah to an upcoming fashion show."
      },
      {
        "id": "tvmaze:206804",
        "title": "A Fashion Faux-pas",
        "season": 2,
        "episode": 7,
        "released": "2014-05-18",
        "overview": "Dr. Simone finally reveals her financial issues to a shocked and speechless Dr. Jackie. Meanwhile, Dr. Heavenly hears some startling information about Mariah. An explosion erupts at the Women of Atlanta fashion show when Reco Chapple and Mariah finally come face to face."
      },
      {
        "id": "tvmaze:206805",
        "title": "Guess Who's Not Coming to Dinner?",
        "season": 2,
        "episode": 8,
        "released": "2014-05-25",
        "overview": "When Heavenly invites the ladies over for a dinner party, long-standing alliances are shattered as the ladies deal with the aftermath of Mariah and Quad's catwalk cat fight and are forced to choose sides."
      },
      {
        "id": "tvmaze:206806",
        "title": "Queen of Shade",
        "season": 2,
        "episode": 9,
        "released": "2014-06-01",
        "overview": "Quad and Reco scramble to finish their puppy couture samples before their investor meeting, but Mariah files a restraining order against Reco that threatens their progress. Lisa Nicole throws a fantastical princess party for her daughter, but tempers flare as Simone disinvites Mariah from the couple's trip"
      },
      {
        "id": "tvmaze:206807",
        "title": "Blind Date",
        "season": 2,
        "episode": 10,
        "released": "2014-06-08",
        "overview": "Simone enlists Jackie's help in a scheme to resuscitate her flatlining love life. While Simone springs a romantic surprise on Cecil, Jackie's babysitting skills are pushed to the limit when Simone's kids wreak havoc on the house . Meanwhile, Quad's business venture leads to a heated argument with her husband that threatens their relationship. Toya and Eugene encounter an unexpected financial problem."
      },
      {
        "id": "tvmaze:206808",
        "title": "Couples Retreat",
        "season": 2,
        "episode": 11,
        "released": "2014-06-15",
        "overview": "As the group's long awaited couples retreat approaches, Simone encourages Mariah to make a surprise visit. The couples arrive in the Blue Ridge Mountains, eager for a break from the constant drama of Atlanta's medical circle. Greg makes a controversial statement that upsets several of the wives, and a conversation about adultery leads to a shocking revelation about Darren and Lisa's relationship."
      },
      {
        "id": "tvmaze:206809",
        "title": "The Flight of the Uterus",
        "season": 2,
        "episode": 12,
        "released": "2014-06-22",
        "overview": "The ladies' mission to have a peaceful trip proves to be impossible when their drama follows them to Blue Ridge. Tempers flare once Quad learns that Simone secretly invited Mariah along. Mariah decides to embrace the outdoors and leaves her mark on the wilderness. Later an intense relationship exercise stirs up emotions for many of the couples, leaving Jackie in tears and bringing Quad and Greg's marital issues to a head."
      },
      {
        "id": "tvmaze:206810",
        "title": "From Courtroom to Catwalk",
        "season": 2,
        "episode": 13,
        "released": "2014-06-29",
        "overview": "Quad and Toya face off with Mariah in the courtroom, lending their support to Reco Chappelle, as he disputes Mariah's restraining order. Meanwhile, Jackie is visited by her stepdaughter Kursten, who reveals something surprising. Later, Mariah decides to extend a peace offering to all the ladies by inviting them to the launch of her new business venture. Then, after all her hard work, Lisa Nicole unveils her design collection to Atlanta and the world."
      },
      {
        "id": "tvmaze:206811",
        "title": "The Queen Bee Gets Stung",
        "season": 2,
        "episode": 14,
        "released": "2014-07-06",
        "overview": "Toya shows off her new extravagant home to Dr. Heavenly who has a lot to say. Meanwhile, Quad is finally ready to launch her puppy couture line with a fabulous fashion show. Everyone, except Mariah, shows up to support Quad. Will Quad succeed at getting the investors she needs to help her company take off?"
      },
      {
        "id": "tvmaze:206812",
        "title": "Reunion Part 1",
        "season": 2,
        "episode": 15,
        "released": "2014-07-13",
        "overview": "Host Andy Cohen reflects on some of the season's most talked about moments, as the MDs and Mrs. MDs come together in part one of the explosive Married to Medicine reunion. Mariah and Quad finally come face to face to reveal the truth about what really went down between them; Heavenly hears from the ladies on what they really think of her; Simone and Toya's disagreement on stage spills over to backstage, putting the rest of the Reunion in jeopardy."
      },
      {
        "id": "tvmaze:206813",
        "title": "Reunion Part 2",
        "season": 2,
        "episode": 16,
        "released": "2014-07-17",
        "overview": "Hour two of the Married to Medicine Reunion continues as host Andy Cohen gets to the bottom of what happened backstage between Simone and Toya. The husbands join to shed their perspective on kids, sex and cheating. Later, Lisa Nicole dishes her grievances with Mariah. After hashing out new and old issues, can the ladies come together as a group again?"
      },
      {
        "id": "tvmaze:206814",
        "title": "Secrets Revealed",
        "season": 2,
        "episode": 17,
        "released": "2014-07-24",
        "overview": "This special looks back at lost footage and never-before-seen cast interviews from Season 2."
      },
      {
        "id": "tvmaze:206815",
        "title": "Background Check Yourself",
        "season": 3,
        "episode": 1,
        "released": "2015-06-07",
        "overview": "The first ladies of medicine are back and busier than ever. Simone and Toya's friendship is on the fence, but when Toya decides to throw a Halloween party to show off her new house, her husband Eugene insists she invites Simone to bury the hatchet. Quad is full speed ahead with her puppy couture line but when Quad learns Lisa Nicole ran a background check on her for \"business\" reasons, the two have a fall out. Meanwhile, Dr. Jackie's latest endeavor is to test out a lifestyle fitness program on the girls and hopefully everyone is willing to jump on board."
      },
      {
        "id": "tvmaze:206816",
        "title": "Putt Up or Shut Up",
        "season": 3,
        "episode": 2,
        "released": "2015-06-14",
        "overview": "Dr. Simone and Toya are at odds but unlike their wives, husbands Cecil and Eugene are determined to save their friendship by forcing an olive branch into Simone and Toya's strained relationship. Still reeling over Lisa's surprise background check, Quad flips the script and hires a private investigator to dig up dirt on Lisa Nicole and her husband Darren. Later, Jackie and her trainer Al ambush the girls with a surprise invite to join her latest fitness venture."
      },
      {
        "id": "tvmaze:206817",
        "title": "Inspector Squad",
        "season": 3,
        "episode": 3,
        "released": "2015-06-21",
        "overview": "Trying to find the root of her anger, Jackie helps Simone understand how her dad's past transgressions are still affecting her life. As the ladies gather to celebrate Lisa Nicole and Heavenly's magazine cover, Simone comes face to face with Toya for the first time since their disagreement. Meanwhile, following a successful meeting with the private investigator, Quad receives all the information she needs to finally give Lisa Nicole a taste of her own medicine."
      },
      {
        "id": "tvmaze:206818",
        "title": "Friends Don't Do Background Checks on Friends",
        "season": 3,
        "episode": 4,
        "released": "2015-07-05",
        "overview": "Hoping to move past the background check, Quad calls Lisa Nicole for an in-person meeting in hopes of teaching her a lesson in the art of friendship. Things take an unexpected turn when Quad makes a startling accusation which leaves Lisa Nicole reeling. Meanwhile, Heavenly prepares for a date with her hubby and enlists her daughter, Alaura's help for some serious fashion guidance. Jackie hits the ground running and kicks off her new fitness program, \"Fit Is the New It.\" However, it is hard to concentrate on getting fit as word reaches the circle of friends about Quad and Lisa's unexpected encounter."
      },
      {
        "id": "tvmaze:206819",
        "title": "The Naked Truth",
        "season": 3,
        "episode": 5,
        "released": "2015-07-12",
        "overview": "In order to regroup, Quad decides that taking some time away from the ladies is her best option. With fitness her top priority, Jackie goes into drill sergeant mode to snap Simone out of her bad junk food habits. Meanwhile, some of the ladies decide to spend some quality time at a strip club but it's not all fun and games when Lisa Nicole learns that the establishment is one of her husband's habitual stomping grounds."
      },
      {
        "id": "tvmaze:206820",
        "title": "Queen Bee Returns to the Hive",
        "season": 3,
        "episode": 6,
        "released": "2015-07-19",
        "overview": "Still reeling from her visit to the strip club, Lisa confronts her husband in order to discover the truth. In hopes of being a supportive wife, Toya tries to get involved with her husband's new business venture. Always the ones to inform and enlighten, Simone and Jackie demonstrate safe-sex techniques that embarrass some of the ladies and perks the interest of others. Meanwhile, through laughter and tears, Mariah and Quad try their best to mend their relationship but aren't sure if they can dive back into their friendship."
      },
      {
        "id": "tvmaze:206821",
        "title": "Love and Races",
        "season": 3,
        "episode": 7,
        "released": "2015-07-26",
        "overview": "Jackie comes up with a creative strategy to whip the girls into shape in the second phase of Fit Is The New It. Meanwhile, an anxious Simone is happy when her sister comes to town to hold her hand through her son's first date. Wanting to settle the score once and for all, Lisa Nicole meets with her attorney to discuss legal options against Quad, while Quad brings in high-powered attorney Phaedra Parks to weigh in on the matter."
      },
      {
        "id": "tvmaze:206822",
        "title": "California Dreamin'",
        "season": 3,
        "episode": 8,
        "released": "2015-08-02",
        "overview": "Quad leaves the messy drama of Atlanta behind and jets off to sunny California with Simone and Jill. Meanwhile, Jackie struggles to deal with her ailing father both as a daughter and a doctor. Lisa Nicole celebrates her son's birthday with a fabulous cooking party but while the bash is in full swing, she drops a bomb that leaves Heavenly and Toya in shock."
      },
      {
        "id": "tvmaze:206823",
        "title": "Invites and Dis-invites",
        "season": 3,
        "episode": 9,
        "released": "2015-08-09",
        "overview": "Refreshed from her trip to La-La land, Quad refocuses her energy on marketing her doggy fashion line. Meanwhile, Heavenly and her husband are at an impasse when he insists she's spending too much time away from home. Simone makes it clear that it's her party and can do what she wants to when she disinvites Lisa Nicole."
      },
      {
        "id": "tvmaze:206824",
        "title": "Full Court Stress",
        "season": 3,
        "episode": 10,
        "released": "2015-08-16",
        "overview": "Determined to show that she's more than a housewife, Toya follows through with her plan to market her husband's business. With her eyes set on bigger and better things, Quad has her first pop-up shop to bring Picture Perfect Pup front and center. Meanwhile, Toya reveals a rumor she heard which leaves Simone in tears."
      },
      {
        "id": "tvmaze:208005",
        "title": "Boys on the Side?",
        "season": 3,
        "episode": 11,
        "released": "2015-08-23",
        "overview": "As Toya looks for locations for her husband's medical concierge business, she is at odds with him on where to break ground. Meanwhile, Dr. Heavenly's daughter interns for Lisa Nicole and designs a dress for her mother's upcoming app release party. At Dr. Jackie's fitness event, staying in shape is far from everyone's mind when Lisa Nicole accuses Quad of publicly questioning her husband's sexuality."
      },
      {
        "id": "tvmaze:208006",
        "title": "Mariah the Party Crasher",
        "season": 3,
        "episode": 12,
        "released": "2015-08-30",
        "overview": "After months of hard work, Dr. Heavenly is finally ready to launch her dating app, Piq. During her release party, everyone in town stops by, including Atlanta socialite Claudia Jordan. However, Dr. Heavenly's husband doesn't love the fact that her new venture will keep his wife busier than ever. Meanwhile, Jill throws a wild Prohibition Party but things get out of control when her husband is accused of disrespecting Dr. Heavenly, and Mariah decides to show up fashionably late to reclaim her seat at the throne. With all the drama surrounding the group, Dr. Simone decides a couples' trip to the Bahamas will be the best way to put the fractured crew back together."
      },
      {
        "id": "tvmaze:208007",
        "title": "Bahama Mamas",
        "season": 3,
        "episode": 13,
        "released": "2015-09-06",
        "overview": "With the upcoming trip to the Bahamas, the ladies have a number of things to settle at home before departing for an island in the sun. The trip starts out on a festive note as the couples are met at the hotel by a band but by dinner, Jill and Dr. Heavenly go head to head for round two of their disagreement."
      },
      {
        "id": "tvmaze:227265",
        "title": "Baha-Mania",
        "season": 3,
        "episode": 14,
        "released": "2015-09-13",
        "overview": "Although the trip was intended to bring relaxation and reconciliation, the voyage is off to a rocky start with all the ladies reflecting about their relationships with one another. Meanwhile, Dr. Simone tries to get everyone back on track and arranges a medical mission for the less fortunate in order to regroup and focus their attention on helping others."
      },
      {
        "id": "tvmaze:227266",
        "title": "Mariah-Mania",
        "season": 3,
        "episode": 15,
        "released": "2015-09-20",
        "overview": "Couples therapy turns into group therapy as unresolved issues arise between Mariah and some of the ladies. Back in Atlanta, Quad hosts the \"Heroes in Healthcare\" event bringing most of the women together, however, with tensions still running high from the Bahamas, Dr. Heavenly decides not to attend. At the event, Toya and Mariah exchange words, revealing the real reason why Mariah still holds a grudge against Toya and leading the group to question once and for all whether Mariah belongs in this circle of friends."
      },
      {
        "id": "tvmaze:227267",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 16,
        "released": "2015-09-27",
        "overview": "The two-part Married to Medicine reunion kicks off with Simone and Toya as they look back at their confrontation from Season 2 and reveal some deep-rooted issues about their childhood. As Quad and Lisa go toe-to-toe over their accusations and legal matters, Heavenly continues to push the women to confess who was to blame over this year's drama. Given light of Jill's recent accusations and arrest, the ladies question whether they treated her fairly. And, bringing her usual spiciness, the Queen Bee Mariah re-enters the Hive for one last showdown."
      },
      {
        "id": "tvmaze:227268",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 17,
        "released": "2015-10-04",
        "overview": "Part two of the Married to Medicine reunion sets off the alarm when Mariah quickly realizes she's the one in the hot seat. It's not all about the ladies this time though as the husbands join the mix and add fuel to the fire. Relationships are put to the test when the conversation turns to Toya and Eugene's inability to communicate. While Lisa's issue with strippers is discussed, it's revealed that Darren isn't the only husband who likes to indulge in the stripper pond. Plus, the quest begins to see if these ladies can come together again, meanwhile Quad defends her throne to stay in the group."
      },
      {
        "id": "tvmaze:323173",
        "title": "Secrets Revealed",
        "season": 3,
        "episode": 18,
        "released": "2015-10-11",
        "overview": "The ladies gather to dish on the dramas of Season 3. Andy Cohen hosts."
      },
      {
        "id": "tvmaze:944155",
        "title": "New Beginnings",
        "season": 4,
        "episode": 1,
        "released": "2016-11-06",
        "overview": "The Atlanta ladies are back! Quad has a new baby in her house, and Lisa Nicole's got a baby on her brain. Dr. Jackie is moving on up while Dr. Simone and Cecil are adjusting to life apart. Toya is in big trouble with the IRS while Heavenly just stirs it up. Lisa Nicole throws a bash to bring the group together, but are the ladies ready to move past it all and have a new beginning?"
      },
      {
        "id": "tvmaze:978061",
        "title": "Forecast: Clouds with 100% Chance of Shade",
        "season": 4,
        "episode": 2,
        "released": "2016-11-13",
        "overview": "Everyone processes the aftermath from Lisa Nicole's party. Dr. Simone reaches out to Quad to make sure she understands why she came down on her so hard about having a baby. Genise reveals to Toya that she doesn't find Heavenly so heavenly. Lisa Nicole takes her complaints about Toya's behavior to her new best friend, Mariah who has decided to throw a new beginnings party and invite all the ladies. Is this really a new beginning or a to be continued?"
      },
      {
        "id": "tvmaze:984490",
        "title": "Her Father's Daughter",
        "season": 4,
        "episode": 3,
        "released": "2016-11-20",
        "overview": "Mariah's new beginnings party ends in a new beef between Genise and Heavenly, and the beginning of the end for Toya and Lisa Nicole's friendship. Simone reaches out to family to find her missing father, while Jackie tries to convince Curtis to give up the suburbs for the city. Meanwhile, Heavenly gets advice from Alaura about being a grownup, and later, three years of bad blood meet face to face as Toya and Mariah see if they can bury the hatchet."
      },
      {
        "id": "tvmaze:992067",
        "title": "The Father, Son, and Heavenly's Spirit",
        "season": 4,
        "episode": 4,
        "released": "2016-11-27",
        "overview": "Simone, Quad, and Jackie head to Nashville to search for Simone's missing father. Heavenly does some soul-searching with her spiritual guide, Jewel Tankard; while Lisa Nicole and Darren also seek help from a professional, about their relationship. Meanwhile, Toya and Eugene have to deal with Avery's discipline problems at school after a ‘peeing' incident."
      },
      {
        "id": "tvmaze:992068",
        "title": "The Breast-est of Friends",
        "season": 4,
        "episode": 5,
        "released": "2016-12-11",
        "overview": "Heavenly and Lisa Nicole embark on a new business venture, but their collaboration quickly turns ugly, when Heavenly shares her true feelings about Lisa Nicole's marriage. Simone is back at work after her emotional trip to Nashville with a transgender patient who wants gender reassignment surgery. Meanwhile, Jackie's topless charity photo shoot gets out of control causing her to expose a very different side of her personality."
      },
      {
        "id": "tvmaze:1008484",
        "title": "It's My Prom and I'll Throw Down If I Want to!",
        "season": 4,
        "episode": 6,
        "released": "2016-12-16",
        "overview": "Hot off the heels of the look book photo shoot, the girls still can't believe Jackie actually kicked them to the curb. Things heat up for Darren when he has to face the music after flaking on Lisa's baby making plans. As the girls prepare to celebrate Toya's 40th birthday, Simone finds out long awaited news about her father. Later, things hit a fever pitch with Mariah and Quad when they finally go head to head at Toya's birthday party."
      },
      {
        "id": "tvmaze:1012278",
        "title": "Is There Life After Prom?",
        "season": 4,
        "episode": 7,
        "released": "2016-12-23",
        "overview": "After their huge argument at Toya's Prom Party, Mariah and Quad's friendship is on shaky ground. Quad is planning a birthday bash for Dr. G and doesn't want Mariah to bring her drama to the party, so she takes \"extra\" precautions. Toya faces the hard truth she can no longer afford the lifestyle she wants but when it's time to make changes she gets cold feet. Lisa's antics put Heavenly's patience to the test as they plan for their upcoming conference."
      },
      {
        "id": "tvmaze:1019160",
        "title": "Brutally Honest Makeover",
        "season": 4,
        "episode": 8,
        "released": "2016-12-30",
        "overview": "Toya and Eugene struggle with the big issue of moving into a smaller house. Jackie and Curtis near a code red as their marriage continues to take a backseat to Jackie's career. Mariah and Simone meet to get their friendship back on track, but a surprise revelation gives Mariah pause. Later, Toya treats the ladies to a spa day to get ready for Hawaii, but tempers erupt when Lisa decides she isn't laying down for Toya anymore."
      },
      {
        "id": "tvmaze:1028280",
        "title": "Hawaii Five Solo",
        "season": 4,
        "episode": 9,
        "released": "2017-01-06",
        "overview": "Dr. Simone and Cecil head off to Hawaii to celebrate their 20th Anniversary with most of the couples in tow. However, Lisa is flying solo as Dr. Darren is missing in action. Dr. Jackie arrives with some baggage of her own, while Mariah starts the trip off on the wrong foot... can the ladies recover?"
      },
      {
        "id": "tvmaze:1030254",
        "title": "Hawaii Five-Uh Oh",
        "season": 4,
        "episode": 10,
        "released": "2017-01-13",
        "overview": "It's day two of their Hawaiian adventure! Jackie is still reeling from her solo trip to the Big Island and Dr. Darren is still nowhere to be found leaving Lisa Nicole all alone. The group bares it all, in couples therapy, but the exchange between Lisa and Heavenly is anything but therapeutic! A traditional Hawaiian luau may be what the group needs to dance away their troubles, when Toya tries to rally around Lisa and her marital woes."
      },
      {
        "id": "tvmaze:1030255",
        "title": "Coconut Bras and Brawls",
        "season": 4,
        "episode": 11,
        "released": "2017-01-20",
        "overview": "On their last day in Hawaii, Simone has one more surprise for the ladies, but will the men be on board once they find out what's in store? Quad organizes a make-up photo shoot for Jackie and her Look Book, but a new fight over old wounds with Mariah threatens to ruin everything. Back in Atlanta, Mariah spills the tea on what she really thinks of Quad and her past. Later, Jackie tries to cure what's ailing in her marriage, but Curtis refuses to just roll over."
      },
      {
        "id": "tvmaze:1030256",
        "title": "Brazilian Bombshells",
        "season": 4,
        "episode": 12,
        "released": "2017-01-27",
        "overview": "With only a week until their relationship conference, Heavenly and Lisa Nicole must work together to get everything in place. But once Heavenly hears that Lisa hasn't been entirely honest about their collaboration, the whole group finds itself having to pick sides once again. After spending months taking care of her family, Quad needs to celebrate herself, and she bares it all at her 35th birthday party! Toya and Eugene make the final leap in their financial journey as they move into a more affordable house."
      },
      {
        "id": "tvmaze:1048812",
        "title": "The Devil is Busy",
        "season": 4,
        "episode": 13,
        "released": "2017-02-03",
        "overview": "Toya and Eugene may have downsized their home, but their new CPA now wants them to downsize their budget. Jackie springs a romantic surprise on Curtis, but is it enough to mend their fractured relationship? The fallout continues between Lisa Nicole and Heavenly as the two women put on dueling conferences... whose conference will the other ladies support? Later, tempers flare at Toya's housewarming party as Lisa and Heavenly finally come face to face for the ultimate showdown."
      },
      {
        "id": "tvmaze:1051386",
        "title": "Breast Friends",
        "season": 4,
        "episode": 14,
        "released": "2017-02-10",
        "overview": "In the season finale, at Toya's housewarming barbecue the ladies continue to fight and when Mariah tries to intervene things turn ugly fast. Heavenly looks to her spiritual advisor when she faces a crisis of conscience while Lisa Nicole and Darren try to pick up the pieces. Dr. Jackie's look book is almost ready and she's hoping the upcoming sneak peek will provide a backdrop for friendships to heal and mend."
      },
      {
        "id": "tvmaze:1069183",
        "title": "Reunion Part 1",
        "season": 4,
        "episode": 15,
        "released": "2017-02-17",
        "overview": "Host Andy Cohen reflects on some of the seasons biggest moments as the ladies of medicine come together in part one of the explosive Married to Medicine Reunion. Toya comes face to face with her tax problems; Lisa Nicole standing up against the blitz of confrontations from the other ladies about her marriage and underhanded business decisions.; Mariah dishes her grievances with Heavenly, telling her what she really thinks of her, leading to a dramatic confrontation."
      },
      {
        "id": "tvmaze:1069184",
        "title": "Reunion Part 2",
        "season": 4,
        "episode": 16,
        "released": "2017-02-24",
        "overview": "Part two of the reunion continues as Andy welcomes the husbands to tell their side of the story. Jackie shocks everyone, dropping a bomb about her relationship with Curtis; Darren confronts the women on the vicious rumors he can't escape, but Lisa ends up being his sharpest critic; Simone relives her darkest moments from the heart wrenching search for her father. After hashing out old and new issues, will the ladies be able to come together as a group again?"
      },
      {
        "id": "tvmaze:1346538",
        "title": "Waiting to Exhale",
        "season": 5,
        "episode": 1,
        "released": "2017-11-05",
        "overview": "The news of Curtis's infidelity sends shockwaves through the group, forcing the husbands and the wives to choose sides. Eugene takes on extra shifts to pay back the IRS, leaving Toya lonely and in need of romance. Quad celebrates the grand opening of Dr. G's new practice, while Simone struggles to split time between her two houses. Heavenly adjusts to her oldest son away at college, and plans a special night for Jackie and the ladies."
      },
      {
        "id": "tvmaze:1346565",
        "title": "Hot Off the Press",
        "season": 5,
        "episode": 2,
        "released": "2017-11-10",
        "overview": "Jackie tries to quietly process Curtis' infidelity, and scandal hits again when an article exposes more details of the affair. Quad focuses on launching a new career, while Heavenly focuses on helping her daughter's music career. Meanwhile, Toya throws a competitive \"Cook Off\" for her birthday, tensions ignite as Heavenly can't control her temper and Simone's struggling marriage reaches a boiling point."
      },
      {
        "id": "tvmaze:1352683",
        "title": "Let's All Throw a Fit-ni",
        "season": 5,
        "episode": 3,
        "released": "2017-11-17",
        "overview": "Needing distraction from scandal, Jackie throws a FITNI field day event. New to the group, Dr. Contessa struggles to find the balance between work and family. All of the ladies show up to support Jackie and compete in her event, but the real games begin when Heavenly and Toya disrupt the festivities. Meanwhile, Simone &amp; Cecil seek out professional help as their rocky marriage starts to take its toll on their kids."
      },
      {
        "id": "tvmaze:1355615",
        "title": "Black Girl Magic or Black Girl Tragic?",
        "season": 5,
        "episode": 4,
        "released": "2017-12-01",
        "overview": "To mend their ailing relationship, Quad plans a night of ‘Romance On The Table' but Dr. G. kills the vibe when he says the wrong thing. Simone confronts Cecil about being a two-faced politician. Meanwhile, Jackie faces the agony of public scrutiny when a patient chimes in on the affair and Toya's fears about cheating creep into her relationship with Eugene. With things going awry in Atlanta, Simone plans a girl's getaway to New Orleans, but Simone quickly learns, with this group, \"The Big Easy\" ain't so easy."
      },
      {
        "id": "tvmaze:1355616",
        "title": "Guess Who's Coming to NOLA?",
        "season": 5,
        "episode": 5,
        "released": "2017-12-08",
        "overview": "The ladies continue their Black Girl Magic trip in the Big Easy. On a swamp tour, Contessa is more concerned with Heavenly snapping back at her than any ‘gator. Back in Atlanta the men enjoy some guy time and cigars. Both Dr. Gregory and Quad are feeling the stress of marriage and seek advice from their friends. Toya promises Jackie and Simone to be nice \"all day\" but then shocks the group with a surprise guest."
      },
      {
        "id": "tvmaze:1355617",
        "title": "That Voodoo That You Do So Well",
        "season": 5,
        "episode": 6,
        "released": "2017-12-15",
        "overview": "On their last day in New Orleans, the ladies try to salvage the Black Girl Magic experience despite Mariah's return. Simone plans a cultural surprise for the ladies but it hits a snag when Heavenly smells a devil. Led by Jackie, the ladies hold a forgiveness ceremony to take a stab at moving forward. Back in Atlanta, Quad faces a tough homecoming, when forced to confront her marital issues with Dr. G."
      },
      {
        "id": "tvmaze:1376604",
        "title": "Mama Drama",
        "season": 5,
        "episode": 7,
        "released": "2017-12-22",
        "overview": "Quad, still reeling from her fight with Dr. G, faces some hard choices about the future of her marriage. Toya's mother comes to town and gives her daughter perspective on maintaining a happy marriage. Simone leans on her sister for emotional support. Meanwhile, Jackie asks Cecil's advice on what to do about Curtis. Heavenly continues to try to be a better person but stumbles when she gets into conflict with Mariah. Mariah hosts a Mother's Day brunch for all the ladies, but when Contessa brings her outspoken nanny, Ms. Reneé, the celebration takes a turn for the worse."
      },
      {
        "id": "tvmaze:1379686",
        "title": "Fly Girls & Low Riders",
        "season": 5,
        "episode": 8,
        "released": "2018-01-05",
        "overview": "Jackie comes face to face with Curtis for the first time since his infidelity. Simone sees a patient with unique circumstances. In an effort to make up for Ms. Renee's behavior at Mariah's party, Contessa turns back the clock and hosts a 90s pool party. But tensions rise, as Simone and Heavenly battle with Mariah, leaving Toya trying to keep the peace."
      },
      {
        "id": "tvmaze:1384001",
        "title": "Breakdown or Breakthrough",
        "season": 5,
        "episode": 9,
        "released": "2018-01-12",
        "overview": "The 90s pool continues with a bang. Contessa struggles balancing work life and family after Ms. Reneé sudden departure. Jackie and Curtis continue their courting with a 2nd date. Heavenly takes Alaura to see a vocal coach to the stars. Simone is blindsided by Cecil's investment in a business venture. Toya tries to seduce Eugene and bring the sexy back into their life. Quad and Greg attempt to solve their problems with a marital focus group, but facing the hard truths leaves them both struggling to move forward."
      },
      {
        "id": "tvmaze:1387124",
        "title": "Invitations and Revelations",
        "season": 5,
        "episode": 10,
        "released": "2018-01-19",
        "overview": "Jackie meets Curtis for the first time in public, and he gives her a surprise invitation. Maintaining a good work/life balance becomes too much for Contessa as she and Scott try to adjust. Just as they're getting closer to paying off their IRS debt, Toya and Eugene are hit with a new financial shock. Quad gets a spot on local TV to demo her new cookbook, but Greg isn't there to support her. Simone helps Cecil launch his new app with a big party, but escalating tension between Mariah and Heavenly threatens to turn the big event into a big fiasco."
      },
      {
        "id": "tvmaze:1396969",
        "title": "The Heavenlywed Game",
        "season": 5,
        "episode": 11,
        "released": "2018-01-26",
        "overview": "Still reeling from drama at the app party, Mariah must decide if she wants to accept an offer from Heavenly. Jackie is stunned when Curtis ambushes her on the way to Barbados, and his arrival sends shockwaves through the group, leading to an awkward encounter with Toya. Later, tensions rise during a first night Newlywed game, as Quad and Greg find all of their problems reaching a boiling point."
      },
      {
        "id": "tvmaze:1401444",
        "title": "Island Fever",
        "season": 5,
        "episode": 12,
        "released": "2018-02-02",
        "overview": "Heavenly takes Damon on an emotional journey, leading to revelations from his past. All the couples get an eye-opening group sex therapy session, where Jackie must come face to face with the state of her marriage. During a medical mission to help island locals, Eugene gets a major health scare. Later, there's trouble on the high seas as a luxury yacht ride heads into stormy waters. Mariah and Simone confront Quad on her selfish behavior. Can the group survive or will it be woman overboard?"
      },
      {
        "id": "tvmaze:1401445",
        "title": "Circle Of Truth",
        "season": 5,
        "episode": 13,
        "released": "2018-02-16",
        "overview": "After a turbulent yacht expedition, Heavenly puts all her energy into leading Couples Therapy. But when she refuses to share any of her own problems and asks questions that push everyone's buttons, a revolt erupts on the beach! Jackie finally breaks down emotionally and allows herself to be vulnerable with Curtis; Simone and Cecil's tensions boil over, while the drama between Quad and Greg reaches a new level. Mariah shares a shocking revelation about her own marriage."
      },
      {
        "id": "tvmaze:1401446",
        "title": "D. N. A. D-Day",
        "season": 5,
        "episode": 14,
        "released": "2018-02-23",
        "overview": "Home from Barbados, Heavenly decides to throw a DNA reveal party to make up for her failed couple's therapy. Jackie lets Curtis move back into the house, but with a surprise stipulation. Quad and Greg meet with their marital focus group to, but wind up in worse shape than before. Contessa makes an emotional and life-changing decision. Later, at the DNA party, Quad and Toya fight, causing Eugene to use a hot-button word that sends everyone into a tailspin."
      },
      {
        "id": "tvmaze:1409952",
        "title": "In the Black",
        "season": 5,
        "episode": 15,
        "released": "2018-03-02",
        "overview": "Toya and Eugene celebrate paying off their tax debt by throwing an In the Black Party. Simone and Cecil send their eldest son Miles off to college. Jackie and Curtis go through some growing pains. Contessa has some unfinished business with Eugene. Things go from bad to worse for Quad and Greg in their crumbling marriage."
      },
      {
        "id": "tvmaze:1422900",
        "title": "Reunion Part 1",
        "season": 5,
        "episode": 16,
        "released": "2018-03-09",
        "overview": "Host Andy Cohen reflects on some of the seasons biggest moments as the ladies of medicine come together in part one of the explosive three-part Married to Medicine Reunion. Toya is put on the hot seat about her sex life; Contessa defends her nanny against an onslaught of attacks; Mariah dishes her grievances with Heavenly, telling her what she really thinks of her, leading to a dramatic confrontation; Simone reveals shocking new information about her marriage."
      },
      {
        "id": "tvmaze:1422901",
        "title": "Reunion Part 2",
        "season": 5,
        "episode": 17,
        "released": "2018-03-16",
        "overview": "Part two of the reunion continues as Andy welcomes the husbands to tell their side of the story. Cecil explains himself and makes surprising claims about another woman; Eugene defends himself against Toya's sex rating; Curtis answers for his misdeeds, but has harsh words for Eugene. Later, Quad and Greg try to work through their issues, but a startling new revelation from Greg threatens to tear their marriage further apart."
      },
      {
        "id": "tvmaze:1419924",
        "title": "Reunion Part 3",
        "season": 5,
        "episode": 18,
        "released": "2018-03-23",
        "overview": "The reunion concludes in part three, as the group deals with the fallout from Greg's scandalous revelation. Seeing another marriage falling apart, the group rallies around Simone and Cecil, imploring them to work it out. Will their pleas be heard or will they fall on deaf ears?"
      },
      {
        "id": "tvmaze:1508697",
        "title": "Get Your Sexy Back",
        "season": 6,
        "episode": 1,
        "released": "2018-09-02",
        "overview": "Quad's marriage problems are plastered all over social media and the blogs, and instead of leaning on the ladies for support, she gives them the cold shoulder. Toya tries to encourage Eugene to live a healthy lifestyle, Contessa struggles with being a stay at home Mom. Simone throws a leather and lace party to reclaim her sexy, but tensions flare between Heavenly and Mariah when Mariah claims to have receipts on \"Daddy.\""
      },
      {
        "id": "tvmaze:1518756",
        "title": "I Don't Talk to Dentists",
        "season": 6,
        "episode": 2,
        "released": "2018-09-09",
        "overview": "After Mariah accuses Damon of infidelity, Heavenly channels her rage by seeking help from an anger management therapist. Contessa worries about her father's failing health, and tells Scott she wants him to visit. Isolated from the entire group, Quad hangs with her new besties from her talk show and vents about her marital woes. Simone and Cecil continue to struggle to fix their broken marriage, while Toya throws a surprise party for Eugene, but ends up making the party all about an absentee Contessa."
      },
      {
        "id": "tvmaze:1518757",
        "title": "Crabby Ladies",
        "season": 6,
        "episode": 3,
        "released": "2018-09-16",
        "overview": "When her ailing father visits, Contessa discovers his health is even worse than she thought. While Mariah has a real talk with Lauren about growing up and getting ready for high school, Simone faces a hard talk with her son, Michael about the current state of her marriage. Heavenly attempts to bring Quad back into the circle of friends for a crab boil, but everything comes to a boiling point with the women as friendships and loyalties are questioned."
      },
      {
        "id": "tvmaze:1518758",
        "title": "Emotional Workout",
        "season": 6,
        "episode": 4,
        "released": "2018-09-23",
        "overview": "Things continue to heat up at the crab boil when Heavenly and Mariah's long-standing feud reaches a fever pitch. Quad opens up to the group, but will her words be enough? Contessa has a candid conversation with her father about a life-altering decision. Meanwhile, Dr. K encourages Heavenly to dig further into her past. Later, Jackie's plan to reconnect her friends forces them to get up and get moving, with surprising results."
      },
      {
        "id": "tvmaze:1518759",
        "title": "Heavenly Homecoming",
        "season": 6,
        "episode": 5,
        "released": "2018-09-30",
        "overview": "Quad has a heart-to-heart with Jackie over her marital issues while the guys have a much-needed night to themselves where Greg tells his side of the story. Contessa takes the first step towards a new life. With Simone and Jackie in tow, Heavenly travels to her childhood home in Miami to seek out the root of her anger."
      },
      {
        "id": "tvmaze:1531975",
        "title": "A Room Without a View",
        "season": 6,
        "episode": 6,
        "released": "2018-10-07",
        "overview": "Heavenly continues her spiritual journey in Miami with the aid of Jackie and Simone. Back in Atlanta, Contessa goes through with her double mastectomy. Quad turns to old friends for comfort in her crumbling marriage. Toya and Eugene are in awe of the progress of their dream home. Mariah and Aydin take Lauren out for a dinner to explain the birds and the bees."
      },
      {
        "id": "tvmaze:1531976",
        "title": "Out Of Commission",
        "season": 6,
        "episode": 7,
        "released": "2018-10-14",
        "overview": "Heavenly, Jackie, and Simone settle back into daily life after their trip to Miami. Simone welcomes her son home from college but isn't so welcoming to the idea of Cecil moving back in. Contessa is recuperating from her prophylactic mastectomy and receives a house call from her good friends, Mariah and Dr. Jarret. Quad lunches with her mom and aunt and reveals that her life has been turned upside down. Jarret invites all the ladies to her newly constructed home for a housewarming party and Quad debates revealing her big news to the ladies."
      },
      {
        "id": "tvmaze:1531977",
        "title": "Pajama Drama",
        "season": 6,
        "episode": 8,
        "released": "2018-10-21",
        "overview": "While Mariah receives some bad news from her husband, Simone finally has some good news to share about Cecil. Heavenly reflects on her Miami trip with her therapist and makes some new personal discoveries. While Quad is quietly adjusting to her newly single life, the other women are shocked to find out through social media of Quad's divorce. In an attempt to reunite the women and bring Black Girl Magic back to the group, Jackie throws a slumber party."
      },
      {
        "id": "tvmaze:1531978",
        "title": "Black Love",
        "season": 6,
        "episode": 9,
        "released": "2018-10-28",
        "overview": "Toya and Eugene contemplate celebrating their 10-year anniversary with their friends overseas. Meanwhile Jackie and Curtis celebrate, coming back from the brink of divorce and making it 17-years. Mariah plans a Black Love party but when some of the invitees fail to show, they put a damper on the festivities."
      },
      {
        "id": "tvmaze:1555225",
        "title": "Trouble in Paradise",
        "season": 6,
        "episode": 10,
        "released": "2018-11-04",
        "overview": "Everyone heads to Antigua for the annual couples trip. Trying to cope with divorce Quad breaks down revealing she saw Greg the night before with another woman. Contessa tries to enjoy the island sun as she recovers from breast surgery, but a surprise encounter with Toya may get in the way of that. Later things heat up when a tiff over Quad sends Heavenly and Mariah into an all out island brawl."
      },
      {
        "id": "tvmaze:1556041",
        "title": "BBQs, Biscuits and Birth Control",
        "season": 6,
        "episode": 11,
        "released": "2018-11-10",
        "overview": "On Part 2 of the couple's trip in Antigua, tensions continue to rise in the group. While Toya confronts Contessa for hitting her on purpose, Mariah can't let go of Heavenly insulting her mom. Jackie attempts to lead a reconciliation between all the ladies but the second night dinner proves to be just as explosive as the first. Tears are shed, and everyone has reached their boiling point."
      },
      {
        "id": "tvmaze:1561339",
        "title": "Heavenly's Second Chance",
        "season": 6,
        "episode": 12,
        "released": "2018-11-17",
        "overview": "Smooth sailing turns to rocky waters when Simone and Contessa's argument turns ugly in Antigua. Facing increased pressure, Mariah apologizes to Damon for the infidelity rumors she's spread. In order to right last year's wrongs from Couples' Therapy, Heavenly sits on the hot seat. Determined to give back, Jackie volunteers the group for a meaningful Medical Mission as Quad hurls the hurt over Dr. Greg's infidelities out to sea."
      },
      {
        "id": "tvmaze:1561340",
        "title": "Sleep Number's Gone!",
        "season": 6,
        "episode": 13,
        "released": "2018-12-01",
        "overview": "Simone and Cecil share some surprising news at their Mi Casa Es Su Casa Party. Determined to keep the romance going, Jackie enlists Simone and Heavenly to help her cook a meal for Curtis. Toya and Eugene visit the construction site of their new home where she discovers some unsettling news. The guys invite Greg to a men's only outing, getting all the tea about what really went down when Quad moved out."
      },
      {
        "id": "tvmaze:1570470",
        "title": "Bottled Up Emotions",
        "season": 6,
        "episode": 14,
        "released": "2018-12-07",
        "overview": "Realizing her baby is growing up, Mariah surprises Lauren with a wardrobe makeover. Simone and Cecil's romantic dinner date is ruined when issues from the past push Simone over the edge. Meanwhile, Jackie and Curtis struggle to compromise on a new home and a fresh start. Toya plans a wine tasting trip for the ladies that turns sour when lingering issues with Contessa come to a head and Mariah gets some scary news about Aydin's health."
      },
      {
        "id": "tvmaze:1575402",
        "title": "Docs on the Dock 2.0",
        "season": 6,
        "episode": 15,
        "released": "2018-12-14",
        "overview": "Simone and Cecil try to recover from their date night, which took a left turn. Before the walls are put up in their new house Toya and her family write scriptures on the foundation. Meanwhile, Jackie follows Toya's lead and decides to build her dream house to create a fresh start with Curtis. In celebration of Aydin's recovery, Mariah hosts a party at her home, Doctors on the Docks 2.0. The group reflect on the year and if they rebuild broken marriages and friendships."
      },
      {
        "id": "tvmaze:1575403",
        "title": "Reunion Part 1",
        "season": 6,
        "episode": 16,
        "released": "2018-12-21",
        "overview": "Host Andy Cohen reflects on some of the seasons biggest moments as the ladies of medicine come together in Part 1 of the explosive three-part Married to Medicine Reunion. Simone reveals what her home life is really like; Contessa finds herself cornered, defending her surgery from attacks. Heavenly and Mariah try to settle an argument, leading to a dramatic confrontation. Quad lays out a shocking accusation."
      },
      {
        "id": "tvmaze:1580777",
        "title": "Reunion Part 2",
        "season": 6,
        "episode": 17,
        "released": "2019-01-06",
        "overview": "Part two of the reunion continues as Andy tries to get to the bottom of Quad's scandalous accusations against Mariah. Then, the husbands tell their side of the story. Damon defends himself against cheating allegations, while Aydin sticks up for his wife. Later, Greg and Quad come face to face for one last confrontation."
      },
      {
        "id": "tvmaze:1584905",
        "title": "Reunion Part 3",
        "season": 6,
        "episode": 18,
        "released": "2019-01-13",
        "overview": "The reunion concludes in part three, as Quad and Greg face off, revealing the shocking truth about their marriage. Then, as the group deals with the fallout from Quad and Greg's confrontation, divisions are drawn. Later, Toya and Contessa's friendship comes to head."
      },
      {
        "id": "tvmaze:1693960",
        "title": "Open and Honest",
        "season": 7,
        "episode": 1,
        "released": "2019-09-08",
        "overview": "The ladies of medicine are back and the lines in the sand have been drawn. Dr. Heavenly and Dr. Jackie shake up the group with their Open and Honest podcast. Toya and Eugene struggle to finish construction on their dream home. Dr. Contessa's traveling back and forth causes Scott to put on his single dad hat. Dr. Simone is happy to have her whole family back under one roof. The ladies try to come together at Heavenly's Hollywood Glam party, but the night quickly turns into chaos."
      },
      {
        "id": "tvmaze:1693961",
        "title": "Stirring the Teapot",
        "season": 7,
        "episode": 2,
        "released": "2019-09-15",
        "overview": "Contessa's pursuit of higher education continues to drive a wedge between her and Scott. Toya tries to put on a brave face and be there for her family after a devastating loss. Quad updates the ladies on her divorce. As the Twitter war between Simone and Heavenly comes to a fever pitch, Jackie throws an \"Emergen-Tea\" party to set everything right. Will the tea be served or spilled?"
      },
      {
        "id": "tvmaze:1693962",
        "title": "Resuscitated Friendships",
        "season": 7,
        "episode": 3,
        "released": "2019-09-22",
        "overview": "Simone and Quad struggle to repair their friendship, but a breaking point may be near. Toya and her family struggle to heal from her miscarriage. Dr. Heavenly vents to Damon that Alaura is growing up too fast, but Simone wants her boys to grow up and clean up. Jackie and Simone hatch a surprise dinner with Heavenly and Mariah to work out their issues, but will Heavenly and Mariah run for the door when they discover the ambush?"
      },
      {
        "id": "tvmaze:1693963",
        "title": "Ballin' on a Budget",
        "season": 7,
        "episode": 4,
        "released": "2019-09-29",
        "overview": "Jackie and Curtis have big plans to tear down and rebuild their home but will the budget fit their dreams? Contessa realizes that that being away in Nashville is making her a distant memory to her family. Simone's friend Buffie throws a Fab and Frugal party where things get ugly when Toya is put on the spot about past money woes. Later, Toya throws a paint and sip for her birthday with a surprise twist that shocks her friends."
      },
      {
        "id": "tvmaze:1725445",
        "title": "Naked and Not Afraid",
        "season": 7,
        "episode": 5,
        "released": "2019-10-06",
        "overview": "Toya shocks the ladies with her idea of an art class. Heavenly decides not to tell Damon about Toya's explicit birthday party. While Simone and Cecil give the boys a safe sex talk, Jackie does some sexual research for an exciting new project. As Toya and Eugene move into their new house, Contessa surprises Scott with some big moves of her own."
      },
      {
        "id": "tvmaze:1735490",
        "title": "Girl Code, Interrupted",
        "season": 7,
        "episode": 6,
        "released": "2019-10-13",
        "overview": "Hoping to get the ladies' friendships back on track, Jackie invites the group to Savannah for a good old-fashioned girls' trip. Feeling called out by Damon, Heavenly takes it out on Toya. Mariah goes after the whole group for perpetuating lies against her. By the end of a disastrous dinner, Jackie's \"friendship revival\" is clearly on life support. Can she save this trip before it flat lines?"
      },
      {
        "id": "tvmaze:1740073",
        "title": "Showdown in Savannah",
        "season": 7,
        "episode": 7,
        "released": "2019-10-20",
        "overview": "Any progress made during Revival Weekend in Savannah comes to a screeching halt after Mariah's meltdown on the bus. Dr. Jackie reaches her breaking point when she realizes that there are some problems she just can't fix. Contessa ponders Jackie's advice to pursue couples' counseling for herself and Scott. Mariah brings the receipts and the drug test results to prove Quad wrong, but do the rest of the ladies even want to know the truth?"
      },
      {
        "id": "tvmaze:1740977",
        "title": "Food for Thought",
        "season": 7,
        "episode": 8,
        "released": "2019-10-27",
        "overview": "Jackie butts heads with Curtis over the rising costs of their home renovations. Contessa gives her dad a new smile courtesy of Dr. Heavenly. Simone and Cecil give Miles a wake-up call about his future. Quad celebrates her birthday and the launch of her new cookbook, but since she's not on the guest list, Mariah celebrates Ramadan with her family. But when Quad shades her friends in her thank-you speech, will the festivities flat line?"
      },
      {
        "id": "tvmaze:1742913",
        "title": "Contessa's Carnival",
        "season": 7,
        "episode": 9,
        "released": "2019-11-03",
        "overview": "Quad loses her mind when she allows Heavenly to set her up on a blind date. Dr. Jackie piles on her to-do list by renovating a new office. An overwhelmed Contessa throws a huge carnival birthday for her kids, hoping to make up for her mommy guilt. Buffie comes to Simone for help when she discovers a lump in her breast."
      },
      {
        "id": "tvmaze:1751222",
        "title": "Battle Down South",
        "season": 7,
        "episode": 10,
        "released": "2019-11-17",
        "overview": "Toya and Eugene invite Simone and Cecil over to tour their new forever home. Contessa and Scott face hard truths about their relationship in their first therapy session. Jackie hosts a party to launch her book \"The Queen V\" and outs some very personal information about Buffie. Later, everyone heads to Cabo for their couple's trip and have a boogie-down battle for the chance to win a penthouse suite."
      },
      {
        "id": "tvmaze:1759877",
        "title": "Bus-ted Cabo",
        "season": 7,
        "episode": 11,
        "released": "2019-11-24",
        "overview": "Buffie breaks her silence with Jackie for talking about her infertility, but Jackie hits back hard. Toya has a meltdown when the mini bus breaks down, forcing Simone and Cecil scramble to come up with a new couple's activity. Can they save the trip or will everything go loco, Mexican Messy Boots style?"
      },
      {
        "id": "tvmaze:1765344",
        "title": "Revenge of the Sip and Paint",
        "season": 7,
        "episode": 12,
        "released": "2019-12-01",
        "overview": "The couples' trip to Cabo continues. Contessa and Scott continue to clash, putting their relationship on the brink. Jackie apologizes to Buffie for their fight the night before, but Buffie's far from over it. When the guys and the ladies have separate nights out, Quad gets a special girls night and Damon winds up in the doghouse with Heavenly."
      },
      {
        "id": "tvmaze:1765434",
        "title": "Swap Till You Drop",
        "season": 7,
        "episode": 13,
        "released": "2019-12-08",
        "overview": "In Cabo San Lucas, the group participates in a good old fashioned wife swap - with games on the beach! Heavenly's anger at Damon going to the strip club boils over. Contessa and Scott put on a brave face for the group, but their marriage issues are bubbling under the surface. Back in Atlanta, Quad's divorce proceedings inch closer to the finish line."
      },
      {
        "id": "tvmaze:1769540",
        "title": "Trouble in Spa-radise",
        "season": 7,
        "episode": 14,
        "released": "2019-12-15",
        "overview": "Back from Cabo, Quad celebrates her new found singledom with pal Cynthia Bailey, Toya starts planning her big housewarming for her new forever home, and Scott and Contessa have a major breakthrough in therapy. When Buffie throws a spa day to recharge the friendships, the last thing on the agenda is rest and relaxation."
      },
      {
        "id": "tvmaze:1773708",
        "title": "Arabian Nights",
        "season": 7,
        "episode": 15,
        "released": "2019-12-22",
        "overview": "As Jackie and Curtis begin renovations on their new home, Toya plans the ultimate housewarming party. Contessa and Scott finally come together on her decision to return to school in Nashville, while Heavenly battles with her decision to trust Alaura. Toya's Arabian Nights Housewarming party hits a snag when Buffie breaks down, Jackie steps away from the ladies, and Contessa and Mariah break the peace of Toya's two-story closet in an epic showdown."
      },
      {
        "id": "tvmaze:1773709",
        "title": "Reunion Part 1",
        "season": 7,
        "episode": 16,
        "released": "2019-12-29",
        "overview": "Host Andy Cohen reflects on some of the seasons biggest moments as the ladies of medicine come together in part one of the explosive \"Married to Medicine\" Reunion. Quad discusses her current relationship status, while Simone surprises everyone with new information about Dr. G. Buffie confronts Dr. Jackie causing Heavenly to leap to her defense."
      },
      {
        "id": "tvmaze:1783472",
        "title": "Reunion Part 2",
        "season": 7,
        "episode": 17,
        "released": "2019-12-29",
        "overview": "Part two of the reunion continues as Andy welcomes the husbands to tell their side of the story. The ladies talk about their favorite shady moments from the season. Mariah discusses the allegations brought up against her. Dr. Simone and Dr. Jackie shock everyone when they reveal a rift in their friendship."
      },
      {
        "id": "tvmaze:1783473",
        "title": "Reunion Part 3",
        "season": 7,
        "episode": 18,
        "released": "2020-01-05",
        "overview": "The reunion concludes as Andy is joined by all the couples. Damon comes face to face with his actions in Cabo. Aydin and Mariah defend themselves. Toya opens up about her past love, upsetting Eugene. Contessa speaks her truth. After hashing out old and new issues, will the ladies be able to come together as a group again?"
      },
      {
        "id": "tvmaze:2032123",
        "title": "Breaking Out of the Bubble",
        "season": 8,
        "episode": 1,
        "released": "2021-03-07",
        "overview": "The ladies are back and life in the A has changed. With Covid and a racial reckoning happening all around the ladies continue to push forward. Toya, fully moved into her dream home struggles with Dr. Eugene working long hours at the hospital, while she's stuck at home with the kids. Contessa and Scott bicker over working together in their new private practice office, while Jackie and Simone, struggle to understand their fractured friendship. Heavenly throws a 50th birthday party for Damon, but tensions flare when the group comes together for the first time in months."
      },
      {
        "id": "tvmaze:2043645",
        "title": "Graduation Snub",
        "season": 8,
        "episode": 2,
        "released": "2021-03-14",
        "overview": "Damon's birthday comes crashing down as Simone and Heavenly's feud breaks up the party. Toya discusses racism and diversity with her boys, Contessa builds out a new medical practice without Scott's blessing. Heavenly helps a gossip blogger, Funky Dineva, put his money where his mouth is. Meanwhile, Anila confronts financial woes due to the pandemic. Heavenly and Simone come face to face to address their longstanding issues. Simone throws a graduation party for her son Michael, but is she acting like a high schooler when she doesn't invite Jackie?"
      },
      {
        "id": "tvmaze:2048131",
        "title": "New Year, Old Feuds",
        "season": 8,
        "episode": 3,
        "released": "2021-03-21",
        "overview": "Simone and the doctors continue the fight against Covid-19 on the front lines. Contessa vents to Jackie about her and Scott's marital problems. Toya's frustration over homeschooling kids continues. Heavenly shares some shady gossip with Quad. During Anila's traditional Rahki party for her friends and family, Toya and Contessa's old feud reignites."
      },
      {
        "id": "tvmaze:2051499",
        "title": "Home Court Advantage",
        "season": 8,
        "episode": 4,
        "released": "2021-03-28",
        "overview": "Simone prepares to send Michael off to college with one last Kids v. Adults basketball game. Anila wants to impress her parents with her new home, but momma isn't impressed. Eugene calls Toya out for her recent cranky behavior. After an epic basketball showdown, Heavenly and Toya go into overtime, exchanging heated words."
      },
      {
        "id": "tvmaze:2051500",
        "title": "Friendship Foes & Marital Woes",
        "season": 8,
        "episode": 5,
        "released": "2021-04-04",
        "overview": "Toya distances herself from the group and hosts her own pool party, with surprise guests. Contessa and Scott vent to others about their marital woes. Heavenly encourages Jackie to mend fences with Simone. Anila and Kiran find their dream house turning into a nightmare. Simone and family send Michael off to college with a tearful goodbye."
      },
      {
        "id": "tvmaze:2063032",
        "title": "The Power of Crystals",
        "season": 8,
        "episode": 6,
        "released": "2021-04-11",
        "overview": "As the tension between former best friends Jackie and Simone reaches new heights, their husbands try and talk sense into them. Heavenly gets an unexpected call for a once-in-a-lifetime opportunity to help a young protester. Contessa enlists her niece Paris to throw a healing crystal event for the group. However, Toya brings along some blasts from the past to crash the party."
      },
      {
        "id": "tvmaze:2063707",
        "title": "Guess Who's Coming to Dinner",
        "season": 8,
        "episode": 7,
        "released": "2021-04-18",
        "overview": "The Doctors and Wives head to Washington DC for their most important medical mission yet as Ambassadors to the March on Washington. Reverend Al Sharpton and Ben Crump come by for dinner to discuss race relations in America. And tensions brew between the doctor's and the wives as Kari reveals to Toya and Anila that Heavenly and Contessa have been questioning their intelligence."
      },
      {
        "id": "tvmaze:2070532",
        "title": "Know Your Status DC",
        "season": 8,
        "episode": 8,
        "released": "2021-04-25",
        "overview": "Everyone gathers to relax by the pool prior to the March on Washington but can't drown out the drama when Toya makes a splash and confronts Heavenly and Contessa. The doctors take a stand against the pandemic and systemic racism when they perform covid testing at the March on Washington. Later, after a day of unity, the ladies head to dinner but ditch two of their own."
      },
      {
        "id": "tvmaze:2075462",
        "title": "Let The Emojis Fly",
        "season": 8,
        "episode": 9,
        "released": "2021-05-02",
        "overview": "After a successful medical mission in DC, the group heads home to Atlanta, reinvigorated. While Simone sees a patient with fibroids, Damon and Heavenly discuss the significance of the March on Washington with their kids during a family dinner. Toya confronts Anila about her finances. Contessa has a business consultation with a specialist before the grand opening of her new practice. Jackie plays peacemaker, hosting a dinner at her house, where Quad and Heavenly come head to head over an emoji incident."
      },
      {
        "id": "tvmaze:2078505",
        "title": "Ain't No Party Like a Self-Love Party",
        "season": 8,
        "episode": 10,
        "released": "2021-05-09",
        "overview": "Everyone's lives come to a halt when they have to isolate for 14 days. Toya discovers that Quad and Heavenly can't stop talking about her. Heavenly questions her son's investment decisions. Simone thinks about adding to the family. Jackie surprises the ladies with a porn star, but Toya gets the real surprise when Anila confronts her about the rumors Toya's been spreading."
      },
      {
        "id": "tvmaze:2090267",
        "title": "Club Q-uarantine",
        "season": 8,
        "episode": 11,
        "released": "2021-05-16",
        "overview": "Toya finds calm at home even as her friendships remain rocky. Simone gives her son Miles an ultimatum. Anila finds a new job in an unlikely place. Contessa opens her new practice, but it's the same old issues with Scott. Quad throws a game night party at her home, but the fun turns to drama, as Toya is forced own up to her past words about Quad's house."
      },
      {
        "id": "tvmaze:2090268",
        "title": "Holi Mess",
        "season": 8,
        "episode": 12,
        "released": "2021-05-23",
        "overview": "Anila and Quad bond over their shared issues with Toya. Simone and Contessa try to get to the bottom of Toya's problems with the group. Simone and Cecil host a couple's dinner, and are shocked to learn just how fragile Scott and Contessa's marriage is. Anila hosts a Holi event in hopes to heal some of the friendships within the group but things go Holi wrong when old feuds flare up."
      },
      {
        "id": "tvmaze:2095499",
        "title": "Chanel Charade",
        "season": 8,
        "episode": 13,
        "released": "2021-05-30",
        "overview": "Cecil and Eugene hang with Scott, who shares some interesting pics on his phone. Anila checks in on her house build and learns some upsetting news about her daughter. Heavenly and Zach put the final touches on their new rental property. Contessa uncovers some truths about herself. Simone plans a political town hall event, but things go off the rails when she discovers Lisa Nicole has been trying to push her aside."
      },
      {
        "id": "tvmaze:2095500",
        "title": "Scott's Secret",
        "season": 8,
        "episode": 14,
        "released": "2021-06-06",
        "overview": "The Town Hall Event is threatened when Simone learns some disturbing info about Lisa Nicole on the local news. Anila goes to Jackie for advice on her fractured friendship with Toya. Scott reveals a bombshell to Contessa that could undermine their entire marriage."
      },
      {
        "id": "tvmaze:2103963",
        "title": "Jekyll Island, Part 1",
        "season": 8,
        "episode": 15,
        "released": "2021-06-13",
        "overview": "The ladies finally arrive to Jekyll Island. Heavenly and Toya come together in hopes of starting anew, while Contessa confides to Jackie and Quad about her suspicions of Scott. The ladies relax at dinner, but their peaceful night is soon disturbed when Anila stirs the pot over a bad deal with Lisa Nicole."
      },
      {
        "id": "tvmaze:2108938",
        "title": "Jekyll Island, Part 2",
        "season": 8,
        "episode": 16,
        "released": "2021-06-20",
        "overview": "In the season finale of Married to Medicine, the ladies enjoy a day of sightseeing that leads to some close encounters. Anila finds a creative way to get her money from Lisa. Later, the men join the ladies for the last night on the island. The truth about Scott and Contessa finally comes out, but will it create more questions than answers?"
      },
      {
        "id": "tvmaze:2117782",
        "title": "Reunion Part 1",
        "season": 8,
        "episode": 17,
        "released": "2021-06-27",
        "overview": "Host Andy Cohen reflects on some of the season's biggest moments as the ladies of medicine come together in part one of the three-part Married to Medicine Reunion. After sharing how Covid flipped their world upside down, Quad graces the stage and shakes things up with Toya when she brings up the heated Instagram live debate. Anila and Toya's friendship is tested, while Heavenly and Toya share a special kiss. Contessa reveals shocking information about her marriage to Scott."
      },
      {
        "id": "tvmaze:2121437",
        "title": "Reunion Part 2",
        "season": 8,
        "episode": 18,
        "released": "2021-07-11",
        "overview": "Scott crashes the stage when he hears Contessa's reveal their relationship status. The women question Scott's fidelity, and Contessa has a breakdown backstage. Simone and Jackie's friendship is questioned, while Simone is brought to tears over her hostile relationship with Heavenly. The men arrive to the stage and Scott is caught in a web of lies."
      },
      {
        "id": "tvmaze:2129880",
        "title": "Reunion Part 3",
        "season": 8,
        "episode": 19,
        "released": "2021-07-18",
        "overview": "The women join the stage and share how difficult this past year has been for all of their marriages. Dr. Eugene breaks down sharing the reality of life in the ER. The ladies joke about the shade they've thrown, but Quad takes it to the next level when she confronts Toya about the comments she's made about her home."
      },
      {
        "id": "tvmaze:2342697",
        "title": "Bless This Mess",
        "season": 9,
        "episode": 1,
        "released": "2022-07-10",
        "overview": "The ladies of medicine are back! Dr. Jackie and Dr. Simone share quality time together. Toya reveals a surprising life change. Quad finds a new man in her life. Dr. Contessa puts her body to work. Dr. Heavenly tries to figure out where she went wrong with Contessa, who hasn't spoken to her in months. Anila throws a housewarming party to show off her new $3 million dream home. Will her party derail when Heavenly and Contessa come face to face for the first time?"
      },
      {
        "id": "tvmaze:2357685",
        "title": "The Beauty Shop",
        "season": 9,
        "episode": 2,
        "released": "2022-07-17",
        "overview": "Contessa reveals to Toya the reasons for her fractured friendship with Heavenly. Anila and Kiran receive some life-altering news. Heavenly opens a new business, partnering with the great beyond. Dr. Simone and Cecil start a new adventure together. Quad and Mason navigate their new life together. All the ladies come together for Heavenly's grand opening for her new beauty supply store. Will everyone play nice or is someone's weave about to be snatched?"
      },
      {
        "id": "tvmaze:2359884",
        "title": "Heavenly Intervention",
        "season": 9,
        "episode": 3,
        "released": "2022-07-24",
        "overview": "Simone and Cecil ask for advice about their book from an old friend. Dr. Jackie gives a patient very important advice. Anila says her final goodbye to Ms. Gomez and wonders what is next for her. Contessa and Toya decide that enough is enough with Heavenly and stage an intervention on her shady ways. When things don't go as planned, friendships are pushed to the limit."
      },
      {
        "id": "tvmaze:2364413",
        "title": "Party Foul",
        "season": 9,
        "episode": 4,
        "released": "2022-07-31",
        "overview": "In the aftermath of Heavenly's intervention, she grapples with changing her ways. Contessa must decide whether to let go of one of her closest friendships. Anila tries to juggle work and her kids. A stunt by Anila and Kiran at the Halloween party goes awry, putting the husbands at odds with each other for the first time."
      },
      {
        "id": "tvmaze:2367070",
        "title": "An Axe to Grind",
        "season": 9,
        "episode": 5,
        "released": "2022-08-07",
        "overview": "Still upset by Anila and Kiran's Halloween costumes, Eugene confronts Kiran. Jackie and Simone plan a trip to Las Vegas in an attempt to bring the ladies together. Ms. Gomez's absence forces Anila to resort to drastic measures. Contessa worries preparing for her bikini fitness competition could prove challenging in Vegas. The ladies look to let loose in Vegas and a game of Never Have I Ever sets the stage for some shocking revelations and a raucously good time."
      },
      {
        "id": "tvmaze:2370219",
        "title": "Viva Las Vegas!",
        "season": 9,
        "episode": 6,
        "released": "2022-08-14",
        "overview": "As the fun continues in Vegas, the ladies play a game where Toya reveals a secret she hopes doesn't make it back to the ATL. Audra calls out Toya for questioning her skills as an attorney. The Vegas girls' bonding trip is turned on its head yet again when the brewing dispute between Contessa and Heavenly rears its ugly head. Toya faces her greatest fears head on."
      },
      {
        "id": "tvmaze:2372603",
        "title": "Secrets & Sinners",
        "season": 9,
        "episode": 7,
        "released": "2022-08-21",
        "overview": "The women continue their Vegas trip with a decadent dinner full of vintage wines, juicy conversation and some eye candy for dessert. Back in Atlanta, the men go boxing and old tensions between Kiran and Eugene resurface. A final brunch in Sin City turns into a second intervention attempt with Heavenly."
      },
      {
        "id": "tvmaze:2381202",
        "title": "The Oh! Shot",
        "season": 9,
        "episode": 8,
        "released": "2022-08-28",
        "overview": "As tensions in Toya and Eugene's marriage continue to grow, Heavenly confides in Jackie about the decline of her mother's health. Anila's parents arrive and immediately cause problems within the home. Contessa and Heavenly rip open old wounds at Simone and Cecil's couples dinner party. Jackie hosts an Oh! Shot party for the ladies to give everyone a boost to their sex lives."
      },
      {
        "id": "tvmaze:2387286",
        "title": "The Breaking Point",
        "season": 9,
        "episode": 9,
        "released": "2022-09-04",
        "overview": "Heavenly admits to Damon that her mother's illness is affecting her and offers a rare apology. Contessa feels for Heavenly and agrees to put their differences aside. Anila's plans move forward with her hair store, but her mom throws a wrench in things. Kiran hosts a gentlemen's affair for the guys at his clinic. Facing a breaking point, Toya and Eugene turn to friends to get advice on their ongoing issues."
      },
      {
        "id": "tvmaze:2388200",
        "title": "Holi-Slay",
        "season": 9,
        "episode": 10,
        "released": "2022-09-11",
        "overview": "Simone and Cecil go for round two, inviting a new set of couples over to help with their book, but when Toya lets Audra know her wardrobe isn't good enough, it threatens to spoil the dinner. Eager to show off her new home, Quad throws a Christmas party for the ladies. The holiday shindig goes off the rails, however, when a salty Audra uses her real estate attorney skills to put Toya's business in the streets. Then, things go from bad to worse when Toya finds out Anila is accusing her of cheating on Eugene."
      },
      {
        "id": "tvmaze:2391451",
        "title": "Rumor Mill",
        "season": 9,
        "episode": 11,
        "released": "2022-09-18",
        "overview": "Quad's rumor-filled holiday party ends when instead of decking the halls, Audra tries to deck Toya in the face. Contessa meets with a new kind of coach to prepare for her fitness competition. Anila's mom continues to cause her stress, pushing her to the edge. Quad celebrates her brother's life with her family. Jackie makes a move at work, opening the door to a surprising future. Later, the ladies discuss what went down at the Christmas party, and Simone reveals a stunning secret about Quad."
      },
      {
        "id": "tvmaze:2399332",
        "title": "The Streets Are Talking",
        "season": 9,
        "episode": 12,
        "released": "2022-09-25",
        "overview": "Simone and Cecil get some unexpected news on their book from Omarosa. Toya and Eugene take time to celebrate their son's birthday. Jackie does something at work she's never done before. Heavenly deals with the passing of her mother. Anila and Kiran continue to process their robbery. Later, at a BBQ at Jackie's house, talk of a \"hit\" leads the ladies to speculate on what really happened with the robbery and who could be responsible."
      },
      {
        "id": "tvmaze:2401621",
        "title": "Going Back, Back to Blue Ridge",
        "season": 9,
        "episode": 13,
        "released": "2022-10-02",
        "overview": "Quad shocks Anila when she spills the tea on what the ladies really think about her break-in. Contessa's day of reckoning arrives as she competes in her first fitness competition. Anila finally gets some good news for her family. Simone and Jackie bring the group together, planning a throwback couples trip to revive the friendships. Audra and Martin welcome a happy surprise, but the trip to Blue Ridge starts off rocky, as tensions flare between the ladies and all the rumors threaten to boil over."
      },
      {
        "id": "tvmaze:2409168",
        "title": "Mountain Revival",
        "season": 9,
        "episode": 14,
        "released": "2022-10-09",
        "overview": "The trip to Blue Ridge continues. Toya makes strides in her relationship with Audra. Cecil loses a big bet. Anila and Toya come to an understanding, as Anila passes the blame on rumors to Quad. The ladies enjoy massages, and Contessa gets special treatment from Jackie. Later, the couples all enjoy dinner and reveal too much about their sex lives. Jackie surprises the couples with a late-night event."
      },
      {
        "id": "tvmaze:2410533",
        "title": "Divine Intervention",
        "season": 9,
        "episode": 15,
        "released": "2022-10-16",
        "overview": "Jackie's surprise open marriage discussion has some couples tongue-tied, but others lean in. Later that night, old tensions rise up as Heavenly and Contessa finally say what's on their minds. Toya confronts Quad about the cheating allegations, setting off a firestorm. Jackie and Simone try to bring the group back together for a Sunday sermon. Will the ladies hear the Word, or are some friendships past forgiveness?"
      },
      {
        "id": "tvmaze:2416007",
        "title": "Reunion Part 1",
        "season": 9,
        "episode": 16,
        "released": "2022-10-23",
        "overview": "Host Andy Cohen reflects on some of the season's biggest moments as the ladies of medicine come together in part one of the explosive three-part \"Married to Medicine\" reunion. The fireworks start early as Contessa confronts Heavenly before the cameras are even ready. Quad goes to extreme lengths to combat allegations made against her. Heavenly shows a different side of herself, but is it enough for her friends? Things come to a head when Anila and Toya confront one another over rumors about a robbery."
      },
      {
        "id": "tvmaze:2416008",
        "title": "Reunion Part 2",
        "season": 9,
        "episode": 17,
        "released": "2022-10-30",
        "overview": "Toya reveals what was really going on with her this season. Quad and Anila point the finger at each other when it comes to who started the rumors about Toya's affair. The ladies finally confront Heavenly on her behavior, but will she listen? The men arrive to the stage and things get heated when Kiran and Eugene open old wounds."
      },
      {
        "id": "tvmaze:2416009",
        "title": "Reunion Part 3",
        "season": 9,
        "episode": 18,
        "released": "2022-11-06",
        "overview": "Kiran and Eugene try to settle the score. Scott surprises everyone, revealing a shocking career move. The women join the stage and Contessa confronts Damon. Eugene tells Quad how he really feels about her innuendos. The ladies get down and dirty as a surprise reprise from Vegas has everyone hot and bothered."
      },
      {
        "id": "tvmaze:2659729",
        "title": "Southern Sweet Tea",
        "season": 10,
        "episode": 1,
        "released": "2023-11-05",
        "overview": "Dr. Jackie and Dr. Heavenly bond over shopping at their friend Miss Phaedra Parks' store; Dr. Simone and Toya catch up and speculate on where Quad has been, but there's a new sheriff in town - Lateasha, best known as Sweet Tea, Dr. G's new fiancée."
      },
      {
        "id": "tvmaze:2678526",
        "title": "Heard It Through the Grapevine",
        "season": 10,
        "episode": 2,
        "released": "2023-11-12",
        "overview": "Toya and Dr. Eugene give their sons a sex education talk they'll never forget. Dr. Jackie meets with her very pregnant patient, hip-hop legend, DaBrat. Phaedra grows suspicious of Sweet Tea's motives for marrying Dr. G. Sweet Tea's wedding planning stress reaches a boiling point. Toya kicks off her new business with a wine tasting night for the ladies, but will they ever accept her as more than just a housewife?"
      },
      {
        "id": "tvmaze:2680294",
        "title": "Pamper Party Crasher",
        "season": 10,
        "episode": 3,
        "released": "2023-11-19",
        "overview": "Dr. Simone drops a truth bomb on her sons on a family night out; the guys take Dr. G out for the bachelor party of a lifetime; the ladies give Sweet Tea an over-the-top bachelorette party that ends with an unexpected visitor."
      },
      {
        "id": "tvmaze:2683005",
        "title": "Revenge of the Bride",
        "season": 10,
        "episode": 4,
        "released": "2023-11-26",
        "overview": "Dr. Heavenly and Dr. Jackie interrogate Phaedra's motives for inviting Quad to Sweet Tea's party; Dr. Simone and Cecil disagree on how to push Miles when it comes to his education."
      },
      {
        "id": "tvmaze:2689703",
        "title": "Resurrection Rejection",
        "season": 10,
        "episode": 5,
        "released": "2023-12-03",
        "overview": "The ladies receive a mysterious invitation from Phaedra; a strange night in Phaedra's funeral home brings a familiar face back from the dead."
      },
      {
        "id": "tvmaze:2691215",
        "title": "Whine Country",
        "season": 10,
        "episode": 6,
        "released": "2023-12-10",
        "overview": "While Heavenly tries to keep Alaura close to home, Simone goes apartment shopping with her boys; Toya takes the ladies on a trip to Sonoma, Calif., but when Quad shows up, the ladies unite together to finally hold her accountable."
      },
      {
        "id": "tvmaze:2696346",
        "title": "The Grapes of Wrath",
        "season": 10,
        "episode": 7,
        "released": "2023-12-17",
        "overview": "The ladies make a difficult decision about Quad's future in the group; Jackie gets support from the White House with her campaign against infant mortality; Toya takes her wine business one step further with an important meeting."
      },
      {
        "id": "tvmaze:2704309",
        "title": "Take a Napa",
        "season": 10,
        "episode": 8,
        "released": "2024-01-07",
        "overview": "Toya surprises the ladies with a spa day that's messier than anticipated; Sweet Tea attempts to bridge the generational gap and bond with Heavenly and Jackie; Cecil and Eugene question Kema's opinions on marriage."
      },
      {
        "id": "tvmaze:2731484",
        "title": "Good Vibrations",
        "season": 10,
        "episode": 9,
        "released": "2024-01-14",
        "overview": "Toya wants to return to the days when Eugene would woo her with tailormade dates; Simone is excited to become an empty nester, but Heavenly is not; losing Alaura is reminding Heavenly that she needs to fix issues with her sister."
      },
      {
        "id": "tvmaze:2735464",
        "title": "A Very Powerful Message",
        "season": 10,
        "episode": 10,
        "released": "2024-01-21",
        "overview": "Toya and Eugene struggle to keep their boys from growing up, while Simone and Cecil celebrate being empty nesters; Jackie and Simone settle the Ozempic debate; Sweet Tea and Gregory get news from their doctor; the husbands clash with Kema."
      },
      {
        "id": "tvmaze:2735470",
        "title": "Not Phaedra's Type",
        "season": 10,
        "episode": 11,
        "released": "2024-01-28",
        "overview": "Damon hosts a medical mixer that Heavenly turns into a dating auction for Phaedra, but Phaedra's focus is on hosting a $70,000 birthday bash for her 13-year-old, Ayden; Simone announces that the couples' trip will be in Hilton Head."
      },
      {
        "id": "tvmaze:2735471",
        "title": "Hilton Head Here We Come",
        "season": 10,
        "episode": 12,
        "released": "2024-02-04",
        "overview": "The group heads to Hilton Head, S.C., for a vacation; tensions arise when certain couples decide to stay behind; Sweet Tea shocks the ladies with a disrespectful outburst; the Golden Girls continue to clash as Heavenly and Simone battle over Jackie."
      },
      {
        "id": "tvmaze:2752290",
        "title": "Golf Cart Girls",
        "season": 10,
        "episode": 13,
        "released": "2024-02-18",
        "overview": "The ladies go golfing leaving the men to learn some cooking skills; the couples are shocked by Kema's claims."
      },
      {
        "id": "tvmaze:2763812",
        "title": "The Med Gala",
        "season": 10,
        "episode": 14,
        "released": "2024-02-25",
        "overview": "The ladies plan their first Med Gala party to honor the medical community in Atlanta; tensions flare when Toya and Heavenly come to an impasse; Quad surprises the group with an unexpected appearance."
      },
      {
        "id": "tvmaze:2763813",
        "title": "Reunion, Part 1",
        "season": 10,
        "episode": 15,
        "released": "2024-03-03",
        "overview": "The ladies hold Phaedra's feet to the fire and find out how she really feels; Heavenly and Sweet Tea face off; Jackie faces a shocking revelation; Quad's relationship with the women reaches a breaking point."
      },
      {
        "id": "tvmaze:2774232",
        "title": "Reunion, Part 2",
        "season": 10,
        "episode": 16,
        "released": "2024-03-10",
        "overview": "Quad continues to try to make amends; Sweet Tea makes accusations against Heavenly and Damon; Alicia joins the ladies and defends her husband; the men arrive on stage and Kema is asked to explain himself; a surprise guest shocks everyone."
      },
      {
        "id": "tvmaze:2774233",
        "title": "Reunion, Part 3",
        "season": 10,
        "episode": 17,
        "released": "2024-03-17",
        "overview": "Apollo Nida joins the cast on stage; the ladies break down the couple's trip; Dr. Simone and Dr. Jackie are put to the test over Dr. Heavenly's meddling; the truth comes out about Dr. G and Phaedra."
      },
      {
        "id": "tvmaze:3032833",
        "title": "Guess Who's Coming to Whitnik",
        "season": 11,
        "episode": 1,
        "released": "2024-11-24",
        "overview": "The ladies of medicine return, but there has been drama in the ATL since the reunion in New York. Heavenly and Quad mend fences, but will it be as easy with Simone? Tea faces her swimming fears while Phaedra and Dr. G discuss the social media bombshell dropped by Heavenly. Simone and Cecil throw a Freaknik inspired party where an uninvited guest crashes and an old friend makes a surprise appearance."
      },
      {
        "id": "tvmaze:3063626",
        "title": "Quad Gets Her Groove Back",
        "season": 11,
        "episode": 2,
        "released": "2024-12-01",
        "overview": "Quad throws herself a Paris-themed birthday party where she stuns the ladies by revealing a big secret. Simone continues to battle her issue with Quad, but a birthday invitation might be a step in the right direction. Dr. Jackie sees a celebrity patient. Dr.G and Sweet Tea wonder how Damon can take a back seat to Heavenly's bad behavior. Things get heated between the guys when Dr. G confronts Dr. Damon about Heavenly's behavior."
      },
      {
        "id": "tvmaze:3063627",
        "title": "Saddle Up, Cowgirls",
        "season": 11,
        "episode": 3,
        "released": "2024-12-08",
        "overview": "Quad gets a special and expensive, gift from her boyfriend, King; Toya has advice for Eugene's new business; Simone and Cecil deal with their boys; Heavenly teaches her son the ropes in her dental office. Pheadra deals with Apollo and his marital affairs. Tea, Contessa and Phaedra come up with a plan to fix the group. The ladies all head down to Florida for a \"Cowboy Carter\"-inspired ladies trip, but will it be the medicine they need?"
      },
      {
        "id": "tvmaze:3063628",
        "title": "Flannels and Fake Apologies",
        "season": 11,
        "episode": 4,
        "released": "2024-12-15",
        "overview": "The ladies enjoy a day out on the ranch; Heavenly and Tea have a saloon showdown that threatens to derail the first night. Quad tries to get Contessa and Heavenly to reconnect. Jackie tries to get to the bottom of Heavenly and Contessa's failed friendship. Toya corrals the ladies for a \"Cowboy Carter\" photoshoot, but her diva behavior rubs the ladies the wrong way."
      },
      {
        "id": "tvmaze:3063629",
        "title": "Blow Up on the Ranch",
        "season": 11,
        "episode": 5,
        "released": "2024-12-22",
        "overview": "The Cowboy Carter photoshoot continues, but tyrant Toya threatens the fun; back in Atlanta, Cecil teaches the boys the way around the kitchen; Eugene makes cologne with his kids; Damon's kids bring him to tears."
      },
      {
        "id": "tvmaze:3068393",
        "title": "Rodeo Reckoning",
        "season": 11,
        "episode": 6,
        "released": "2025-01-05",
        "overview": "After an explosive dinner, Contessa grapples with Heavenly's hurtful comments. Quad gets vulnerable with the group and finally mends things with Simone. Back home in Atlanta, Cecil brings Dr. G and Scott on a wild ride. Eugene tries to get Damon to see how Heavenly's hurtful tweets are going to make the group crash and burn. The next day the ladies wrap their heads and arms around how they will emotionally and physically recover from last night's fight."
      },
      {
        "id": "tvmaze:3098203",
        "title": "Mean Girls Gala",
        "season": 11,
        "episode": 7,
        "released": "2025-01-12",
        "overview": "Heavenly throws Zachary a going-away party at their lake house. The ladies question Phadera's ability to raise money for the Med Gala. Phaedera gets defensive and has some choice words for the ladies. At the Med Gala, Dr.Damon tries to make peace with Dr.Greg. Dr. Contessa and Tea face Dr. Heavenly. Dr. Jackie is on pins and needles as she hopes the gala will meet the 100k."
      },
      {
        "id": "tvmaze:3106272",
        "title": "Baby Birkin",
        "season": 11,
        "episode": 8,
        "released": "2025-01-19",
        "overview": "Dr. Jackie is short of money for the Med Gala, so will Phaedra be able to write a check for the difference? Sweet Tea introduces Dr. Mimi and her husband, Steve, to the group. Tea throws a matchmaking event for age gap relationships and while Phadera ends the night with something sweet, Heavenly and Sweet Tea end on a sour note. Toya throws a mysterious baby shower, leading to the ladies speculating if she's pregnant."
      },
      {
        "id": "tvmaze:3113419",
        "title": "From the White House to Key West",
        "season": 11,
        "episode": 9,
        "released": "2025-01-26",
        "overview": "Toya and Eugene talk with their boys about setting PDA boundaries with girls. Phaedra takes the next step with her date from the Sweet and Savory event. Dr. Jackie, Dr. Heavenly and Dr. Simone travel to the White House to meet Former VP Kamala Harris for a historic conference on women's health. The couples all head to Key West, Fla., for their annual trip. Will Quad and Greg be able to play nice?"
      },
      {
        "id": "tvmaze:3118056",
        "title": "Battle of the Exes",
        "season": 11,
        "episode": 10,
        "released": "2025-02-02",
        "overview": "The couples' trip to Key West, Fla., continues after a successful kayak relay race. A storm brews when Phaedra surprises the group with her new boy toy, Cheick, even though Dr. Heavenly has invited her ex, Apollo. Tensions rise between Quad and Dr. G as a playful evening couples' game turns into the battle of the exes, threatening to derail the whole trip."
      },
      {
        "id": "tvmaze:3149883",
        "title": "Trouble on the Sandbar",
        "season": 11,
        "episode": 11,
        "released": "2025-02-16",
        "overview": "After a rocky night, Toya and Eugene explore the Keys with Mimi and Steve. Apollo shows up to the Couples Trip with his wife, Sherrein, throwing Phaedra for a loop. What started as a peaceful trip to the Sandbar turns into chaos."
      },
      {
        "id": "tvmaze:3145104",
        "title": "Calm After the Storm",
        "season": 11,
        "episode": 12,
        "released": "2025-02-23",
        "overview": "The argument at the Sandbar continues, forcing a couple to leave the trip. Phaedra also departs on a private jet, leaving the ladies shocked. The men try to make sense of the drama as the group spends their last night together trying to figure out a way forward."
      },
      {
        "id": "tvmaze:3163503",
        "title": "This Ain't the Playground",
        "season": 11,
        "episode": 13,
        "released": "2025-03-02",
        "overview": "After returning from their trip, Toya organizes a \"Bridgerton\" themed dance lesson to bring the group together. But when people fail to show up, Dr. Contessa drops a bombshell, dividing the group in unexpected ways. As tensions rise, Tea wrestles with where her loyalties lie. Dr. Jackie makes one last plea to Phaedra to stay in the group and the ladies meet at Quad's house, where they make a shocking decision that changes everything."
      },
      {
        "id": "tvmaze:3160036",
        "title": "Crossing Paths",
        "season": 11,
        "episode": 14,
        "released": "2025-03-09",
        "overview": "Dr. Contessa and Dr. Heavenly sit down and try to bury the past. Quad's hot tub session with King turns chilly, leaving their future uncertain. Dr. Simone and Dr. Cecil are fed up with the boys' messy apartment and demand new rules. At Dr. Contessa's Diabetes Health Fair, tensions flare when Quad and Dr. Heavenly try to sneak out before Tea and Dr. Greg arrive."
      },
      {
        "id": "tvmaze:3164971",
        "title": "Duchess Toya and Her Royal Court",
        "season": 11,
        "episode": 15,
        "released": "2025-03-16",
        "overview": "Toya and Eugene's grand ball, \"Georgiaton,\" finally arrives. The question is, who will attend? Sweet Tea, Dr. G, Quad and King are not thrilled by the idea of being in the same space. The rest of the group feels conflicted by who they should support. Will Toya's formal event lead to fractures in the friend group?"
      },
      {
        "id": "tvmaze:3170769",
        "title": "Reunion, Part 1",
        "season": 11,
        "episode": 16,
        "released": "2025-03-23",
        "overview": "The ladies reunite in New York for a showdown, but not everyone shows up. Phaedra's absence takes center stage. Simone and Quad's tension lingers. Sweet Tea and Quad's yelling match proves they still can't co-exist. New friction between Toya and Sweet Tea deepens the divide. Heavenly and Contessa remain at odds."
      },
      {
        "id": "tvmaze:3189326",
        "title": "Reunion, Part 2",
        "season": 11,
        "episode": 17,
        "released": "2025-03-30",
        "overview": "The reunion continues as Sweet Tea and Quad's rivalry flares up once again. Heavenly and Sweet Tea consider a fresh start. When the men arrive, Greg and King are kept apart. Things turn tense as Damon and Greg go head-to-head over cheating rumors and social media drama. Simone and Quad's fiery backstage clash threatens to end their friendship for good."
      },
      {
        "id": "tvmaze:3199984",
        "title": "Reunion, Part 3",
        "season": 11,
        "episode": 18,
        "released": "2025-04-06",
        "overview": "The reunion concludes as Greg and King finally face off; Simone and Quad attempt a fragile truce; Heavenly offers Contessa an olive branch, but can their friendships be saved?; Greg dodges accountability with Quad, pushing the group to the edge."
      },
      {
        "id": "tvmaze:3406498",
        "title": "Cocktails and Polo",
        "season": 12,
        "episode": 1,
        "released": "2025-11-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3454461",
        "title": "Makeups And Breakups",
        "season": 12,
        "episode": 2,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3454462",
        "title": "The Player's Ball",
        "season": 12,
        "episode": 3,
        "released": "2025-12-14",
        "overview": ""
      }
    ]
  }
}