{
  "meta": {
    "id": "tvmaze:61324",
    "type": "series",
    "name": "IT: Welcome to Derry",
    "description": "Taking place in the ‘60s, the show explores the origins of the curse that would haunt the small Maine town for the next 27 years — as well as the origin story of Pennywise the Clown.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/594/1485959.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/594/1485959.jpg",
    "videos": [
      {
        "id": "tvmaze:3373405",
        "title": "Winter Fire",
        "season": 1,
        "episode": 8,
        "released": "2025-12-14",
        "overview": "As a dense fog engulfs the town – and General Shaw pushes ahead with his mission – the Hanlons, Rose, Dick, and the kids must work together to save Derry."
      },
      {
        "id": "tvmaze:3373404",
        "title": "The Black Spot",
        "season": 1,
        "episode": 7,
        "released": "2025-12-07",
        "overview": "A vigilante attack on the Black Spot unleashes long dormant forces. In the aftermath, Dick helps uncover another crucial artifact."
      },
      {
        "id": "tvmaze:3351763",
        "title": "The Pilot",
        "season": 1,
        "episode": 1,
        "released": "2025-10-26",
        "overview": "Four months after their classmate's sudden disappearance, Teddy, Phil, Lilly, and Ronnie vow to figure out why so many kids have gone missing in Derry...and why they've each been experiencing strange phenomena. Meanwhile, Major Leroy Hanlon arrives at Derry Air Force Base, where he navigates a chilly reception from some of his fellow airmen."
      },
      {
        "id": "tvmaze:3373399",
        "title": "The Thing in the Dark",
        "season": 1,
        "episode": 2,
        "released": "2025-11-02",
        "overview": "After joining Leroy at their new house in Derry, Charlotte is left with a strange feeling while running errands in town, and Will is teased on his first day of school. Later, Lilly faces pressure from all sides about what really happened at the movie theater, and Ronnie worries about her father's fate."
      },
      {
        "id": "tvmaze:3373400",
        "title": "Now You See It",
        "season": 1,
        "episode": 3,
        "released": "2025-11-09",
        "overview": "When a major find yields few clues, General Shaw pushes ahead with his top-secret mission, ordering Leroy and Pauly to escort Dick Hallorann on an aerial search for a new dig site. Meanwhile, Rose attends a tribal meeting about the military presence in Derry, and Ronnie, Lilly, Will, and Rich attempt to get visual proof by conjuring an Orixá."
      },
      {
        "id": "tvmaze:3373401",
        "title": "The Great Swirling Apparatus of Our Planet's Function",
        "season": 1,
        "episode": 4,
        "released": "2025-11-16",
        "overview": "As the kids face increasingly terrifying experiences, Charlotte attempts to advocate for Hank, and General Shaw escalates his efforts."
      },
      {
        "id": "tvmaze:3373402",
        "title": "29 Neibolt Street",
        "season": 1,
        "episode": 5,
        "released": "2025-11-23",
        "overview": "As the military descends on Neibolt Street, the kids head into the sewers with their own objective."
      },
      {
        "id": "tvmaze:3373403",
        "title": "In the Name of the Father",
        "season": 1,
        "episode": 6,
        "released": "2025-11-30",
        "overview": "Plagued by dark visions, Dick gets a surprise at the Black Spot. Meanwhile, the kids each face their own challenges."
      }
    ]
  }
}