{
  "meta": {
    "id": "tvmaze:49980",
    "type": "series",
    "name": "The Real Housewives of Salt Lake City",
    "description": "The Real Housewives of Salt Lake City takes viewers into an undiscovered world that is about so much more than religion, although the Mormon church is undeniably engrained in the culture. In the majestic mountains of Utah is a hidden social circle made up of successful women who have created their own paradise filled with luxury homes, shopping sprees and multi-million-dollar businesses and brands. With Hollywood's exclusive Sundance Film Festival in their backyards, these Type-A power-brokers are accustomed to rubbing elbows with A-listers and what party list you are on means everything. They have mastered running wildly successful enterprises by day and enjoy après ski at the finest resorts by night, all the while raising extraordinary and unconventional families. Here perfection is not an aspiration, it's a mandate. They hold themselves and each other to an extremely high standard and never hold back when things go sideways, but lord knows they are always there for each other when they need it most.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/585/1464401.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/585/1464401.jpg",
    "videos": [
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3449564",
        "title": "Greek For The Week",
        "season": 6,
        "episode": 13,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:1927624",
        "title": "Welcome to Salt Lake City!",
        "season": 1,
        "episode": 1,
        "released": "2020-11-11",
        "overview": "Salt Lake City is more than just mountains and religion. When Jen throws a Tongan themed birthday party for her close friend Meredith, it's anything but a celebration when she confronts Mary about insensitive comments made about her family. Heather discovers that her longtime friend from college, Lisa, has been spreading rumors about her. And after years of judgement and scrutiny, Whitney finally has her dream wedding with her dream guy."
      },
      {
        "id": "tvmaze:1965268",
        "title": "A Snow Mountain of Trouble",
        "season": 1,
        "episode": 2,
        "released": "2020-11-18",
        "overview": "Meredith's birthday party comes to an icy cold ending when Jen and Mary get into a heated argument about Mary's insensitivity towards Jen's aunt, and Whitney confronts Lisa about an incident at Whitney's vow renewal. While Meredith battles marriage problems and Whitney helps her dad through a difficult time, Heather invites all the women to a ski day, which starts out well, but goes downhill when Whitney and Heather confront Lisa about her judgmental behavior."
      },
      {
        "id": "tvmaze:1965269",
        "title": "Everybody Needs a Switzerland",
        "season": 1,
        "episode": 3,
        "released": "2020-11-25",
        "overview": "With the ladies operating on a \"clean slate,\" Whitney plans a roaring 20s party. Heather hosts a baby shower for five of her young, Mormon, pregnant employees, Meredith and Mary grow closer, and Jen acts inappropriately at a nighttime gathering. Later, when Meredith cancels plans, Jen begins to grow skeptical of Mary's involvement and questions Meredith's friendship."
      },
      {
        "id": "tvmaze:1965270",
        "title": "Roaring Emotions",
        "season": 1,
        "episode": 4,
        "released": "2020-12-02",
        "overview": "At the conclusion of Whitney's 20s Party, Jen's explosive temper reaches a boiling point and Meredith and Mary are the targets. Meredith finally reveals the truth about her marriage to Lisa, while Jen shares the details with Heather, who then tells Whitney. Mary takes the high road and invites Jen to her luncheon hoping to squash their issues for good, but when Jen tries to open up to the group things take a sudden turn for the worst."
      },
      {
        "id": "tvmaze:1973423",
        "title": "Ladies Who Lunch",
        "season": 1,
        "episode": 5,
        "released": "2020-12-09",
        "overview": "Mary's luncheon ends in disaster when Jen accuses Mary of being racist and Mary accuses Heather of being two-faced. While Whitney deals with her daddy issues, Meredith's marriage problems escalate and Lisa reflects on her own marriage. Heather, caught between two friends, attempts to smooth things over with Mary who is still hurting over the things Jen said about her."
      },
      {
        "id": "tvmaze:1973424",
        "title": "Sundance City",
        "season": 1,
        "episode": 6,
        "released": "2020-12-16",
        "overview": "When Sundance arrives to Utah, it's nonstop parties and celebrations for the ladies. When Whitney throws her husband, Justin, a 52nd birthday party, Jen and Mary finally call truce. Meredith helps her son Brooks prep for Salt Lake City's very first fashion week while Heather is on the prowl for a one-night stand, with the help of Vanderpump Rules' Utah natives Lala and Katie to assist. And while everyone is partying, Lisa is too busy planning Sundance parties for everyone else in Park City."
      },
      {
        "id": "tvmaze:1980937",
        "title": "Fashion Faux Pas",
        "season": 1,
        "episode": 7,
        "released": "2020-12-23",
        "overview": "Now that Sundance is over, Lisa makes a promise to work less, but her husband John isn't buying it. Whitney grows concerned when her dad says he's ready to move on from the treatment center. And Heather finally comes clean with her daughters over her hesitations with Mormonism and her desire to date. And after Meredith's husband Seth misses the Park City Fashion show, Jen alludes to Meredith having bigger problems in her marriage than she's letting on."
      },
      {
        "id": "tvmaze:1980938",
        "title": "Hot Tub Confessions",
        "season": 1,
        "episode": 8,
        "released": "2020-12-30",
        "overview": "While Heather works on expanding her business, Lisa and John have a heart to heart about how much work she's taking on and Whitney enlists her husband, Justin to have a difficult conversation with her father. And although Meredith and Seth decide to give their marriage another shot, after a fun day of snowmobiling, Whitney grows curious about Meredith's marriage and wonders if there is any truth to what Jen is implying. Later, Lisa, Meredith, Jen and their husbands hang out at Jen's house; While the women dish about their marital issues, the men give their side of the story."
      },
      {
        "id": "tvmaze:1995435",
        "title": "Hip Hop and Heartbreak",
        "season": 1,
        "episode": 9,
        "released": "2021-01-06",
        "overview": "Meredith and Seth are happy to be back together, while Heather has an awkward Valentine's Day with her ex-husband and Lisa spends time with her family at the aquarium. And after Jen plans a surprise birthday party for her husband and doesn't invite Mary, Whitney hears that the other women are talking about Jen behind her back and things get heated when she decides to tell Jen the rumor during Sharreiff's birthday party."
      },
      {
        "id": "tvmaze:1995477",
        "title": "In Hot Water",
        "season": 1,
        "episode": 10,
        "released": "2021-01-13",
        "overview": "After blowing up at Sharrieff's birthday party, all of Jen's relationships are on the rocks. Lisa takes some time away from the drama to focus on work, and now that Heather's Beauty Lab and Laser business is thriving, she wants to carry that success into her personal life. With Meredith and Seth in a better place, it's finally time to share some good news. And later, things get heated when Whitney and Heather try to make amends with Jen who's still fuming about Whitney's poor timing."
      },
      {
        "id": "tvmaze:2004078",
        "title": "All Bets Are Off",
        "season": 1,
        "episode": 11,
        "released": "2021-01-20",
        "overview": "Whitney hosts a dinner with her dad and siblings in an effort to reunite their family, while Jen sets Heather up on a date with Sharrieff's best friend. When Whitney invites the women for a girls getaway to Vegas, Lisa, who's still upset with Whitney, has reservations about going. And when Jen takes Heather on an exclusive shopping experience, things take a turn when Jen begins to question Heather's true loyalty."
      },
      {
        "id": "tvmaze:2004644",
        "title": "Sinners in the City",
        "season": 1,
        "episode": 12,
        "released": "2021-01-27",
        "overview": "The Vegas trip implodes during dinner when Jen feels betrayed by Meredith and Lisa, yet again. Later that night, the ladies, sans Jen, gather together and discover there is more deception brewing amongst the group. Mary reminds Lisa of Jen's destructive behavior, and Whitney arranges a spiritually healing activity for the ladies only to be derailed when Meredith's marriage rumors are brought up, Jen is confronted and the women are left questioning who to trust."
      },
      {
        "id": "tvmaze:2009516",
        "title": "Chilly Reception",
        "season": 1,
        "episode": 13,
        "released": "2021-02-03",
        "overview": "Heather works hard to finish her new Beauty Lab location for her launch party, but worries that she hasn't connected with Jen since Vegas. Mary goes to her place of peace, her church choir, while Lisa spends time with her family doing what she truly loves – making business plans. Meredith and Seth realize that their marriage is a hot topic for their friends while Sharrieff surprises Jen with a date night she won't forget. And at the At the Beauty Lab Launch Party, Jen tries to make amends with her friends but it doesn't go as well as she planned."
      },
      {
        "id": "tvmaze:2016389",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 14,
        "released": "2021-02-10",
        "overview": "The reunion kicks off with Jen revealing the issues that still haunt her and her husband Sharrieff, while Whitney addresses the rumors swirling in her marriage. Meredith confronts Jen about the awkward night at her house, leading to a heated conversation about Brooks. Tensions rise with Lisa and Mary when Lisa defends her friendship with Jen."
      },
      {
        "id": "tvmaze:2022256",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 15,
        "released": "2021-02-17",
        "overview": "Mary reveals intimate details about her marriage and sets the record straight about her church. Jen finally puts the hospital comments to bed, meanwhile Meredith demands respect from the women about her marriage. Frustrations heighten between Lisa, Whitney and Heather, which finally pushes Lisa to her breaking point."
      },
      {
        "id": "tvmaze:2025400",
        "title": "Reunion Part 3",
        "season": 1,
        "episode": 16,
        "released": "2021-02-24",
        "overview": "The husbands take the stage and Justin reveals shocking details about leaving the Mormon church, Robert addresses Jen and her husband, Sharrieff, and Whitney shares an update on her dad's sobriety. Emotions come to a head when Jen opens up about cultural insensitivities within the group, leaving the women startled and confused with Jen even more hurt than before."
      },
      {
        "id": "tvmaze:2149469",
        "title": "Best of Frenemies",
        "season": 2,
        "episode": 1,
        "released": "2021-09-12",
        "overview": "The women of Salt Lake City return and fractured friendships have split the group in two. Caught in the middle, Lisa tries to get Jen and Meredith to make amends. While Heather prepares her daughter for college, Whitney throws a birthday bash for her stepson and Mary starts a podcast. Lisa's friend of 10 years and new housewife, Jennie is introduced."
      },
      {
        "id": "tvmaze:2164263",
        "title": "Icy Apology",
        "season": 2,
        "episode": 2,
        "released": "2021-09-19",
        "overview": "Heather takes Jen to task for the disparaging comments she's made behind her back. Whitney talks to Justin about improving their sex life, Mary makes plans to renovate her home and Meredith reveals new negative tweets Jen is liking about Brooks."
      },
      {
        "id": "tvmaze:2170882",
        "title": "Fishing for the Truth",
        "season": 2,
        "episode": 3,
        "released": "2021-09-26",
        "overview": "Jen hosts an ice fishing excursion to reunite the ladies but is blindsided when Meredith shows up to confront her about mean tweets towards Brooks. Meanwhile Whitney and Lisa see each other for the first time in months, Heather is surprised to hear Ashley won't return to the Mormon church and Jennie and Duy argue over whether to expand their family."
      },
      {
        "id": "tvmaze:2177268",
        "title": "Friendship Roulette",
        "season": 2,
        "episode": 4,
        "released": "2021-10-03",
        "overview": "All bets are off when the ladies are invited to a casino themed fundraiser; Mary is nervous to see Jen, Meredith gets a vampire facial, and Whitney and Lisa clash when Lisa is accused of sabotaging the party."
      },
      {
        "id": "tvmaze:2192066",
        "title": "Gin and Bear It",
        "season": 2,
        "episode": 5,
        "released": "2021-10-10",
        "overview": "After the catering fiasco, Whitney and Lisa find a way to put aside their differences. Meanwhile, Jen apologizes to Brooks, Heather celebrates Ashley's college acceptance, and the guys enjoy a night away from their wives."
      },
      {
        "id": "tvmaze:2192067",
        "title": "Sex, Lies and Sister Wives",
        "season": 2,
        "episode": 6,
        "released": "2021-10-17",
        "overview": "When Jennie is unwilling to expand their family, a heartbroken Duy seeks desperate measures. Jen plans a surprise for the ladies, while Heather has 'the talk' with Ashley and Mary worries for her marriage once Robert Jr. leaves the nest. Finally, a double date with Whitney goes awry when Lisa tries to prove her innocence."
      },
      {
        "id": "tvmaze:2192855",
        "title": "Slippery Slope",
        "season": 2,
        "episode": 7,
        "released": "2021-10-24",
        "overview": "A fun day of snow tubing leaves Mary and Lisa at odds, Jennie and Mary at war and Meredith and Jen nowhere to be found when it comes to having Lisa's back. Meanwhile, Heather throws a party for Beauty Lab, Meredith and Seth plan for the future and Jennie still reeling from her conversation with Duy looks towards other solutions for their marital their problems."
      },
      {
        "id": "tvmaze:2192856",
        "title": "A Wolf Pack of Secrets",
        "season": 2,
        "episode": 8,
        "released": "2021-10-31",
        "overview": "Jen lashes out when Lisa brings a salacious rumor about Jen to light. Meredith and Heather plan a girls' trip to Vail, while Whitney meets with her brother Will to check on her estranged father Steve. Finally, Lisa hosts an intimate event, leaving Jen off the guest list, and Meredith reeling after a cryptic warning from one of Mary's former parishioners."
      },
      {
        "id": "tvmaze:2202323",
        "title": "I Was Driving Carpool!",
        "season": 2,
        "episode": 9,
        "released": "2021-11-07",
        "overview": "Mary hosts a cooking class and confronts Whitney for missing her call and disobeying the dress code. Heather meets with her once devout Mormon niece and Lisa defends her son's charity guest list. Finally, the ladies get ready for their trip to Vail; but before they depart, Jen receives an urgent call leaving her friends shocked and concerned."
      },
      {
        "id": "tvmaze:2202324",
        "title": "Highway to Vail",
        "season": 2,
        "episode": 10,
        "released": "2021-11-14",
        "overview": "After the authorities leave Beauty Lab, shocked, the ladies move forward with their girls' trip. Back in Salt Lake City, Jen faces charges brought against her and the women are left questioning if they really know her at all."
      },
      {
        "id": "tvmaze:2214722",
        "title": "Old Testaments, New Revelations",
        "season": 2,
        "episode": 11,
        "released": "2021-11-21",
        "overview": "In the wake of Jen's indictment, the ladies attempt to get to the bottom of the rumors about Mary. Meredith questions her chance encounter with Cameron, while Heather and Whitney accuse Lisa of masterminding the meeting. And back in Salt Lake City, Jen receives some hard facts."
      },
      {
        "id": "tvmaze:2217387",
        "title": "A House Divided",
        "season": 2,
        "episode": 12,
        "released": "2021-12-05",
        "overview": "Separated from the church, Heather meets with her estranged sister to make amends. Whitney feels blindsided when Mary's late night gifting results in a renewed friendship with Lisa. And when the group gathers to hash out their grievances before heading home, a heated argument divides the ladies, leaving two behind in Vail."
      },
      {
        "id": "tvmaze:2221184",
        "title": "Fair Weather Friends",
        "season": 2,
        "episode": 13,
        "released": "2021-12-12",
        "overview": "After returning home from their trip from hell, Lisa questions Meredith's loyalty and friendship, but Meredith thinks they're all responsible for what happened in Vail. Jen feels alone and isolated, but Heather agrees to see her and offer her support. Mary meets with an organizer to try to bring order to her chaos, while Jennie plans a Pho luncheon. Whitney confesses her rebrand has drained the family savings, but goes ahead with an expensive photo shoot."
      },
      {
        "id": "tvmaze:2221185",
        "title": "What the Pho?",
        "season": 2,
        "episode": 14,
        "released": "2021-12-19",
        "overview": "All hell breaks loose at Jennie's Pho luncheon when Meredith sees Jen, Mary questions her innocence and Lisa feels attacked. Meanwhile, Heather learns her brother is leaving the Mormon church, Whitney shares some shocking news about Mary and Robert Sr. and Jen and Sharrieff come to terms with her mounting legal fees."
      },
      {
        "id": "tvmaze:2221186",
        "title": "The Miseducation of Mary Cosby",
        "season": 2,
        "episode": 15,
        "released": "2022-01-02",
        "overview": "Despite being in over her head financially, Whitney throws a lavish party for her Wild Rose rebrand; but Jennie uses the opportunity to confront Mary for her tone-deaf comments at Pho. Meanwhile, Lisa gets Jack ready for prom and Jen questions who her true friends are in the group. Heather and Whitney suspect it may have been one of the women who turned Jen into the authorities."
      },
      {
        "id": "tvmaze:2241703",
        "title": "Holy Mother of Zion",
        "season": 2,
        "episode": 16,
        "released": "2022-01-09",
        "overview": "Meredith throws Seth a birthday party and doesn't invite the Shahs, leaving Heather and Whitney to believe something bigger is causing a rift between the two women. Jen and Sharrieff work on their marriage, while Mary questions Jennie's overreaction to her regifted shoes. The husbands surprise the women with a Mother's Day trip to Zion, but once Jen learns Meredith hired a private investigator, she and Lisa come to blows when Lisa refuses to hold Meredith accountable."
      },
      {
        "id": "tvmaze:2248030",
        "title": "Who's Calling Who a Fraud?",
        "season": 2,
        "episode": 17,
        "released": "2022-01-16",
        "overview": "In the majestic mountains of Utah is a hidden social circle made up of successful women who have created their own paradise filled with luxury homes, shopping sprees and multimillion-dollar businesses and brands"
      },
      {
        "id": "tvmaze:2248031",
        "title": "Sorrys and Sleepovers",
        "season": 2,
        "episode": 18,
        "released": "2022-01-23",
        "overview": "The girls' trip to Zion goes from bad to worse when Meredith catches wind of speculation over the validity of her father's memorial. However, an outdoor adventure of ATVing and rock climbing becomes the bonding experience the ladies need. Jen and Whitney keep the fun going with a VIP party at \"Club Zion,\" and it looks like good vibes only from here on out."
      },
      {
        "id": "tvmaze:2248032",
        "title": "Cinco De Mayhem",
        "season": 2,
        "episode": 19,
        "released": "2022-01-30",
        "overview": "As the Zion trip continues, the women head out for a day of horseback riding, ATVing and spa treatments; but the lingering doubt over whether Meredith held a memorial for her father continues. Jen hosts a Cinco De Mayo celebration where Jennie finds herself at odds with Mary yet again. And when Meredith defends Mary, a distraught Lisa goes off."
      },
      {
        "id": "tvmaze:2265215",
        "title": "Memorial Meltdown",
        "season": 2,
        "episode": 20,
        "released": "2022-02-06",
        "overview": "The Cinco De Mayo festivities intensify as the tension between the ladies boils over. Mary and Meredith cling together as the rest of the women hound Meredith for the date of her father's memorial and struggle to understand Meredith's unwavering support for Mary. Once back in Salt Lake City, the women try to make sense of all chaos left behind in Zion. Jen visits Mary's church to see if the rumors are true, Lisa seeks advice from John and Meredith offers an olive branch to Heather and Whitney."
      },
      {
        "id": "tvmaze:2269307",
        "title": "Why Can't We Be Friends",
        "season": 2,
        "episode": 21,
        "released": "2022-02-20",
        "overview": "Heather holds a Celebration of Life for her father, while Jen downsizes to pay for her legal fees; Lisa throws an over-the-top 80's themed party, relationships are tested when Jennie attacks Mary for being dismissive and Meredith confronts Lisa."
      },
      {
        "id": "tvmaze:2269308",
        "title": "Reunion Part 1",
        "season": 2,
        "episode": 22,
        "released": "2022-02-27",
        "overview": "The women of Salt Lake City sit down with host Andy Cohen as they discuss Mary's decision not to attend the reunion and Jen's impending trial; Meredith breaks down rehashing the difficult moments of the season."
      },
      {
        "id": "tvmaze:2269309",
        "title": "Reunion Part 2",
        "season": 2,
        "episode": 23,
        "released": "2022-03-06",
        "overview": "The reunion continues with an update on the Real Housekids of Salt Lake City; the women discuss the allegations and rumors about Mary; Lisa breaks down after Heather and Whitney hold her accountable for her attempt at an apology."
      },
      {
        "id": "tvmaze:2294817",
        "title": "Reunion Part 3",
        "season": 2,
        "episode": 24,
        "released": "2022-03-13",
        "overview": "The reunion concludes with the husbands taking the stage. Sharrieff explains where he was on the day of Jen's arrest, while Justin confirms if Whitney's beauty venture depleted their savings. John hopes Lisa and Meredith can make amends, and Duy tries to explain his need for more kids. And later, Jen answers questions about the rumors that swirled in the aftermath of her arrest and gives an update on her impending trial."
      },
      {
        "id": "tvmaze:2383138",
        "title": "Revenge Marks the Spot",
        "season": 3,
        "episode": 1,
        "released": "2022-09-28",
        "overview": "The women of Salt Lake City are back. Jen attempts to reunite the ladies at Coach Shah's 51st birthday party. Lisa's salacious rant has redefined her friendship with Meredith, but Meredith reveals some alleged Lisa rumors of her own. Jen prepares for pretrial meetings in New York. Whitney turns to Heather for support as she begins to break all ties with the Mormon Church."
      },
      {
        "id": "tvmaze:2400313",
        "title": "Searching for Sereni-Tea",
        "season": 3,
        "episode": 2,
        "released": "2022-10-05",
        "overview": "Whitney plans a girls' trip to Arizona to support Jen before her trial, but she's blindsided when Meredith shares an alleged rumor about Lisa. While Jen gets emotional support from her mom, Lisa talks to Jack about his future. An emotional experience with a shaman inspires the women to open up."
      },
      {
        "id": "tvmaze:2400566",
        "title": "Courtside Conundrum",
        "season": 3,
        "episode": 3,
        "released": "2022-10-12",
        "overview": "Whitney shares information about her childhood with the group, shocking the other women. Meredith and Lisa have a short-lived clemency, but Heather calls out Meredith on her superiority complex. After an afternoon of activities around Arizona, Jen hosts a party in honor of Meredith, but chaos ensues."
      },
      {
        "id": "tvmaze:2400567",
        "title": "Bad Weather Betrayal",
        "season": 3,
        "episode": 4,
        "released": "2022-10-19",
        "overview": "The Arizona girls trip goes from bad to worse when Whitney and Heather face off. An anxious Jen leaves the trip early for pretrial meetings in New York. Whitney reunites with her siblings to seek answers about her past. With Jen gone, the women speculate about Jen's trial."
      },
      {
        "id": "tvmaze:2400568",
        "title": "On Thin Ice",
        "season": 3,
        "episode": 5,
        "released": "2022-10-26",
        "overview": "Jen returns from pre-trial meetings in New York with unexpected news. Heather hosts a ski day to reunite the women, but tempers flare when Lisa discovers Angie H. is invited. Whitney attempts to resolve her conflict with Heather but realizes their friendship might be over."
      },
      {
        "id": "tvmaze:2421759",
        "title": "Finsta Fight",
        "season": 3,
        "episode": 6,
        "released": "2022-11-02",
        "overview": "When Heather is caught telling a lie, Lisa sets the record straight. Whitney is surprised when Justin is unexpectedly laid off. Meredith and Angie H. have a double date with their husbands. Jen turns to Heather for support but is blindsided when Angie H. arrives at Heather's choir auditions."
      },
      {
        "id": "tvmaze:2421760",
        "title": "Choir of Chaos",
        "season": 3,
        "episode": 7,
        "released": "2022-11-09",
        "overview": "All hell breaks loose at choir auditions when Jen confronts Angie H. Hoping to rise above the drama, Lisa recommits to her faith. Whitney talks to Heather about the distance in their friendship, creating an even greater divide between \"bad weather.\""
      },
      {
        "id": "tvmaze:2421761",
        "title": "RSVPlease",
        "season": 3,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "Jen, Lisa and Whitney unite to address their issues with Heather, but only Lisa finds common ground with Heather. Meredith copes with past family trauma. The husbands meet up for a BBQ. Jen and Angie K. invite the women to San Diego, but an interaction with Danna causes Jen to storm off."
      },
      {
        "id": "tvmaze:2430986",
        "title": "Not a Yacht of Fun",
        "season": 3,
        "episode": 9,
        "released": "2022-11-30",
        "overview": "Meredith convinces a reluctant Jen to include Danna on the girls trip, but when Angie K. claims the primary bedroom, she becomes a target in Jen's line of fire. Heather, Lisa and Whitney take sides, but when Angie K. retaliates with an accusation against Jen, it becomes an all-out war."
      },
      {
        "id": "tvmaze:2437638",
        "title": "High Heels in the High Seas",
        "season": 3,
        "episode": 10,
        "released": "2022-12-07",
        "overview": "The chaos on the high seas continues as designer shoes end up overboard. Pushed to her limit, Lisa reconsiders her friendship with Jen. Back at the house, the ladies get ready for a luau dinner, but tensions come to an all-time high when the women throw shots at and issue ultimatums to each other."
      },
      {
        "id": "tvmaze:2445581",
        "title": "High Stakes and Friendship Breaks",
        "season": 3,
        "episode": 11,
        "released": "2022-12-14",
        "overview": "Heather and Lisa come together to address Jen's behavior, but the conversation comes to a halt when Jen reveals information about her mental health. Whitney is put on blast for claiming she wanted a friendship break from Heather, and \"bad weather\" goes from bad to worse. Dressed as blonde bombshells, the ladies have a night on the town with clubbing and debauchery. Unfortunately, the next morning, they're shocked to learn that Heather has a mysterious black eye."
      },
      {
        "id": "tvmaze:2445582",
        "title": "White Lies and Black Eyes",
        "season": 3,
        "episode": 12,
        "released": "2022-12-21",
        "overview": "While the ladies are still in sunny San Diego, a dark cloud looms above as the group tries to get answers about Heather's black eye. Lisa learns that Meredith has been spreading rumors about her businesses, but at a Greek Goddess-themed dinner, Lisa confronts Meredith for retaliating against her infamous rant."
      },
      {
        "id": "tvmaze:2454776",
        "title": "Unfashionable Behavior",
        "season": 3,
        "episode": 13,
        "released": "2023-01-04",
        "overview": "The mystery of Heather's black eye still has everyone uneasy; Whitney presses for more answers, but this pushes bad weather into an even worse spot; Meredith hosts a mental awareness fundraiser in honor of her nephew."
      },
      {
        "id": "tvmaze:2454777",
        "title": "Trials and Tribulations",
        "season": 3,
        "episode": 14,
        "released": "2023-01-11",
        "overview": "When Heather is asked about how she got her black eye, a heated argument ensues between her and Jen; at Heather's book cover reveal party, rumors are revealed and tensions rise."
      },
      {
        "id": "tvmaze:2464144",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 15,
        "released": "2023-01-25",
        "overview": "The housewives bring an icy chill to New York to confront one another after an unpredictable season; Meredith Marks and Lisa Barlow face off about their ongoing issues; Meredith phones a special friend to help clear her name about an unproven rumor."
      },
      {
        "id": "tvmaze:2464145",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 16,
        "released": "2023-02-01",
        "overview": "The conversation around Heather's enigmatic black eye continues; the husbands take a seat on the couch to share their perspectives on the ladies' drama; the women open up about Jen's guilty plea and the status of their friendships."
      },
      {
        "id": "tvmaze:2612966",
        "title": "Fresh Powder, Fresh Start",
        "season": 4,
        "episode": 1,
        "released": "2023-09-05",
        "overview": "The women of Salt Lake return and Heather wants to get everyone together for a fresh start. Whitney's public comments about Meredith put a strain on their already fragile friendship. Angie introduces her friend Monica to the ladies. Lisa struggles with her son Jack's decision to go on a Mormon mission."
      },
      {
        "id": "tvmaze:2612967",
        "title": "Vacation Crashers",
        "season": 4,
        "episode": 2,
        "released": "2023-09-12",
        "overview": "Lisa and Meredith meet up to talk out their issues. Meredith plans a trip to Palm Springs for the women but snubs one of the ladies. Monica reveals a secret about her past to Heather and worries about leaving her kids for the first time. Whitney takes matters into her own hands with Angie for the trip. In Palm Springs, Lisa loses something valuable and sentimental."
      },
      {
        "id": "tvmaze:2612968",
        "title": "All Tricks, No Trust",
        "season": 4,
        "episode": 3,
        "released": "2023-09-19",
        "overview": "The Palm Springs venture continues and Meredith tries to make the best of Angie crashing her trip, but the night ends in threats, tears and puke. The women start to question Monica's behavior as she turns on her closest friends. Heather and Angie's issues come to a head. Lisa works on her friendship with Meredith."
      },
      {
        "id": "tvmaze:2638945",
        "title": "Don't Be a Drag",
        "season": 4,
        "episode": 4,
        "released": "2023-09-26",
        "overview": "On the final day of their Palm Springs trip, Whitney takes over and calls Meredith on her behavior. Monica and Lisa's tension reveals itself in head-to-toe drag. Angie and Meredith continue to throw insults at each other. Heather and Angie bond during a team building exercise. Mary bows out of participating in the ladies' plans."
      },
      {
        "id": "tvmaze:2643945",
        "title": "The Nastiness and Rumors",
        "season": 4,
        "episode": 5,
        "released": "2023-10-03",
        "overview": "Heather talks to her daughters about the effect her book has had on them. Whitney and Justin struggle with their changing roles now that Justin is back at work. Lisa, still hurt from the accusations made in Palm Springs, hosts an event and confronts Monica. The rumors about Angie's marriage reach a boiling point."
      },
      {
        "id": "tvmaze:2643946",
        "title": "Après Rumor",
        "season": 4,
        "episode": 6,
        "released": "2023-10-10",
        "overview": "The rumor about Angie's marriage has a ripple effect in the group. Meredith finds comfort in her family after a traumatic incident on the road. Old issues between Lisa and Heather resurface. Monica's parenting is called into question by her own mother."
      },
      {
        "id": "tvmaze:2656022",
        "title": "An Olive Branch with Thorns",
        "season": 4,
        "episode": 7,
        "released": "2023-10-17",
        "overview": "Mary's son's relationship status is revealed. Meredith retreats from the group and attends the GLAAD Awards. Heather confronts Lisa about Jack's mission. Angie tries to get clarification about the rumors, but things go awry when Monica's mom intervenes at Angie's Greek Easter party."
      },
      {
        "id": "tvmaze:2663982",
        "title": "Moms, Missions, and Matrimony",
        "season": 4,
        "episode": 8,
        "released": "2023-10-31",
        "overview": "Tensions escalate as Monica has dinner with her mother. Angie goes to her dad for advice on how to navigate her marriage. In an effort to mask her pain about Jack leaving for a mission, Lisa puts her focus on planning a mission location reveal party. Whitney meets with Mary for an explosive dinner."
      },
      {
        "id": "tvmaze:2664332",
        "title": "Don't Come for my Sound Bath",
        "season": 4,
        "episode": 9,
        "released": "2023-11-07",
        "overview": "After Angie and Monica reconcile, Angie gets caught in the middle of Lisa and Monica's feud. Whitney juggles parenthood and career by throwing two parties in one weekend, and tensions boil over between friends. Heather tries to come to an understanding with Lisa. Meredith dips her toes back into the group, but Lisa has questions about her recent behavior."
      },
      {
        "id": "tvmaze:2668690",
        "title": "Mormons Get a Bad Rap",
        "season": 4,
        "episode": 10,
        "released": "2023-11-14",
        "overview": "Lisa feels betrayed by Angie and embraced by Heather; Monica and her mom agree to move forward; Meredith opens up about her marriage on her podcast with Seth; Heather hosts a reading for her book and searches for community."
      },
      {
        "id": "tvmaze:2676107",
        "title": "If I Could Churn Back Time",
        "season": 4,
        "episode": 11,
        "released": "2023-11-21",
        "overview": "Heather proposes a group trip to celebrate Monica's birthday, causing unresolved tensions between Monica and Lisa to reach a boiling point. Angie leans on Whitney for advice about her marriage woes. Whitney and Justin join Meredith and Seth on their new podcast and open up about the status of their marriage. Heather throws a Pioneer Day-themed lunch to thank her friends for their support, but the day ends with hurt feelings and the upcoming trip hanging in the balance."
      },
      {
        "id": "tvmaze:2680739",
        "title": "Icy Apologies",
        "season": 4,
        "episode": 12,
        "released": "2023-11-28",
        "overview": "The ladies are unsure about how they feel about going on a trip with Monica for her birthday as Monica turns to Mary for advice. A lunch between Lisa and Meredith leaves their friendship on shaky ground. When Whitney loses a close friend, she looks to the ladies for support but finds one of them isn't as empathetic as she expects."
      },
      {
        "id": "tvmaze:2684103",
        "title": "Bermuda Views and Bathtub Blues",
        "season": 4,
        "episode": 13,
        "released": "2023-12-05",
        "overview": "On their first international trip together, Whitney and Lisa avoid each other until Heather's comments send dinner into chaos. After not getting a room with a bathtub, Meredith goes from a little under the weather to severely ill but recovers in time to hold the ladies accountable on the Sprinter ride to dinner. Excited to kick off her birthday celebration in Bermuda, Monica comforts Meredith, and a new layer of their friendship is revealed when dirt on Angie surfaces."
      },
      {
        "id": "tvmaze:2689947",
        "title": "Bermuda Birthday Blues",
        "season": 4,
        "episode": 14,
        "released": "2023-12-12",
        "overview": "On their second day in Bermuda, the women throw Monica a birthday bash, but things go south when she receives bad news. Monica's personal questions rub Heather the wrong way. When a new rumor about Angie surfaces, all roads seem to lead to Meredith as the women don't know who to believe."
      },
      {
        "id": "tvmaze:2692050",
        "title": "Swimming With the Fishes",
        "season": 4,
        "episode": 15,
        "released": "2023-12-19",
        "overview": "On day three in Bermuda, Meredith tries to clear her name, but finds herself in an uphill battle with the ladies. Monica worries that Meredith's attempt to smooth things over with Lisa will put a wrench in the progress she's made on her own friendship with Lisa. Whitney calls out Heather for being hypocritical, leading to a showdown between the two."
      },
      {
        "id": "tvmaze:2705895",
        "title": "Mysteries, Revealed?",
        "season": 4,
        "episode": 16,
        "released": "2024-01-02",
        "overview": "On their final day in Bermuda, Heather receives a devastating phone call with incriminating information that affects the rest of the women. Meredith remains in hot water for her role in the rumors about Angie. A bombshell about Heather's black eye is revealed. Someone in the group is exposed and the women must decide whether they will cut ties or accept past mistakes."
      },
      {
        "id": "tvmaze:2714488",
        "title": "Reunion Part 1",
        "season": 4,
        "episode": 17,
        "released": "2024-01-09",
        "overview": "The ladies reunite in New York to discuss the season's highs and lows. New housewife Monica sets the record straight about her past – from her affair, history with the Mormon church and how she became an informant in her ex-friend's criminal case. Angie confronts Monica and Meredith about the rumors regarding her husband and the Greek Mafia."
      },
      {
        "id": "tvmaze:2721811",
        "title": "Reunion Part 2",
        "season": 4,
        "episode": 18,
        "released": "2024-01-16",
        "overview": "In Part II of the reunion, Monica breaks down while reflecting on her relationship with her mother. The rift between Angie and Monica grows as they disagree about the unseen events from Greek Easter. The group is joined by Mary, who comes to Monica's defense and sheds light on where she currently stands with the rest of the women."
      },
      {
        "id": "tvmaze:2725290",
        "title": "Reunion Part 3",
        "season": 4,
        "episode": 19,
        "released": "2024-01-23",
        "overview": "Tensions reach a boiling point in the conclusion of an intense reunion. Heather's bombshell admission about her black eye forces Andy and the group to question her timing and past loyalty. Monica is in the hot seat once again as she defends her motivation for participating in a social media account."
      },
      {
        "id": "tvmaze:2982479",
        "title": "Costume or Couture?",
        "season": 5,
        "episode": 1,
        "released": "2024-09-18",
        "overview": "After a tumultuous previous year, Lisa celebrates Valentine's Day by throwing a Besos party for her friends, but shows no love for Whitney. Meredith confronts Whitney for starting a bath bomb line. Both Angie and Meredith seek apologies for events that transpired last year. Lisa's friend Bronwyn brings a new level of sophistication, fashion and a critical eye to the group. Heather's friend Britani makes a less than favorable impression on Mary."
      },
      {
        "id": "tvmaze:3003828",
        "title": "Walking a Tightrope",
        "season": 5,
        "episode": 2,
        "released": "2024-09-25",
        "overview": "Lisa and Angie struggle to find a way forward in their friendship; Heather hosts a ropes course; Bronwyn lands in the hot seat when Heather accuses her of being two-faced; Meredith recommits to Judaism; Britani's relationship irks Mary."
      },
      {
        "id": "tvmaze:3003829",
        "title": "Basketball, Bobbleheads and the Brow Girl",
        "season": 5,
        "episode": 3,
        "released": "2024-10-02",
        "overview": "Whitney takes the women on a girl's trip to Milwaukee; things heat up when Bronwyn confronts Lisa for not defending her at the ropes course."
      },
      {
        "id": "tvmaze:3004554",
        "title": "The Epiphany",
        "season": 5,
        "episode": 4,
        "released": "2024-10-09",
        "overview": "On day two of the Milwaukee girl's trip, the women support Britani; Lisa plans her own activities; Heather informs Whitney about the Prism rumors, leading to a disagreement between Whitney and Meredith; Britani announces news about her relationship."
      },
      {
        "id": "tvmaze:3008498",
        "title": "Whitney Drew and Her Clues",
        "season": 5,
        "episode": 5,
        "released": "2024-10-16",
        "overview": "As the women settle back into life in Salt Lake City after their whirlwind trip to Milwaukee, group dynamics are anything but calm: Whitney is on the hunt to find out who planted the rumors about her business; Mary is fed up with Heather."
      },
      {
        "id": "tvmaze:3014299",
        "title": "Mafia Wives and Bad Vibes",
        "season": 5,
        "episode": 6,
        "released": "2024-10-23",
        "overview": "Angie celebrates her 25th wedding anniversary with a mafia-themed party; Whitney accuses Lisa of leaking the rumor about her jewelry company; Mary and Angie accuse Heather of being two faced; Britani is caught in a love triangle."
      },
      {
        "id": "tvmaze:3029998",
        "title": "The Huzzbands",
        "season": 5,
        "episode": 7,
        "released": "2024-10-30",
        "overview": "Angie's anniversary party leaves the group at odds; Justine and John work to resolve their issues; Angie takes Heather to task; Meredith finds herself in conflict with Angie's husband; Bronwyn invites Heather over to make amends."
      },
      {
        "id": "tvmaze:3030392",
        "title": "The Desert and the Deserted",
        "season": 5,
        "episode": 8,
        "released": "2024-11-06",
        "overview": "Bronwyn and Todd take the couples to Palm Springs to celebrate their 10th anniversary, but once in the desert, the divisions in the group become clear; even after being uninvited on the trip, Heather makes her presence known in Palm Springs."
      },
      {
        "id": "tvmaze:3034746",
        "title": "Revenge is Best Served in Coach",
        "season": 5,
        "episode": 9,
        "released": "2024-11-13",
        "overview": "Tensions mount between Bronwyn and Lisa; Todd's frustration grows; Meredith questions Shawn's comments; Whitney and Lisa find some common ground; a fun day at the racetrack."
      },
      {
        "id": "tvmaze:3058744",
        "title": "Kiss Kiss, Bangs Bangs",
        "season": 5,
        "episode": 10,
        "released": "2024-11-20",
        "overview": "An Audrey Hepburn-inspired brunch leaves most of the women at odds. Mary and Meredith's friendship lands in a rocky place after a surprising conflict. Heather has lingering resentment over Palm Springs. Todd is disappointed in Bronwyn's behavior. Angie makes an emotional confession to her dad. Mary's concern for Robert Jr. grows."
      },
      {
        "id": "tvmaze:3041771",
        "title": "Troop Salt Lake City",
        "season": 5,
        "episode": 11,
        "released": "2024-11-27",
        "overview": "Heather and Whitney host a girl's camp to reunite the women, but fractures in the friend group only become more evident. Meredith invites Mary to a gallery to work through their issues, but things quickly go awry. Lisa and Angie meet up to attempt to make amends, but Bronwyn threatens their reconciliation when she reveals what Angie and Whitney have been talking about behind everyone's back. As her bat mitzvah approaches, Meredith hosts a Shabbat dinner. Mary has a heart-to-heart with Robert Jr. and learns a dark truth."
      },
      {
        "id": "tvmaze:3052966",
        "title": "Mazel, Meredith",
        "season": 5,
        "episode": 12,
        "released": "2024-12-04",
        "overview": "Meredith becomes a bat mitzvah; after breaking Whitney and Angie's trust, Bronwyn is confronted for spilling their secrets; Mary tries to work through her issues with Meredith while grappling with personal issues at home. The party takes a surprising turn when hair argument arises."
      },
      {
        "id": "tvmaze:3053891",
        "title": "Rooms for Improvement",
        "season": 5,
        "episode": 13,
        "released": "2024-12-11",
        "overview": "There is trouble in paradise as the ladies embark on their trip to Puerto Vallarta. Angie feels slighted after Meredith's bat mitzvah. Bronwyn and Lisa have a falling out over room assignments. Mary chooses to stay in Salt Lake City as issues with Robert Jr. come to a head. Britani makes a new announcement. Bronwyn comes to terms with Gwen's decision about her grandparents."
      },
      {
        "id": "tvmaze:3065818",
        "title": "La VIDA Loca",
        "season": 5,
        "episode": 14,
        "released": "2024-12-18",
        "overview": "The Mexico trip continues with the ladies on a yacht excursion. Lisa updates the group on life with John and Henry. Britani takes offense at the lack of enthusiasm over her last announcement. Bronwyn reveals dark truths about her marriage and is surprised by Heather's grace and Lisa's lack of support. Mary arrives and the ladies come together for a beautiful VIDA dinner where Meredith learns her late-night antics have fueled Britani with fresh gossip. Angie and Bronwyn confront Lisa at dinner."
      },
      {
        "id": "tvmaze:3081655",
        "title": "Smile, You're Being Recorded",
        "season": 5,
        "episode": 15,
        "released": "2025-01-08",
        "overview": ""
      },
      {
        "id": "tvmaze:3082231",
        "title": "Burn Books, Revisited?",
        "season": 5,
        "episode": 16,
        "released": "2025-01-15",
        "overview": "On their final day in Mexico, the ladies surprise Lisa with a Lisa-themed lunch, but things take a turn when Whitney finally pushes Lisa to her limit."
      },
      {
        "id": "tvmaze:3113990",
        "title": "Reunion Part 1",
        "season": 5,
        "episode": 17,
        "released": "2025-01-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3113991",
        "title": "Reunion Part 2",
        "season": 5,
        "episode": 18,
        "released": "2025-01-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3113992",
        "title": "Reunion Part 3",
        "season": 5,
        "episode": 19,
        "released": "2025-02-05",
        "overview": ""
      },
      {
        "id": "tvmaze:3331127",
        "title": "Hot Dogs And Hearsay",
        "season": 6,
        "episode": 1,
        "released": "2025-09-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3364375",
        "title": "Law And Out Of Order",
        "season": 6,
        "episode": 2,
        "released": "2025-09-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3366853",
        "title": "Dismissed",
        "season": 6,
        "episode": 3,
        "released": "2025-09-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3366854",
        "title": "Petty Little Liars",
        "season": 6,
        "episode": 4,
        "released": "2025-10-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3377301",
        "title": "The Salt Lake City Soup Man",
        "season": 6,
        "episode": 5,
        "released": "2025-10-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3391490",
        "title": "Out Of Gas",
        "season": 6,
        "episode": 6,
        "released": "2025-10-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3391491",
        "title": "Above Deck And Below The Belt",
        "season": 6,
        "episode": 7,
        "released": "2025-10-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3393185",
        "title": "Loose Lips Sink Friend Ships",
        "season": 6,
        "episode": 8,
        "released": "2025-11-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3402846",
        "title": "Unicorn Overboard",
        "season": 6,
        "episode": 9,
        "released": "2025-11-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3438861",
        "title": "The Higher the Hair, the Closer to God",
        "season": 6,
        "episode": 10,
        "released": "2025-11-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3438862",
        "title": "Ladies Who Lunch: The Sequel",
        "season": 6,
        "episode": 11,
        "released": "2025-11-25",
        "overview": ""
      },
      {
        "id": "tvmaze:3441880",
        "title": "First Amendment Rights, and Wrongs",
        "season": 6,
        "episode": 12,
        "released": "2025-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:3449564",
        "title": "Greek For The Week",
        "season": 6,
        "episode": 13,
        "released": "2025-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3466356",
        "title": "My Big Fat Greek Mother's Day",
        "season": 6,
        "episode": 14,
        "released": "2025-12-16",
        "overview": ""
      }
    ]
  }
}