{
  "meta": {
    "id": "tvmaze:87783",
    "type": "series",
    "name": "Inside the Arrest",
    "description": "Inside the Arrest captures the moment of arrest, conducted more than two thousand times a day by British police, in order to investigate or prevent a crime. The arrest is the start point for every story, a high-stakes moment that can be met with anything from violence to defiance, confession to incredulity.Each episode features two cases using police bodycam footage to analyse some notorious and high-profile arrests from recent years.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/602/1506482.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/602/1506482.jpg",
    "videos": [
      {
        "id": "tvmaze:3467100",
        "title": "The Runaway Heiress",
        "season": 1,
        "episode": 7,
        "released": "2025-12-12",
        "overview": "An aristocrat goes on the run with her partner and baby in the depths of winter. Police fear the child won't survive, and race to find her."
      },
      {
        "id": "tvmaze:3467101",
        "title": "Losing Control",
        "season": 1,
        "episode": 8,
        "released": "2025-12-19",
        "overview": "An affair is exposed, ending in tragedy. Police arrest the suspect and discover the killer's cover-up. Plus, how an arrest solves two crimes at once."
      },
      {
        "id": "tvmaze:3404154",
        "title": "A Deadly Secret",
        "season": 1,
        "episode": 1,
        "released": "2025-10-31",
        "overview": "It's only when 35-year-old Virginia McCullough is arrested at her home for the murder of her parents that officers discover her gruesome secret."
      },
      {
        "id": "tvmaze:3404155",
        "title": "Protecting Holly",
        "season": 1,
        "episode": 2,
        "released": "2025-11-07",
        "overview": "A plot to kidnap TV presenter Holly Willoughby is discovered when an undercover cop in the US spots something suspicious in an online chat room."
      },
      {
        "id": "tvmaze:3440487",
        "title": "A Shot in the Dark",
        "season": 1,
        "episode": 3,
        "released": "2025-11-14",
        "overview": "After a nine-year-old girl is caught in the crossfire of a gangland feud, a specialist weapons team moves in to arrest her killer."
      },
      {
        "id": "tvmaze:3440488",
        "title": "Killers on the Run",
        "season": 1,
        "episode": 4,
        "released": "2025-11-21",
        "overview": "The discovery of a murdered schoolgirl leads to an international manhunt, and the dramatic arrest of her father and stepmother on an airport runway."
      },
      {
        "id": "tvmaze:3440489",
        "title": "Hunting The Rioters",
        "season": 1,
        "episode": 5,
        "released": "2025-11-28",
        "overview": "After the murders of three schoolgirls, riots break out across Britain. Police are outnumbered but then use cameras to hunt down and arrest rioters."
      },
      {
        "id": "tvmaze:3440490",
        "title": "In the Line of Fire",
        "season": 1,
        "episode": 6,
        "released": "2025-12-05",
        "overview": "Armed officers confront a crazed gunman at his home, then discover his terrifying plans to carry out a mass shooting at a school and police station."
      }
    ]
  }
}