{
  "meta": {
    "id": "tvmaze:1390",
    "type": "series",
    "name": "Sister Wives",
    "description": "Sister Wives explores the complex daily life of a polygamist family. Sister Wives introduces audiences to husband Kody -- along with his three wives; Meri, Janelle and Christine and their combined 13 children -- showing how they attempt to navigate life as a \"normal\" family in a society that shuns their lifestyle. From their unconventional family structure and living arrangements to financial challenges, each half hour episode exposes the inner workings of a polygamist household, revealing the unexpectedly tight-knit and loving relationships between Kody's wives.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505682.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505682.jpg",
    "videos": [
      {
        "id": "tvmaze:3464817",
        "title": "TBA",
        "season": 20,
        "episode": 12,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3464818",
        "title": "TBA",
        "season": 20,
        "episode": 13,
        "released": "2025-12-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3464819",
        "title": "TBA",
        "season": 20,
        "episode": 14,
        "released": "2025-12-28",
        "overview": ""
      },
      {
        "id": "tvmaze:3464820",
        "title": "TBA",
        "season": 20,
        "episode": 15,
        "released": "2026-01-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3464816",
        "title": "Leaving Las Vegas",
        "season": 20,
        "episode": 11,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:122768",
        "title": "Meet Kody & The Wives",
        "season": 1,
        "episode": 1,
        "released": "2010-09-26",
        "overview": "Meet the Browns, a seemingly regular family on the outside, but with a twist once you step inside their home. We also learn this extraordinary family is on the verge of another huge change that could transform the family's dynamic forever."
      },
      {
        "id": "tvmaze:122769",
        "title": "Courting a Fourth Wife",
        "season": 1,
        "episode": 2,
        "released": "2010-10-03",
        "overview": "Kody heads south to court his potential fourth wife, Robyn. Meanwhile back home, the wives express their true feelings about their new possible sister wife as they make preparations for Christine's new baby."
      },
      {
        "id": "tvmaze:122770",
        "title": "Wives on the Move",
        "season": 1,
        "episode": 3,
        "released": "2010-10-03",
        "overview": "Kody and his teenage daughters throw a birthday party for his new fiancée, Robyn. Meanwhile, 1st wife Meri struggles with feelings of jealousy as the whole Brown clan moves Robyn and her anxious kids closer to the family home."
      },
      {
        "id": "tvmaze:122771",
        "title": "A Wife in Labor",
        "season": 1,
        "episode": 4,
        "released": "2010-10-10",
        "overview": "Kody's fiancée Robyn helps out with the kids while Kody and his pregnant third wife Christine go to the hospital. A week overdue, they must make an important decision on whether or not to induce labor."
      },
      {
        "id": "tvmaze:122772",
        "title": "1st Wife's 20th Anniversary",
        "season": 1,
        "episode": 5,
        "released": "2010-10-10",
        "overview": "While the three wives buy a friendship ring for Kody's fiancée Robyn, Kody prepares to celebrate his 20th Anniversary with his first wife, Meri. But when nothing goes as planned, will Kody end up in the dog house?"
      },
      {
        "id": "tvmaze:122773",
        "title": "A Fourth Wife to Be",
        "season": 1,
        "episode": 6,
        "released": "2010-10-17",
        "overview": "As the wedding day nears, the three wives help fiancée Robyn pick a wedding dress, a cake, and a venue for their unique polygamist wedding reception."
      },
      {
        "id": "tvmaze:122774",
        "title": "Four Wives and Counting...",
        "season": 1,
        "episode": 7,
        "released": "2010-10-17",
        "overview": "The big day is finally here! Follow Kody and his wives as they make Robyn officially wife number four. See this extraordinary family as they celebrate the newest additions to their family and prepare to embark on a new chapter in their lives."
      },
      {
        "id": "tvmaze:122777",
        "title": "Browns Out of Hiding",
        "season": 2,
        "episode": 1,
        "released": "2011-03-13",
        "overview": "After years of hiding their lifestyle, Kody and his four wives are off to New York to appear on national television for the first time as open polygamists. Meanwhile back home, the Brown family kids embark on their first day of public school."
      },
      {
        "id": "tvmaze:122778",
        "title": "Free Range Browns",
        "season": 2,
        "episode": 2,
        "released": "2011-03-20",
        "overview": "In wake of the investigation revolving around the family, the Browns decide to get away for a quick vacation to Kody's parent's ranch in Wyoming. And we finally learn more about Kody's family history."
      },
      {
        "id": "tvmaze:122779",
        "title": "The Price of Polygamy",
        "season": 2,
        "episode": 3,
        "released": "2011-03-27",
        "overview": "Kody and Janelle plan a private camping trip that results in a discussion about family finances. Meanwhile, Robyn opens up about her insecurities of not wanting to be a burden on the family financially."
      },
      {
        "id": "tvmaze:122780",
        "title": "Carving Into Polygamy",
        "season": 2,
        "episode": 4,
        "released": "2011-04-03",
        "overview": "Candy, pumpkins,and Polygamy: The Brown family celebrates Halloween with 16 trick or treaters, 21 colorful costumes, and 24 great pumpkins."
      },
      {
        "id": "tvmaze:122781",
        "title": "Wife #3 Hits Sin City",
        "season": 2,
        "episode": 5,
        "released": "2011-04-10",
        "overview": "It's Wife #3's turn with Kody! Christine and her kids head to Vegas so they can spend time some alone time with their dad in her favorite vacation spot. Meanwhile back at home, Meri decides to take the rest of the family out for a bowling night."
      },
      {
        "id": "tvmaze:122782",
        "title": "Polygamist Party",
        "season": 2,
        "episode": 6,
        "released": "2011-04-17",
        "overview": "Meri goes to the doctor for a cancer screening, but will the results be more than she bargained for? Meanwhile the wives are doing something they've never been able to do before: invite their monogamous friends over for dinner!"
      },
      {
        "id": "tvmaze:122783",
        "title": "The Brown Family Decision",
        "season": 2,
        "episode": 7,
        "released": "2011-05-08",
        "overview": "To celebrate Christmas, the Browns head off to a snow-bound cabin in the mountains to get away from the pressure of their on going police investigation. And later, a decision will be revealed that will affect the families lives once again."
      },
      {
        "id": "tvmaze:122784",
        "title": "Sister Wives in Holiday Crisis",
        "season": 2,
        "episode": 8,
        "released": "2011-05-08",
        "overview": "The Sister Wives struggle to accept that this will be their last Christmas in Utah. And with the mounting tension from the investigation leads to a massive change to the family dynamic that awaits them in the New Year."
      },
      {
        "id": "tvmaze:122785",
        "title": "No Place for Home",
        "season": 2,
        "episode": 9,
        "released": "2011-05-15",
        "overview": "Kody and his wives Meri and Robyn drive down to Las Vegas in search for a new home, but upon arrival they realize there are no polygamist houses to be found. Meanwhile back home, the rest of the family plans a suprise birthday party for Meri."
      },
      {
        "id": "tvmaze:122786",
        "title": "Gambling on the Future",
        "season": 2,
        "episode": 10,
        "released": "2011-05-22",
        "overview": "With the family move to Las Vegas only three days away, Kody tells the younger children they will be leaving their home in Utah forever. Despite some protest, the Browns begin to pack. But when the media gets hold of the news, plans turn into panic."
      },
      {
        "id": "tvmaze:122787",
        "title": "Sister Wives in the City of Sin",
        "season": 2,
        "episode": 11,
        "released": "2011-06-05",
        "overview": "The Browns finally arrive in Las Vegas, but face new challenges in building their life away from Utah like finding a home. Meanwhile, one of the wives has some exciting news to announce to the family."
      },
      {
        "id": "tvmaze:122788",
        "title": "The Announcement",
        "season": 3,
        "episode": 1,
        "released": "2011-09-25",
        "overview": "A nervous Robyn finally announces her new pregnancy to the family. How will everyone react to her big news? Meanwhile, the older teens discontent over their new life starts to bubble to the surface."
      },
      {
        "id": "tvmaze:122789",
        "title": "Teen Sex Talk",
        "season": 3,
        "episode": 2,
        "released": "2011-10-02",
        "overview": "Kody and his wives, Christine and Janelle, experiment with working in real estate. Meanwhile, the teens are going out with new friends in Las Vegas -- and the conversation turns towards dating. Finally, Robyn and Kody receive a scare."
      },
      {
        "id": "tvmaze:122790",
        "title": "4 Houses, 4 Relationships",
        "season": 3,
        "episode": 3,
        "released": "2011-10-02",
        "overview": "After finding out Robyn's been spotting, she and Kody rush to see their midwife to find out what's wrong. Will their worst nightmare become a reality? Later, the wives are on a mission to make over one room in each house."
      },
      {
        "id": "tvmaze:122791",
        "title": "The 4 Lives of Kody Brown",
        "season": 3,
        "episode": 4,
        "released": "2011-10-09",
        "overview": "We follow Kody through four days of his astonishing life, moving each day to the house of a different wife. Hear how his family and relationships with his wives has changed since the move. Plus, we finally learn the sex of Robyn and Kody's baby."
      },
      {
        "id": "tvmaze:122792",
        "title": "Defending Polygamy",
        "season": 3,
        "episode": 5,
        "released": "2011-10-16",
        "overview": "Kody and his wives finally return to his hometown for the first time as open polygamists. How will his childhood friends receive him? Later, after revealing the sex of the baby, Robyn and Kody finally decide to announce the name."
      },
      {
        "id": "tvmaze:122793",
        "title": "The Wives Diet Woes",
        "season": 3,
        "episode": 6,
        "released": "2011-10-23",
        "overview": "The sisters open up about an issue that has bothered all of them -- their weight! Watch the sisters speak candidly about their battle with the bulge and see their attempts to the shed pounds as they they make their way to a gym for a body fat analysis."
      },
      {
        "id": "tvmaze:122794",
        "title": "July 4th Rebellion",
        "season": 3,
        "episode": 7,
        "released": "2011-10-30",
        "overview": "Christine's daughter, Ysabel, and Robyn's daughter, Breanna, are moving out -- to Meri's house. But will Meri be in over her head having them temporarily under her roof? Then, the Browns are off for some camping fun, but the teens have different ideas."
      },
      {
        "id": "tvmaze:122795",
        "title": "Another Wife",
        "season": 3,
        "episode": 8,
        "released": "2011-11-06",
        "overview": "When another couple from the Browns' church in Utah comes to visit, the conversation turns to polygamy. How will the Browns respond to questions surrounding courting another wife and dealing with jealousy? What advice will they offer to ensure success?"
      },
      {
        "id": "tvmaze:122796",
        "title": "College-Bound Browns",
        "season": 3,
        "episode": 9,
        "released": "2011-11-13",
        "overview": "The Brown family nervously accepts an invitation from a religious professor to talk to her students in Boston. Anxious about the question they will face, how will they respond? Meanwhile, the older teens tag along to visit some of Boston's best colleges."
      },
      {
        "id": "tvmaze:122797",
        "title": "Sister Wives on the Strip",
        "season": 3,
        "episode": 10,
        "released": "2011-11-20",
        "overview": "The Sister Wives get makeovers and head to the strip for a night on the town while Kody stays home to babysit all the kids. How will they react when they come face to face with all the \"adult\" entertainment Vegas has to offer?"
      },
      {
        "id": "tvmaze:122798",
        "title": "Kody Climbs Into the Ring",
        "season": 3,
        "episode": 11,
        "released": "2011-11-20",
        "overview": "Kody heads for the Vegas strip for a guy's night out on the town, testing his wrestling skills against a mixed martial arts fighter and answering his friends' questions about his lifestyle. Meanwhile, the wives help setup Robyn's new nursery."
      },
      {
        "id": "tvmaze:122799",
        "title": "Sisters' Special Delivery",
        "season": 3,
        "episode": 12,
        "released": "2011-11-27",
        "overview": "The Sister Wives are buzzing with excitement as Robyn's first contractions finally kick in. But not everyone is happy about it. The emotion builds as each of the Browns face their true feelings about Robyn's family becoming their own."
      },
      {
        "id": "tvmaze:122800",
        "title": "Sister Wives Separated",
        "season": 4,
        "episode": 1,
        "released": "2012-05-13",
        "overview": "It's the Browns' first Christmas in Vegas and the wives are separated in four rental homes. Desperate to get the family back together, Kody has his hands full chopping down Christmas trees and finding the dream home that will bring them all together again."
      },
      {
        "id": "tvmaze:122801",
        "title": "Polygamist Date Nights",
        "season": 4,
        "episode": 2,
        "released": "2012-05-20",
        "overview": "Date Night is important in a plural marriage and Kody needs to bring his A-game to keep his wives happy. From hitting the slopes to releasing pent up aggression shooting paintballs, all four wives are expecting Kody to bring the magic and some romance."
      },
      {
        "id": "tvmaze:122802",
        "title": "Brutal Honesty",
        "season": 4,
        "episode": 3,
        "released": "2012-05-27",
        "overview": "As the Sister Wives prepare for Kody's birthday, Christine tries to reconcile with Robyn by opening up about the problems she's had since Robyn joined the family. How will Robyn handle this brutally honest conversation?"
      },
      {
        "id": "tvmaze:122803",
        "title": "You Asked, Browns Answer",
        "season": 4,
        "episode": 4,
        "released": "2012-05-27",
        "overview": "Everyone has questions about polygamy. Today the Browns answer the toughest questions submitted by viewers. From contraception and gay children to Kody's favorite and least favorite traits of each wife, nothing is held back."
      },
      {
        "id": "tvmaze:122804",
        "title": "Infertility & Nesting",
        "season": 4,
        "episode": 5,
        "released": "2012-06-03",
        "overview": "The Browns apply for separate mortgages as they dream of getting their family into adjacent homes. Meanwhile, Janelle is still determined to open a gym, but will Kody support her plan? Later, Meri discloses the details of her past fertility problems."
      },
      {
        "id": "tvmaze:122805",
        "title": "4 Wives, 4 Valentines",
        "season": 4,
        "episode": 6,
        "released": "2012-06-03",
        "overview": "What's the most awkward day of the year for a Polygamist? Valentine's Day! And how do the Browns handle monogamy's biggest holiday of love? This year, Kody takes his young daughters to a daddy-daughter Valentine's dance at their school."
      },
      {
        "id": "tvmaze:122806",
        "title": "Brown Boys Do Vegas",
        "season": 4,
        "episode": 7,
        "released": "2012-06-10",
        "overview": "The Brown brothers are coming to town! Kody ditches his four wives for his three brothers as they hit up the city of sin. They're cruising on motorcycles, hanging out at a biker bar, and shooting guns."
      },
      {
        "id": "tvmaze:122807",
        "title": "No Place Like Home",
        "season": 4,
        "episode": 8,
        "released": "2012-06-10",
        "overview": "Logan, Mariah, Madison, and Hunter head back to Utah to visit their family and friends, but more importantly, to visit the happy home they left behind. How will they feel about being back and will they have any resentment or regrets since leaving?"
      },
      {
        "id": "tvmaze:122808",
        "title": "Meri's Baby Decision",
        "season": 4,
        "episode": 9,
        "released": "2012-06-17",
        "overview": "Kody makes good on his promise to Meri escaping to Mexico for a romantic getaway. They climb ancient temples and swim with dolphins. But despite all the romance, the conversation turns serious when Kody asks Meri about Robyn's offer of surrogacy."
      },
      {
        "id": "tvmaze:122809",
        "title": "Brown Family Confessions",
        "season": 4,
        "episode": 10,
        "released": "2012-06-17",
        "overview": "The Brown family is bringing it home! The Browns invite viewers into their home to answer more in depth questions about their plural marriage lifestyle. But this time, they invite their teenagers to join the discussion."
      },
      {
        "id": "tvmaze:122810",
        "title": "Leaving the Nest",
        "season": 4,
        "episode": 11,
        "released": "2012-06-24",
        "overview": "As high school graduation nears, Logan finally decides on which college he will attend. Meanwhile, Kody and the wives are on the verge of fulfilling their dream of bringing the family back together. Will they finally make their dream come true?"
      },
      {
        "id": "tvmaze:122812",
        "title": "Polygamist Debt Threat",
        "season": 5,
        "episode": 1,
        "released": "2012-11-18",
        "overview": "Desperate to get their family back together, the Browns put money down to hold land in order to build homes altogether on one cul de sac. But the shockingly bad credit of one wife could hold back the entire family."
      },
      {
        "id": "tvmaze:122813",
        "title": "Kody Begs for an Answer",
        "season": 5,
        "episode": 2,
        "released": "2012-11-25",
        "overview": "The teachers are in for a big surprise when Kody and the wives all attend Parent/Teacher conferences for their kids. Later, Logan graduates from college, but not without some family mayhem. And Kody demands an answer from Meri about having another baby."
      },
      {
        "id": "tvmaze:122814",
        "title": "More Sister Wives!",
        "season": 5,
        "episode": 3,
        "released": "2012-12-02",
        "overview": "The Browns plan a vacation with their polygamist friends, the Dargers as they head to the beach for some polygamist fun in the sun. For the first time we'll meet another polygamist family and discover how they're the same, or different from the Browns."
      },
      {
        "id": "tvmaze:122815",
        "title": "Polygamist Cults",
        "season": 5,
        "episode": 4,
        "released": "2012-12-09",
        "overview": "The dark side of polygamy is uncovered when the Brown teenagers volunteer for an organization that helps people escape from abusive polygamist families."
      },
      {
        "id": "tvmaze:122816",
        "title": "Mourning the Loss",
        "season": 5,
        "episode": 5,
        "released": "2012-12-16",
        "overview": "Tensions rise as the Sister Wives fight for the bonus features they want for each house. Who stays in budget and who goes way over? Later, the Brown family digs deep when the family pet is ailing. A compromise leaves them all in tears."
      },
      {
        "id": "tvmaze:122817",
        "title": "Confronting Failure",
        "season": 5,
        "episode": 6,
        "released": "2012-12-16",
        "overview": "With the Sister Wives living separately for over a year now, the Brown family structure is falling apart. After stressing out over finances, the wives try hard to start a web business, and Christine makes another attempt to pass her real estate exam."
      },
      {
        "id": "tvmaze:122818",
        "title": "Polygamist Pilgrimage Into the Past",
        "season": 5,
        "episode": 7,
        "released": "2012-12-23",
        "overview": "The wives plan a dream pilgrimage across country to Nauvoo Illinois, the birthplace of American polygamy. But the three-day road trip turns into much more than they bargained for as tempers start to flair and relationships get tested."
      },
      {
        "id": "tvmaze:122819",
        "title": "Hard to Say Goodbye",
        "season": 5,
        "episode": 8,
        "released": "2012-12-30",
        "overview": "As the Browns prepare a proper send-off for Logan's graduation, Kody and the wives push hard to get moved into their new homes before Christmas. Will all the pressures of moving and decorating for the holidays get the better of them?"
      },
      {
        "id": "tvmaze:122821",
        "title": "Picking Up the Pieces",
        "season": 6,
        "episode": 1,
        "released": "2013-07-21",
        "overview": "The Browns make strides in reuniting the family by doing the first walk-throughs of each of their four adjacent homes. Meanwhile, the family business continues to struggle, creating tension among the wives. And Robyn asks Meri about her surrogacy offer."
      },
      {
        "id": "tvmaze:122822",
        "title": "Four Lives of Kody's Wives",
        "season": 6,
        "episode": 2,
        "released": "2013-07-28",
        "overview": "Since leaving Utah, the wives have now settled into four separate lives. Janelle continues her weight-loss battle. Robyn fights to keep the family business afloat. Meri works hard to repair her relationship with Mariah and Christine rethinks her career."
      },
      {
        "id": "tvmaze:122823",
        "title": "Big Boy Panties",
        "season": 6,
        "episode": 3,
        "released": "2013-08-04",
        "overview": "Focused on their goal of being in all four houses by Christmas, snags in the building process threaten to ruin the Brown's dream. Meanwhile, Aspyn and Mariah discuss college plans. And one wife decides to possibly jump ship on the family business."
      },
      {
        "id": "tvmaze:122824",
        "title": "Odd Wife Out",
        "season": 6,
        "episode": 4,
        "released": "2013-08-11",
        "overview": "With builders putting the finishing touches on their new homes, one major hurdle still remains for all of them -- closing on their mortgages? Will all four wives be able to afford their new home or will one of them be left with tears of disappointment?"
      },
      {
        "id": "tvmaze:122825",
        "title": "Christmas Surprise",
        "season": 6,
        "episode": 5,
        "released": "2013-08-18",
        "overview": "The Browns will celebrate Christmas a week later in hopes of getting everybody moved into their new houses, but will the extra time be enough? Meanwhile, Kody adds more stress by challenging his wives to a contest and Robyn has a special gift for Kody."
      },
      {
        "id": "tvmaze:122826",
        "title": "Robyn's Secret",
        "season": 6,
        "episode": 6,
        "released": "2013-08-25",
        "overview": "In hopes of establishing their new homes, the family decides to bury a time capsule to symbolize putting down their roots. Later, the Browns hold their first church service since moving in and Robyn reveals some shocking secret from her past."
      },
      {
        "id": "tvmaze:122827",
        "title": "Polygamy Questions Answered",
        "season": 6,
        "episode": 7,
        "released": "2013-09-01",
        "overview": "The viewers take control as the Browns are put to the test answering all your questions. What do the teens really think of the family dress code? Which mom is the strictest? Get all the behind-the-scenes details in this special episode of Sister Wives."
      },
      {
        "id": "tvmaze:122828",
        "title": "A Wife Decides",
        "season": 6,
        "episode": 8,
        "released": "2013-09-08",
        "overview": "In an attempt to move forward with their new life, the Brown's celebrate by burning the bag Kody used daily to go between each house. Meanwhile, Janelle hits a plateau with her weight loss and Kody and Meri make a decision on Robyn's surrogacy offer."
      },
      {
        "id": "tvmaze:122829",
        "title": "Sister Wives on the Ropes",
        "season": 6,
        "episode": 9,
        "released": "2013-09-15",
        "overview": "Tensions run high when the Browns must stand their ground at a debate with outspoken anti-polygamists with Christine's estranged aunt as one of them. Later, Meri and Kody receive some financial news that could affect Mariah's college plans."
      },
      {
        "id": "tvmaze:122830",
        "title": "Polygamist Marriage Therapy",
        "season": 6,
        "episode": 10,
        "released": "2013-09-22",
        "overview": "Kody and his four wives travel to a couples retreat to tackle their relationship issues head on. After a meditation session that barely eases the emotional stress, Browns finally make a discovery on the root cause of their internal conflicts."
      },
      {
        "id": "tvmaze:1615069",
        "title": "Tell All",
        "season": 6,
        "episode": 11,
        "released": "2013-09-22",
        "overview": "The Brown family is back on the couch and ready to tell all in a revealing hour-long reunion special. Kody, Meri, Christine, Janelle, and Robyn sit down with NBC's Tamron Hall to set the record straight ."
      },
      {
        "id": "tvmaze:122832",
        "title": "Mother-in-Law Invasion",
        "season": 6,
        "episode": 12,
        "released": "2013-12-29",
        "overview": "It's Mother's Day and Kody's mothers-in-laws are visiting, 9 moms in all. Kody makes Mother's Day breakfast. The wives discuss how to pay for their kids starting college, and how to improve their relationships before the commitment celebration."
      },
      {
        "id": "tvmaze:122833",
        "title": "Boys Night Out",
        "season": 6,
        "episode": 13,
        "released": "2014-01-05",
        "overview": "On a Mormon mission, Kody met friend, Brett. But as Kody turned toward Mormon Fundamentalism, Brett turned away. Now Kody and Brett are ready to rekindle their bro-mance. Meri's panic about her future empty nest grows as Mariah's graduation approaches."
      },
      {
        "id": "tvmaze:122834",
        "title": "Polygamist Flash Mob",
        "season": 6,
        "episode": 14,
        "released": "2014-01-12",
        "overview": "It's Mariah and Aspyn's graduation day and Meri has a complete meltdown. Later, the Browns throw a party for the two girls, featuring what may be the very first polygamist flash mob. There's even a fortune teller who sees a fifth wife in Kody's future."
      },
      {
        "id": "tvmaze:122835",
        "title": "While the Wives Are Away...",
        "season": 6,
        "episode": 15,
        "released": "2014-01-19",
        "overview": "It's a Brown family first when the wives take a road trip to San Francisco without Kody! The wives decide to work on their relationships by going dress shopping for their commitment celebration. And with the women gone, Kody is home alone with 17 kids."
      },
      {
        "id": "tvmaze:122836",
        "title": "Browns in Crisis",
        "season": 6,
        "episode": 16,
        "released": "2014-01-26",
        "overview": "The Browns get a scare when Truely falls ill but are told she just has the flu. While preparing for Mariah's going away party, Truely's health worsens and Christine learns that she has a deteriorating condition and needs to be hospitalized immediately."
      },
      {
        "id": "tvmaze:122837",
        "title": "Tragedy in the Family",
        "season": 6,
        "episode": 17,
        "released": "2014-02-09",
        "overview": "With the commitment celebration just a month and a half away, the Browns need to kick the plans into high gear. They meet with a party planner, but their efforts are interrupted by a sudden family tragedy the second in two months."
      },
      {
        "id": "tvmaze:122838",
        "title": "Celebration Countdown",
        "season": 6,
        "episode": 18,
        "released": "2014-02-16",
        "overview": "The Browns are preparing for their long-awaited Commitment Celebration. Tensions and tempers flare after a disastrous dress rehearsal with the entire family, leaving Kody and his wives wondering if all their hard work and planning will pay off."
      },
      {
        "id": "tvmaze:122839",
        "title": "The Commitment Celebration",
        "season": 6,
        "episode": 19,
        "released": "2014-02-23",
        "overview": "After months of planning there's just 48 hours to go; the dresses are not ready, the lights are not strung, and 200+ guests are on their way. A surprise organized by the teenagers caps a unique event; a celebration of four marriages in one giant family."
      },
      {
        "id": "tvmaze:1615068",
        "title": "Tell All 2",
        "season": 6,
        "episode": 20,
        "released": "2014-02-23",
        "overview": "In this latest installment of Sister Wives Tell All, the Brown family sits down with NBC's Tamron Hall to dish about everything that happened on camera and behind the scenes on the latest season of of TLC's hit show."
      },
      {
        "id": "tvmaze:122841",
        "title": "Meri Drops a Bomb",
        "season": 7,
        "episode": 1,
        "released": "2014-06-08",
        "overview": "The Browns face a chaotic week. They have a meeting with a potential investor for their jewelry line. Christine's daughter Mykelti brings a boyfriend home. Lastly, Meri drops a bombshell that threatens her close relationship with one sister wife."
      },
      {
        "id": "tvmaze:122842",
        "title": "Polygamists in a Shark Tank",
        "season": 7,
        "episode": 2,
        "released": "2014-06-15",
        "overview": "The Browns' jewelry business is beginning to overwhelm the wives. Robyn wants to have time for another baby and Meri wants to go back to school. Needing to hire some employees, they've turned to investors for money. But will their pitch sink or swim?"
      },
      {
        "id": "tvmaze:122843",
        "title": "The Big Decision",
        "season": 7,
        "episode": 3,
        "released": "2014-06-22",
        "overview": "As the Browns attempt to secure investors for their business, the family learns that a wife's slip up may have cost them the whole deal. Later, Meri heads to Utah and catches up with a childhood friend. And Janelle continues her weight loss journey."
      },
      {
        "id": "tvmaze:122844",
        "title": "Vegas Surprise",
        "season": 7,
        "episode": 4,
        "released": "2014-06-22",
        "overview": "The family decides to throw Kody a Vegas-themed surprise party thanking him for all he's done to get the family where they are. During the planning, each person shares how the family has grown. But will the big surprise be spoiled as the countdown looms?"
      },
      {
        "id": "tvmaze:122845",
        "title": "Growing Up Polygamist",
        "season": 7,
        "episode": 5,
        "released": "2014-06-29",
        "overview": "We check in with some of the Brown teens to see how they are dealing with dating, college, and the uncertainties of their futures as potential polygamists. Meanwhile, Janelle has a battle of her own when she hits a plateau on her weight loss journey."
      },
      {
        "id": "tvmaze:122846",
        "title": "Four Wives in Two RVs",
        "season": 7,
        "episode": 6,
        "released": "2014-07-06",
        "overview": "The Browns hit the road for their Spring Break trip along historic Route 66 to meet up with a non-Mormon polygamist family in Missouri. Memories are made (including ones involving a 72 ounce steak), but will the close RV quarters lead to tempers flaring?"
      },
      {
        "id": "tvmaze:122847",
        "title": "From Monogamy to Polygamy",
        "season": 7,
        "episode": 7,
        "released": "2014-07-13",
        "overview": "The Browns reach the last stop on their road trip, as they meet the Richards, a Christian polygamist family. Religion isn't the only difference between them, however. The Richards operate on rigidity and discipline, which shocks the fun loving Browns."
      },
      {
        "id": "tvmaze:122848",
        "title": "Every Brown Revealed",
        "season": 7,
        "episode": 8,
        "released": "2014-07-20",
        "overview": "Kody, his wives, and all of the children work to compile photos and videos that bring new life and new understanding to the family. Insightful details and shocking secrets emerge to give an even deeper look into what makes this family so extraordinary."
      },
      {
        "id": "tvmaze:1615067",
        "title": "Tell All",
        "season": 7,
        "episode": 9,
        "released": "2014-07-27",
        "overview": "No topic is off limits as Kody and his wives tackle all of the tough and uncomfortable questions about the season. The older kids enter the mix to reveal a new interest in Logan's life, as the youngest kids open up about their TV lives for the first time."
      },
      {
        "id": "tvmaze:122850",
        "title": "Growing Up & Moving Out",
        "season": 8,
        "episode": 1,
        "released": "2015-01-04",
        "overview": "Two more daughters are graduating High School in the same year: Mykelti and Madison. Meanwhile, Janelle goes to the family therapist and opens up for the first time about offenses she has hung onto involving one of the wives."
      },
      {
        "id": "tvmaze:122851",
        "title": "A Family Meltdown",
        "season": 8,
        "episode": 2,
        "released": "2015-01-11",
        "overview": "The Browns begin a road trip to meet another polygamist family. They check in on Christine's mother who has plans of moving to Vegas. Next, they visit their old home in Utah and are overwhelmed by past emotions. And Kody does something to upset one wife."
      },
      {
        "id": "tvmaze:122852",
        "title": "Courting Another Wife",
        "season": 8,
        "episode": 3,
        "released": "2015-01-18",
        "overview": "The blow up between Kody and Christine continues as they approach their final destination. Can Kody get to the root of the problem? Later, the Browns meet another polygamist family, the Colliers and discuss the idea of the Colliers courting another wife."
      },
      {
        "id": "tvmaze:122853",
        "title": "One More Woman in Kody's Life",
        "season": 8,
        "episode": 4,
        "released": "2015-01-25",
        "overview": "Christine's two oldest daughters, Aspyn and Mykelti, are moving out, while her mother Annie is moving in! How will Kody handle having his mother-in-law around all the time? Later, Meri comforts Robyn about her ongoing struggles with her ex-husband."
      },
      {
        "id": "tvmaze:124068",
        "title": "Anthropologists Move In",
        "season": 8,
        "episode": 5,
        "released": "2015-02-08",
        "overview": "The Browns have agreed to do something they have never done before -- allow total strangers to move into their houses! Two anthropology students will live with the Browns for several days to get an unfiltered look at their polygamist lifestyle."
      },
      {
        "id": "tvmaze:1615066",
        "title": "Robyn - Behind the Scenes",
        "season": 8,
        "episode": 6,
        "released": "2015-02-08",
        "overview": "The family recounts Robyn's journey as she joined the family and revisit the highlights of her first five years as Kody's fourth wife. Discussing everything from early jealousies to bad hairstyles, we go behind the scenes with the Browns' about Robyn."
      },
      {
        "id": "tvmaze:129019",
        "title": "First a Verdict, Then a Lawyer",
        "season": 8,
        "episode": 7,
        "released": "2015-02-15",
        "overview": "The Browns begin to worry about whether the anthropology students will see them as a healthy family or completely dysfunctional. And on top this stress, Meri makes a momentous decision that will change the Brown family forever."
      },
      {
        "id": "tvmaze:1615065",
        "title": "Meri - Behind the Scenes",
        "season": 8,
        "episode": 8,
        "released": "2015-02-15",
        "overview": "With Meri about to make a stunning decision that could change the Brown family forever, now is the perfect time to take an in-depth look at all of the major events Meri has gone through in the past five years, and beyond."
      },
      {
        "id": "tvmaze:140660",
        "title": "Divorce",
        "season": 8,
        "episode": 9,
        "released": "2015-03-01",
        "overview": "The bombshell Meri dropped is real and it's happening now. Ripples of shock spread through the family as each wife learns what Meri is doing. Nothing like this has ever happened before in the Brown family."
      },
      {
        "id": "tvmaze:1615064",
        "title": "Tell All",
        "season": 8,
        "episode": 10,
        "released": "2015-03-01",
        "overview": "Tamron Hall sits down with the Kody Brown and the Sister Wives to discuss the most explosive season of Sister Wives yet. No topic is off limits as the family opens up about the unexpected development that has everyone talking."
      },
      {
        "id": "tvmaze:206527",
        "title": "A Secret Marriage",
        "season": 9,
        "episode": 1,
        "released": "2015-09-13",
        "overview": "Now that Meri has legally divorced Kody, the next step is supposed to be simple: Kody legally marries Robyn. But when is a marriage ever simple? And these are polygamists, so do the other wives come? The children?"
      },
      {
        "id": "tvmaze:218999",
        "title": "Wrestling with Adoption",
        "season": 9,
        "episode": 2,
        "released": "2015-09-20",
        "overview": "Meri is emotional as she tries to tell the kids about the marriage license shift to Robyn. But the next step is really the most important: Kody wants to adopt Robyn's kids from her first marriage. The big question now is how does Robyn's ex feel about it?"
      },
      {
        "id": "tvmaze:219000",
        "title": "All About Janelle",
        "season": 9,
        "episode": 3,
        "released": "2015-09-20",
        "overview": "Janelle is the only of Kody's wives who did not grow up in a polygamist church and we'll learn new details about how she was introduced to polygamy. She talks about her feelings at gaining a new Sister and where she's at in her struggle to lose weight."
      },
      {
        "id": "tvmaze:219001",
        "title": "Marriage Counseling Texas Style",
        "season": 9,
        "episode": 4,
        "released": "2015-09-27",
        "overview": "Christine and Kody turn an anniversary trip to Galveston, Texas, into intensive couples therapy in an effort to improve their relationship. Before they leave, the Brown family meets with their lawyer to start the process of adopting Robyn's kids."
      },
      {
        "id": "tvmaze:236862",
        "title": "All About Christine",
        "season": 9,
        "episode": 5,
        "released": "2015-09-27",
        "overview": "This one's all about Christine! She reveals the things she never wanted to talk about at all and what she was really thinking during the most memorable moments of the past five years."
      },
      {
        "id": "tvmaze:277889",
        "title": "Just Trying to Stay Afloat",
        "season": 9,
        "episode": 6,
        "released": "2015-10-04",
        "overview": "The Sister Wives decide to race in a cardboard boat regatta at an annual pirate festival in Las Vegas. Janelle's family will build one cardboard boat, and Christine and Robyn's families will build another."
      },
      {
        "id": "tvmaze:277891",
        "title": "More Girls Than Kody Can Handle?",
        "season": 9,
        "episode": 7,
        "released": "2015-10-11",
        "overview": "Kody admits that he relates better to his boys than his young girls. He does want to improve this though, so he decides to take five of the youngest girls off his wives hands for a few days."
      },
      {
        "id": "tvmaze:277893",
        "title": "Robyn's Big Announcement",
        "season": 9,
        "episode": 8,
        "released": "2015-10-18",
        "overview": "This is a big week! The adoption of Robyn's kids is coming to a head as the Browns sign official paperwork with their lawyer. Only one thing stands in their way now... a judge."
      },
      {
        "id": "tvmaze:372918",
        "title": "A Judge Decides",
        "season": 9,
        "episode": 9,
        "released": "2015-10-25",
        "overview": "Today is the day the Brown's have been working towards this entire year. Finally, this is the court hearing where Kody will learn if he can adopt Robyn's oldest three kids. And Janelle's oldest daughter, Madison, has a stunning announcement for the family"
      },
      {
        "id": "tvmaze:384688",
        "title": "Chaos in the Cul-de-Sac",
        "season": 9,
        "episode": 10,
        "released": "2015-11-01",
        "overview": "The Browns set out to celebrate the judge's decision to allow Kody to adopt Robyn's first three kids. What starts as a simple party for family and friends turns into a huge event for 60 people. This is the famous \"Brown chaos\" at its worst...and best."
      },
      {
        "id": "tvmaze:384689",
        "title": "A Boy or a Girl?",
        "season": 9,
        "episode": 11,
        "released": "2015-11-08",
        "overview": "The Browns are taking the biggest journey of their lives. They are all going to Alaska and they are bringing Logan's new girlfriend too. And Kody and Robyn reveal the sex of their new baby to the family!"
      },
      {
        "id": "tvmaze:384690",
        "title": "Meri Catfished",
        "season": 9,
        "episode": 12,
        "released": "2015-11-15",
        "overview": "The Browns are in Alaska dog sledding and deep sea fishing. And in one of the most stunning and emotional twists ever on Sister Wives, Meri admits to her family that she's been involved with a man online, but this person is not who she thought he was."
      },
      {
        "id": "tvmaze:432862",
        "title": "Tell All",
        "season": 9,
        "episode": 13,
        "released": "2015-11-22",
        "overview": "After a season of change, conflict, and stunning confessions, the Brown family comes together to set the record straight. From Robyn's pregnancy to Meri's catfishing bombshell, nothing is off limits in the most revealing Sister wives tell-all yet."
      },
      {
        "id": "tvmaze:741225",
        "title": "Catfishing Fallout",
        "season": 10,
        "episode": 1,
        "released": "2016-05-08",
        "overview": "The Sister Wives are reeling from Meri's recent admission that she became involved with someone online who she thought was a man, but turned out to be a woman."
      },
      {
        "id": "tvmaze:773525",
        "title": "Pawn Shops and Polygamy Perks",
        "season": 10,
        "episode": 2,
        "released": "2016-05-15",
        "overview": "In this one-hour special, Sister Wives Tell-All RAW, we throw open the vaults, bringing fans what they haven't seen. For the first time ever, we'll take a look back over the years we've gotten to know America's most famous polygamist family."
      },
      {
        "id": "tvmaze:1615063",
        "title": "Confessions",
        "season": 10,
        "episode": 3,
        "released": "2016-05-15",
        "overview": "Meri is not at all over the trauma of the recent catfishing incident and yet decides to attempt a therapy session with Janelle, hoping to work through conflicts from long ago. Janelle is very nervous that the therapy might open up old wounds."
      },
      {
        "id": "tvmaze:777295",
        "title": "Thanksgiving: The Good, the Bad, the Ugly",
        "season": 10,
        "episode": 4,
        "released": "2016-05-22",
        "overview": "Meri and Janelle, fresh out of their first therapy session together, attempt another step forward in their effort to get along better by decorating for the big Thanksgiving family dinner together. But their first planning session starts off rocky."
      },
      {
        "id": "tvmaze:792353",
        "title": "Unforgiven",
        "season": 10,
        "episode": 5,
        "released": "2016-05-29",
        "overview": "Meri hopes a gift for Kody will help make amends after the catfishing incident. Madison goes wedding dress shopping and finds the one. Mariah distances herself from Meri and the polygamist church."
      },
      {
        "id": "tvmaze:792354",
        "title": "Baby Sister Is Born",
        "season": 10,
        "episode": 6,
        "released": "2016-06-05",
        "overview": "Robyn's baby is due NOW, and she's worried about the possibility of a breached birth. She and Kody go for one more ultrasound to check on Baby Sister- meanwhile one of the oldest daughters, Madison, goes to be fitted for her wedding gown."
      },
      {
        "id": "tvmaze:1615062",
        "title": "Meri Makes Amends",
        "season": 10,
        "episode": 7,
        "released": "2016-06-12",
        "overview": "The whole Brown family is preparing for an epic trip to Hawaii, but Robyn is nervous about travelling with her newborn, Ariella. Meanwhile Meri and Janelle continue their therapy."
      },
      {
        "id": "tvmaze:824353",
        "title": "Kody: Behind the Scenes",
        "season": 10,
        "episode": 8,
        "released": "2016-06-16",
        "overview": "It's usually all about the Sister Wives, but this week all four wives turn their focus on Kody and reveal some of his biggest secrets. They open up about why he became a polygamist and what he was thinking when he agreed to go public with his illegal life"
      },
      {
        "id": "tvmaze:824354",
        "title": "Hawaiian Vacation Erupts",
        "season": 10,
        "episode": 9,
        "released": "2016-06-19",
        "overview": "The Browns' idyllic Hawaiian vacation takes a turn when they fight about parking cars and beach umbrella placement; Kody and Meri take steps towards improving their struggling relationship."
      },
      {
        "id": "tvmaze:1615061",
        "title": "Tell All",
        "season": 10,
        "episode": 10,
        "released": "2016-06-27",
        "overview": "In the latest two-hour installment of Sister Wives Tell All, the Brown family sits down with NBC's Erica Hill for their most emotional and candid conversation yet. The family discusses their relationships, their kids, and the ongoing catfishing scandal."
      },
      {
        "id": "tvmaze:987372",
        "title": "It's Worse Than We Thought",
        "season": 11,
        "episode": 1,
        "released": "2016-11-27",
        "overview": "As the Browns are busy prepping for Madison's wedding, Mykelti drops a bomb of her own; while Kody tries to mend fences between Meri and Mariah, he realizes that his own relationship with his first wife is still in a shambles."
      },
      {
        "id": "tvmaze:995752",
        "title": "Kody Takes Responsibility",
        "season": 11,
        "episode": 2,
        "released": "2016-12-04",
        "overview": "Madison and Mykelti race to the altar; Kody tries to convince Mariah to forgive Meri for the catfishing incident; Janelle and Meri's therapist pushes them to take the next step in their struggling relationship."
      },
      {
        "id": "tvmaze:1004024",
        "title": "He Pops the Question",
        "season": 11,
        "episode": 3,
        "released": "2016-12-04",
        "overview": "Madison lays out the plans for her wedding; Janelle and Meri's therapist pushes them to take the next step in their struggling relationship; the Brown's family may be growing again after a special proposal."
      },
      {
        "id": "tvmaze:1004025",
        "title": "Embarrassing the Sister Wives",
        "season": 11,
        "episode": 4,
        "released": "2016-12-11",
        "overview": "A windstorm wreaks havoc, Madison receives the embarrassing gifts her mother dreaded and wedding preparations go awry at this polygamist bridal shower; Mykelti and Tony announce their engagement."
      },
      {
        "id": "tvmaze:1030327",
        "title": "The Dress Doesn't Fit",
        "season": 11,
        "episode": 5,
        "released": "2016-12-11",
        "overview": "It's the week before Maddie's wedding and Mykelti and Tony are announcing their engagement! The whole family has to get to Wyoming, and when the mother of the bride, Janelle, talks about going fishing in the nearby river, Maddie melts down."
      },
      {
        "id": "tvmaze:1004026",
        "title": "Maddie Gets Married",
        "season": 11,
        "episode": 6,
        "released": "2016-12-18",
        "overview": "Madison Brown is getting married! This is the first wedding of all the Sister Wives' children and it's absolutely stunning."
      },
      {
        "id": "tvmaze:1615060",
        "title": "Guide to Wedded Bliss",
        "season": 11,
        "episode": 7,
        "released": "2016-12-25",
        "overview": "Relive special moments from three Brown family weddings."
      },
      {
        "id": "tvmaze:1025729",
        "title": "Another Catfishing",
        "season": 11,
        "episode": 8,
        "released": "2017-01-01",
        "overview": "Meri meets another woman catfished by \"Sam\" and the stunning new details revealed lead to a reckoning with Kody. Their marriage is in worse shape than we ever knew. Then Mariah makes a huge announcement."
      },
      {
        "id": "tvmaze:1030328",
        "title": "A Shocking Revelation",
        "season": 11,
        "episode": 9,
        "released": "2017-01-08",
        "overview": "Meri's only daughter, Mariah, makes a stunning announcement; the whole family heads to a mountain resort where Meri struggles to connect with Mariah, who remains angry about the catfishing."
      },
      {
        "id": "tvmaze:1030329",
        "title": "The Newlyweds vs. The Browns",
        "season": 11,
        "episode": 10,
        "released": "2017-01-15",
        "overview": "The Brown family decides to play a game to see who knows each other better: the newlyweds, the newly-engaged older kids or Kody and his four wives."
      },
      {
        "id": "tvmaze:1030330",
        "title": "Tell All: Part 1",
        "season": 11,
        "episode": 11,
        "released": "2017-01-22",
        "overview": "In the latest two-part installment of Sister Wives Tell All, The Brown Family sits down to discuss this season's celebrations, confessions, and jaw-dropping moments. From weddings, to catfishing, and stories of coming out, nothing is off limits."
      },
      {
        "id": "tvmaze:1030331",
        "title": "Tell All: Part 2",
        "season": 11,
        "episode": 12,
        "released": "2017-01-29",
        "overview": "In the latest two-part installment of Sister Wives Tell All, The Brown Family sits down to discuss this season's celebrations, confessions, and jaw-dropping moments. From weddings, to catfishing, and stories of coming out, nothing is off limits."
      },
      {
        "id": "tvmaze:1376139",
        "title": "Meri Moving",
        "season": 12,
        "episode": 1,
        "released": "2018-01-07",
        "overview": "Mykelti brings Tony's family home to meet her parents, but they don't speak English; Meri and Christine's mom Annie go to Utah for a potential business opportunity."
      },
      {
        "id": "tvmaze:1376578",
        "title": "Groomzilla",
        "season": 12,
        "episode": 2,
        "released": "2018-01-14",
        "overview": "Mykelti, her moms and her fiance Tony go wedding dress shopping; the sister wives go see the bed and breakfast Meri wants to buy in Utah, but worry it will pull her away; Madison shows up with big news, leaving Janelle in tears."
      },
      {
        "id": "tvmaze:1390493",
        "title": "I Will Survive",
        "season": 12,
        "episode": 3,
        "released": "2018-01-21",
        "overview": "It's Mykelti's bridal shower, but Janelle's terrified of performing with the sister wives; Christine gets emotional as she cuts up her wedding dress to make cloth flowers for Mykelti's bouquet; Maddie tells the family her big news."
      },
      {
        "id": "tvmaze:1387117",
        "title": "Meri's Crazy Idea",
        "season": 12,
        "episode": 4,
        "released": "2018-01-28",
        "overview": "Meri has big news about the bed and breakfast she wants to buy, but it's not what the Browns were expecting; Mykelti's wedding rehearsal doesn't go as smoothly as planned."
      },
      {
        "id": "tvmaze:1390519",
        "title": "PolygaMexicamist Wedding",
        "season": 12,
        "episode": 5,
        "released": "2018-02-11",
        "overview": "Mykelti's polygamist family ties the knot with Tony's Mexican Catholic family with a unique winter wedding where they beat bride and groom piñatas; Christine forgets to bring Kody's shirts."
      },
      {
        "id": "tvmaze:1390520",
        "title": "Meeting Mariah's Girlfriend",
        "season": 12,
        "episode": 6,
        "released": "2018-02-18",
        "overview": "Mariah and her girlfriend go to the March for Women in Washington, D.C.; she invites Meri and Janelle to go too, but Kody doesn't like the idea."
      },
      {
        "id": "tvmaze:1413977",
        "title": "Risking Arrest",
        "season": 12,
        "episode": 7,
        "released": "2018-02-25",
        "overview": "The Browns are distraught that the Utah legislature is voting to strengthen the laws against polygamy. Friends are planning a protest march, but if the Browns go back to Utah they could be arrested."
      },
      {
        "id": "tvmaze:1413978",
        "title": "The Truth Comes Out",
        "season": 12,
        "episode": 8,
        "released": "2018-03-04",
        "overview": "Janelle's house is all joy as Maddie has her baby shower. But Christine is devastated when Ysabel's X-rays show that her scoliosis is worsening and surgery is imminent. In desperation they turn to unproven alternative treatments."
      },
      {
        "id": "tvmaze:1420868",
        "title": "The Longest Labor",
        "season": 12,
        "episode": 9,
        "released": "2018-03-11",
        "overview": "Meri takes Kody to check out the B&amp;B, and Maddie goes into labor."
      },
      {
        "id": "tvmaze:1420869",
        "title": "Confronting Meri",
        "season": 12,
        "episode": 10,
        "released": "2018-03-18",
        "overview": "Even as the Sister Wives bask in the glow of their first grandchild, tensions emerge. Meri found out that all the wives were at the birth, except her. Intense therapy sessions fail to resolve the hurt, so Christine confronts Meri with some brutal truths."
      },
      {
        "id": "tvmaze:1437181",
        "title": "Game Night!",
        "season": 12,
        "episode": 11,
        "released": "2018-03-25",
        "overview": "It's game night at the Browns, and it's about to get a little crazy. The family gets competitive as Mykelti and Gwendlyn host Sister Wives trivia. There's lots of noise and chaos, and there's punishments for the losers, so the stakes are high!"
      },
      {
        "id": "tvmaze:1434367",
        "title": "Tell All: Part 1",
        "season": 12,
        "episode": 12,
        "released": "2018-03-25",
        "overview": "Nothing is off limits as the Browns discuss this season's jaw-dropping moments. Has Meri's dream of buying a B&amp;B driven the family even further apart? With Utah's tough new polygamy law, can the Browns ever go home?"
      },
      {
        "id": "tvmaze:1439498",
        "title": "Tell All: Part 2",
        "season": 12,
        "episode": 13,
        "released": "2018-04-01",
        "overview": "In the dramatic conclusion of Sister Wives Tell All, Paedon reveals why he refused to join the rest of the family to protest Utah's new polygamy law. And the adults discuss how Kody and Meri's marriage is affecting the family."
      },
      {
        "id": "tvmaze:1439803",
        "title": "Polygamy 101",
        "season": 12,
        "episode": 14,
        "released": "2018-04-01",
        "overview": "The Sister Wives still get asked a ton of questions about polygamy. How do they feel about their kids not wanting to be polygamists? Do some polygamists sleep in the same bed? Their answers are funny, emotional and often shocking."
      },
      {
        "id": "tvmaze:1580771",
        "title": "Meri, On Her Own...",
        "season": 13,
        "episode": 1,
        "released": "2019-01-20",
        "overview": "Meri's offer on the B&amp;B is accepted! But she doesn't have enough cash for the down payment and asks the family for help. Kody steps up, but later, he realizes he doesn't have the money and reneges, leaving Meri to come up with the money on her own."
      },
      {
        "id": "tvmaze:1592118",
        "title": "Sister Wife Secrets",
        "season": 13,
        "episode": 2,
        "released": "2019-01-27",
        "overview": "Meri finds a way to buy the Bed &amp; Breakfast she wants without Kody or her Sister Wives' help. Then, when Janelle hears that Meri closed on the B&amp;B from a stranger on the street, this precipitates another confrontation."
      },
      {
        "id": "tvmaze:1598589",
        "title": "Kody Wants Out",
        "season": 13,
        "episode": 3,
        "released": "2019-02-10",
        "overview": "Mitch and Aspyn announce their engagement and the race is on to find a venue! Then, the whole family goes to Utah to help with the official opening of Meri's Bed &amp; Breakfast. At the opening, Kody drops a hint of some MAJOR changes ahead."
      },
      {
        "id": "tvmaze:1604939",
        "title": "Kody's Shocking Move",
        "season": 13,
        "episode": 4,
        "released": "2019-02-17",
        "overview": "Aspyn goes wedding dress shopping but after the fun, Kody drops a huge bombshell. With a weird whiteboard presentation, he tells his wives they need to sell their houses and move. Janelle digs in her heels. She's not going to do this to her kids."
      },
      {
        "id": "tvmaze:1608738",
        "title": "Mariah's Big Announcement",
        "season": 13,
        "episode": 5,
        "released": "2019-02-24",
        "overview": "Christine and Meri try to recover the fun relationship they had years ago. Kody and Christine go to check out Flagstaff, AZ. Mariah has something big to announce to the family. Meanwhile Janelle talks to her kids about the move."
      },
      {
        "id": "tvmaze:1612064",
        "title": "Flagstaff Flirtation",
        "season": 13,
        "episode": 6,
        "released": "2019-03-03",
        "overview": "Blocked by some of his wives from moving to Utah, Kody pitches Flagstaff AZ. He takes Meri there to look at land and starts to tell the kids. Mitch and Aspyn are busy preparing their wedding but some younger kids have a meltdown about moving."
      },
      {
        "id": "tvmaze:1616828",
        "title": "Divided We Move",
        "season": 13,
        "episode": 7,
        "released": "2019-03-10",
        "overview": "The Browns go to Flagstaff to look at properties and they are split over which one to buy. Robyn &amp; Christine prefer one and Meri &amp; Kody another. Janelle is the tie breaker and her decision is surprising. They make an offer and the response is sobering."
      },
      {
        "id": "tvmaze:1617984",
        "title": "Aspyn's Royal Wedding",
        "season": 13,
        "episode": 8,
        "released": "2019-03-17",
        "overview": "Aspyn &amp; Mitch are getting married with bagpipes, kilts and lots of flower girls! It's a perfect day but the officiant has lost his voice and the Browns are stressing because they now have to move to Flagstaff within a month!"
      },
      {
        "id": "tvmaze:1617985",
        "title": "Kody's Secret Plan",
        "season": 13,
        "episode": 9,
        "released": "2019-03-24",
        "overview": "The Sister Wives announce to the kids that they've bought land in Flagstaff and they plan to move there within a month. Aspyn asks what void are they trying to fill by moving? And Kody secretly has plans drawn up for one giant polygamist house."
      },
      {
        "id": "tvmaze:1625884",
        "title": "Moving Meltdowns",
        "season": 13,
        "episode": 10,
        "released": "2019-03-31",
        "overview": "Kody sees the plans for his one giant polygamist house and loves them, but will his wives? Just weeks away from leaving their homes in Las Vegas, tensions run high. Robyn presses Kody to settle down and Gabe walks out."
      },
      {
        "id": "tvmaze:1628986",
        "title": "Leaving Las Vegas",
        "season": 13,
        "episode": 11,
        "released": "2019-04-07",
        "overview": "The Brown family is finally moving to Flagstaff. Moving day is chaotic and the dream they are chasing is becoming a nightmare. There's rays of hope, but mostly it's tears as they face an uncertain future and leave so much behind."
      },
      {
        "id": "tvmaze:1636164",
        "title": "Tell All: Part 1",
        "season": 13,
        "episode": 12,
        "released": "2019-04-14",
        "overview": "In Part 1 of Sister Wives Tell All, the Browns are left reeling as frank discussion leads to new insights and emotional meltdowns. Will the family ever settle down in one location? Did Meri's B&amp;B further damage her relationship with Kody?"
      },
      {
        "id": "tvmaze:1638355",
        "title": "Tell All: Part 2",
        "season": 13,
        "episode": 13,
        "released": "2019-04-21",
        "overview": "In the continuation of the most moving Sister Wives Tell All yet, the looming question from part 1 is finally answered; Was Meri's desire to buy the Utah bed and breakfast a way out of the family for good?"
      },
      {
        "id": "tvmaze:1780072",
        "title": "Kicked Out",
        "season": 14,
        "episode": 1,
        "released": "2020-01-05",
        "overview": "It's the Sister Wives' first day unpacking after moving the whole family to Flagstaff. It's pouring rain and the neighbors at Meri's rental have called the police. Was this move a mistake?"
      },
      {
        "id": "tvmaze:1787040",
        "title": "Happier Alone?",
        "season": 14,
        "episode": 2,
        "released": "2020-01-05",
        "overview": "After angry neighbors drive Meri out of Flagstaff, even Kody starts to wonder if the move might be a mistake. The houses in Vegas are not selling and the family is drowning in rents and mortgages. At least the pond on their land gets the kids excited."
      },
      {
        "id": "tvmaze:1785174",
        "title": "Lonely in Flagstaff",
        "season": 14,
        "episode": 3,
        "released": "2020-01-12",
        "overview": "Meri returns to Flagstaff but still feels alone. When she meets the other Sister Wives for lunch, old tensions bubble to the surface. Meanwhile Kody has a plan to reunite the family."
      },
      {
        "id": "tvmaze:1787041",
        "title": "Four Wives, One House?",
        "season": 14,
        "episode": 4,
        "released": "2020-01-19",
        "overview": "On Christmas Eve, Kody finally presents to his family his pitch for all four wives to live in one big house. Janelle actually likes the idea, but Christine is dead set against it. Merry Christmas!"
      },
      {
        "id": "tvmaze:1790340",
        "title": "A Not So Merry Christmas",
        "season": 14,
        "episode": 5,
        "released": "2020-01-26",
        "overview": "It's Christmas and the family is divided over Kody's pitch to live in one house. There's a big surprise when a pregnancy is revealed. Later the family confronts the fact that their houses in Vegas are not selling. Their finances are at a breaking point."
      },
      {
        "id": "tvmaze:1797745",
        "title": "An Awkward Valentine's Day",
        "season": 14,
        "episode": 6,
        "released": "2020-02-09",
        "overview": "Kody pushes the idea of building one big house, but the Sister Wives are divided. Then it's Valentine's Day a very awkward holiday for a polygamist. Lastly, at Kody's birthday party, Mariah and her girlfriend show up with a major announcement!"
      },
      {
        "id": "tvmaze:1800737",
        "title": "Why Not One House?",
        "season": 14,
        "episode": 7,
        "released": "2020-02-16",
        "overview": "Janelle moves (again!) to be closer to her Sister Wives. Kody won't let go of his dream to live all under one roof but the wives can't agree to do it. Robyn wonders if they have failed as polygamists if they can't live together."
      },
      {
        "id": "tvmaze:1800738",
        "title": "Doubting Polygamy",
        "season": 14,
        "episode": 8,
        "released": "2020-02-23",
        "overview": "Kody tells his friend Kyle, a polygamist who's first wife left him, that he is feeling jaded about polygamy. Kody's wives are refusing to all live under one roof and the roller-coaster ride of houses sold, lost and stalled has everyone at a boiling point."
      },
      {
        "id": "tvmaze:1805124",
        "title": "This Land Is Your Land...or Hers?",
        "season": 14,
        "episode": 9,
        "released": "2020-03-01",
        "overview": "Robyn, Meri and Kody have a huge fight over who will get which piece of land. Janelle worries the whole family won't get access to the pond. Tempers flare and everyone is lashing out at everyone else in the worst fight the family has ever had."
      },
      {
        "id": "tvmaze:1807869",
        "title": "A Breaking Point",
        "season": 14,
        "episode": 10,
        "released": "2020-03-08",
        "overview": "Just as Robyn's family has adjusted to Flagstaff they learn that the owner is selling their rental house. They have 60 days to leave. Robyn and Kody fight in front of the kids over it and Aurora has a full-on panic attack perhaps her worst ever."
      },
      {
        "id": "tvmaze:1811632",
        "title": "Being Gay and Religious",
        "season": 14,
        "episode": 11,
        "released": "2020-03-15",
        "overview": "The Sister Wives visit Mariah and her fiancée, Audrey, in Chicago. Meri opens up about how badly she behaved when Mariah first came out as gay and Mariah confesses about her struggles growing up gay in their polygamist church."
      },
      {
        "id": "tvmaze:1815222",
        "title": "Robyn vs. Kody",
        "season": 14,
        "episode": 12,
        "released": "2020-03-22",
        "overview": "Robyn's rental house has been sold out from under her and she has only 28 days to find a new home. There are no rentals and tensions run high as Kody insists they buy. Not wanting to slow down building homes on Coyote Pass, Robyn refuses. It's an impasse."
      },
      {
        "id": "tvmaze:1818161",
        "title": "The Heat Is On",
        "season": 14,
        "episode": 13,
        "released": "2020-03-29",
        "overview": "A forest fire is bearing down on Meri's house and she's freaking out. Meri prepares to evacuate. Robyn is just days away from losing her rental and tensions are high with Kody. Lastly, Madison is having contractions and thinks the baby is coming tonight!"
      },
      {
        "id": "tvmaze:1825184",
        "title": "Baby Steps",
        "season": 14,
        "episode": 14,
        "released": "2020-04-05",
        "overview": "Maddie thinks she's in labor, but it's a false alarm, so Kody heads back to Flagstaff. Kody and Robyn are at wits' end over their struggle to close on her house. Then, Kody and Meri head to their therapist in Vegas, where the brutal truth comes out."
      },
      {
        "id": "tvmaze:1827074",
        "title": "Two Moms, Their Daughter, and a Baby",
        "season": 14,
        "episode": 15,
        "released": "2020-04-12",
        "overview": "Kody and Robyn are struggling with the bank as the mortgage process is not designed for plural marriage. Then in North Carolina, Maddie's water breaks - at the mall. Evie K is born, but when she has problems breathing, an ambulance is called."
      },
      {
        "id": "tvmaze:2022285",
        "title": "Being Strong Or Being A Bitch",
        "season": 15,
        "episode": 1,
        "released": "2021-02-14",
        "overview": "Janelle gathers Kody and the wives to talk about their increasingly tense family dynamic. Kody gets honest and says he doesn't want to advocate for polygamy anymore, and Robyn and Christine open up about their own insecurities as they question everything."
      },
      {
        "id": "tvmaze:2028986",
        "title": "Felons No More",
        "season": 15,
        "episode": 2,
        "released": "2021-02-21",
        "overview": "The Browns visit their polygamist friends to discuss the sudden and exciting possibility that polygamy will be decriminalized in Utah. The car trip to get there is a mess, but once there, the excitement is palpable. Could the family relocate back to Utah?"
      },
      {
        "id": "tvmaze:2032591",
        "title": "Robyn The Peacemaker",
        "season": 15,
        "episode": 3,
        "released": "2021-02-28",
        "overview": "Mariah and Audrey are in town and share an exciting announcement with the family. Robyn tries to help Kody patch things up with Meri after their big fight on the property, but Kody pushes back and doesn't seem interested in fixing things."
      },
      {
        "id": "tvmaze:2037437",
        "title": "The Basement Wife",
        "season": 15,
        "episode": 4,
        "released": "2021-03-07",
        "overview": "Robyn questions why Christine said the family \"hates\" her when they all gather. Mariah and Audrey look at wedding venues, and they say that anyone who disapproves of their same-sex marriage isn't invited. Then, COVID-19 fears sweep the country."
      },
      {
        "id": "tvmaze:2040854",
        "title": "Polygamists In A Pandemic",
        "season": 15,
        "episode": 5,
        "released": "2021-03-14",
        "overview": "Kody and the wives struggle to adapt to the pandemic as a polygamous family. Robyn is terrified for her children's health, and Janelle tearfully tells Kody to stay away. As he decides where he'll quarantine, Kody teaches the kids how to save toilet paper."
      },
      {
        "id": "tvmaze:2043831",
        "title": "Different Wives, Different Rules",
        "season": 15,
        "episode": 6,
        "released": "2021-03-21",
        "overview": "Utah has decriminalized polygamy, and Christine toys with the idea of moving back. Meanwhile, coronavirus cases are rising, and Arizona goes into lockdown. Janelle tells Kody to stop coming over, and the whole family grapples with how to handle it all."
      },
      {
        "id": "tvmaze:2048127",
        "title": "Birthday Breakdown",
        "season": 15,
        "episode": 7,
        "released": "2021-03-28",
        "overview": "It's the month of birthdays in the Brown family, but COVID-19 has disrupted celebrations. With Kody and Meri not communicating, he's surprised to learn that Mariah and Audrey have gone to run the B&amp;B to protect Meri's mom."
      },
      {
        "id": "tvmaze:2051638",
        "title": "Can I Light You Up?",
        "season": 15,
        "episode": 8,
        "released": "2021-04-04",
        "overview": "Kody finally returns to Janelle's house, but the larger family conflict over COVID-19 rules continues to grow; it's Kody and Meri's 30th anniversary, and Kody shows no interest in rekindling a romance, despite Meri's intense interest."
      },
      {
        "id": "tvmaze:2055805",
        "title": "A Family Stuck",
        "season": 15,
        "episode": 9,
        "released": "2021-04-11",
        "overview": "The Brown family is having problems communicating, and when Janelle sets out to resolve things, it's apparent that maybe some things can't be fixed. Then, Robyn opens up to Kody about having more children."
      },
      {
        "id": "tvmaze:2070106",
        "title": "Polygamy Hell",
        "season": 15,
        "episode": 10,
        "released": "2021-04-18",
        "overview": "The wives take sides, and conflict grows over Kody's COVID-19 rules. Janelle's efforts to improve communication reveal that Kody is losing faith in his wives ever getting along. Christine makes a shocking confession that could impact the entire family."
      },
      {
        "id": "tvmaze:2074212",
        "title": "Everything's Upside Down",
        "season": 15,
        "episode": 11,
        "released": "2021-04-18",
        "overview": "The pandemic is pulling the Brown family apart, and tensions rise. Kody refuses to travel with Christine for Ysabel's surgery. Then, Christine gathers the wives for a pitch to move back to Utah, which ends in tears as she questions her marriage to Kody."
      },
      {
        "id": "tvmaze:2213104",
        "title": "There's No Me in Polgamy",
        "season": 16,
        "episode": 1,
        "released": "2021-11-21",
        "overview": "After rejecting Christine's idea of moving back to Utah, Kody checks in with Janelle and Robyn. Then, Kody says he now wants his own lot on the property, and the family discusses the possibility of spending the holidays apart."
      },
      {
        "id": "tvmaze:2216869",
        "title": "Four Wives, Three Fires",
        "season": 16,
        "episode": 2,
        "released": "2021-11-28",
        "overview": "Janelle's kids have strong opinions about Kody's COVID rules, and Kody makes a surprise visit to Meri's. Then, Kody organizes an outdoor get-together for the whole family -- their first time seeing each other in months."
      },
      {
        "id": "tvmaze:2221100",
        "title": "Not Social But Very Distant",
        "season": 16,
        "episode": 3,
        "released": "2021-12-05",
        "overview": "The wives come to a major decision about the property lots. Christine is leaving to take Ysabel to New Jersey for surgery, but Kody's refusal to go leaves Christine angry. Then, a member of the family has a big announcement."
      },
      {
        "id": "tvmaze:2227756",
        "title": "Cistern Wives",
        "season": 16,
        "episode": 4,
        "released": "2021-12-12",
        "overview": "Meri and Janelle talk through old wounds after the family spins off in four directions: Christine takes Ysabel to have surgery in New Jersey, Janelle helps out while Evie gets foot surgery in North Carolina, Meri is in Utah, and Kody and Robyn stay home."
      },
      {
        "id": "tvmaze:2232269",
        "title": "Sad Sorry Lonely Little People",
        "season": 16,
        "episode": 5,
        "released": "2021-12-19",
        "overview": "Christine and Kody's daughter Ysabel has surgery in New Jersey to correct her scoliosis. The recovery is far more intense than anyone expected, and Kody's absence upsets Christine."
      },
      {
        "id": "tvmaze:2237011",
        "title": "No Head Wife",
        "season": 16,
        "episode": 6,
        "released": "2021-12-26",
        "overview": "Christine questions why a nanny is allowed around Robyn's kids when her family is not, so Kody produces a long list of COVID rules that the nanny follows. Janelle thinks some of it is ridiculous, but the wives wonder why they didn't get this list sooner."
      },
      {
        "id": "tvmaze:2240862",
        "title": "Choosing Kids Over Kody",
        "season": 16,
        "episode": 7,
        "released": "2022-01-02",
        "overview": "Janelle's kids blow up and call Kody's COVID rules \"stupid.\" Later, at a family meeting to plan the holidays, Kody tries to persuade some of his wives to stay in town and follow his rules. Janelle walks out on him, angry and cursing."
      },
      {
        "id": "tvmaze:2244250",
        "title": "Two Cliques",
        "season": 16,
        "episode": 8,
        "released": "2022-01-09",
        "overview": "The Brown family grows more divided than ever; Christine and Janelle must choose between seeing Kody and seeing their older children; Robyn and Meri follow Kody's COVID rules so they can have Thanksgiving with him."
      },
      {
        "id": "tvmaze:2255928",
        "title": "The Teflon Queen",
        "season": 16,
        "episode": 9,
        "released": "2022-01-16",
        "overview": "Kody faces off with his sons Gabe and Garrison, and they trade blame over COVID restrictions. Then, Janelle suffers a huge loss as Christmas is approaching. The family hopes they will all test negative and finally be together."
      },
      {
        "id": "tvmaze:2257938",
        "title": "The Beginning of the End",
        "season": 16,
        "episode": 10,
        "released": "2022-01-23",
        "overview": "After a family gathering, the Brown family has their first COVID exposure. A conversation with Kody is the last straw for Christine, and when he returns to her house, he finds his belongings boxed in the garage."
      },
      {
        "id": "tvmaze:2268472",
        "title": "One on One: Part 1",
        "season": 16,
        "episode": 11,
        "released": "2022-01-30",
        "overview": "The Browns sit down individually to talk about their most contentious season yet. Kody, Christine and Meri answer burning questions about the current state of their relationships, and the rest of the family discusses the challenges brought on by COVID."
      },
      {
        "id": "tvmaze:2269188",
        "title": "One on One: Part 2",
        "season": 16,
        "episode": 12,
        "released": "2022-02-06",
        "overview": "The Brown family continues to speak one-on-one with host Sukanya Krishnan about the highs and lows of last year. Christine discusses being a basement wife, while Robyn reveals her struggle for acceptance within the family."
      },
      {
        "id": "tvmaze:2273063",
        "title": "One on One: Part 3",
        "season": 16,
        "episode": 13,
        "released": "2022-02-20",
        "overview": "In this final episode of one-on-one interviews, Kody and Christine share shocking news that will change the family dynamic forever as the other wives weigh in on how it affects their future."
      },
      {
        "id": "tvmaze:2372127",
        "title": "It's Over",
        "season": 17,
        "episode": 1,
        "released": "2022-09-11",
        "overview": "Janelle tests positive for COVID-19; Kody confides in Robyn about his troubles with Christine; Kody and Christine sit down to have a tense discussion about the future of their marriage, which leaves Christine feeling empowered and Kody defeated."
      },
      {
        "id": "tvmaze:2388199",
        "title": "Is There a Favorite Wife?",
        "season": 17,
        "episode": 2,
        "released": "2022-09-18",
        "overview": "While Janelle's household fights through COVID-19, Ysabel has exciting news about her future. Then, Christine reveals her plans to move to Salt Lake City with Truely as Kody struggles to let go."
      },
      {
        "id": "tvmaze:2398731",
        "title": "The Labors of Life",
        "season": 17,
        "episode": 3,
        "released": "2022-09-25",
        "overview": "As schools begin to open up, Janelle challenges Kody about getting things back to normal. Then, Christine travels to St. George, Utah, to be with Mykelti as she gives birth, and Meri suffers a devastating loss."
      },
      {
        "id": "tvmaze:2398732",
        "title": "And Then There Were Three",
        "season": 17,
        "episode": 4,
        "released": "2022-10-02",
        "overview": "Janelle makes a major decision about her living situation without telling Kody. The family disagrees about the kids returning back to school. Then, Christine gathers her sister wives to reveal that she's divorcing Kody."
      },
      {
        "id": "tvmaze:2409167",
        "title": "The Last Family Gathering",
        "season": 17,
        "episode": 5,
        "released": "2022-10-09",
        "overview": "Kody worries about tight quarters after touring Janelle's new RV, and Meri feels hurt when Kody suggests she move away to run the bed and breakfast full time. Then, the family reunites for Ysabel's graduation party with a bittersweet celebration."
      },
      {
        "id": "tvmaze:2415913",
        "title": "Telling Truely",
        "season": 17,
        "episode": 6,
        "released": "2022-10-16",
        "overview": "As Ysabel packs up for college, Gwedolyn opens up about her sexuality. Christine reveals her moving timeline, and Kody pushes back. Then, after an overheard conversation, Christine tells Truely about the divorce."
      },
      {
        "id": "tvmaze:2419538",
        "title": "The Failed Priest",
        "season": 17,
        "episode": 7,
        "released": "2022-10-23",
        "overview": "Kody feels conflicted officiating a wedding while going through a divorce. Christine and Janelle are floored as Kody breaks COVID protocols for his friend but not his family. Kody and Christine argue over selling her house and the custody agreement."
      },
      {
        "id": "tvmaze:2423266",
        "title": "Hang on With Me",
        "season": 17,
        "episode": 8,
        "released": "2022-10-30",
        "overview": "Kody deals with the divorce fallout as Christine prepares to leave Flagstaff. Meri and Robyn have a heart-to-heart about the future of the family, and Ysabel heads off to college."
      },
      {
        "id": "tvmaze:2426022",
        "title": "A Polygamist Divorce",
        "season": 17,
        "episode": 9,
        "released": "2022-11-06",
        "overview": "After dropping off Ysabel in North Carolina, Christine tells her emotional sister wives that her house is under contract and she's moving to Utah in a week. Then, Kody reveals that he no longer considers himself married to Meri."
      },
      {
        "id": "tvmaze:2431307",
        "title": "The Knife in the Kidneys",
        "season": 17,
        "episode": 10,
        "released": "2022-11-13",
        "overview": "Christine's big announcement that she's leaving in a week causes chaos as Robyn questions her future relationship with her former sister wife and Kody explodes. As they all try to pick up the pieces, Janelle's RV lifestyle hits another obstacle."
      },
      {
        "id": "tvmaze:2435084",
        "title": "The Worst Goodbye",
        "season": 17,
        "episode": 11,
        "released": "2022-11-20",
        "overview": "Christine reveals that she's open to getting married again someday. Janelle frustrates Kody when she makes another change to her living situation. After packing up Christine's house, Mykelti urges the family to get together for one last awkward goodbye."
      },
      {
        "id": "tvmaze:2438296",
        "title": "Life After Polygamy",
        "season": 17,
        "episode": 12,
        "released": "2022-11-27",
        "overview": "Christine and Kody have a final battle about a snowblower on her way out the door to move to Utah. When Christine's house sale falls through, Kody wants Janelle to buy it, much to her dismay."
      },
      {
        "id": "tvmaze:2442525",
        "title": "Coronapocalypse",
        "season": 17,
        "episode": 13,
        "released": "2022-12-04",
        "overview": "Now that Christine has left the family, big problems with Kody and Janelle's marriage bubble to the surface. Before they can address them, however, Kody and Robyn both get COVID-19. Robyn ends up in the hospital wondering if she's going to survive."
      },
      {
        "id": "tvmaze:2446316",
        "title": "Which Wife Is Next",
        "season": 17,
        "episode": 14,
        "released": "2022-12-11",
        "overview": "Kody have another tense conversation at Robyn's. Janelle feels Kody is making her choose between him and her kids, and they reach a breaking point."
      },
      {
        "id": "tvmaze:2449170",
        "title": "One on One: Part 1",
        "season": 17,
        "episode": 15,
        "released": "2022-12-18",
        "overview": "The Brown family sits down individually to discuss the challenges they have faced over the past year. Kody and Christine give insight about their separation, while Meri learns of an instance when Kody thought about reconciling."
      },
      {
        "id": "tvmaze:2455935",
        "title": "One on One: Part 2",
        "season": 17,
        "episode": 16,
        "released": "2023-01-01",
        "overview": "As the sit-downs continue, the Browns reveal difficulties that go back decades, including a short time where Janelle left the family. The family discusses Kody's meltdown, and Robyn shares anger over the lack of support from her sister wives."
      },
      {
        "id": "tvmaze:2455936",
        "title": "One on One: Part 3",
        "season": 17,
        "episode": 17,
        "released": "2023-01-08",
        "overview": "In this final episode of one-on-one interviews, Kody is confronted with the question of whether he has a \"favorite wife.\" Then, Kody and Janelle open up about the conflict over holidays and reveal the status of their relationship."
      },
      {
        "id": "tvmaze:2595913",
        "title": "No Such Thing as a Free Lunch",
        "season": 18,
        "episode": 1,
        "released": "2023-08-20",
        "overview": "Christine has moved, but the fallout from her divorce remains; Janelle, Meri and Robyn struggle to plan the upcoming holidays as the family continues to be divided; things get tense when Kody and Christine sit down for the first time since she left."
      },
      {
        "id": "tvmaze:2624090",
        "title": "Thanks for Nothing",
        "season": 18,
        "episode": 2,
        "released": "2023-08-27",
        "overview": "Christine and Kody struggle to keep things cordial. Kody regrets the family being separated at Thanksgiving. Paedon updates Christine on Robyn and the kids."
      },
      {
        "id": "tvmaze:2628281",
        "title": "Throwing Stones in Glass Houses",
        "season": 18,
        "episode": 3,
        "released": "2023-09-03",
        "overview": "Kody vents to friends about his anger over his divorce. Janelle's sons are still not talking to Kody, and the family may celebrate another holiday separately. A discussion about Christmas blows up into the worst fight Janelle and Kody have ever had."
      },
      {
        "id": "tvmaze:2634147",
        "title": "A Deal With the Devil",
        "season": 18,
        "episode": 4,
        "released": "2023-09-10",
        "overview": "Kody confides in a friend who has also gone through a polygamist divorce, and he contemplates giving up on plural marriage. While Janelle is still reeling from the huge fight she had with Kody, the family once again celebrates Christmas separately."
      },
      {
        "id": "tvmaze:2634148",
        "title": "When the Going Gets Tough",
        "season": 18,
        "episode": 5,
        "released": "2023-09-17",
        "overview": "The Browns discuss how things went over Christmas; Janelle confesses to Christine that she doesn't know if her marriage can be fixed; Robyn and Meri try to dissect what went wrong and reveal that Kody was not always equal with his time."
      },
      {
        "id": "tvmaze:2644010",
        "title": "The Understatement of the Year",
        "season": 18,
        "episode": 6,
        "released": "2023-09-24",
        "overview": "Christine reveals she's hired a matchmaker. Meri makes plans to move her business but worries about how Robyn will take the news. Janelle meets with Kody for the first time since their huge fight and asks if he still wants a plural marriage."
      },
      {
        "id": "tvmaze:2649078",
        "title": "Throwing in the Towel",
        "season": 18,
        "episode": 7,
        "released": "2023-10-01",
        "overview": "Janelle meets with Christine and reveals that she doesn't want to be married any more. Meri nervously tells Robyn that she's moving her clothing business to Parowan, Utah, and will spend less time in Flagstaff, believing Kody is done with her."
      },
      {
        "id": "tvmaze:2661301",
        "title": "The Writing Is on the Wall",
        "season": 18,
        "episode": 8,
        "released": "2023-10-08",
        "overview": "Kody takes Janelle out for her birthday and talks about wanting to start over. Meri reveals to Kody that she's moving her clothing business to Utah but not giving up on their relationship, and his reaction is worse than she expected."
      },
      {
        "id": "tvmaze:2666476",
        "title": "Battle Lines Are Drawn",
        "season": 18,
        "episode": 9,
        "released": "2023-10-15",
        "overview": "Janelle, Christine and their older kids gather for dinner, and things get intense as they express their frustrations about Kody and Robyn. Then, Christine celebrates her ex-anniversary with friends."
      },
      {
        "id": "tvmaze:2670692",
        "title": "Don't Put All Your Eggs in One Basket",
        "season": 18,
        "episode": 10,
        "released": "2023-10-22",
        "overview": "Christine is excited to celebrate her first Easter since divorcing Kody; Janelle says her life is better without Kody, but reveals she would consider polygamy again; after learning Aurora is interested in a boy, Meri reflects on marrying so young."
      },
      {
        "id": "tvmaze:2675571",
        "title": "Airing the Dirty Laundry",
        "season": 18,
        "episode": 11,
        "released": "2023-10-29",
        "overview": "Christine is ecstatic when Mykelti tells her she's having twins. Then, Meri reveals that while out for their anniversary, Kody finally admitted he no longer wants a relationship with her, and she is forced to consider ending her marriage for good."
      },
      {
        "id": "tvmaze:2675573",
        "title": "Can't See the Forest",
        "season": 18,
        "episode": 12,
        "released": "2023-11-05",
        "overview": "Christine throws a 1950s-themed party for her 50th birthday and admits she's dating again. Kody checks out Janelle's new apartment but realizes she's planning a future without him. Meri worries about big changes in her life with both the B&amp;B and Kody."
      },
      {
        "id": "tvmaze:2675574",
        "title": "The Elephant in the Room",
        "season": 18,
        "episode": 13,
        "released": "2023-11-12",
        "overview": "Kody and Robyn reunite with Janelle and Christine on a family video call to reveal the gender of Mykelti's twins; in Parowan, Meri continues to struggle with the decision about her marriage; Christine and Janelle head out on a road trip to Idaho."
      },
      {
        "id": "tvmaze:2675575",
        "title": "It's Always Darkest Before Dawn",
        "season": 18,
        "episode": 14,
        "released": "2023-11-19",
        "overview": "Christine talks with her brothers about her newfound happiness and hopes to inspire Janelle, but Janelle won't let go of the past. At Coyote Pass, Robyn is devastated when she learns that this is finally the end of the road for Meri and Kody."
      },
      {
        "id": "tvmaze:2691103",
        "title": "One on One: Part 1",
        "season": 18,
        "episode": 15,
        "released": "2023-11-26",
        "overview": "The Brown family sits down individually to discuss the challenges they have faced over the past year. Kody and Christine give insight about their separation, while Meri learns of an instance when Kody thought about reconciling."
      },
      {
        "id": "tvmaze:2691104",
        "title": "One on One: Part 2",
        "season": 18,
        "episode": 16,
        "released": "2023-12-03",
        "overview": "As the sit-downs continue, the Browns reveal difficulties that go back decades, including a short time where Janelle left the family. The family discusses Kody's meltdown, and Robyn shares anger over the lack of support from her sister wives."
      },
      {
        "id": "tvmaze:2692499",
        "title": "One on One: Part 3",
        "season": 18,
        "episode": 17,
        "released": "2023-12-10",
        "overview": "In this final episode of one-on-one interviews, Kody is confronted with the question of whether he has a \"favorite wife.\" Then, Kody and Janelle open up about the conflict over holidays and reveal the status of their relationship."
      },
      {
        "id": "tvmaze:2697045",
        "title": "One on One: Part 4",
        "season": 18,
        "episode": 18,
        "released": "2023-12-17",
        "overview": "In the final episode of this interview special, Robyn discusses coming to terms with monogamy and what she needs to move on. Christine introduces her new fiancé, David, and the couple shares the events that led to their engagement."
      },
      {
        "id": "tvmaze:2697048",
        "title": "Christine and David's Wedding: Part 1",
        "season": 18,
        "episode": 19,
        "released": "2024-01-07",
        "overview": "After years of struggling in her plural marriage to Kody, Christine Brown has met the love of her life: David Woolley. After a year-long courtship, they are getting married! Set against a majestic Utah backdrop, Christine gets the wedding of her dreams."
      },
      {
        "id": "tvmaze:2697049",
        "title": "Christine and David's Wedding: Part 2",
        "season": 18,
        "episode": 20,
        "released": "2024-01-14",
        "overview": "Christine Brown and David Woolley are getting married in a lavish ceremony set against the red cliffs of the Utah desert, and you are invited. Christine will finally get the wedding she never had when she became Kody Brown's third wife decades ago."
      },
      {
        "id": "tvmaze:2979643",
        "title": "A House Divided Cannot Stand",
        "season": 19,
        "episode": 1,
        "released": "2024-09-15",
        "overview": "Things get awkward as Kody, Robyn and Christine see each other for the first time in months at Mykelti's baby sprinkle. Meri tells her friend Brandi that she's done with Kody. Janelle reveals that she's looking at buying property in Montana."
      },
      {
        "id": "tvmaze:2989737",
        "title": "Let There Be Light",
        "season": 19,
        "episode": 2,
        "released": "2024-09-22",
        "overview": "Janelle considers leaving Flagstaff for good as she and Maddie look at land in Montana. Kody learns that Meri is asking their church for a \"release,\" their religion's word for a divorce. Christine and Aspyn throw Ysabel a welcome home party."
      },
      {
        "id": "tvmaze:3002874",
        "title": "Am I My Brother's Keeper",
        "season": 19,
        "episode": 3,
        "released": "2024-09-29",
        "overview": "Christine and Robyn reunite in the waiting room as Mykelti welcomes her twins. At a game night with Robyn and their kids, Kody reflects on his 3 failed marriages."
      },
      {
        "id": "tvmaze:3002875",
        "title": "How the Mighty Have Fallen",
        "season": 19,
        "episode": 4,
        "released": "2024-10-06",
        "overview": "The Brown family spends Thanksgiving apart. Christine and Robyn put their differences aside to visit Mykelti's newborns. Then, Christine reveals that she went on a promising first date."
      },
      {
        "id": "tvmaze:3013760",
        "title": "The Year of Release",
        "season": 19,
        "episode": 5,
        "released": "2024-10-13",
        "overview": "Meri asks the church for a release from her marriage to Kody. Christine is excited about her second date with David. Mykelti reveals she ate her placenta. Robyn is left in tears on Christmas."
      },
      {
        "id": "tvmaze:3013761",
        "title": "He Delivered Me From All My Fears",
        "season": 19,
        "episode": 6,
        "released": "2024-10-20",
        "overview": "The Browns spend Christmas apart; Christine talks with her kids about her new boyfriend, David, in a heated sit down, Kody blames Meri for their divorce; Janelle wants to settle the property dispute with Kody and move on."
      },
      {
        "id": "tvmaze:3027895",
        "title": "Labor of Love",
        "season": 19,
        "episode": 7,
        "released": "2024-10-27",
        "overview": "Kody helps Meri prepare to move away, and they joke about their divorce. Christine and David look at wedding venues after only two months of dating, which leaves her kids thinking things are moving too fast."
      },
      {
        "id": "tvmaze:3027896",
        "title": "A Wolf in Sheep's Clothing",
        "season": 19,
        "episode": 8,
        "released": "2024-11-03",
        "overview": "Kody suggests reconciling with Janelle, but she flatly refuses when he continues to prioritize Robyn; Christine introduces her boyfriend David to more of her children, before they head out ring shopping."
      },
      {
        "id": "tvmaze:3032325",
        "title": "Baptism by Fire",
        "season": 19,
        "episode": 9,
        "released": "2024-11-10",
        "overview": "Janelle warns Meri on trusting Kody about the Coyote Pass property. Despite only dating a few months, Christine and David go house shopping. The family gathers for Gwendlyn's bridal shower, and Kody awkwardly meets David."
      },
      {
        "id": "tvmaze:3034195",
        "title": "A Man After My Own Heart",
        "season": 19,
        "episode": 10,
        "released": "2024-11-17",
        "overview": "Christine and David's relationship continues at light speed when they go off-roading in Moab and David gets down on one knee. Ysabel is in tears over fears of losing her dad. Meri asks Kody to help her move to Parowan."
      },
      {
        "id": "tvmaze:3043862",
        "title": "The Eleventh Hour",
        "season": 19,
        "episode": 11,
        "released": "2024-11-24",
        "overview": "Kody sobs after helping Meri move away from Flagstaff, leaving Meri confused about why he has pushed her away for so many years. David and Christine gather their kids to announce their engagement, and Janelle meets David."
      },
      {
        "id": "tvmaze:3044934",
        "title": "Put Your House in Order",
        "season": 19,
        "episode": 12,
        "released": "2024-12-01",
        "overview": "As the deadline to pay off Coyote Pass looms, tensions rise over how the family will divide the property. Meri takes an empowering solo trip to England. Christine and Janelle host a graduation party for Savannah."
      },
      {
        "id": "tvmaze:3058443",
        "title": "Give Up the Ghost",
        "season": 19,
        "episode": 13,
        "released": "2024-12-08",
        "overview": "Christine goes shopping for her dream wedding dress; Meri meets with two of her friends and struggles to come to grips with her new reality; Aurora and Breanna approach Robyn about returning to church."
      },
      {
        "id": "tvmaze:3063588",
        "title": "The Truth Will Set You Free",
        "season": 19,
        "episode": 14,
        "released": "2024-12-15",
        "overview": "Kody and Robyn go on a date. Christine and David host an engagement party with some very messy tacos. Meri and Jenn visit Brandi in Las Vegas to dish about her spiritual release from Kody."
      },
      {
        "id": "tvmaze:3077102",
        "title": "Faith Can Move Mountains",
        "season": 19,
        "episode": 15,
        "released": "2024-12-29",
        "overview": "Robyn's girls explore non-mormon churches and Kody struggles to keep quiet about it. Christine tries on her fairytale wedding dress, and the party continues with a wedding shower. Meri wants to start dating soon."
      },
      {
        "id": "tvmaze:3077103",
        "title": "A Time to Weep, a Time to Laugh",
        "season": 19,
        "episode": 16,
        "released": "2025-01-05",
        "overview": "Meri cuts up a quilt that celebrated her marriage to Kody. Christine and David are in Moab preparing for their magical day. Robyn and Kody have a difficult conversation about the breakup of the family."
      },
      {
        "id": "tvmaze:3085015",
        "title": "Love Is Patient, Love Is Kind",
        "season": 19,
        "episode": 17,
        "released": "2025-01-12",
        "overview": "The day is finally here that Christine is getting married! It's a joyful event on the banks of the Colorado River as Christine and David say, \"I do.\" Kody discusses missing out on the Brown family celebration."
      },
      {
        "id": "tvmaze:3095674",
        "title": "Money Is the Root of All Evil",
        "season": 19,
        "episode": 18,
        "released": "2025-01-19",
        "overview": "Christine and Janelle each reveal big new chapters in their lives. Kody meets with a realtor at Coyote Pass. Meri has a new companion in her life, and considers meeting with a lawyer about the property."
      },
      {
        "id": "tvmaze:3095675",
        "title": "Behold I Come Like a Thief",
        "season": 19,
        "episode": 19,
        "released": "2025-01-26",
        "overview": "Janelle and Meri join forces to finally get answers about Coyote Pass, but Kody is having doubts about letting it go. Christine takes another step towards independence and buys a vacation rental in Moab."
      },
      {
        "id": "tvmaze:3114659",
        "title": "For Everything There Is a Season",
        "season": 19,
        "episode": 20,
        "released": "2025-02-02",
        "overview": "On a road trip across the country to move Janelle to North Carolina, Christine, Janelle and David stop at a bar where Janelle has her first shot ever. The fate of Meri's B&amp;B is up in the air, and Kody and Robyn have a heart to heart with Aurora."
      },
      {
        "id": "tvmaze:3181449",
        "title": "The Land of Milk and Honey?",
        "season": 19,
        "episode": 21,
        "released": "2025-04-20",
        "overview": "With Christine's help, Janelle moves her life from Flagstaff to North Carolina and sees the land that she purchased sight unseen; Meri questions her entire relationship with Robyn; Kody prepares to baptize Aurora into a new church."
      },
      {
        "id": "tvmaze:3202547",
        "title": "Love Covers All Wrongs",
        "season": 19,
        "episode": 22,
        "released": "2025-04-27",
        "overview": "Christine is excited to spend her first monogamous Valentine's Day with David. Meri and Janelle meet at Coyote Pass to discuss a strategy moving forward. Robyn and Kody discuss not being polygamists anymore."
      },
      {
        "id": "tvmaze:3202548",
        "title": "The Stars Will Fall From the Sky",
        "season": 19,
        "episode": 23,
        "released": "2025-05-04",
        "overview": "As Christine's new dynamic with David continues to flourish, she realizes that she was more alone with Kody than she understood. Meri and Jenn discuss what's next after closing the B&amp;B. Then, tragedy of unimaginable proportions strikes the Brown family."
      },
      {
        "id": "tvmaze:3214782",
        "title": "Blessed Are Those Who Mourn",
        "season": 19,
        "episode": 24,
        "released": "2025-05-11",
        "overview": "Janelle visits the Flagstaff Humane Society to view a plaque that they have dedicated to her son Garrison. Kody and Robyn's family travels to Wyoming where the rest of the Browns will eventually join them for his burial."
      },
      {
        "id": "tvmaze:3214783",
        "title": "He Heals the Brokenhearted",
        "season": 19,
        "episode": 25,
        "released": "2025-05-18",
        "overview": "The family has gathered in Wyoming to honor Garrison and lay him to rest in the family plot next to his grandparents. Kody digs a grave for his son's ashes and the family says their goodbyes."
      },
      {
        "id": "tvmaze:3234303",
        "title": "One-on-One Part 1",
        "season": 19,
        "episode": 26,
        "released": "2025-05-25",
        "overview": "The Brown family sit down individually to discuss their past and future. As Christine says she tried to make her relationship with Kody work, he says that the wives all had the same chances as Robyn. The family comments on Meri's legal divorce from Kody."
      },
      {
        "id": "tvmaze:3234304",
        "title": "One-on-One Part 2",
        "season": 19,
        "episode": 27,
        "released": "2025-06-01",
        "overview": "As the One-on-One conversations continue, Janelle opens up about her dislike for both Kody and Robyn. Christine discusses her issue with the term \"favorite ex-wife,\" and Kody considers a guy trip with David."
      },
      {
        "id": "tvmaze:3247839",
        "title": "One-on-One Part 3",
        "season": 19,
        "episode": 28,
        "released": "2025-06-08",
        "overview": "In part three of this One-on-One interview special, Meri discusses her distrust over Coyote Pass. Janelle describes button pushing and defines love bombing while Suki asks the big question, \"Who gets the luggage rack?\""
      },
      {
        "id": "tvmaze:3247840",
        "title": "One-on-One Part 4",
        "season": 19,
        "episode": 29,
        "released": "2025-06-15",
        "overview": "In this final episode of the One-on-One interviews, David gives his thoughts on polygamy and the role men play within it. Kody discusses a college secret he kept from Christine and Janelle, as Christine wonders what else could have been kept from her."
      },
      {
        "id": "tvmaze:3336632",
        "title": "Why I Want To Be a Monogamist",
        "season": 20,
        "episode": 1,
        "released": "2025-09-28",
        "overview": "Christine and David visit Janelle in North Carolina to celebrate the purchase of her new property. Kody and Robyn discuss their now monogamist relationship and the possibility of bringing in a new wife. Meri dips her toe back into the dating world."
      },
      {
        "id": "tvmaze:3388567",
        "title": "Welcome to Speed Dating",
        "season": 20,
        "episode": 2,
        "released": "2025-10-05",
        "overview": "Meri's speed dating event starts out awkward until she meets Ron. Janelle and Meri discuss what needs to be done to sell Coyote Pass, as Kody pushes Robyn to move on. Christine has a hard time dealing with Tony and Mykelti's decision to move."
      },
      {
        "id": "tvmaze:3389155",
        "title": "All About Eggplants",
        "season": 20,
        "episode": 3,
        "released": "2025-10-12",
        "overview": "Mykelti and Tony drive right into a tornado as Christine and David help them move to North Carolina. Kody and Robyn decide to begin anew, and someone makes an unexpected pregnancy announcement."
      },
      {
        "id": "tvmaze:3395722",
        "title": "You Need to Shut Up",
        "season": 20,
        "episode": 4,
        "released": "2025-10-19",
        "overview": "Meri ventures into the wild world of dating apps. Kody struggles to fake it about the new family dynamic, as he and Robyn pack up their home. Christine has a strong reaction to Janelle's comment about being closer to the kids."
      },
      {
        "id": "tvmaze:3402035",
        "title": "Kissing Another Man's Wife",
        "season": 20,
        "episode": 5,
        "released": "2025-10-26",
        "overview": "With the changing family dynamics, the Browns celebrate the holidays with new traditions. Meri takes a trip to NYC, David suggests that Janelle try a dating app for farmers, and Kody and Robyn decorate their Christmas tree with Aurora's new boyfriend."
      },
      {
        "id": "tvmaze:3429857",
        "title": "We're Not Brother Husbands",
        "season": 20,
        "episode": 6,
        "released": "2025-11-02",
        "overview": "Janelle and Meri awkwardly meet with Kody to discuss an offer they received on Coyote Pass. Kody tells Robyn about the love letters he receives from women who have crushes on him, and they discuss if polygamy is still on the table."
      },
      {
        "id": "tvmaze:3436580",
        "title": "You're Like a Stripper, I'm Like the Pole",
        "season": 20,
        "episode": 7,
        "released": "2025-11-09",
        "overview": "Meri digs through boxes of her wedding memorabilia that bring up painful memories. Christine and David have their biggest disagreement yet. Kody and Robyn try to improve their rhythm with a dance lesson, and Janelle helps Maddie prepare for labor."
      },
      {
        "id": "tvmaze:3436581",
        "title": "Making Out Like Teenagers",
        "season": 20,
        "episode": 8,
        "released": "2025-11-16",
        "overview": "Coyote Pass has finally sold and it's the final chapter in the family's breakup. Kody, Robyn, Janelle, and Meri anxiously prepare to meet on the land to close out the deal. In North Carolina, Maddie has her baby girl."
      },
      {
        "id": "tvmaze:3436582",
        "title": "Standoff at Coyote Pass",
        "season": 20,
        "episode": 9,
        "released": "2025-11-23",
        "overview": "It's an awkward final showdown at Coyote Pass with Kody, Robyn, Janelle, and Meri. Janelle takes a trip to New Orleans and let's loose with girlfriends to celebrate, and Kody considers finding a therapist to help repair relationships with his children."
      },
      {
        "id": "tvmaze:3456032",
        "title": "Extending an Olive Branch",
        "season": 20,
        "episode": 10,
        "released": "2025-11-30",
        "overview": "Janelle celebrates the sale of Coyote Pass by partying with friends in New Orleans. Meri ventures out of her comfort zone and attends a dating event in Las Vegas. Kody owns up to his bad behavior and decides to apologize to each of his ex-wives."
      }
    ]
  }
}