{
  "meta": {
    "id": "tvmaze:64815",
    "type": "series",
    "name": "The Good Ship Murder",
    "description": "The Good Ship Murder is set aboard a luxury cruise liner touring everyone's favorite Mediterranean holiday hotspots bubbling with intrigue, rivalries, glamour, money and class divides – but its new cabaret singer, ex detective Jack Grayling, soon discovers there are also more sinister elements below the surface. On a cruise out of Southampton, Jack meets newly promoted First Officer, Kate Woods. Fierce and ambitious, she's a woman in a man's world with plenty to prove. After a passenger is found murdered in their first port of call, Kate's dream of her own command is thrown into Jeopardy and Jack finds himself thrust back into his former life as a detective. What follows is a wave of murder mysteries – each set against the backdrop of a different stunning coastal destination where the ship has dropped anchor.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/479/1199790.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/479/1199790.jpg",
    "videos": [
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      },
      {
        "id": "tvmaze:2652087",
        "title": "La Rochelle",
        "season": 1,
        "episode": 1,
        "released": "2023-10-13",
        "overview": "Cruise singer Jack and First Officer Kate team up to solve a murder in La Rochelle."
      },
      {
        "id": "tvmaze:2660306",
        "title": "Lisbon",
        "season": 1,
        "episode": 2,
        "released": "2023-10-20",
        "overview": "When the world's number one crime writer joins the luxury ship as a star passenger, it isn't long before Death gets on board as well.In the beautiful city of Lisbon, the author's husband dies in circumstances eerily similar to events in her own book.With super-fans and bitter rivals in the mix, it's up to singer Jack and First Officer Kate to unravel the murderer's identity before the body count rises still further..."
      },
      {
        "id": "tvmaze:2660307",
        "title": "Casablanca",
        "season": 1,
        "episode": 3,
        "released": "2023-10-27",
        "overview": "Another port, another killer...When the ship docks at his friend and crewmate Jamil's hometown of Casablanca, singer Jack volunteers to moonlight as a tour guide and invites himself for dinner with Jamil's family.But the sun-drenched alleys and markets hide sinister secrets, and soon a charity helping street kids is mired in scandal and a murder has been committed.First Office Kate is under pressure to leave the sleuthing to the professionals and concentrate on her career, but when there's a mystery to be solved and a killer to be brought to justice, some things are more important than obeying Captain's orders…"
      },
      {
        "id": "tvmaze:2666501",
        "title": "Palma",
        "season": 1,
        "episode": 4,
        "released": "2023-11-03",
        "overview": "When First Officer Kate's schoolfriend Cecile unexpectedly joins the ship for her lavish wedding, Kate and Jack are both swept up in the hen and stag dos.But in Palma a dramatic kidnap and ransom demand shatter the party mood.Jack re-lives old times with local detective Luciana Perez as the mystery deepens and hidden motives are revealed.Will Cecile and her beau get their happy ever after? And how will Kate react when she receives a proposal of her own?"
      },
      {
        "id": "tvmaze:2666502",
        "title": "At Sea",
        "season": 1,
        "episode": 5,
        "released": "2023-11-10",
        "overview": "Murder is on the cards as the luxury ship hosts a high stakes poker tournament while cruising to the Bay of Biscay.Top player Nikolai Volkov lords it over his competitors, who all have reasons to want to teach the arrogant maestro a lesson. When simmering resentments turn deadly, Kate and Jack have no shortage of suspects, and must unravel a case which may turn out to involve more than one murderer.Meanwhile, the mismatched pair of sleuths exchange home truths when a job offer means their partnership could be on borrowed time."
      },
      {
        "id": "tvmaze:2666503",
        "title": "Sicily",
        "season": 1,
        "episode": 6,
        "released": "2023-11-17",
        "overview": "The luxury liner sails to Sicily and a family saga unfolds. Successful businessman Roberto is terminally ill and is returning to his homeland with his three children and his new wife, Freya, who he wants to take over the business when the time comes. When death duly strikes in the heat of the Sicilian sun, Jack and First Officer Kate must penetrate a devious web of secrets to unmask the killer."
      },
      {
        "id": "tvmaze:2666504",
        "title": "Barcelona",
        "season": 1,
        "episode": 7,
        "released": "2023-11-24",
        "overview": "Cruise Director Beverley is having trouble keeping the entertainment team in line, but their onboard bickering is as nothing to what happens ashore when the ship docks in balmy Barcelona.A murderer strikes in the shadow of the majestic Sagrada Familia cathedral, but who has the skills to kill in this very particular way – and what is their motive?Crooner Jack and First Officer Kate uncover a mystery of concealed identities that stretches back to the assassination of a Russian oligarch.Finally, at a moving musical tribute to a fallen friend, are Jack and Kate also saying goodbye to their chance of happiness together?"
      },
      {
        "id": "tvmaze:2666505",
        "title": "Malta",
        "season": 1,
        "episode": 8,
        "released": "2023-12-01",
        "overview": "It's the last journey of the season, but will dramatic events in Valetta make it Jack and Kate's final destination?The presence of legendary singer Vida Devine onboard the ship produces a frenzy of fans, and members of the press circle the star like hungry sharks.Someone claims to have a scoop on Vida, while another passenger believes her most famous song holds a special significance for them. With Vida conflicted about her celebrity and longing for a simpler life, things are complicated enough even before there's a murder in Malta.With Jack and Kate's relationship on the rocks since Kate's engagement, the pair struggle to put their differences behind them to solve a case involving buried identities and lost relationships.To further complicate things, a job offer for Jack means it could be goodbye forever for the singer and the First Officer…"
      },
      {
        "id": "tvmaze:3083846",
        "title": "Rome",
        "season": 2,
        "episode": 1,
        "released": "2025-01-10",
        "overview": "Jack is ready to take a bold step in his relationship with Kate, inviting her for a romantic evening at the opera during their stop in Rome. But the unexpected arrival of his estranged 18-year-old daughter, Mia, throws his plans into chaos. As Jack juggles to reconnect with Mia and tension between him and Kate reaches a boiling point, he investigates the murder of an opera troupe member. And the situation spirals out of control when Mia runs away with a suspect from the murder investigation."
      },
      {
        "id": "tvmaze:3087484",
        "title": "Gran Canaria",
        "season": 2,
        "episode": 2,
        "released": "2025-01-17",
        "overview": "Jack and Kate are still reeling from their fallout in Rome, each trying to suppress their growing feelings. Adding fuel to the fire, Piers steps into his new role as Staff Captain with calculated charm, hoping to rekindle his relationship with Kate. When Jack recognises a familiar face - a notorious ex-con named Mickey Eldergill - things take a sinister turn. Rumours swirl about stolen bullion tied to Mickey's past, and Jack warns Kate to keep her distance. But her detective instincts pull her back into the fray, especially when one of Mickey's henchmen is found murdered during a tour excursion. And Piers's rivalry with Jack takes a turn, setting the stage for a battle of wills that threatens both men's futures."
      },
      {
        "id": "tvmaze:3108867",
        "title": "Madeira",
        "season": 2,
        "episode": 3,
        "released": "2025-01-24",
        "overview": "In the lush vineyards of Madeira, Jack and Kate are drawn into the murder of Max King, the charismatic but ruthless vineyard owner. As they navigate a tangled web of suspects, including Max's ex-wife, his son, and new partner Maria, Jack grows increasingly frustrated with Kate's hot-and-cold behaviour. Piers, revelling in Kate's vulnerability, piles on the pressure, using every opportunity to undermine her confidence. Back on the ship, he even attempts to convince Colin to reconsider Jack's place in the entertainment team."
      },
      {
        "id": "tvmaze:3113902",
        "title": "Gozo",
        "season": 2,
        "episode": 4,
        "released": "2025-01-31",
        "overview": "A lavish influencer party on a sun-soaked Gozo beach turns deadly when its host, Tony Tong, is found murdered. Amid the chaos, Jamil is discovered passed out near the scene, making him the prime suspect. Jack and Kate are forced to set aside their personal tension to clear Jamil's name. As the case unravels, Kate sees Jack's unwavering loyalty to Jamil, softening her resolve to keep their relationship strictly professional. Meanwhile, Jamil's unspoken feelings for Cassie take a hit when she admits she only sees him as a friend. And Piers intensifies his schemes, determined to make both Jack and Kate's lives miserable as he plots his next move."
      },
      {
        "id": "tvmaze:3123608",
        "title": "Alexandria",
        "season": 2,
        "episode": 5,
        "released": "2025-02-07",
        "overview": "A pickpocketing ring aboard the ship spirals into murder when Lisa, one of the culprits, is killed. Piers seizes the opportunity to accuse Jack of misconduct, but Kate intervenes, exposing cracks in Piers's confident facade. Cassie's sympathy for Piers blossoms into romance, leaving Jamil heartbroken. Jack's recklessness earns him a stern lecture from Kate, pushing him to confront his own impulsive behaviour. But with Piers and Cassie's relationship heating up, tensions aboard the ship are far from over."
      },
      {
        "id": "tvmaze:3129304",
        "title": "Côte D'Azur",
        "season": 2,
        "episode": 6,
        "released": "2025-02-14",
        "overview": "When an '80s rock band reunion ends in murder, Jack and Kate are thrust into a high-profile case filled with secrets, grudges, and a meticulously planned alibi. As they peel back the layers of the band's dark past, they discover the killer hiding in plain sight. Meanwhile, Cassie's whirlwind romance with Piers crashes and burns, leaving her heartbroken and vulnerable..."
      },
      {
        "id": "tvmaze:3129305",
        "title": "Athens",
        "season": 2,
        "episode": 7,
        "released": "2025-02-21",
        "overview": "A stolen artifact tied to true love becomes the centrepiece of a heist that leaves a security guard dead. Rumours of Jack's kiss with Cassie spark chaos, with Jamil feeling betrayed and Kate questioning everything. As Jack takes the fall for Jamil during an incident, he risks his career to save his friend. With Jack's future on the line, Kate must decide whether to let misunderstandings keep them apart or fight for the man she loves."
      },
      {
        "id": "tvmaze:3459061",
        "title": "Alicante",
        "season": 3,
        "episode": 1,
        "released": "2025-12-29",
        "overview": "After the ship docks in the Spanish resort of Alicante, Donna, claiming a life-changing illness, boards with her friend Bernie. As the festive voyage begins, Donna charms fellow passenger Gary and visits a remote monastery, where she meets a mysterious priest and an enigmatic nun, but the holiday cheer is lost when Bernie is found dead. Meanwhile, the recently sacked Jack is lying low, but the murder draws Kate back to him and, with Jamil's help, the two might finally rekindle their romance."
      }
    ]
  }
}