{
  "meta": {
    "id": "tvmaze:215",
    "type": "series",
    "name": "American Dad!",
    "description": "In American Dad!, Stan Smith leads the all-American family in this animated sitcom filled with wild and crazy extremes. Everyday life is taken to the limit as Stan applies the same drastic measures used in his job at the CIA to his home life. Driven by machismo and the American dream, he often is blind to how horribly he fails at his attempts. This father might not know best, but he never stops trying.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/476/1191222.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/476/1191222.jpg",
    "videos": [
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:14127",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2005-02-06",
        "overview": "Proud father Stan Smith uses his CIA skills to help 13-year-old son Steve win class president and the heart of the hottest girl in class, Lisa Silver. But when being class president makes Steve mad with power, Stan must jump in to save the day. Meanwhile, Roger, the alien Stan saved from Area 51, helps 18-year-old Haley with her school paper. In return, she hooks him up with boatloads of junk food to curb his sweet tooth. Unfortunately, some Chocodiles send him over the edge and a sugar crash prohibits him from finishing one of her papers, forcing Haley to pick up the pieces. And Klaus, the goldfish with the brain of a German guy, pines after mother Francine. Unfortunately for Klaus, the closest he'll ever get to a date with her is the spin cycle with her sports bra."
      },
      {
        "id": "tvmaze:14128",
        "title": "Threat Levels",
        "season": 1,
        "episode": 2,
        "released": "2005-05-01",
        "overview": "Stan returns home with the wrong thermos and exposes the family to hazardous material, causing them to think they only have 24 hours to live. The next day, they realize Stan brought home the wrong thermos and they will be fine, but the experience prompts Francine to question her purpose in life and decide that she wants to be a realtor. Stan is supportive of this, until he begins to feel emasculated by her big paychecks and decides to take matters into his own hands."
      },
      {
        "id": "tvmaze:14129",
        "title": "Stan Knows Best",
        "season": 1,
        "episode": 3,
        "released": "2005-05-08",
        "overview": "When Haley comes home from a Green Party rally with dyed green hair, Stan shaves her head with an electric shaver while she's sleeping. In an act of defiance, Haley moves into a van with her new boyfriend. When Stan cuts her off, she gets a job as a waitress in a strip club, which sends Stan over the edge. Meanwhile, Steve tries to pass Roger the Alien off as his disfigured sister in order to gain sympathy from girls."
      },
      {
        "id": "tvmaze:14130",
        "title": "Francine's Flashback",
        "season": 1,
        "episode": 4,
        "released": "2005-05-15",
        "overview": "When Stan forgets his wedding anniversary - again - he arranges to have 19 hours of Francine's memory erased, but the CIA temp on duty accidentally erases 19 years. Francine, having reverted to her wild-child days, moves into her old apartment with Haley as a roommate, and ends up going to a festival with Haley's boyfriend. Meanwhile, Steve asks a good-looking girl out, but needs his wingman, Roger, to jump on a grenade for him and date her ugly cousin."
      },
      {
        "id": "tvmaze:14131",
        "title": "Roger Codger",
        "season": 1,
        "episode": 5,
        "released": "2005-06-05",
        "overview": "When Stan invites his boss, Bullock (Patrick Stewart), over for dinner, Roger's quest for Chardonnay puts the Smith family at risk of getting caught hiding him. After the close call, Roger goes into a stress-induced coma, which makes everyone thinks he's dead. After they dispose of his body, Roger comes to and tries to get home, but he ends up in drag and almost caught by the CIA."
      },
      {
        "id": "tvmaze:14132",
        "title": "Homeland Insecurity",
        "season": 1,
        "episode": 6,
        "released": "2005-06-12",
        "overview": "Francine thinks Stan's safety practices have isolated her from the rest of the neighborhood and prevented them from making new friends. In an effort to remedy the situation, Francine decides to throw a block party. But when Stan meets some new neighbors he doesn't trust, all hell breaks lose. Meanwhile, Stan persuades Steve to join a youth group, which ends up causing him more harm than good."
      },
      {
        "id": "tvmaze:14133",
        "title": "Deacon Stan, Jesus Man",
        "season": 1,
        "episode": 7,
        "released": "2005-06-19",
        "overview": "When Stan hears his rival Chris White wants to become the new deacon of their church, Stan decides he wants the position as well. Unfortunately for his family, Stan's competitive nature gets the best of him as he tries to win the deacon race. Meanwhile, Steve takes a class at the church with Betsy, the Whites' daughter, who's a Gold Medal gymnast. Steve does back flips for her and their romance helps bring Stan to his senses."
      },
      {
        "id": "tvmaze:14134",
        "title": "Bullocks to Stan",
        "season": 1,
        "episode": 8,
        "released": "2005-09-11",
        "overview": "When Stan is up for a promotion, he asks his family to be on their best behavior at the CIA picnic. Unfortunately, Haley ends up getting into a fight with Stan's boss Bullock, which makes Stan think his chances for the promotion are ruined. But when Stan goes to Bullock's house to apologize for Haley's behavior, he's shocked to discover Bullock's new woman."
      },
      {
        "id": "tvmaze:14135",
        "title": "A Smith in Hand",
        "season": 1,
        "episode": 9,
        "released": "2005-09-18",
        "overview": "When Steve brings home a permission slip to take sex ed at school, Stan flips out and demands to teach it himself. However, after Stan unrealistically explains the birds and the bees to Steve, he gets into an accident that causes him to take matters into his own hands. Meanwhile, Roger becomes a bartender in hopes of making something of himself."
      },
      {
        "id": "tvmaze:14136",
        "title": "All About Steve",
        "season": 1,
        "episode": 10,
        "released": "2005-09-25",
        "overview": "When the CIA organizes a father-son baseball game, Stan is determined to show his co-workers that his son is masculine and athletic. Unfortunately, Steve is a geek, so Stan decides to lie and ditches him. But after getting a taste of his own treatment at work, Stan turns to Steve and his sci-fi knowledge to help capture a cyber-terrorist. Meanwhile, Roger goes incognito in a desperate attempt to interact with humans."
      },
      {
        "id": "tvmaze:14137",
        "title": "Con Heir",
        "season": 1,
        "episode": 11,
        "released": "2005-10-02",
        "overview": "When Stan's father passes away, Stan reveals his real father is actually Jack Smith, a super suave spy. Jack convinces Stan to quit the CIA and work with him at the Scarlet Alliance, an ultra-secret spy group. Francine is upset with Stan, who is busy training with Jack for a mission involving uranium, artwork and terrorists. But when the FBI shows up at the Smiths' house looking for an international jewel thief, Francine suspects Jack is the fake."
      },
      {
        "id": "tvmaze:14138",
        "title": "Stan of Arabia: Part 1",
        "season": 1,
        "episode": 12,
        "released": "2005-11-06",
        "overview": "Stan has to throw a party for his boss and assumes his wife Francine will do all the work, but she refuses. With Stan as party planner, the event turns into a disaster. As a result, Stan's boss relocates Stan and his family to Saudi Arabia, where they quickly get a taste of life on foreign ground. As American and Arabian social norms clash, gender wars heat up."
      },
      {
        "id": "tvmaze:14139",
        "title": "Stan of Arabia: Part 2",
        "season": 1,
        "episode": 13,
        "released": "2005-11-13",
        "overview": "As the Smiths continue to live in Saudi Arabia, Stan is fully enjoying the male-dominated society, while the rest of the family struggles with the different social norms. Meanwhile, Francine's musical exposé on gender roles gets her into trouble and a brush with death leads the Smiths to return to the United States ."
      },
      {
        "id": "tvmaze:14140",
        "title": "Stannie Get Your Gun",
        "season": 1,
        "episode": 14,
        "released": "2005-11-20",
        "overview": "After Stan and Hayley have a disagreement, Francine demands that the two of them spend a day together. Unfortunately, the plan backfires when Stan takes Hayley to National Gun Association Land, where their conflicting opinions toward gun control drive them even further apart. Meanwhile, after losing from snoozing, Roger develops a scheme to get revenge on Steve."
      },
      {
        "id": "tvmaze:14141",
        "title": "Star Trek",
        "season": 1,
        "episode": 15,
        "released": "2005-11-27",
        "overview": "After Stan finds out that Steve is failing English, he forces Steve to write his own story, which is inspired by Roger's desire to be a celebrity. It quickly becomes a best-selling hit and Steve gets a taste of life in the spotlight. But as Stan and Francine milk the benefits of having a famous son, Steve turns around and divorces the family."
      },
      {
        "id": "tvmaze:14142",
        "title": "Not Particularly Desperate Housewives",
        "season": 1,
        "episode": 16,
        "released": "2005-12-18",
        "overview": "As Stan continues to dominate the household, Francine finds herself idolizing a group of women who seem to have it all. She tries to impress them and even lies in order to gain acceptance into their group, until she realizes they aren't as perfect as they seem. Meanwhile, loyalties are tested when Stan gets a new best friend."
      },
      {
        "id": "tvmaze:14143",
        "title": "Rough Trade",
        "season": 1,
        "episode": 17,
        "released": "2006-01-08",
        "overview": "After Stan and Roger have a rough day, they get into a fight that leads to a \"Freaky Friday\"-type switcheroo where they get a taste of life in each other's shoes. But after the excitement of a new life stales, they face each other's problems as Roger is under pressure at work and Stan yearns to be needed. The swap gets out of hand as the family starts to crumble."
      },
      {
        "id": "tvmaze:14144",
        "title": "Finances with Wolves",
        "season": 1,
        "episode": 18,
        "released": "2006-01-29",
        "overview": "After receiving a hefty bonus from work, Stan buys extravagant gadgets while Francine pleads for her dream kiosk. Upset about his lack of support, Francine opens a muffin shop without his approval and gives Stan a taste of life without a housewife. In a desperate move, Stan puts Klaus's brain back into a human body - only to discover it was a huge mistake as Klaus tries to win over Francine. Meanwhile, Steve is convinced he's a teen wolf after watching a horror film."
      },
      {
        "id": "tvmaze:14145",
        "title": "It's Good to Be Queen",
        "season": 1,
        "episode": 19,
        "released": "2006-02-26",
        "overview": "Because of Stan's bad prom experience, he's overly excited to attend Francine's high school reunion and finally have his dance with the Homecoming Queen. But when Francine learns her title was a mistake, Stan must choose between his wife and the dance of his dreams. Back at home, Steve and Roger seek enlightenment from a delivery boy."
      },
      {
        "id": "tvmaze:14146",
        "title": "Roger 'n Me",
        "season": 1,
        "episode": 20,
        "released": "2006-04-23",
        "overview": "When Stan goes to Atlantic City for a bachelor party and is shunned by his so-called best friend, Roger steps in and becomes Stan's new sidekick. Their friendship goes to a whole new level, but when they return home and face Francine, Stan realizes that what happens in Atlantic City doesn't necessarily stay there. Meanwhile, Haley and Steve team up to break up a good-looking couple."
      },
      {
        "id": "tvmaze:14147",
        "title": "Helping Handis",
        "season": 1,
        "episode": 21,
        "released": "2006-04-30",
        "overview": "Stan wants Steve to be popular and goes to desperate measures giving him steroids to make him bigger, better and part of the in-crowd at school. But when the steroids have an unexpected side effect, Steve gets a lot more attention than anyone expected. Meanwhile, after Haley makes a movie about Francine's life as a housewife, Francine is determined to start a new career as a doctor."
      },
      {
        "id": "tvmaze:14148",
        "title": "With Friends Like Steve's",
        "season": 1,
        "episode": 22,
        "released": "2006-05-07",
        "overview": "After Steve shows a lack of interest in Stan's job, Stan replaces him with Barry, Steve's malicious friend. Barry frames Steve to eliminate him from the household, but when Steve discovers Barry's weakness, he relies on his CIA skills to save the family. Meanwhile, Roger takes an impressive keg-stand and uses it to become a fraternity brother."
      },
      {
        "id": "tvmaze:14149",
        "title": "Tears of a Clooney",
        "season": 1,
        "episode": 23,
        "released": "2006-05-14",
        "overview": "When Francine's birthday brings back haunting memories of a celebrity film moment stolen by George Clooney, Francine's new dream is to destroy the star. But when she tries to win Clooney's heart with the intention of breaking it, Stan actually falls for him and sabotages the plan. Meanwhile back at home, Roger builds a vineyard and starts up a private sweat shop of foster children."
      },
      {
        "id": "tvmaze:14150",
        "title": "Camp Refoogee",
        "season": 2,
        "episode": 1,
        "released": "2006-09-10",
        "overview": "When Stan tries to trick Steve into attending summer camp, things go horribly wrong and Steve ends up in a refugee camp. However, Stan, being the eternal optimist, joins Steve and manages to stage a camp Olympics between the refugees and the rebel faction living across the river."
      },
      {
        "id": "tvmaze:14151",
        "title": "The American Dad After School Special",
        "season": 2,
        "episode": 2,
        "released": "2006-09-17",
        "overview": "When Steve announces that he finally has a girlfriend, Stan could not be a prouder father. But when Stan realizes that she is not the petite cheerleader he was expecting, his obsession with physical appearance spirals out of control and he develops anorexia. Steve comes to recognize that his overweight girlfriend is the root of his father's problems and he has to make a hard choice in an effort to save his father's life."
      },
      {
        "id": "tvmaze:14152",
        "title": "Failure is Not a Factory-installed Option",
        "season": 2,
        "episode": 3,
        "released": "2006-09-24",
        "overview": "Stan, the CIA's best interrogator, loses his confidence and his job when a car salesman gets the best of him in a negotiation. To get even, Stan comes up with an elaborate scam that temporarily costs his family their integrity. Meanwhile, Roger and Steve set up a makeshift drive-in to try to get to first base with popular schoolgirls ."
      },
      {
        "id": "tvmaze:14153",
        "title": "Lincoln Lover",
        "season": 2,
        "episode": 4,
        "released": "2006-11-05",
        "overview": "Stan has his heart set on speaking at the Republican National Convention on behalf of the Langley chapter, but when they pass him up for another candidate, Stan decides to look for other angles and accepts an endorsement from the local gay chapter of Republicans. While the people around him disapprove of his new lifestyle choices, Stan decides to follow his heart and speak on their behalf."
      },
      {
        "id": "tvmaze:14154",
        "title": "Dungeons and Wagons",
        "season": 2,
        "episode": 5,
        "released": "2006-11-12",
        "overview": "After Francine tells Stan she's looking for excitement in their marriage, Stan gets in the driver's seat and becomes involved in drag racing to spice things up. Meanwhile, Hayley breaks up with her boyfriend, Jeff, who is emotionally crushed until he joins Steve's world of online gaming. When Hayley finds out, she tries to sabotage their fun."
      },
      {
        "id": "tvmaze:14155",
        "title": "Iced, Iced Babies",
        "season": 2,
        "episode": 6,
        "released": "2006-11-19",
        "overview": "When Steve's new relationship with his girlfriend gives Francine empty nest syndrome, she tries to convince Stan to have another baby. Meanwhile, Roger tries to enroll in college with Haley in order to experience college life, but while Roger ends up teaching the class, Haley finds a new crush in her classmate Ethan, who turns out to be far from normal."
      },
      {
        "id": "tvmaze:14156",
        "title": "Of Ice and Men",
        "season": 2,
        "episode": 7,
        "released": "2006-11-26",
        "overview": "Francine discovers that Stan has been hiding a secret passion for competitive figure skating for the past 20 years. Instead of demeaning him, Francine decides to support him and joins him as his pairs partner - until Stan's competitive nature gets the best of him and he ditches her for a new partner. Meanwhile, Steve's classmate Snot finds new respect among his peers when he parades his new mail-order bride around the playground."
      },
      {
        "id": "tvmaze:14157",
        "title": "Irregarding Steve",
        "season": 2,
        "episode": 8,
        "released": "2006-12-10",
        "overview": "When Roger helps Steve see that his father isn't as smart as he always believed, the power-hungry pair set their sights on fame and fortune in New York City. It doesn't take long for Roger to lose everything on Wall Street, and Steve contemplates prostitution after Jon Stewart shoots down his comedy routine. Meanwhile, the rest of the family is certain that the two have just run away to the tree house, so when it explodes in a lightning storm, they are devastated but console themselves with Steve's college fund."
      },
      {
        "id": "tvmaze:14158",
        "title": "The Best Christmas Story Never Told",
        "season": 2,
        "episode": 9,
        "released": "2006-12-17",
        "overview": "Lisa Kudrow Guest-Stars When an injunction prevents Langley Falls from lighting their annual Christmas tree, Stan blames secular non-believers for ruining his favorite holiday. With Stan's holiday spirit at an all-time low, the Ghost of Christmas Past (Lisa Kudrow) visits him and tries to show him the true meaning of Christmas. However, Stan is convinced that Christmas can be saved by changing the outcome of Vietnam, but finds that changing the past only dramatically changes the future."
      },
      {
        "id": "tvmaze:14159",
        "title": "Bush Comes to Dinner",
        "season": 2,
        "episode": 10,
        "released": "2007-01-07",
        "overview": "When Stan enters an essay-writing contest to have his personal hero, President Bush, come over for dinner, he is overcome with joy when the President arrives at his doorstep. However, not everyone in the Smith family shares Stan's excitement. Haley tries to drill Pres. Bush on the Iraq war, and Steve and Roger attempt to convince him that they've found Osama Bin Laden but instead get him drunk after 15 years of sobriety. Stan tries to save the President from public humiliation while Haley revels in his fall from glory."
      },
      {
        "id": "tvmaze:14160",
        "title": "The American Dream Factory",
        "season": 2,
        "episode": 11,
        "released": "2007-01-28",
        "overview": "When Stan feels like he's not climbing the ladder fast enough at the work, he turns to his lifelong ambition of making festive teddy bears. However, when he realizes that making a quick profit takes a lot of work, he resorts to using illegal aliens as cheap labor. Meanwhile, Haley sees her father's new business model as an atrocity and takes matters into her own hands by calling Uncle Sam."
      },
      {
        "id": "tvmaze:14161",
        "title": "A.T. The Abusive Terrestrial",
        "season": 2,
        "episode": 12,
        "released": "2007-02-11",
        "overview": "When Roger is rejected by Steve, who seems to be 'over him,' Roger heads out in search of a new human companion. But when this new friend starts to abuse Roger and the relationship turns into a lot of excuses and sorry's, Steve and Haley scheme to get Roger out of the bad relationship and back home where he belongs. Meanwhile, Stan tours the Mr. Pibb factory and meets the man himself."
      },
      {
        "id": "tvmaze:14162",
        "title": "Black Mystery Month",
        "season": 2,
        "episode": 13,
        "released": "2007-02-18",
        "overview": "While researching a paper about George Washington Carver in celebration of Black History Month, Steve uncovers a conspiracy that's been going on since the Civil War. When the curator of the Smithsonian Peanut Museum reaches out to tell Steve the truth, he's mysteriously murdered, and Steve and Stan are tracked by a secret society that will stop at nothing to keep this scandalous secret of American history."
      },
      {
        "id": "tvmaze:14163",
        "title": "An Apocalypse to Remember",
        "season": 2,
        "episode": 14,
        "released": "2007-03-25",
        "overview": "When Stan arrives late to a CIA nuclear drill and thinks it's real, he moves the family to the mountains to survive the perceived apocalypse. Even after he realizes his error, he's enjoying the attention from the family so much that he doesn't tell them the truth. However, when the family meets a mountain man and learns the truth, Stan has some explaining to do."
      },
      {
        "id": "tvmaze:14164",
        "title": "Four Little Words",
        "season": 2,
        "episode": 15,
        "released": "2007-04-01",
        "overview": "Stan sets Bullock up with a friend of Francine's but, dreading to hear Francine tell him 'I told you so,' Stan goes to great lengths to make sure the date goes well by getting everyone drunk. Unfortunately, Bullock accidentally kills the woman and Stan covers it up and then frames Francine so that she'll stop asking questions."
      },
      {
        "id": "tvmaze:14165",
        "title": "When a Stan Loves a Woman",
        "season": 2,
        "episode": 16,
        "released": "2007-04-29",
        "overview": "When Stan discovers that Francine has a secret sex garden, he feels like their marriage might be on shaky ground. Hoping to rekindle the romance, Francine insists on a divorce so that Stan can experience life as a bachelor again, and both learn a valuable lesson in love. Meanwhile, Steve becomes addicted to an energy drink and finds himself panhandling in the streets to support his habit."
      },
      {
        "id": "tvmaze:14166",
        "title": "I Can't Stan You",
        "season": 2,
        "episode": 17,
        "released": "2007-05-06",
        "overview": "When Stan brings home special equipment from the CIA to eavesdrop on conversations, he discovers how his neighbors really feel about him. To get back at them, Stan has the entire neighborhood evicted in order to live free of any criticism. However, when an unexpected friend comes to his rescue, he realizes that gossip is a two-way street."
      },
      {
        "id": "tvmaze:14167",
        "title": "The Magnificent Steven",
        "season": 2,
        "episode": 18,
        "released": "2007-05-13",
        "overview": "When Stan is prosecuted for sending contaminated cattle to the slaughterhouse, he recounts his story of how the ordeal started out as a quest to make Steve \"a man\". Meanwhile, Roger starts a cat fight between Francine and Haley after he unintentionally gives one a little more attention."
      },
      {
        "id": "tvmaze:14168",
        "title": "Joint Custody",
        "season": 2,
        "episode": 19,
        "released": "2007-05-20",
        "overview": "When Roger finds out that Hayley's boyfriend, Jeff, is wanted in Florida for smuggling marijuana, he and Stan turn into bounty hunters and chase Jeff across the country. However, when the truth behind the matter is revealed, Roger is left with his tail between his legs and Stan steps in to offer some fatherly advice. Meanwhile, Steve gets shocked trying to hot-wire Francine's car and is cursed with a gift."
      },
      {
        "id": "tvmaze:14169",
        "title": "The Vacation Goo",
        "season": 3,
        "episode": 1,
        "released": "2007-09-30",
        "overview": "When Francine discovers that all their family vacations have been artificial memories created by CIA so that Stan could ditch the family, she is fuming and demands a real vacation. However, when the vacation seems too good to be true, Francine is convinced it is also the work of the CIA and causes the family has to suffer the consequences. Meanwhile, Roger makes a desperate effort to be the greatest actor who ever lived in ."
      },
      {
        "id": "tvmaze:14170",
        "title": "Meter Made",
        "season": 3,
        "episode": 2,
        "released": "2007-10-07",
        "overview": "In order to be taken more seriously and to be a \"somebody,\" Stan becomes a meter maid who seems to have all of the power. Now he's getting the best tables at restaurants (threatening to ticket and tow), pocketing quarters from meters and impressing Francine with his prowess. But, when Turlington from Parking Internal Affairs pays him a visit, Stan realizes crime and this lifestyle don't pay. Meanwhile, Haley poses nude for a college art class and is surprised to see Roger there."
      },
      {
        "id": "tvmaze:14171",
        "title": "Dope and Faith",
        "season": 3,
        "episode": 3,
        "released": "2007-10-14",
        "overview": "Stan prays for a friend and thinks God sent him one, but Brett turns out to be an atheist. So, Stan tries to convince his friend that God exists by making his life extremely hard until his plan backfires. Meanwhile, Roger convinces Steve that he has been accepted to \"Hogwarts\"."
      },
      {
        "id": "tvmaze:14172",
        "title": "Big Trouble in Little Langley",
        "season": 3,
        "episode": 4,
        "released": "2007-11-04",
        "overview": "When Francine's adopted parents stop by for an unannounced stay, Stan is furious that they refuse to assimilate to his \"man of the house\" ways. After he unsuccessfully tries to give them the boot, he is convinced that finding Francine's birth parents will change things. Meanwhile, Steve tries to live to the extreme in order to get to second base with the class hottie."
      },
      {
        "id": "tvmaze:14173",
        "title": "Haylias",
        "season": 3,
        "episode": 5,
        "released": "2007-11-11",
        "overview": "When Hayley decides to move to France because of imperialistic oppression, Stan will do anything to stop her including revealing the fact that she was brainwashed as a child by the CIA. Feeling desperate, Stan activates her trigger word and gains control over Hayley against the advice of his boss, Bullock. Everything is going fine until Stan remembers that if he doesn't change Hayley back to normal, there will be deadly consequences for him. Meanwhile, Steve and Roger become private Dick Tracys."
      },
      {
        "id": "tvmaze:14174",
        "title": "42-Year-Old Virgin",
        "season": 3,
        "episode": 6,
        "released": "2007-11-18",
        "overview": "At a poker game with the guys, Stan reveals that he has never actually killed anyone. It seems that every kill in Stan's history with the CIA has been the result of fortunate timing. Roger and the guys become determined to get Stan his first kill."
      },
      {
        "id": "tvmaze:14175",
        "title": "Surro-Gate",
        "season": 3,
        "episode": 7,
        "released": "2007-12-02",
        "overview": "When Francine decides to be a surrogate for her gay neighbors Terry and Greg, Stan's Republican blood boils. Although he pretends to be happy, when the baby is born, Stan kidnaps her and heads to the Nebraska boarder, where gay couples have no rights. Meanwhile Steve and Roger pull a Howard Hughes and become reclusive after they think Klaus is out to get them."
      },
      {
        "id": "tvmaze:14176",
        "title": "The Most Adequate Christmas Ever",
        "season": 3,
        "episode": 8,
        "released": "2007-12-16",
        "overview": "After Stan comes home from another dangerous mission, he finds that his family has decked the halls with boughs of holly and donned themselves with gay apparel, but just not to his satisfaction. He demands a grander Christmas starting with the search of a bigger and better tree in the forest. When his family has had enough, Stan powers on by himself, finds the perfect tree and meets an untimely end. While in Limbo, he has to fight for a second chance at life and battle the forces of good and evil to save his family."
      },
      {
        "id": "tvmaze:14177",
        "title": "Frannie 911",
        "season": 3,
        "episode": 9,
        "released": "2008-01-06",
        "overview": "Francine comes up with an elaborate plan to reunite Stan and Roger after a big fight. She fakes Roger's kidnapping in the hopes of showing Roger that Stan still cares about him, but when Stan never shows up to pay the ransom, it forces Roger to rethink the way he treats people. After all it wouldn't kill him to be nice to people - or would it?"
      },
      {
        "id": "tvmaze:14178",
        "title": "Tearjerker",
        "season": 3,
        "episode": 10,
        "released": "2008-01-13",
        "overview": "Stan and the family are characters in a Bond-style spoof when Stan must stop Tearjerker (a.k.a. Roger), a diabolical film producer, who produces movies that can kill. Tearjerker's fiendish plot involves abducting celebrities from his spa and replacing them with celebrity robots that make horrible movies, all in an effort to make his masterpiece \"Oscar's Gold\" the best and saddest movie ever, causing millions of moviegoers cry themselves to death."
      },
      {
        "id": "tvmaze:14179",
        "title": "Oedipal Panties",
        "season": 3,
        "episode": 11,
        "released": "2008-01-27",
        "overview": "When Stan's mom gets dumped for the umpteenth time by a boyfriend, she comes running to Stan for support. Feeling threatened by her always-visiting mother-in-law, Francine is determined to cut Stan's umbilical cord and figure out what keeps going wrong with the men in her life. Like a regular Cagney &amp; Lacey, Francine and Roger go undercover to solve the case. Meanwhile, Klaus gives Steve the ick."
      },
      {
        "id": "tvmaze:14180",
        "title": "Widowmaker",
        "season": 3,
        "episode": 12,
        "released": "2008-02-17",
        "overview": "Francine pushes Stan to open up to her emotionally, but she gets more than she bargained for when he tells her that he killed her best friend Julie's husband. Meanwhile, Roger plays psychiatrist to help them work through their issues."
      },
      {
        "id": "tvmaze:14181",
        "title": "Red October Sky",
        "season": 3,
        "episode": 13,
        "released": "2008-04-27",
        "overview": "Stan goes in search of a former KGB agent, Sergei, but he's shocked to find the man is his new next door neighbor. When Sergei starts helping Steve build a rocket for class, Stan realizes the boy has turned into a communist. Meanwhile, Roger and Klaus head to France for a little R&amp;R but their trip takes a turn for the worse when Klaus gets busted for smuggling drugs back into the U.S. ."
      },
      {
        "id": "tvmaze:14182",
        "title": "Office Spaceman",
        "season": 3,
        "episode": 14,
        "released": "2008-05-04",
        "overview": "Roger begins to release photos of himself to the local media for extra cash, prompting the CIA to initiate an Alien Task Force. Through a twist of fate, Roger ends up in charge of the task force in disguise, creating tension at home as he is now Stan's boss. Meanwhile Francine comes to grips with being left-handed and Roger frames Stan as an alien in attempt to keep his identity a secret."
      },
      {
        "id": "tvmaze:14183",
        "title": "Stanny Slickers II: The Legend of Ollie's Gold",
        "season": 3,
        "episode": 15,
        "released": "2008-05-11",
        "overview": "Officially declared dead after an accident with a pudding truck, Stan comes back to life and realizes his sweet dream of leaving a legacy on the world. After digging through his past, Stan begins to excavate his home in search of Ollie North's Contra'-band buried treasure. As the search for gold goes North,' life at home begins to head south as Hayley turns to body piercing, Steve creates a robotic girlfriend and Roger files for sexual harassment. Will Stan's gold lust propel him to fame or will he forgo it to save and treasure his family?"
      },
      {
        "id": "tvmaze:14184",
        "title": "Spring Break-Up",
        "season": 3,
        "episode": 16,
        "released": "2008-05-18",
        "overview": "The Smith's marriage is fizzling, leaving Stan feeling unappreciated as Francine visits her parents over spring break. Yet the family is unaware of Roger's own plans to become the 'King of Spring Break,' as he invites college coeds to come party at their revamped home. While Steve tries to lose his virginity to the luscious Carmen Selectra, Stan's tastes lead him to Jessica, his new Spring Break buddy. Stan must now decide whether the booze cruise with Jessica is better than married life."
      },
      {
        "id": "tvmaze:14185",
        "title": "1600 Candles",
        "season": 4,
        "episode": 1,
        "released": "2008-09-28",
        "overview": "The Smith family gets ready to celebrate Roger's big 1-6-double-0 but are sidetracked by Steve's horrifying announcement that he's going through puberty! With the wounds still fresh from Hayley going through \"the change\" in their minds, Stan and Francine use experimental medicine to try and bypass the growing pains of having another teenager with raging hormones. Meanwhile, Roger gets the shaft from the family and tries to make his own birthday fun."
      },
      {
        "id": "tvmaze:14186",
        "title": "The One That Got Away",
        "season": 4,
        "episode": 2,
        "released": "2008-10-05",
        "overview": "When Roger discovers that someone has maxed out his credit card, he is certain it is identify theft and is determined to bring down the crook. After playing \"Matlock\" for a few days and dishing out some street justice, he realizes things are not quite right and seem all too familiar. Meanwhile, the rest of the Smith family gets sucked into a mean game of Simon."
      },
      {
        "id": "tvmaze:14187",
        "title": "One Little Word",
        "season": 4,
        "episode": 3,
        "released": "2008-10-19",
        "overview": "When Stan becomes his boss' go-to guy, he feels like he can't say no to anything including outrageous personal requests. But when Francine gets roped into the annoying ordeal and her romantic Valentine's Day get-away is ruined, she lays down the law and forces Stan to say \"NO\" ."
      },
      {
        "id": "tvmaze:14188",
        "title": "Choosy Wives Choose Smith",
        "season": 4,
        "episode": 4,
        "released": "2008-11-02",
        "overview": "Stan becomes jealous when he finds out Francine was once engaged to a pilot whose plane crashed. Little does she know that her lost love is still alive, but Stan and Roger track him down, Francine is forced to decide between the two men."
      },
      {
        "id": "tvmaze:14189",
        "title": "Escape from Pearl Bailey",
        "season": 4,
        "episode": 5,
        "released": "2008-11-09",
        "overview": "Steve plots to get revenge against the popular girls at school who torment losers.. like his girlfriend Debbie."
      },
      {
        "id": "tvmaze:14190",
        "title": "Pulling Double Booty",
        "season": 4,
        "episode": 6,
        "released": "2008-11-16",
        "overview": "Hayley breaks up with her boyfriend and ends up in the arms of Stan's body double from the CIA, but things get really bizarre when the body double starts hitting on Francine."
      },
      {
        "id": "tvmaze:14191",
        "title": "Phantom of the Telethon",
        "season": 4,
        "episode": 7,
        "released": "2008-11-30",
        "overview": "When the CIA's budget gets cut, Roger suggests that Stan hold a telethon to raise funds. When Stan takes credit for the brilliant idea, Roger does everything in his power to sabotage it."
      },
      {
        "id": "tvmaze:14192",
        "title": "Chimdale",
        "season": 4,
        "episode": 8,
        "released": "2009-01-25",
        "overview": "When Steve finds out he has scoliosis and has to wear a back brace, he becomes the laughingstock of the school, but feels better when Stan admits to wearing a toupee since he was Steve's age. Meanwhile, Roger takes Francine to a weeklong spa retreat for two, but they run into problems when they try to sneak in an unpaid guest."
      },
      {
        "id": "tvmaze:14193",
        "title": "Stan Time",
        "season": 4,
        "episode": 9,
        "released": "2009-02-08",
        "overview": "Stan is exhausted every night and doesn't have any time for himself. When his co-worker Dick (voiced by Koechner) gives him pills that allow him to stay up all night, but feel like he slept a full eight hours - Stan is ecstatic! The pills give Stan an extra dose of energy, but he ultimately discovers that instead of spending his newfound time on hobbies, he'd rather spend more time with his wife."
      },
      {
        "id": "tvmaze:14194",
        "title": "Family Affair",
        "season": 4,
        "episode": 10,
        "released": "2009-02-15",
        "overview": "When the Smiths try to plan a family game night, Roger is full of excuses about prior commitments. However, when he is caught in a lie, the Smiths feel stabbed in the back when they realize Roger has been cheating on them with other families. Stan, Francine, Hayley and Steve go on the offensive to teach Roger a lesson about monogamy until Roger has a breakthrough about why he isn't a one family kind-of-guy."
      },
      {
        "id": "tvmaze:14195",
        "title": "Live and Let Fry",
        "season": 4,
        "episode": 11,
        "released": "2009-03-01",
        "overview": "When Langley Falls implements a ban on trans fats, Stan finds himself legally separated from his favorite foods. He sets a poor example for the rest of the family when he blatantly disregards the law by crossing county lines and using Steve as a trans-fatty food mule to satisfy his own gluttonous desires."
      },
      {
        "id": "tvmaze:14196",
        "title": "Roy Rogers McFreely",
        "season": 4,
        "episode": 12,
        "released": "2009-03-08",
        "overview": "When Stan forgets to pick up grenadine at the grocery store, Roger goes ballistic and vows to get him back by taking over a project close to Stan's heart - the Homeowner's Association. When Roy Rogers McFreely is appointed chairman of the association and starts to abuse his power, Stan, Hayley and Steve lead the opposition to preserve the small town's \"American\" values and take the community back from \"the man\" ."
      },
      {
        "id": "tvmaze:14197",
        "title": "Jack's Back",
        "season": 4,
        "episode": 13,
        "released": "2009-03-15",
        "overview": "Steve signs Stan up for a father-son bike tournament, but the plan veers off-track when Stan admits that his father never taught him how to ride a bike. Determined to make things better, Steve helps reconcile Stan with his convict father. Meanwhile, Hayley needs internship credit for school, so Roger hires her to bartend at his makeshift bar in the attic."
      },
      {
        "id": "tvmaze:14198",
        "title": "Bar Mitzvah Shuffle",
        "season": 4,
        "episode": 14,
        "released": "2009-03-22",
        "overview": "Steve and the gang sabotage a stuck-up kid's bar mitzvah after he hits on Steve's girlfriend, Debbie. But when Snot gets wrongly accused of stealing the kids bar mitzvah money, he must answer to the Rabbi and his own celebration is in jeopardy. Meanwhile, Stan and Francine pitch a cell phone idea to Verizon, but the plan gets fuzzy when they can't deliver the goods."
      },
      {
        "id": "tvmaze:14199",
        "title": "Wife Insurance",
        "season": 4,
        "episode": 15,
        "released": "2009-03-29",
        "overview": "When Stan gets kidnapped in Colombia, Francine fears he's gone for good. Stan finally reappears unharmed, but the real trouble erupts in the Smith household when he admits that he has a plan to marry his dentist if Francine dies before him. Meanwhile, Steve and Roger play detective duo \"Wheels and the Legman\"."
      },
      {
        "id": "tvmaze:14200",
        "title": "Delorean Story-An",
        "season": 4,
        "episode": 16,
        "released": "2009-04-19",
        "overview": "Stan is excited about finally building his dream car: a DeLorean. Francine encourages him to include Steve, so the two take a road trip in search of doors for the sports car. The trip veers off-track when there is a mad dash across the country to get the last set of doors available."
      },
      {
        "id": "tvmaze:14201",
        "title": "Every Which Way But Lose",
        "season": 4,
        "episode": 17,
        "released": "2009-04-26",
        "overview": "Steve joins a junior football team to make Stan proud. However, when a hyper-competitive Stan assumes the position of head coach, Steve gets kicked off the team for not being good enough. Out for revenge, Steve and Roger recruit a new team of misfits who threaten Stan's perfect season. Meanwhile, Francine and Hayley compete for a blue ribbon at the Langley County Fair."
      },
      {
        "id": "tvmaze:14202",
        "title": "Weiner of Our Discontent",
        "season": 4,
        "episode": 18,
        "released": "2009-05-03",
        "overview": "Roger has been behaving like a selfish brat for years, and Stan has had enough! When he calls Roger out, he declares that he has in fact been sent to earth as \"the decider\" to determine the fate of man kind. Stupefied by his outlandish statement, Stan challenges Roger to prove it and when they discover the truth about his real purpose for being on Earth, Roger is crushed and Stan is tickled pink to have finally won one. Roger struggles to get a grip on reality until a fateful crate of hotdogs takes center stage at Steve's hot-dog eating contest and Roger gets to decide who lives and who dies."
      },
      {
        "id": "tvmaze:14203",
        "title": "Daddy Queerest",
        "season": 4,
        "episode": 19,
        "released": "2009-05-10",
        "overview": "Neighbors Terry and Greg are nervous when Terry's father, football great Tank Bates, announces that he will be coming to town for a visit. Terry is worried because his dad doesn't know he's gay, has a baby or lives with his partner. Meanwhile, Steve goes on a drunken bender and learns the meaning of \"beer goggles\" ."
      },
      {
        "id": "tvmaze:14204",
        "title": "Stan's Night Out",
        "season": 4,
        "episode": 20,
        "released": "2009-05-17",
        "overview": "Stan leaves Francine at home to go out with the boys, but guys' night out goes from wild to reckless when Stan finds himself in one compromising situation after another. Meanwhile, Roger and Hayley use their charm and looks to attract a frat boy."
      },
      {
        "id": "tvmaze:14205",
        "title": "In Country...Club",
        "season": 5,
        "episode": 1,
        "released": "2009-09-27",
        "overview": "When Steve is selected to sing the national anthem at the Langley Falls Veterans' Day celebration, he gets some heat from Stan who doesn't think he's ready for such an undertaking. Unimpressed with Steve's vocal talents, Stan decides Steve needs to experience real war in order to sing about our country's military prowess. But things quickly go south when Roger gets involved and Steve goes bananas."
      },
      {
        "id": "tvmaze:14206",
        "title": "Moon Over Isla Island",
        "season": 5,
        "episode": 2,
        "released": "2009-10-04",
        "overview": "Stan has to convince the dictator of Isla Island to sign a treaty in order to get a promotion at work. When Stan meets the general and accidentally kills him, he gets Roger to pose as the leader of the small island nation. However, Roger takes his persona too far and Stan has to rescue him from an impending revolution. Meanwhile, Steve and Snot become competitive to see who can get farther with the other's mom."
      },
      {
        "id": "tvmaze:14207",
        "title": "Home Adrone",
        "season": 5,
        "episode": 3,
        "released": "2009-10-11",
        "overview": "Steve is left home alone when the family takes a trip to look at a potential college for Hayley. When his friends arrive and realize he has the run of the house, they persuade Steve to break the rules. They're soon in over their heads when they discover that what they thought was a video game is actually a military controlled drone. As they attempt to cover their tracks, Roger has a meltdown that keeps the family from making their trip. Stan returns to find that Steve has betrayed his trust and thrust them into a high-level security situation."
      },
      {
        "id": "tvmaze:14208",
        "title": "Brains, Brains, and Automobiles",
        "season": 5,
        "episode": 4,
        "released": "2009-10-18",
        "overview": "When Hayley and Steve leave for their respective summers of fun, Francine looks forward to her newfound alone time with Stan. There's only one problem: Roger is still living in the attic fighting for every second of attention he can get. When Francine teaches Roger to be self-sufficient, he finally gets a place of his own. Stan fears that he will bore Francine into leaving him and cooks up a scheme to bring Roger back to the house and liven things up. Meanwhile at camp, Steve and his pals fall prey to a scheme that doesn't quite have the effect they were hoping for."
      },
      {
        "id": "tvmaze:14209",
        "title": "Man in the Moonbounce",
        "season": 5,
        "episode": 5,
        "released": "2009-11-08",
        "overview": "Stan nearly ruins Steve's birthday party by demanding that Steve act his own age, but Francine saves the day by getting the moonbounce Steve has always wanted. When Stan reluctantly joins in the fun, he comes to realize he never had the chance to be a kid. When Stan has a run-in with local law enforcement, the father-son roles are reversed, forcing Steve to become the man of the house. Meanwhile, Klaus tries to re-capture the feeling of having a human body by getting a haircut."
      },
      {
        "id": "tvmaze:14210",
        "title": "Shallow Vows",
        "season": 5,
        "episode": 6,
        "released": "2009-11-15",
        "overview": "Stan and Francine are set to renew their wedding vows until Stan reveals he only married Francine for her looks. Furious with Stan, Francine \"lets herself go\" to see if Stan actually loves the woman he's been married to for 20 years. Meanwhile, Steve and Hayley search for the perfect wedding gift."
      },
      {
        "id": "tvmaze:14211",
        "title": "My Morning Straitjacket",
        "season": 5,
        "episode": 7,
        "released": "2009-11-22",
        "overview": "When Hayley goes to a My Morning Jacket concert against Stan's wishes, he crashes the show to bring her back home, but when he hears their music for the first time, it calls to him and he's smitten. Stan becomes obsessed with the band and decides to follow them on the road as a groupie."
      },
      {
        "id": "tvmaze:14212",
        "title": "G-String Circus",
        "season": 5,
        "episode": 8,
        "released": "2009-11-29",
        "overview": "Upset that Hayley no longer wants his advice, Stan decides to prove that she is missing out on his sage counseling. After meeting a stripper on an important CIA mission, Stan takes it upon himself to improve her life and show Hayley that his advice works. But when he opens a new business, hoping to prove Hayley wrong, he finds himself dancing for cash to cover up his failures."
      },
      {
        "id": "tvmaze:14213",
        "title": "Rapture's Delight",
        "season": 5,
        "episode": 9,
        "released": "2009-12-13",
        "overview": "When the Smith family goes to church on Christmas Day, Stan is furious when he can't get a good seat. While Francine tries to ease his frustration, a moment of divine intervention occurs. Upset that he has been left on earth with Francine during the ultimate fight between good and evil, Stan ditches his wife to get into the pearly gates of heaven, but when Francine is kidnapped, Stan fights to get her back."
      },
      {
        "id": "tvmaze:14214",
        "title": "Don't Look a Smith Horse in the Mouth",
        "season": 5,
        "episode": 10,
        "released": "2010-01-03",
        "overview": "When Francine demands that Stan get rid of his gas-guzzling SUV because it's draining the family of money, he hatches a plan with Roger at the local horse track to avoid giving up his ride. Meanwhile, it's up to Steve and his friends to help out an old friend."
      },
      {
        "id": "tvmaze:14215",
        "title": "A Jones for a Smith",
        "season": 5,
        "episode": 11,
        "released": "2010-01-31",
        "overview": "Stan puts down liberal social programs because he thinks they're a waste of money and gives Francine a hard time for lending a helping hand at the local homeless shelter. When Stan develops a nasty addiction and needs help, he suddenly has a change of heart."
      },
      {
        "id": "tvmaze:14216",
        "title": "May the Best Stan Win",
        "season": 5,
        "episode": 12,
        "released": "2010-02-14",
        "overview": "Stan gives Francine \"love coupons\" for Valentine's Day, but refuses to honor them once he becomes preoccupied with his very own CIA cyborg. Meanwhile, Roger helps Steve and his friends remake a classic '80s movie."
      },
      {
        "id": "tvmaze:14217",
        "title": "Return of the Bling",
        "season": 5,
        "episode": 13,
        "released": "2010-02-21",
        "overview": "When Stan admits that his heroes include Ronald Reagan and the 1980 U.S. Olympic Hockey Team, including Michael Eruzione and Rob McClanahan, Roger confesses that he played on the team as Chex LeMeneux. But when Roger comes clean that he took steroids to win, they both lose. Meanwhile, Reginald tries to win over Hayley by taking her to a concert."
      },
      {
        "id": "tvmaze:14218",
        "title": "Cops & Roger",
        "season": 5,
        "episode": 14,
        "released": "2010-04-11",
        "overview": "After Roger and Francine are victims of a mugging, Roger joins the police academy so he can learn how to defend himself and his loved ones, but he falls in with a corrupt cop who leads him astray. Meanwhile, Hayley's new friendship threatens her long-term relationship."
      },
      {
        "id": "tvmaze:14219",
        "title": "Merlot Down Dirty Shame",
        "season": 5,
        "episode": 15,
        "released": "2010-04-18",
        "overview": "When Roger and Francine go wine-tasting, Roger plants a big kiss on Francine in a drunken moment. Francine decides to tell Stan about this incident, but when they sit down to talk, Roger convinces Stan that Francine started it all."
      },
      {
        "id": "tvmaze:14220",
        "title": "Bully for Steve",
        "season": 5,
        "episode": 16,
        "released": "2010-04-25",
        "overview": "Roger announces that he is putting a portfolio together so he can study crime scene photography. Meanwhile, Stan follows Steve around for the day and discovers that Steve shies away from obstacles, so he decides to bully Steve so that he will toughen up. But Francine does not approve of Stan's approach and decides to help Steve stand up to Stan."
      },
      {
        "id": "tvmaze:14221",
        "title": "An Incident at Owl Creek",
        "season": 5,
        "episode": 17,
        "released": "2010-05-09",
        "overview": "In preparation for a neighborhood pool party, Stan tells his family to get in tip-top shape. But when an accident ruins the Smith family name, a humiliated Stan fakes his family's deaths and moves everyone out of Langley Falls to escape his shame."
      },
      {
        "id": "tvmaze:14222",
        "title": "Great Space Roaster",
        "season": 5,
        "episode": 18,
        "released": "2010-05-16",
        "overview": "It's Roger's birthday, and he begs to be roasted, but when he ends up devastated by the jokes, he vows to pull his life together. Things take a turn for the worse when Roger takes it one step too far, causing the Smith family to go on the run."
      },
      {
        "id": "tvmaze:14223",
        "title": "100 A.D., Pt 1 of 2",
        "season": 6,
        "episode": 1,
        "released": "2010-10-03",
        "overview": "Hayley sends the family into chaos after she and her old boyfriend run off and elope. Stan offers a reward to whomever stops the couple, sparking a cannonball run through town in order to stop them in the \"100 A.D.."
      },
      {
        "id": "tvmaze:14224",
        "title": "Son of Stan, Pt. 2 of 2",
        "season": 6,
        "episode": 2,
        "released": "2010-10-10",
        "overview": "After Stan creates a clone of Steve, Francine and Stan compete with each other to determine who has better parenting skills. Meanwhile, Roger tracks down the AWOL bride and groom in Thailand."
      },
      {
        "id": "tvmaze:14225",
        "title": "Best Little Horror House in Langley Falls",
        "season": 6,
        "episode": 3,
        "released": "2010-11-07",
        "overview": "Stan and Francine have had the scariest haunted house on the block for eight years running, but when one of their neighbors provides some stiff competition, Stan ups the ante with a \"killer\" set-up. Meanwhile, Steve falls head over heels for his overprotective friend's younger sister and competes to win her heart in a Halloween showdown."
      },
      {
        "id": "tvmaze:14226",
        "title": "Stan's Food Restaurant",
        "season": 6,
        "episode": 4,
        "released": "2010-11-14",
        "overview": "Stan is ecstatic when Roger offers to help him live out his lifelong dream of opening a restaurant to rival his favorite childhood haunt - until their different visions for what the eatery should be cause havoc. Meanwhile, Steve meets Ashley, the new girl in school who invites him over while her parents are out of town."
      },
      {
        "id": "tvmaze:14227",
        "title": "White Rice",
        "season": 6,
        "episode": 5,
        "released": "2010-11-21",
        "overview": "After an argument between Stan and Francine breaks out, Stan suggests they go see a counselor, who hypnotizes Francine and reawakens her lifelong dream of being a comedian. Meanwhile, back in Langley Falls, Steve brings home a potential love interest for Klaus."
      },
      {
        "id": "tvmaze:14228",
        "title": "There Will Be Bad Blood",
        "season": 6,
        "episode": 6,
        "released": "2010-11-28",
        "overview": "It's Thanksgiving in Langley Falls, and as usual, Stan invites his half-brother, Rusty, over to show off his cornucopia of wealth and good fortune. But when Stan finds out that Rusty is far wealthier than he led on, Stan tries to take from Rusty what he feels is rightfully his. Things don't go well, and the Smith family nearly loses it all."
      },
      {
        "id": "tvmaze:14229",
        "title": "The People vs. Martin Sugar",
        "season": 6,
        "episode": 7,
        "released": "2010-12-05",
        "overview": "If there's one thing that Stan Smith loves, it's a good jury trial. He anxiously awaits his annual jury summons. But when Roger is the defendant in the trial where Stan is the foreman, he is finally in a position to make Roger accountable for his misdeeds. Meanwhile, Jeff and Hayley move in with the Smiths, and Francine tries to get Jeff to clean up his act."
      },
      {
        "id": "tvmaze:14230",
        "title": "For Whom the Sleigh Bell Tolls",
        "season": 6,
        "episode": 8,
        "released": "2010-12-12",
        "overview": "Stan gives Steve a gun for Christmas, even though Francine warns him that Steve is too young. As usual, Stan ignores her, and when Steve accidentally shoots Santa, he sends the North Pole into a tizzy and jeopardizes Christmas."
      },
      {
        "id": "tvmaze:14231",
        "title": "Fartbreak Hotel",
        "season": 6,
        "episode": 9,
        "released": "2011-01-16",
        "overview": "After Roger releases lethal gas into the Smith residence, the family moves into a hotel while the fumes clear. With no housework to do, Francine finds herself with a lot of free time on her hands. After befriending the hotel concierge (guest voice Elizondo), she soon finds herself working in the construction business, but realizes that perhaps she is better suited for family life."
      },
      {
        "id": "tvmaze:14232",
        "title": "Stanny Boy and Frantastic",
        "season": 6,
        "episode": 10,
        "released": "2011-01-23",
        "overview": "When Stan and Francine meet a young couple, Tom and Cami, their predictable lives get a shot of adrenaline as they do their best to keep up with the younger couple's crazy and adventurous lifestyle. But it isn't long before Stan and Francine struggle to keep up and come up with a plan to slow Tom and Cami down permanently."
      },
      {
        "id": "tvmaze:14233",
        "title": "A Piñata Named Desire",
        "season": 6,
        "episode": 11,
        "released": "2011-02-13",
        "overview": "With a flair for the dramatic, Roger invites Stan to attend one of his acting classes. However, tempers flare when they both audition for the same role, leaving them to duke it out for top dog. Meanwhile, Steve and his friends get into a pillow fight when they try to plan the greatest slumber party ever."
      },
      {
        "id": "tvmaze:14234",
        "title": "You Debt Your Life",
        "season": 6,
        "episode": 12,
        "released": "2011-02-20",
        "overview": "When Stan and Roger disagree over a recent string of events, Roger moves out of the house in protest but is quickly replaced by another warm body. After Roger learns of the replacement roomie, the two of them battle for Stan's affection. Meanwhile, Steve gets a new job at school that allows him to do a little self-promotion over the P.A. system."
      },
      {
        "id": "tvmaze:14235",
        "title": "I Am the Walrus",
        "season": 6,
        "episode": 13,
        "released": "2011-03-27",
        "overview": "When Steve challenges Stan for family dominance, Stan does everything he can to prove to Steve that he is the alpha male of the Smith house. Meanwhile, Hayley and Jeff seek marriage counseling when the honeymoon phase wears off."
      },
      {
        "id": "tvmaze:14236",
        "title": "School Lies",
        "season": 6,
        "episode": 14,
        "released": "2011-04-03",
        "overview": "In an attempt to advance in the CIA, Stan begins playing golf with Senator Buckingham. Things are going well until Roger accidentally sells the senator's daughter to a drug lord, forcing Stan must choose between family and his career."
      },
      {
        "id": "tvmaze:14237",
        "title": "License to Till",
        "season": 6,
        "episode": 15,
        "released": "2011-04-10",
        "overview": "When Steve has trouble crossing over into the \"cool kids\" social circle, Klaus and Roger place their bets to see how quickly Roger can make him cool. Everything they try backfires until Steve becomes the in-crowds designated driver. Meanwhile, Stan and Francine take turns pranking each other."
      },
      {
        "id": "tvmaze:14238",
        "title": "Jenny Fromdabloc",
        "season": 6,
        "episode": 16,
        "released": "2011-04-17",
        "overview": "After Snot professes his love for Hayley and gets shot down, Steve and Roger devise a plan to cheer him up. Roger dresses up as Steve's cousin from New Jersey, Jenny Fromdabloc, and Snot falls hard for her. Meanwhile, Stan wants to live like a gentleman of the 1960s, complete with dark suits and dry martinis."
      },
      {
        "id": "tvmaze:14239",
        "title": "Home Wrecker",
        "season": 6,
        "episode": 17,
        "released": "2011-05-08",
        "overview": "Stan and Francine fight over how to redecorate the house. It goes so far that they split the house down the middle and try to live without each other."
      },
      {
        "id": "tvmaze:14240",
        "title": "Flirting with Disaster",
        "season": 6,
        "episode": 18,
        "released": "2011-05-15",
        "overview": "Francine gets a job at Stan's office, which cramps Stan's style and his ability to flirt with co-workers. When Francine retaliates with a little flirting of her own, war breaks out at work."
      },
      {
        "id": "tvmaze:14241",
        "title": "Gorillas in the Mist",
        "season": 6,
        "episode": 19,
        "released": "2011-05-22",
        "overview": "Stan spends some quality father-son time with Steve at the local zoo, but things go horribly wrong when Steve slips into a gorilla exhibit. Meanwhile, Roger bets Hayley that he can become a great Country singer and sets out to write the most heartbreaking song of all time."
      },
      {
        "id": "tvmaze:14242",
        "title": "Hot Water",
        "season": 7,
        "episode": 1,
        "released": "2011-09-25",
        "overview": "Stan is stressed by family life so he decides to buy a hot tub for the backyard, but he becomes obsessed and when the hot tub starts singing and encourages some bad behavior they are all in trouble."
      },
      {
        "id": "tvmaze:14243",
        "title": "Hurricane!",
        "season": 7,
        "episode": 2,
        "released": "2011-10-02",
        "overview": "When a storm hits Langley Falls, the Smiths decide to stay home, they must fight tooth and nail to survive."
      },
      {
        "id": "tvmaze:14244",
        "title": "A Ward Show",
        "season": 7,
        "episode": 3,
        "released": "2011-11-06",
        "overview": "Roger becomes Steve's legal guardian, but gets a little too overzealous in the parenting department and gets Steve's BFF Principal Brian Lewis fired. After getting beat up by the other teachers at the school, Steve decides to run away. Meanwhile Stan and Francine attempt to make waves after discovering that their vacation to the biggest water park in the world fails to get their hearts pumping."
      },
      {
        "id": "tvmaze:14245",
        "title": "The Worst Stan",
        "season": 7,
        "episode": 4,
        "released": "2011-11-13",
        "overview": "When Stan realizes that he might never fulfill his dream of becoming a Best Man, he convinces his last single friend, Principal Lewis, to marry the school's Superintendent and to choose him as his Best Man. Stan invites Lewis' old friend from prison to the wedding, only to discover a secret that could prevent the wedding from happening at all. Meanwhile, Roger finds the perfect pair of shorts, and an encounter with Ricky Martin makes him question his self-confidence."
      },
      {
        "id": "tvmaze:14246",
        "title": "Virtual In-Stanity",
        "season": 7,
        "episode": 5,
        "released": "2011-11-20",
        "overview": "After realizing that he has missed every milestone in Steve's life, Stan makes a desperate attempt to bond with his son by creating a busty blonde bombshell alias, Phyllis, whom he sends Steve's way. When Stan oversteps his boundaries, Francine intervenes to keep's Steve's virginity out of \"blonde's\" way. Meanwhile, Roger starts his own limo service, and when a group of guys \"drive and dash,\" he goes on a manhunt to get his revenge."
      },
      {
        "id": "tvmaze:14247",
        "title": "The Scarlett Getter",
        "season": 7,
        "episode": 6,
        "released": "2011-11-27",
        "overview": "When Stan runs into his former crush from CIA boot camp, his affection for her resurfaces, which drives Francine into a jealous frenzy. By including Roger in her plan for revenge, Francine accidentally leads him straight into the arms of a dangerous alien hunter. Meanwhile, Steve is struck with good luck, when he accidentally wears Hayley's panties to school."
      },
      {
        "id": "tvmaze:14248",
        "title": "Season's Beatings",
        "season": 7,
        "episode": 7,
        "released": "2011-12-11",
        "overview": "Father Donovan holds a Christmas play at the mall and casts Stan as Santa Claus and Roger as Jesus. But after the two get in a fight and cause a scene, Stan is kicked out of the church. Meanwhile, Hayley and Jeff adopt a child who turns out to be possessed."
      },
      {
        "id": "tvmaze:14249",
        "title": "The Unbrave One",
        "season": 7,
        "episode": 8,
        "released": "2012-01-08",
        "overview": "When Steve tries to prove himself as a macho man to Stan, he follows in Roger's footsteps and tries to change himself from the outside in with a superhero persona. Meanwhile, Francine is going through an identity crisis of her own when she receives surprising news that could change the family forever."
      },
      {
        "id": "tvmaze:14250",
        "title": "Stanny Tendergrass",
        "season": 7,
        "episode": 9,
        "released": "2012-01-29",
        "overview": "When Stan finally has enough money to afford a membership at the golf club he has worked at for the past thirty summers, his hard work and perseverance prove to be futile when the club gives a membership to Steve first. However, things are not all what they seem when Stan realizes who the club owner really is."
      },
      {
        "id": "tvmaze:14251",
        "title": "Wheels & the Legman and the Case of Grandpa's Key",
        "season": 7,
        "episode": 10,
        "released": "2012-02-12",
        "overview": "Stan joins Roger and Steve's fictional detective agency, but he ruins the fun by being extremely incompetent at his \"job.\" Roger demands that Steve fire Stan, but Steve cannot bring himself to do it and ends up lying to Roger. Things take a turn for the worse when Stan is kidnapped, and Steve must tell Roger the truth."
      },
      {
        "id": "tvmaze:14252",
        "title": "Old Stan in the Mountain",
        "season": 7,
        "episode": 11,
        "released": "2012-02-19",
        "overview": "When Stan is overly enthusiastic about his hatred for old people, a hex is placed on him that turns him into a frail, old man. Meanwhile, Roger takes Francine on a road trip to a dance competition, but she soon finds out it's not what she bargained for."
      },
      {
        "id": "tvmaze:14253",
        "title": "The Wrestler",
        "season": 7,
        "episode": 12,
        "released": "2012-03-04",
        "overview": "When Barry threatens Stan's old high school wrestling record, Stan enlists Roger to beat Barry and defend his small claim to fame. However, Stan is caught off-guard when Roger, not Barry, is actually the threat to Stan's record."
      },
      {
        "id": "tvmaze:14254",
        "title": "Dr. Klaustus",
        "season": 7,
        "episode": 13,
        "released": "2012-03-11",
        "overview": "Roger acts as the Smith family therapist under his \"Dr. Penguin\" alter-ego, but his services are put on hold when he is sent to Iraq to fight in the war. Klaus seizes his opportunity to be the go-to counselor of the household, but ends up causing a major ruckus."
      },
      {
        "id": "tvmaze:14255",
        "title": "Stan's Best Friend",
        "season": 7,
        "episode": 14,
        "released": "2012-03-18",
        "overview": "Despite Stan's objections, Francine buys Steve the dog he's always wanted. However, when the dog suffers a horrific accident, Stan refuses to take the pup off life support because of a traumatic childhood incident."
      },
      {
        "id": "tvmaze:14256",
        "title": "Less Money, Mo' Problems",
        "season": 7,
        "episode": 15,
        "released": "2012-03-25",
        "overview": "After losing patience with Hayley and Jeff for their freeloading ways, Stan bets the young couple that he and Francine can live on minimum wage for a month. Meanwhile, Steve and Roger embark on a mission to test drive the car of their dreams."
      },
      {
        "id": "tvmaze:14257",
        "title": "The Kidney Stays in the Picture",
        "season": 7,
        "episode": 16,
        "released": "2012-04-01",
        "overview": "Stan discovers that Francine was unfaithful one night before she and Stan married. With the possibility that Hayley may not be his biological daughter, he travels back in time to find out who the mystery dad might be. But when he inadvertently disrupts the events of the past, he must do everything to avoid changing the future."
      },
      {
        "id": "tvmaze:14258",
        "title": "Ricky Spanish",
        "season": 7,
        "episode": 17,
        "released": "2012-05-06",
        "overview": "Roger rediscovers his alter-ego \"Ricky Spanish,\" an infamous character who remains the most despised man in town. Meanwhile, Stan and Francine are in for a surprise when their sponsored child from Africa shows up on their doorstep."
      },
      {
        "id": "tvmaze:14259",
        "title": "Toy Whorey",
        "season": 7,
        "episode": 18,
        "released": "2012-05-13",
        "overview": "When Stan catches Steve playing imaginary games with his toys, he decides to take his son down to Mexico to help him become a man. But the trip takes a turn for the worse when Stan and Steve are kidnapped by a drug cartel, and it's up to Steve to break himself and Stan out of captivity."
      },
      {
        "id": "tvmaze:14260",
        "title": "Love, AD Style",
        "season": 8,
        "episode": 1,
        "released": "2012-09-30",
        "overview": "Roger opens a crooner's bar in the Smith family's attic and recruits Hayley as his main entertainer. Soon, all of Langley Falls becomes enthralled by her singing voice - including Roger, who takes his crush on Hayley a bit too far. Meanwhile, Stan tries to prove his manhood by negotiating a good deal on a new car."
      },
      {
        "id": "tvmaze:14261",
        "title": "Killer Vacation",
        "season": 8,
        "episode": 2,
        "released": "2012-10-07",
        "overview": "The Smith family's tropical vacation turns out to be anything but relaxing when Stan is assigned a mission to kill the activities director at their resort, whom his boss at the CIA insists is an ex-war criminal. Meanwhile, Hayley and Jeff try to rekindle their fading romance, while Roger, as his latest persona, Abigail Lemonparty, falls for an older gentleman."
      },
      {
        "id": "tvmaze:14262",
        "title": "Can I Be Frank with You?",
        "season": 8,
        "episode": 3,
        "released": "2012-11-04",
        "overview": "Francine fears that she and Stan are growing apart because he spends so much time hanging out with his buddies at the \"CIA Chill House.\" Meanwhile, Steve and his friends are recruited to join a boy band and make a music video."
      },
      {
        "id": "tvmaze:14263",
        "title": "American Stepdad",
        "season": 8,
        "episode": 4,
        "released": "2012-11-18",
        "overview": "Stan invites his mother to come live with the family after Stan's stepfather dies, and tensions rise when Roger is forced to share his attic with her. But Roger and Stan's mom quickly fall in love and get married, and Stan is forced to deal with Roger as his new stepdad. Meanwhile, Steve and his friends discover a mysterious plane crash while on a bike ride and come across a long-lost script of a \"Fast and Furious\" movie that they are determined to get made."
      },
      {
        "id": "tvmaze:14264",
        "title": "Why Can't We Be Friends?",
        "season": 8,
        "episode": 5,
        "released": "2012-12-02",
        "overview": "Stan decides that Snot isn't cool enough to be Steve's best friend. So he attempts to separate them by staging a shooting at an ice cream parlor, of which Snot is the only witness and is then placed in the CIA Witness Protection program. Meanwhile, Roger hires Jeff to clean his attic for extra cash, but keeps robbing him every time he goes back downstairs."
      },
      {
        "id": "tvmaze:14265",
        "title": "Adventures in Hayleysitting",
        "season": 8,
        "episode": 6,
        "released": "2012-12-09",
        "overview": "The Smith family's regular babysitter, Lindsay, breaks her leg in a soccer match. So Stan and Francine are forced to leave Steve with Hayley, despite her track record of being extremely irresponsible. When Hayley teases Steve about being a goody-two-shoes, Steve is determined to prove her wrong and sneaks out of the house to go to a party with the cool kids."
      },
      {
        "id": "tvmaze:14266",
        "title": "National Treasure 4: Baby Franny: She's Doing Well: The Hole Story",
        "season": 8,
        "episode": 7,
        "released": "2012-12-23",
        "overview": "A Langley Falls talk show outs Francine as \"Baby Franny,\" the toddler who was once rescued from a well by a heroic fireman. Then, on the anniversary of her rescue, she falls down the well again and makes a shocking discovery. Meanwhile, Stan and Roger have an entrepreneurial \"eureka!\" moment when they think of the world's next game-changing business opportunity - male stripper shoes."
      },
      {
        "id": "tvmaze:14267",
        "title": "Finger Lenting Good",
        "season": 8,
        "episode": 8,
        "released": "2013-01-06",
        "overview": "Francine encourages the family to give up their various vices, but they all get drunk at Roger's Mardi Gras party and enter into a harrowing pact with Bullock. Meanwhile, a pastie is left in the attic, Cinderella-style, and Roger sets out to find the \"perfect bosom\" on which to place it."
      },
      {
        "id": "tvmaze:14268",
        "title": "The Adventures of Twill Ongenbone and His Boy Jabari",
        "season": 8,
        "episode": 9,
        "released": "2013-01-13",
        "overview": "Francine tries to teach Roger the value of hard work after his character \"Twill Ongenbone\" fakes a degree in archaeology, but she quickly regrets her decision. Meanwhile, Steve asks Stan questions about Stan's past for a school project, but is shocked by what he hears."
      },
      {
        "id": "tvmaze:14269",
        "title": "Blood Crieth Unto Heaven",
        "season": 8,
        "episode": 10,
        "released": "2013-01-27",
        "overview": "In a tribute to and send-up of the Pulitzer Prize-winning play, \"August: Osage County,\" a dark secret is revealed about the Smith family's past when Francine invites Stan's incarcerated dad, Jack, to Stan's birthday party. Also in this spoof, Roger plays Edna, a maid who nurses Bullock and Hayley's love child. But when Edna falls in love with Bullock, it could mean dire consequences for the kid."
      },
      {
        "id": "tvmaze:14270",
        "title": "Max Jets",
        "season": 8,
        "episode": 11,
        "released": "2013-02-10",
        "overview": "Roger announces that \"Max Jets,\" a character of Roger's who enjoys showering the Smith family with money, is soon getting out of prison. But a wrench is thrown in the system when Max falls in love with Gina, a gold-digging waitress who threatens the family's inheritance."
      },
      {
        "id": "tvmaze:14271",
        "title": "Naked to the Limit, One More Time",
        "season": 8,
        "episode": 12,
        "released": "2013-02-17",
        "overview": "Roger pretends to be Jeff's imaginary friend, so he can freely roam naked around the house with no disguise. But when big-mouth Jeff figures out that Roger is an alien, Stan issues an ultimatum: either Roger or Jeff must be killed immediately. Meanwhile, Steve becomes insecure about the shape of his rear end."
      },
      {
        "id": "tvmaze:14272",
        "title": "For Black Eyes Only",
        "season": 8,
        "episode": 13,
        "released": "2013-03-10",
        "overview": "In Part 2 of \"The Tearjerker Saga,\" a \"James Bond\" parody, Stan and his wife, Sexpun Tocome's honeymoon is brutally interrupted when Black Villain fatally shoots Sexpun. Determined to get his revenge, Stan teams up with former nemesis The Tearjerker to track down Black Villain and put a stop to his evil plan to melt the arctic glaciers."
      },
      {
        "id": "tvmaze:14273",
        "title": "Spelling Bee My Baby",
        "season": 8,
        "episode": 14,
        "released": "2013-03-24",
        "overview": "Francine discovers Steve's special talent that will help him get into a great school: spelling. But when she fears that Steve is being distracted by Hiko's sister, Akiko, she takes drastic measures to ensure victory at the Pearl Bailey High School Spelling Bee. Meanwhile, Stan and Roger want Hayley to line-judge their badminton game, but she's still devastated over Jeff, so they decide to push her through the five stages of grief as quickly as possible."
      },
      {
        "id": "tvmaze:14274",
        "title": "The Missing Kink",
        "season": 8,
        "episode": 15,
        "released": "2013-04-14",
        "overview": "Francine does all she can to make Stan take on a different mission. And when he does, she learns that her missionary man is all she really needs. Then, Hayley tries to get back into the dating scene with disastrous results, and reluctantly submits to Snot's advance, agreeing to a dinner date."
      },
      {
        "id": "tvmaze:14275",
        "title": "The Boring Identity",
        "season": 8,
        "episode": 16,
        "released": "2013-04-21",
        "overview": "Francine tries to mold Stan into her ideal husband when he gets amnesia after falling off an arcade game during a CIA operation to capture the \"real\" Osama bin Laden (who, apparently, has been managing a \"Dave and Buster's\" restaurant in Florida). Meanwhile, Roger lets Steve join his paper route to earn some extra money, but Steve is drawn into the corrupt side of the business."
      },
      {
        "id": "tvmaze:14276",
        "title": "The Full Cognitive Redaction of Avery Bullock by the Coward Stan Smith",
        "season": 8,
        "episode": 17,
        "released": "2013-04-28",
        "overview": "Stan is shocked when Agent Crisp from CIA Internal Affairs tells him that Deputy Director Bullock is showing early signs of dementia and must have his memory erased. Meanwhile, Steve runs into a bully at school, so Roger hires an old friend - Stelio Kontos - to take care of the problem."
      },
      {
        "id": "tvmaze:14277",
        "title": "Lost in Space",
        "season": 8,
        "episode": 18,
        "released": "2013-05-05",
        "overview": "In the special 150th episode, the series travels to the slave spaceship that abducted Jeff -- with Roger's help - after Jeff discovered his secret (hint: Roger is an alien). To find his way home, Jeff must first prove to the evil Emperor Zing that he was always in love with Hayley."
      },
      {
        "id": "tvmaze:14278",
        "title": "Da Flippity Flop",
        "season": 8,
        "episode": 19,
        "released": "2013-05-12",
        "overview": "Klaus discovers his original human body, but Stan refuses to help him switch back. So, Klaus steals Stan's body and Stan becomes the fish. Meanwhile, Roger turns the attic into a gym, and tries to pressure Steve into a long-term membership."
      },
      {
        "id": "tvmaze:14279",
        "title": "Steve and Snot's Test-Tubular Adventure",
        "season": 9,
        "episode": 1,
        "released": "2013-09-29",
        "overview": "Thwarted in their efforts to secure dates for the upcoming high school prom, Steve and Snot turn to the CIA's cloning machine to churn out two willing ladies. But, when the device produces two uber-fast-growing newborn babies, the boys must break out their fathering skills to ready them in time for prom night. Meanwhile, Stan takes home the CIA's cloned pet, Daren the Dodo, with disastrous consequences."
      },
      {
        "id": "tvmaze:14280",
        "title": "Poltergasm",
        "season": 9,
        "episode": 2,
        "released": "2013-10-06",
        "overview": "Francine's \"Poltergasm\" starts to haunt the Smith household when she is unsatisfied by Stan in the sack, and Roger must conjure a medium named Zelda Rubinstein to help eliminate the ghost. Meanwhile, Hayley introduces her new boy-toy, Mauricio, to the family."
      },
      {
        "id": "tvmaze:14281",
        "title": "Buck, Wild",
        "season": 9,
        "episode": 3,
        "released": "2013-11-03",
        "overview": "Steve is eager to prove that he's no longer a little boy, so he sets off to prove his manhood by joining Stan, Bullock and the rest of the CIA on their annual hunting trip. Meanwhile, Roger and Klaus set off on a cross-country road trip."
      },
      {
        "id": "tvmaze:14282",
        "title": "Crotchwalkers",
        "season": 9,
        "episode": 4,
        "released": "2013-11-10",
        "overview": "In a desperate attempt to show Steve that she's still a \"cool\" mom, Francine teaches him a vast array of shoplifting techniques to try out at the local mall. B when their attempt to pull off the ultimate heist at \"The Gash\" goes awry, Steve is captured and sent to a Venezuelan sweatshop. Meanwhile, Roger, Hayley and Klaus form Langley Falls' first Russian Balalaika trio."
      },
      {
        "id": "tvmaze:14283",
        "title": "Kung Pao Turkey",
        "season": 9,
        "episode": 5,
        "released": "2013-11-24",
        "overview": "Stan's plans for a perfect Thanksgiving watching football in his underwear are thwarted when Francine invites her adoptive parents to join them for the holiday. Meanwhile, Francine's mom encourages Hayley to get back on the dating scene and invites an eligible bachelor over, but her true intentions are revealed at Thanksgiving dinner."
      },
      {
        "id": "tvmaze:14284",
        "title": "Independent Movie",
        "season": 9,
        "episode": 6,
        "released": "2013-12-01",
        "overview": "Determined to get Snot to confront his emotions after his father passes away, Steve and friends embark on an epic cross-country road trip to the funeral. But Steve's commitment to his friend wavers when he falls for a Pixie Dream Girl along the way. Meanwhile, Stan and Roger invent an automatic cake-cutter for the Home Shopping Network, but their partnership is tested when they only make a \"verbal agreement\" to split the profits."
      },
      {
        "id": "tvmaze:14285",
        "title": "Faking Bad",
        "season": 9,
        "episode": 7,
        "released": "2013-12-08",
        "overview": "In this \"Breaking Bad\" parody, Hayley tries to fit in with a popular group of her former high school friends and, in the process, discovers Steve has an amazing ability to create incredibly realistic fake IDs. Sensing a business opportunity, Hayley builds out Steve's operation, but they don't count on having to deal with the other kingpin of the Langley Falls fake ID game: Kevin Ramage (Roger in disguise)."
      },
      {
        "id": "tvmaze:14286",
        "title": "Minstrel Krampus",
        "season": 9,
        "episode": 8,
        "released": "2013-12-15",
        "overview": "When Steve starts acting like a spoiled brat during the holidays, Stan takes him to see his incarcerated Grandpa Jack, who tells him the story of how he caught Minstrel Krampus, a legendary demon who punishes naughty children on Christmas. Stan decides that releasing Krampus is the only way to straighten out Steve's attitude. But when Krampus kidnaps Steve, it's up to Stan and Roger to get him back. Meanwhile, Hayley gets a job at the airport, but quickly realizes that she might not be cut out for customer service."
      },
      {
        "id": "tvmaze:14287",
        "title": "Vision: Impossible",
        "season": 9,
        "episode": 9,
        "released": "2014-01-05",
        "overview": "Roger suffers a horrific car crash as he tries to take a picture of his crotch on a traffic speed cam. After waking up from a coma, he starts to have eerie visions of the future, and saves the Smiths from a terrible fire. But, Roger's abuse of his newfound powers soon draws the ire of his fellow family members and the Smiths must learn to cope with the uncertainty of the future."
      },
      {
        "id": "tvmaze:14288",
        "title": "Familyland",
        "season": 9,
        "episode": 10,
        "released": "2014-01-12",
        "overview": "Francine is eager to re-live the Smith kids' childhood theme park adventures on a family visit to \"Familyland.\" But, when the nefarious and cryogenically-frozen founder of the theme park, Roy Family, is mistakenly thawed, the Smiths find themselves prisoners of the medieval-themed park."
      },
      {
        "id": "tvmaze:14289",
        "title": "Cock of the Sleepwalk",
        "season": 9,
        "episode": 11,
        "released": "2014-01-26",
        "overview": "Stan mixes up his nighttime routine after his 100th kill, but mistakenly unleashes a \"good\" Stan in his sleep - Jekyll &amp; Hyde-style - who's hell-bent on pursuing all the good deeds that real Stan would never consider, and stopping him from ever killing again."
      },
      {
        "id": "tvmaze:14290",
        "title": "Introducing the Naughty Stewardesses",
        "season": 9,
        "episode": 12,
        "released": "2014-03-16",
        "overview": "Roger and Steve switch faces in a scheme that has the former wooing an attractive girl for the latter, but things come to a head when Roger actually falls for the young lady. Meanwhile, Stan and Francine take to the sky as \"Charlie's Angels\"-type flight attendants to thwart a sinister scheme concocted by Mark Cuban."
      },
      {
        "id": "tvmaze:14291",
        "title": "I Ain't No Holodeck Boy",
        "season": 9,
        "episode": 13,
        "released": "2014-03-23",
        "overview": "Against Francine's wishes, Stan takes the housebound kids into the woods for some outdoor playtime, where they wind up on the CIA's holodeck. Meanwhile, Hayley claims she is Roger's queen after purchasing his home star on an international star registry."
      },
      {
        "id": "tvmaze:14292",
        "title": "Stan Goes on the Pill",
        "season": 9,
        "episode": 14,
        "released": "2014-03-30",
        "overview": "Stan turns into a \"woman\" after taking an experimental drug."
      },
      {
        "id": "tvmaze:14293",
        "title": "Honey, I'm Homeland",
        "season": 9,
        "episode": 15,
        "released": "2014-04-06",
        "overview": "Stan attempts to infiltrate the \"Occupy\" movement, based on CIA intelligence that a leftist cell is planning a terrorist attack. But when he's captured and returned home by a group of radicals, Hayley suspects her father may have been \"turned\"."
      },
      {
        "id": "tvmaze:14294",
        "title": "She Swill Survive",
        "season": 9,
        "episode": 16,
        "released": "2014-04-13",
        "overview": "Stan fears that Hayley has no life skills, so he forces her to take a job as a bartender in Roger's attic haunt. However, when Bullock becomes Hayley's best customer, Stan realizes that he can use his daughter's knowledge to get ahead at work."
      },
      {
        "id": "tvmaze:14295",
        "title": "Rubberneckers",
        "season": 9,
        "episode": 17,
        "released": "2014-04-27",
        "overview": "Stan's co-workers at the CIA teach him about \"rubbernecking,\" the art of checking out other women on the sly, away from the gaze of their wives. But when Stan causes a massive accident in an attempt to take a picture of an attractive jogger, he's interviewed by an intimidating insurance inspector who may rat out Stan to Francine. Meanwhile, Roger and Klaus spill wine on the Smiths' brand new couch, and vow never to tell the other family members by sitting on the stained spot for the rest of their lives."
      },
      {
        "id": "tvmaze:14296",
        "title": "Permanent Record Wrecker",
        "season": 9,
        "episode": 18,
        "released": "2014-05-04",
        "overview": "Stan is fired from the CIA in a round of budget cuts, but since his 20 years of work experience are classified and hidden from his \"permanent record\", the only job he's able to land is at the local grocery store where Steve is the manager. Meanwhile, Roger bets an annoying coffee shop musician that he can outplay him in one week. To accomplish his goal, he enters into a Faustian bargain with Lorenzo, a guitar-instructing infomercial host."
      },
      {
        "id": "tvmaze:14297",
        "title": "News Glance with Genevieve Vavance",
        "season": 9,
        "episode": 19,
        "released": "2014-05-11",
        "overview": "Hayley starts an internship at a local news station working for a Nancy Grace-type reporter, who happens to be Roger in disguise. T.J. Miller, Nat Faxon and Josh Groban guest-voice."
      },
      {
        "id": "tvmaze:14298",
        "title": "The Longest Distance Relationship",
        "season": 9,
        "episode": 20,
        "released": "2014-05-18",
        "overview": "A year after Jeff's abduction, Hayley is still heartbroken, until she meets Millionaire Matt Davis, who may be able to help her move forward. Things are going great, until Steve and Snot catch a signal on a CB radio - Jeff's alive in space and trying to make it back to Hayley."
      },
      {
        "id": "tvmaze:14299",
        "title": "Roger Passes the Bar",
        "season": 10,
        "episode": 1,
        "released": "2014-09-14",
        "overview": "Roger is forced to sell his beloved attic bar to a restaurant chain after suffering a heart attack, and a sexy new next-door neighbor promises to take Steve and his friends' virginity in return for housework. Then, Roger movies in with Greg and Terry."
      },
      {
        "id": "tvmaze:14300",
        "title": "A Boy Named Michael",
        "season": 10,
        "episode": 2,
        "released": "2014-09-14",
        "overview": "At a party celebrating Greg and Terry's adoption of a 10-year-old Russian boy, Roger gets a taste of their sophisticated lifestyle and decides to reject the Smiths and indoctrinate himself into his cultured neighbors' lives."
      },
      {
        "id": "tvmaze:14301",
        "title": "Blagsnarst, A Love Story",
        "season": 10,
        "episode": 3,
        "released": "2014-09-21",
        "overview": "Roger and Francine discover an alien in the woods, and Roger capriciously has a one-night relationship with her before being fed up with her quirks. He tries to get rid of her by calling the CIA, but then realizes that he can't go through with it."
      },
      {
        "id": "tvmaze:14302",
        "title": "Blonde Ambition",
        "season": 11,
        "episode": 1,
        "released": "2014-10-20",
        "overview": "When her efforts to save the planet prove hopeless, Hayley decides that she might get more attention if she becomes a blonde. Meanwhile, Stan and Steve go on a mission to find a new home for the Smiths."
      },
      {
        "id": "tvmaze:14303",
        "title": "CIAPOW",
        "season": 11,
        "episode": 2,
        "released": "2014-10-27",
        "overview": "When Bullock sends a drone to do the job Stan and his colleagues are supposed to do, Stan is determined to prove that humans are better than robots. Meanwhile, Francine and the rest of the family participate in a slow motion race against each other in the living room."
      },
      {
        "id": "tvmaze:14304",
        "title": "Scents and Sensei-bility",
        "season": 11,
        "episode": 3,
        "released": "2014-11-03",
        "overview": "Steve and Snot are fed up with being bullied. When they enroll in a karate class, Snot is brainwashed by the sensei and its Steve's mission to get him back. Meanwhile, Klaus develops a horrible odor and is forced into being an outside pet."
      },
      {
        "id": "tvmaze:14305",
        "title": "Big Stan on Campus",
        "season": 11,
        "episode": 4,
        "released": "2014-11-10",
        "overview": "When the CIA is forced to make cut backs and go on furlough, Stan volunteers to take a position as a College Campus Security Guard. Meanwhile, Roger opens a bed and breakfast in order to boost the families' income."
      },
      {
        "id": "tvmaze:14306",
        "title": "Now and Gwen",
        "season": 11,
        "episode": 5,
        "released": "2014-11-17",
        "overview": "When Francine's sister Gwen comes to town, Hayley suspects she is up to no good. Meanwhile, Stan teaches Steve the art of hugging Aunt Gwen and Klaus shadows Roger's dramatic comments."
      },
      {
        "id": "tvmaze:14307",
        "title": "Dreaming of a White Porsche Christmas",
        "season": 11,
        "episode": 6,
        "released": "2014-12-01",
        "overview": "When Stan wishes he could have Principal Lewis' carefree, single life, a la It's a Wonderful Life, his wish comes true! Meanwhile, in his wish world, Principal Lewis has Stan's family."
      },
      {
        "id": "tvmaze:129001",
        "title": "LGBSteve",
        "season": 11,
        "episode": 7,
        "released": "2015-02-23",
        "overview": "The roller derby team will only let Hayley play if her \"sister\" Steve can play too; a magical carpenter visits Stan and Francine."
      },
      {
        "id": "tvmaze:129002",
        "title": "Morning Mimosa",
        "season": 11,
        "episode": 8,
        "released": "2015-03-02",
        "overview": "When Steve says \"F-U\" to Francine, she refuses to cook for him and he becomes a successful chef, appearing on a popular morning show. Meanwhile, Stan thinks he can make people invisible by snapping his fingers."
      },
      {
        "id": "tvmaze:129003",
        "title": "My Affair Lady",
        "season": 11,
        "episode": 9,
        "released": "2015-03-09",
        "overview": "Hayley starts a new job and may be starting a new romance as she becomes attracted to a coworker. Meanwhile, Stan drives Francine and Steve to the Mother-Son dance."
      },
      {
        "id": "tvmaze:129004",
        "title": "A Star is Reborn",
        "season": 11,
        "episode": 10,
        "released": "2015-03-16",
        "overview": "While on vacation in Los Angeles, California, Stan joins the world of old Hollywood., as an old Hollywood actress becomes convinced that Stan is the reincarnation of her dead husband, a former Hollywood actor named Leonard Prince. Meanwhile, Roger kennel trains Steve and Hayley."
      },
      {
        "id": "tvmaze:129005",
        "title": "Manhattan Magical Murder Mystery Tour",
        "season": 11,
        "episode": 11,
        "released": "2015-03-23",
        "overview": "Francine is up for an award for her lonely housewife novel, so the family heads to the big apple for the ceremony. Meanwhile, Stan and Hayley hang out with actor Robert Wuhl and Steve and Roger recreate their Wheels and the Legman persona."
      },
      {
        "id": "tvmaze:129006",
        "title": "The Shrink",
        "season": 11,
        "episode": 12,
        "released": "2015-03-30",
        "overview": "Stan is horrified when he sees a couple die in a car crash and goes to see a shrink. Meanwhile, Roger and Klaus study for a wine tasting."
      },
      {
        "id": "tvmaze:155368",
        "title": "Holy Shit, Jeff's Back!",
        "season": 11,
        "episode": 13,
        "released": "2015-05-18",
        "overview": "Jeff has escaped from space, or has he?"
      },
      {
        "id": "tvmaze:156101",
        "title": "American Fung",
        "season": 11,
        "episode": 14,
        "released": "2015-05-25",
        "overview": "Is sold to a Chinese businessman. Meanwhile, Stan has Francine committed to an insane asylum when he forgets their anniversary."
      },
      {
        "id": "tvmaze:156868",
        "title": "Seizures Suit Stanny",
        "season": 11,
        "episode": 15,
        "released": "2015-06-01",
        "overview": "When Stan lies about his texting and driving accident, he takes a seizure medication and suffers from the side effects. Meanwhile, Roger helps Steve with his performance anxiety."
      },
      {
        "id": "tvmaze:508572",
        "title": "Roots",
        "season": 12,
        "episode": 1,
        "released": "2016-01-25",
        "overview": "Stan sets out to stop a tree that he considers his father from being cut down. Steve realizes heÂs stopped growing and considers surgery."
      },
      {
        "id": "tvmaze:583603",
        "title": "The Life Aquatic with Steve Smith",
        "season": 12,
        "episode": 2,
        "released": "2016-02-01",
        "overview": "Steve joins the high school water polo team to get girls. Meanwhile, Roger and Stan get a boat."
      },
      {
        "id": "tvmaze:583604",
        "title": "Hayley Smith, Seal Team Six",
        "season": 12,
        "episode": 3,
        "released": "2016-02-08",
        "overview": "Hayley mentally regresses to a 6-year-old. Steve and his pals get a slow cooker."
      },
      {
        "id": "tvmaze:583605",
        "title": "N.S.A. (No Snoops Allowed)",
        "season": 12,
        "episode": 4,
        "released": "2016-02-15",
        "overview": "Steve goes to work with Stan and discovers the N.S.A.. Hayley decides to let go of being a vegetarian and eat meat for one day."
      },
      {
        "id": "tvmaze:583606",
        "title": "Stan Smith as Keanu Reeves as Stanny Utah in Point Breakers",
        "season": 12,
        "episode": 5,
        "released": "2016-02-22",
        "overview": "Stan goes undercover as a surfer a la Point Break. Steve befriends a drifter, Hayley might be pregnant, and Roger wants the World Cup to be held in the backyard."
      },
      {
        "id": "tvmaze:583607",
        "title": "Kiss Kiss, Cam Cam",
        "season": 12,
        "episode": 6,
        "released": "2016-02-29",
        "overview": "After Stan and Francine have a terrible \"Kiss Cam\" experience, Stan questions everything about their marriage."
      },
      {
        "id": "tvmaze:583608",
        "title": "The Devil Wears a Lapel Pin",
        "season": 12,
        "episode": 7,
        "released": "2016-03-07",
        "overview": "Stan is enlisted to organize the CIA calendar, but Hayley sets out to destroy it. Elsewhere, Roger fakes his own death to avoid paying a huge balance on a credit card."
      },
      {
        "id": "tvmaze:583609",
        "title": "Stan-Dan Deliver",
        "season": 12,
        "episode": 8,
        "released": "2016-03-14",
        "overview": "Roger serves as a teacher at Steve's school, involving himself with underprivileged kids. Elsewhere, Stan decides to stay at a retirement home."
      },
      {
        "id": "tvmaze:583610",
        "title": "Anchorfran",
        "season": 12,
        "episode": 9,
        "released": "2016-03-21",
        "overview": "Francine tries to help news anchor Greg deal with a breakup. Also, Roger grows obsessed with a fictional boy from an old game."
      },
      {
        "id": "tvmaze:621948",
        "title": "The Two Hundred",
        "season": 12,
        "episode": 10,
        "released": "2016-03-28",
        "overview": "Stan, tattooed and haunted, travels a barren Langley Falls alone. Meanwhile, a mysterious element known as The Two Hundred has reigned terror on the town and separated Stan from his family."
      },
      {
        "id": "tvmaze:621949",
        "title": "The Unincludeds",
        "season": 12,
        "episode": 11,
        "released": "2016-04-11",
        "overview": "Steve and Snot alter their futures when they throw a party for the uncool kids. Meanwhile, Roger is disgruntled when a waitress doesn't compliment his order."
      },
      {
        "id": "tvmaze:621950",
        "title": "The Dentist's Wife",
        "season": 12,
        "episode": 12,
        "released": "2016-04-18",
        "overview": "Roger loses his identity after becoming fascinated by a local dentist's wife. Meanwhile, Klaus throws a party when Stan and the kids are unable to move from being sore."
      },
      {
        "id": "tvmaze:653025",
        "title": "Widow's Pique",
        "season": 12,
        "episode": 13,
        "released": "2016-04-25",
        "overview": "When Stan is on a mission, Francine pretends she's a widow. Steve and his friends play wrestling and get beat up by Principal Lewis."
      },
      {
        "id": "tvmaze:653026",
        "title": "The Nova Centauris-burgh Board of Tourism Presents: American Dad",
        "season": 12,
        "episode": 14,
        "released": "2016-05-02",
        "overview": "Francine joins in on Steve and his pals' live-action role-playing game. Stan opens a knock-off Seaworld in the house."
      },
      {
        "id": "tvmaze:653027",
        "title": "Daesong Heavy Industries",
        "season": 12,
        "episode": 15,
        "released": "2016-05-09",
        "overview": "Stan loses his faith in religion after Steve questions everything in the Bible. He takes the family to Korea to investigate the rumors of a reinvented \"Noah's Ark.\""
      },
      {
        "id": "tvmaze:653028",
        "title": "Daesong Heavy Industries II: Return to Innocence",
        "season": 12,
        "episode": 16,
        "released": "2016-05-16",
        "overview": "Everyone is separated after the ship explodes: Stan and Francine lose their memories and resort to primitive living on an island."
      },
      {
        "id": "tvmaze:653029",
        "title": "Criss-Cross Applesauce: The Ballad of Billy Jesusworth",
        "season": 12,
        "episode": 17,
        "released": "2016-05-23",
        "overview": "When Roger breaks his ankle, Francine convinces Stan to let him play in his basketball league."
      },
      {
        "id": "tvmaze:669285",
        "title": "Mine Struggle",
        "season": 12,
        "episode": 18,
        "released": "2016-05-30",
        "overview": "When Stan discovers a salt mine in the backyard, the Morton Salt Company wants to buy it. It turns out Steve is the rightful owner of the land and he faces pressure from the family."
      },
      {
        "id": "tvmaze:753669",
        "title": "Garfield and Friends",
        "season": 12,
        "episode": 19,
        "released": "2016-06-06",
        "overview": "To teach Hayley a history lesson, Stan brings President James A. Garfield back to life from the 19th century; and Steve lands a job writing for the school newspaper."
      },
      {
        "id": "tvmaze:753699",
        "title": "Gift Me Liberty",
        "season": 12,
        "episode": 20,
        "released": "2016-06-13",
        "overview": "Stan undertakes a mission to uncover who neglected to bring a gift to the CIA's Secret Santa party; and good-guy Steve fills in as boyfriend to several female classmates."
      },
      {
        "id": "tvmaze:753736",
        "title": "Next of Pin",
        "season": 12,
        "episode": 21,
        "released": "2016-06-20",
        "overview": "Stan and Steve start bowling together to have more quality time and Steve gets discovered for his bowling talent. Klaus holds a contest to test Roger and Hayley."
      },
      {
        "id": "tvmaze:754139",
        "title": "Standard Deviation",
        "season": 12,
        "episode": 22,
        "released": "2016-06-27",
        "overview": "In order to avoid being sent on a suicide mission, Stan learns how to become a DJ to beat Bullock in a DJ battle. Jeff takes up drinking psychadelic teas and Roger helps him."
      },
      {
        "id": "tvmaze:907143",
        "title": "Father's Daze",
        "season": 13,
        "episode": 1,
        "released": "2016-11-07",
        "overview": "The Smith family forgets to celebrate Father's Day, and so to make it up to Stan, they plan out the perfect day. Stan uses a CIA device to erase their memories and have them continually plan perfect days for him."
      },
      {
        "id": "tvmaze:959194",
        "title": "Fight and Flight",
        "season": 13,
        "episode": 2,
        "released": "2016-11-14",
        "overview": "Stan goes over-the-top to produce a reenactment of Charles Lindbergh's solo flight for Steve's school project after he gets an F. Klaus buys a pair of shoes online and Hayley helps him harass the neighbor they believe has stolen them."
      },
      {
        "id": "tvmaze:959195",
        "title": "The Enlightenment of Ragi-Baba",
        "season": 13,
        "episode": 3,
        "released": "2016-11-21",
        "overview": "Hayley takes Roger with her to a meditation center and he quickly takes over, becoming one of the worldÂs leading authorities on meditation. Stan and Steve become apprentices as they are taught the art of making sushi."
      },
      {
        "id": "tvmaze:959196",
        "title": "Portrait of Francine's Genitals",
        "season": 13,
        "episode": 4,
        "released": "2016-11-28",
        "overview": "Stan is embarrassed when a painting of Francine's genitals, done by a famous artist, is unveiled at the museum. Steve turns to helping people after masturbation."
      },
      {
        "id": "tvmaze:968609",
        "title": "Bahama Mama",
        "season": 13,
        "episode": 5,
        "released": "2016-12-05",
        "overview": "Stan is upset at the idea of becoming a grandfather after Hayley and Jeff announce they're trying to have a baby. Steve and Klaus join a drug gang"
      },
      {
        "id": "tvmaze:968610",
        "title": "Roger's Baby",
        "season": 13,
        "episode": 6,
        "released": "2016-12-12",
        "overview": "Hayley experiences what pregnancy would be like after Roger agrees to give birth to Jeff so he can be human again. Snot's feelings are hurt"
      },
      {
        "id": "tvmaze:968611",
        "title": "Ninety North, Zero West",
        "season": 13,
        "episode": 7,
        "released": "2016-12-19",
        "overview": "The Smith family must rescue Steve after he is kidnapped and taken to the North Pole. There, Santa Claus is using children to mine for precious stones that he needs"
      },
      {
        "id": "tvmaze:1075107",
        "title": "A Whole Slotta Love",
        "season": 13,
        "episode": 8,
        "released": "2017-04-10",
        "overview": "*Corrected*Stan is obsessed with mini-track-race cars and Francine needs to get to the bottom of why he's always staying late after work.Roger becomes a flight attendant... but soon that apirals out of control...as with everything Roger touches.*additional*I edited the description after watching the episode and found out it was the description for episode 09/13 which is released on April 17th."
      },
      {
        "id": "tvmaze:1075108",
        "title": "The Witches of Langley",
        "season": 13,
        "episode": 9,
        "released": "2017-04-17",
        "overview": "Steve and his friends take up witchcraft to gain power and popularity at school. Stan and Klaus become obsessed with remembering 90s bands."
      },
      {
        "id": "tvmaze:1075109",
        "title": "A Nice Night for a Drive",
        "season": 13,
        "episode": 10,
        "released": "2017-04-24",
        "overview": "Klaus gets transferred into the navigation system of Stan's car when Stan refuses to pay for life-saving surgery; Steve and his friends prank Roger, who then terrorizes them for revenge."
      },
      {
        "id": "tvmaze:1100568",
        "title": "Casino Normale",
        "season": 13,
        "episode": 11,
        "released": "2017-05-01",
        "overview": "Francine steals from the CIA and pretends to be a super villain to incite Stan to be more seductive; Roger tricks Hayley and Steve into trapping Jay Leno so he can take revenge."
      },
      {
        "id": "tvmaze:1100569",
        "title": "Bazooka Steve",
        "season": 13,
        "episode": 12,
        "released": "2017-05-29",
        "overview": "Steve becomes the town pariah after he convinces the star quarterback of the arena football team to stop playing; Roger forces Hayley to become a cab driver to pay him back for her gambling debts."
      },
      {
        "id": "tvmaze:1162941",
        "title": "Camp Campawanda",
        "season": 13,
        "episode": 13,
        "released": "2017-06-05",
        "overview": "Steve is upset when Snot threatens their summer camp fun by becoming a counselor-in-training. Hayley and Jeff are suspicious of Roger when he organizes a Burning Man reenactment in the yard for their anniversary."
      },
      {
        "id": "tvmaze:1171082",
        "title": "Julia Rogerts",
        "season": 13,
        "episode": 14,
        "released": "2017-06-12",
        "overview": "Roger runs off in disguise as a Julia Roberts character to a small town after Stan hurts his feelings. Steve plans a meeting when he finds out that Jeff and Barry have never met."
      },
      {
        "id": "tvmaze:1202529",
        "title": "The Life and Times of Stan Smith",
        "season": 13,
        "episode": 15,
        "released": "2017-07-24",
        "overview": "Stan becomes addicted to dying after Roger tricks him into thinking he had a heart attack; Klaus takes Steve to Arizona State University for a college visit, where a fraternity hazes him."
      },
      {
        "id": "tvmaze:1202530",
        "title": "The Bitchin' Race",
        "season": 13,
        "episode": 16,
        "released": "2017-07-31",
        "overview": "The family competes on the reality show, \"The Bitchin' Race\", but after Stan and Hayley ditch the less-motivated Steve and Francine to team up, they end up in a Tunisian labor prison."
      },
      {
        "id": "tvmaze:1222663",
        "title": "Family Plan",
        "season": 13,
        "episode": 17,
        "released": "2017-08-07",
        "overview": "Francine reconnects with her birth family when she starts craving the experience of having a big family. Meanwhile, Stan becomes a Picker based on his obsession with American Pickers."
      },
      {
        "id": "tvmaze:1222664",
        "title": "The Long Bomb",
        "season": 13,
        "episode": 18,
        "released": "2017-08-14",
        "overview": "While having trouble communicating, Stan and Hayley team up to stop a terrorist plot to blow up the Bazooka Sharks arena. Meanwhile, Roger pretends to be an escort."
      },
      {
        "id": "tvmaze:1253742",
        "title": "Kloger",
        "season": 13,
        "episode": 19,
        "released": "2017-08-21",
        "overview": "Roger and Klaus start having a secret affair after they accidentally end up on an online date together. Meanwhile, Steve tries to catch Hayley's pink eye to get out of doing a fitness test at school."
      },
      {
        "id": "tvmaze:1253743",
        "title": "Garbage Stan",
        "season": 13,
        "episode": 20,
        "released": "2017-08-28",
        "overview": "Stan and Steve open up their own father-son garbage business after Stan inherits his father's old truck. Meanwhile, Roger finds Hayley is a natural at bumper pool and brings her to play with the best player in town."
      },
      {
        "id": "tvmaze:1265062",
        "title": "The Talented Mr. Dingleberry",
        "season": 13,
        "episode": 21,
        "released": "2017-09-04",
        "overview": "Roger becomes a marionette and injures other students to help Steve win the school talent show. Meanwhile, Stan, Hayley and Klaus start their own local honey business."
      },
      {
        "id": "tvmaze:1265063",
        "title": "West to Mexico",
        "season": 13,
        "episode": 22,
        "released": "2017-09-11",
        "overview": "Stan becomes a wanted man, running from Roger the bounty hunter, and ends up in a town in need of a good guy to help Principal Lewis, Francine, Steve and Hayley."
      },
      {
        "id": "tvmaze:1370834",
        "title": "Santa, Schmanta",
        "season": 14,
        "episode": 1,
        "released": "2017-12-25",
        "overview": "When the Smiths are too busy preparing for Christmas to pay attention to Roger, Roger turns his attention to Steve's friend Snot. Snot teaches Roger about Hanukkah, prompting Roger to convert to Judaism. Roger then decides that he can make Hanukkah more popular than Christmas by stealing Santa Claus' powers and becoming Schmanta Claus. But, being Roger, he abuses his new Schmanta powers leading the Smiths and Snot to find the real Santa Claus in an attempt to take down Roger."
      },
      {
        "id": "tvmaze:1378725",
        "title": "Paranoid Frandroid",
        "season": 14,
        "episode": 2,
        "released": "2018-02-12",
        "overview": "Francine is happy watching vapid morning talk shows and ignoring real world news. When she decides to surprise Stan at work she accidentally discovers that Stan has been running her favorite show in an attempt to shelter her from the real world. Francine turns to Roger who leads her into the twisted world of conspiracy theories. Meanwhile, Steve and Klaus help Snot's family move into a new apartment."
      },
      {
        "id": "tvmaze:1378726",
        "title": "The Census of the Lambs",
        "season": 14,
        "episode": 3,
        "released": "2018-02-19",
        "overview": "Stan and Hayley compete in collecting data for the U.S. Census; Klaus has Steve and his friends model for his new camera."
      },
      {
        "id": "tvmaze:1378727",
        "title": "Shell Game",
        "season": 14,
        "episode": 4,
        "released": "2018-02-26",
        "overview": "Steve and Roger are bird-watching when they see a strange man steal the bird eggs. Steve and Roger follow the man and learn that he is part of a secret organization that collects rare and endangered bird eggs."
      },
      {
        "id": "tvmaze:1407876",
        "title": "The Mural of the Story",
        "season": 14,
        "episode": 5,
        "released": "2018-03-05",
        "overview": "Stan discovers that the Langley Falls historical mural has been ruined by graffiti and neglect and convinces the town to allow him to restore the mural himself; Roger becomes Steve's instructor at a prestigious clowning university."
      },
      {
        "id": "tvmaze:1407877",
        "title": "(You Gotta) Strike for Your Right",
        "season": 14,
        "episode": 6,
        "released": "2018-03-12",
        "overview": "Hayley gets a job as a delivery driver and begins delivering lunch to Stan's office; when she sees the terrible work conditions, she organizes a strike; the family watches Breaking Bad in reverse and discovers the show is hiding a scavenger hunt."
      },
      {
        "id": "tvmaze:1407878",
        "title": "Klaustastrophe.tv",
        "season": 14,
        "episode": 7,
        "released": "2018-03-19",
        "overview": "Stan deals with childhood issues of abandonment. Klaus starts a website to embarrass the Smith family about their fails."
      },
      {
        "id": "tvmaze:1407879",
        "title": "Death by Dinner Party",
        "season": 14,
        "episode": 8,
        "released": "2018-03-26",
        "overview": "Francine hosts a dinner party even though a serial killer who attacks dinner parties is terrorizing the town; when the lights go out and guests start to disappear, Roger takes charge of solving the mystery of who is stalking the party."
      },
      {
        "id": "tvmaze:1418093",
        "title": "The Never-Ending Stories",
        "season": 14,
        "episode": 9,
        "released": "2018-04-09",
        "overview": "Bullock asks Stan to fill in for him at his class at the CIA Academy and Stan finds that the cadets are the perfect captive audience for his boring stories; Klaus becomes the hype-man for a famous rapper."
      },
      {
        "id": "tvmaze:1418094",
        "title": "Railroaded",
        "season": 14,
        "episode": 10,
        "released": "2018-04-16",
        "overview": "Stan is frustrated with traffic so he goes to the mayor and proposes that the town build a bullet train, but the mayor laughs off the idea; Roger pushes Stan into running for mayor; Stan wins the election but finds himself overwhelmed."
      },
      {
        "id": "tvmaze:1418095",
        "title": "My Purity Ball and Chain",
        "season": 14,
        "episode": 11,
        "released": "2018-04-23",
        "overview": "Steve is acting out his sexual energy, so Francine asks Stan to give Steve the talk; Stan is terrified because he's afraid he will do it wrong; the family builds a giant water slide in the backyard."
      },
      {
        "id": "tvmaze:1425177",
        "title": "OreTron Trail",
        "season": 14,
        "episode": 12,
        "released": "2018-04-30",
        "overview": "Roger becomes worried about outliving the family; Klaus opens a convenience store in the attic."
      },
      {
        "id": "tvmaze:1423293",
        "title": "Mean Francine",
        "season": 14,
        "episode": 13,
        "released": "2018-05-07",
        "overview": "Francine falls in with a group of tough girls after becoming the new school guidance counselor. Jeff panics when he loses his hat."
      },
      {
        "id": "tvmaze:1553920",
        "title": "One-Woman Swole",
        "season": 14,
        "episode": 14,
        "released": "2019-02-11",
        "overview": "Tired of never finishing what she starts, Francine takes bodybuilding to an unhealthy extreme."
      },
      {
        "id": "tvmaze:1599375",
        "title": "Flavortown",
        "season": 14,
        "episode": 15,
        "released": "2019-02-18",
        "overview": "Jeff starts hanging out with Stan's favorite celebrity chef while in search of an identity. Klaus and Roger start their own valet operation."
      },
      {
        "id": "tvmaze:1604938",
        "title": "Persona Assistant",
        "season": 14,
        "episode": 16,
        "released": "2019-02-25",
        "overview": "In the show's 250th episode, Stan has to take over Roger's different personas after a tumor takes him out of commission. Principal Lewis pressures Steve and the school choir to do whatever it takes to win."
      },
      {
        "id": "tvmaze:1610421",
        "title": "The Legend of Old Ulysses",
        "season": 14,
        "episode": 17,
        "released": "2019-03-04",
        "overview": "Steve gets competitive during the father-son events at Possum Lake. Roger learns how to ride a bike."
      },
      {
        "id": "tvmaze:1612592",
        "title": "Twinanigans",
        "season": 14,
        "episode": 18,
        "released": "2019-03-11",
        "overview": "Steve and Roger restart their career as a twin brother acting duo. The family becomes addicted to a novelty gift shop."
      },
      {
        "id": "tvmaze:1615020",
        "title": "Top of the Steve",
        "season": 14,
        "episode": 19,
        "released": "2019-03-18",
        "overview": "Steve goes to boarding school, only to discover it's an all-girls school. Stan is annoyed by a parade of characters that come to take Steve's place at home."
      },
      {
        "id": "tvmaze:1619000",
        "title": "Funnyish Games",
        "season": 14,
        "episode": 20,
        "released": "2019-03-25",
        "overview": "Francine becomes obsessed with home security after a break-in rattles her. Steve tries on Hayley's laidback approach to school work."
      },
      {
        "id": "tvmaze:1624768",
        "title": "Fleabiscuit",
        "season": 14,
        "episode": 21,
        "released": "2019-04-01",
        "overview": "Hayley feels left behind after Jeff becomes a star dog racing coach. Steve takes advantage of an empty house."
      },
      {
        "id": "tvmaze:1624769",
        "title": "The Future is Borax",
        "season": 14,
        "episode": 22,
        "released": "2019-04-08",
        "overview": "While trying to rekindle their marriage, Stan and Francine get trapped on a hot air balloon. The rest of the family wins a jingle writing contest."
      },
      {
        "id": "tvmaze:1624770",
        "title": "Fantasy Baseball",
        "season": 15,
        "episode": 1,
        "released": "2019-04-15",
        "overview": "Steve tries to use baseball to connect with his father."
      },
      {
        "id": "tvmaze:1624771",
        "title": "I Am the Jeans: The Gina Lavetti Story",
        "season": 15,
        "episode": 2,
        "released": "2019-04-22",
        "overview": "Francine tries to be a better friend to one of Roger's personas who is selling her homemade jeans on TV. Stan and Steve swap eyebrows."
      },
      {
        "id": "tvmaze:1624772",
        "title": "Stan & Francine & Connie & Ted",
        "season": 15,
        "episode": 3,
        "released": "2019-04-29",
        "overview": "Steve introduces Stan and Francine to Barry's parents and Steve regrets it. Roger goes blind."
      },
      {
        "id": "tvmaze:1640674",
        "title": "Rabbit Ears",
        "season": 15,
        "episode": 4,
        "released": "2019-05-06",
        "overview": "Stan gets obsessed with a 1960s television show after picking up a secondhand TV. Roger decides to live as a baby and the family cares for him."
      },
      {
        "id": "tvmaze:1645045",
        "title": "Jeff and the Dank Ass Weed Factory",
        "season": 15,
        "episode": 5,
        "released": "2019-05-13",
        "overview": "Jeff wins a tour through a mysterious weed factory and brings Stan along."
      },
      {
        "id": "tvmaze:1647779",
        "title": "Lost Boys",
        "season": 15,
        "episode": 6,
        "released": "2019-05-20",
        "overview": "Roger breaks up Steve's friendship with Snot, Barry &amp; Toshi. Jeff realizes he has a flair for house flipping and gets Stan, Francine and Hayley involved."
      },
      {
        "id": "tvmaze:1653314",
        "title": "Shark?!",
        "season": 15,
        "episode": 7,
        "released": "2019-05-27",
        "overview": "Stan has Roger pretend to be a shark to help Steve overcome his fears. Hayley's friend Danuta becomes romantically interested in Klaus."
      },
      {
        "id": "tvmaze:1654080",
        "title": "The Long March",
        "season": 15,
        "episode": 8,
        "released": "2019-06-03",
        "overview": "Hayley and Jeff move into a van and start living life on the open road; Francine and Steve are haunted by a rideshare driver that they rated poorly."
      },
      {
        "id": "tvmaze:1654081",
        "title": "The Hall Monitor and the Lunch Lady",
        "season": 15,
        "episode": 9,
        "released": "2019-06-10",
        "overview": "Steve goes undercover as a school hall monitor; Roger and Stan go catatonic after witnessing a grisly escalator accident."
      },
      {
        "id": "tvmaze:1654082",
        "title": "Wild Women Do",
        "season": 15,
        "episode": 10,
        "released": "2019-06-17",
        "overview": "Jeff is forced to take Francine out for a not-so-wild night on the town. Klaus forces Steve to watch his celebrity impressions."
      },
      {
        "id": "tvmaze:1654083",
        "title": "An Irish Goodbye",
        "season": 15,
        "episode": 11,
        "released": "2019-06-24",
        "overview": "Francine helps Hayley take a break from their marriages. Stan and Jeff pretend to be frontiersmen."
      },
      {
        "id": "tvmaze:1654084",
        "title": "Stompe Le Monde",
        "season": 15,
        "episode": 12,
        "released": "2019-07-01",
        "overview": "Stan buys the rights to a Broadway show after inheriting money from a dead uncle."
      },
      {
        "id": "tvmaze:1654085",
        "title": "Mom Sauce",
        "season": 15,
        "episode": 13,
        "released": "2019-07-08",
        "overview": "Steve's life is turned upside down when Snot gets rich after his mom starts selling a new dipping sauce. Klaus, Stan, Roger and Jeff become mall fashion show models."
      },
      {
        "id": "tvmaze:1654086",
        "title": "Hamerican Dad!",
        "season": 15,
        "episode": 14,
        "released": "2019-07-15",
        "overview": "Stan, reluctantly invites Roger into his ham club. Francine decides to scare Greg."
      },
      {
        "id": "tvmaze:1654087",
        "title": "Demolition Daddy",
        "season": 15,
        "episode": 15,
        "released": "2019-07-22",
        "overview": "Thanks to Roger, Snot discovers his dead father was a demolition derby driver. Hayley takes Steve on a road trip, so he can learn to drive."
      },
      {
        "id": "tvmaze:1654088",
        "title": "Pride Before the Fail",
        "season": 15,
        "episode": 16,
        "released": "2019-07-29",
        "overview": "Roger tries to force Hayley into graduating from community college so he can move into her room. Klaus repairs Francine's car."
      },
      {
        "id": "tvmaze:1654089",
        "title": "Enter Stanman",
        "season": 15,
        "episode": 17,
        "released": "2019-08-05",
        "overview": "Roger helps Stan enter Francine's dreams after he becomes insecure about their contents."
      },
      {
        "id": "tvmaze:1654090",
        "title": "No Weddings and a Funeral",
        "season": 15,
        "episode": 18,
        "released": "2019-08-12",
        "overview": "Klaus leaves the family after one too many harassments. 15 years later, they reconnect for his funeral."
      },
      {
        "id": "tvmaze:1654091",
        "title": "Eight Fires",
        "season": 15,
        "episode": 19,
        "released": "2019-08-19",
        "overview": "Roger helps Francine with her terrible cooking by bringing her to a remote Patagonian island. Stan gets a nail in his head and can't speak."
      },
      {
        "id": "tvmaze:1654092",
        "title": "The Hand That Rocks the Rogu",
        "season": 15,
        "episode": 20,
        "released": "2019-08-26",
        "overview": "Steve babysits Roger's ex-tumor, Rogu, to prove to Francine that he's ready for the responsibility. Stan and Francine get into trouble in their respective clubs."
      },
      {
        "id": "tvmaze:1791424",
        "title": "100 Years a Solid Fool",
        "season": 16,
        "episode": 1,
        "released": "2020-04-13",
        "overview": "While running an errand in Little Columbia, Stan is confronted by his hidden past."
      },
      {
        "id": "tvmaze:1833822",
        "title": "Downtown",
        "season": 16,
        "episode": 2,
        "released": "2020-04-20",
        "overview": "Hayley drives Steve to a testing center in \"no good\" downtown but they end up stranded in a worse suburban neighborhood. Stan, Francine, and Roger mistakenly go downtown to rescue them."
      },
      {
        "id": "tvmaze:1836553",
        "title": "Cheek to Cheek: A Stripper's Story",
        "season": 16,
        "episode": 3,
        "released": "2020-04-27",
        "overview": "Roger enlists Jeff as his protégé in order to open his dream chivalric strip club. Klaus moves into Steve's room."
      },
      {
        "id": "tvmaze:1840072",
        "title": "A Starboy is Born",
        "season": 16,
        "episode": 4,
        "released": "2020-05-04",
        "overview": "Stan abducts The Weeknd to teach Roger a valuable lesson. Meanwhile, Hayley attempts to sleep with the celebrity singer."
      },
      {
        "id": "tvmaze:1848021",
        "title": "Tapped Out",
        "season": 16,
        "episode": 5,
        "released": "2020-05-11",
        "overview": "Steve discovers his mom has never stopped giving him her breastmilk."
      },
      {
        "id": "tvmaze:1857818",
        "title": "Brave N00b World",
        "season": 16,
        "episode": 6,
        "released": "2020-05-18",
        "overview": "Stan and Steve enter an e-sports game tournament to save the world. The rest of the family get stuck in a banister."
      },
      {
        "id": "tvmaze:1861682",
        "title": "Into the Woods",
        "season": 16,
        "episode": 7,
        "released": "2020-05-25",
        "overview": "When Stan sees a middle-school classmate, he feels compelled to right an old wrong; Francine tries to scare Greg."
      },
      {
        "id": "tvmaze:1866183",
        "title": "One Fish, Two Fish",
        "season": 16,
        "episode": 8,
        "released": "2020-06-01",
        "overview": "Hayley takes extreme measures to help Klaus from being deported while the rest of the family tries to open a coconut."
      },
      {
        "id": "tvmaze:1881224",
        "title": "Exquisite Corpses",
        "season": 16,
        "episode": 9,
        "released": "2020-06-08",
        "overview": "Jeff, Francine and Roger decide to team up and start their own bus tour business, with murderous results!"
      },
      {
        "id": "tvmaze:1883551",
        "title": "Trophy Wife, Trophy Life",
        "season": 16,
        "episode": 10,
        "released": "2020-06-15",
        "overview": "After Stan is injured, Francine nurses him back to health and he becomes dependent on her; the family discovers Tuttle is a Korean reality show star."
      },
      {
        "id": "tvmaze:1883549",
        "title": "Game Night",
        "season": 16,
        "episode": 11,
        "released": "2020-06-22",
        "overview": "Stan drags the family to a labyrinth for family game night; Roger gets some geese."
      },
      {
        "id": "tvmaze:1883550",
        "title": "American Data?",
        "season": 16,
        "episode": 12,
        "released": "2020-06-29",
        "overview": "Steve and the boys take part in a prison experiment to earn some cash. Meanwhile, Stan deals with the death of his CIA groundskeeper friend."
      },
      {
        "id": "tvmaze:1891598",
        "title": "Salute Your Sllort",
        "season": 16,
        "episode": 13,
        "released": "2020-07-06",
        "overview": "Steve's efforts to befriend a Swedish exchange student backfire in a big way; The family calls in an animal behaviorist to deal with Klaus."
      },
      {
        "id": "tvmaze:1896458",
        "title": "Ghost Dad",
        "season": 16,
        "episode": 14,
        "released": "2020-07-13",
        "overview": "Stan struggles to cope with the untimely death of his father. Meanwhile, a simple canoeing trip does catastrophic damage to Hayley and Jeff's relationship."
      },
      {
        "id": "tvmaze:1896459",
        "title": "Men II Boyz",
        "season": 16,
        "episode": 15,
        "released": "2020-07-20",
        "overview": "Klaus enlists Stan, Roger and Jeff to join him on a wild bachelor party weekend."
      },
      {
        "id": "tvmaze:1899097",
        "title": "First, Do No Farm",
        "season": 16,
        "episode": 16,
        "released": "2020-07-27",
        "overview": "Concerned that Hayley is too soft-hearted, Stan attempts to make her farm tough by turning the house into an urban homestead."
      },
      {
        "id": "tvmaze:1903077",
        "title": "Roger Needs Dick",
        "season": 16,
        "episode": 17,
        "released": "2020-08-03",
        "overview": "When one of Roger's characters falls in love with Dick it affects the whole family."
      },
      {
        "id": "tvmaze:1911951",
        "title": "The Old Country",
        "season": 16,
        "episode": 18,
        "released": "2020-08-10",
        "overview": "Steve pushes Stan to trace the Smith family's ancestry, while Hayley and Francine go under cover as Sub Hub secret shoppers."
      },
      {
        "id": "tvmaze:1909777",
        "title": "Businessly Brunette",
        "season": 16,
        "episode": 19,
        "released": "2020-08-17",
        "overview": "Hayley takes off her headband and becomes a businesswoman; Stan plans a party."
      },
      {
        "id": "tvmaze:1911952",
        "title": "The Chilly Thrillies",
        "season": 16,
        "episode": 20,
        "released": "2020-08-24",
        "overview": "Francine explores ASMR with Roger. Steve gets a a pole in his head and a secret admirer."
      },
      {
        "id": "tvmaze:1915879",
        "title": "Dammmm, Stan!",
        "season": 16,
        "episode": 21,
        "released": "2020-08-31",
        "overview": "Stan goes to great lengths to find the \"right\" couple's activity for him and Francine; Hayley and Steve look into some mysterious markings they find on the door frame."
      },
      {
        "id": "tvmaze:1917826",
        "title": "The Last Ride of the Dodge City Rambler",
        "season": 16,
        "episode": 22,
        "released": "2020-09-07",
        "overview": "The Smiths take a trip on an old steam locomotive to visit Francine's aunt only to discover it's being hijacked."
      },
      {
        "id": "tvmaze:1921470",
        "title": "300",
        "season": 16,
        "episode": 23,
        "released": "2020-09-14",
        "overview": "American Dad becomes the 25th scripted primetime show in the History of Television to reach 300 episodes and Roger's past comes back to haunt him."
      },
      {
        "id": "tvmaze:1980157",
        "title": "Yule. Tide. Repeat.",
        "season": 16,
        "episode": 24,
        "released": "2020-12-21",
        "overview": "After Stan's plan for the perfect Christmas goes terribly, tragically wrong, he's given a magical opportunity to make things right."
      },
      {
        "id": "tvmaze:2013717",
        "title": "Who Smarted?",
        "season": 17,
        "episode": 1,
        "released": "2021-04-19",
        "overview": "Jeff undergoes an intelligence enhancement procedure."
      },
      {
        "id": "tvmaze:2071705",
        "title": "Russian Doll",
        "season": 17,
        "episode": 2,
        "released": "2021-04-26",
        "overview": "Stan becomes infatuated with a doll that the CIA wants to use to spy on the Russians."
      },
      {
        "id": "tvmaze:2076100",
        "title": "Stan Moves to Chicago",
        "season": 17,
        "episode": 3,
        "released": "2021-05-03",
        "overview": "Stan moves to Chicago to become a comic while Steve and Hayley host Roger for a nice night in."
      },
      {
        "id": "tvmaze:2079593",
        "title": "Shakedown Steve",
        "season": 17,
        "episode": 4,
        "released": "2021-05-10",
        "overview": "Steve and Jeff try to bond as brothers while the rest of the family visits an escape room."
      },
      {
        "id": "tvmaze:2085003",
        "title": "Klaus And Rogu In Thank God For Loose Rocks: An American Dad! Adventure",
        "season": 17,
        "episode": 5,
        "released": "2021-05-17",
        "overview": "When the family goes to a dude ranch, Klaus and Rogu have to work together to survive in the wilderness."
      },
      {
        "id": "tvmaze:2089587",
        "title": "The Wondercabinet",
        "season": 17,
        "episode": 6,
        "released": "2021-05-24",
        "overview": "Steve spins out about his future, but a radio show about new age mysticism gives him a hopeful new understanding of life. Roger struggles to get into the adult film industry."
      },
      {
        "id": "tvmaze:2095797",
        "title": "Little Bonnie Ramirez",
        "season": 17,
        "episode": 7,
        "released": "2021-05-31",
        "overview": "After a series of boring personas, Roger goes to great lengths to prove to Francine he still has \"his edge\"."
      },
      {
        "id": "tvmaze:2104524",
        "title": "Dancin' A-with My Cell",
        "season": 17,
        "episode": 8,
        "released": "2021-06-07",
        "overview": "Stan tries a new, cutting edge parenting approach DNA splicing."
      },
      {
        "id": "tvmaze:2104525",
        "title": "Mused and Abused",
        "season": 17,
        "episode": 9,
        "released": "2021-06-14",
        "overview": "Roger reveals a secret passion to Klaus; Stan and Francine seek revenge on Bazooka Sharks management."
      },
      {
        "id": "tvmaze:2112787",
        "title": "Henderson",
        "season": 17,
        "episode": 10,
        "released": "2021-06-21",
        "overview": "Stan's childhood imaginary friend returns to collect a debt. Klaus has a big date and needs a fishbowl upgrade."
      },
      {
        "id": "tvmaze:2114627",
        "title": "Hot Scoomp",
        "season": 17,
        "episode": 11,
        "released": "2021-06-28",
        "overview": "Hayley searches for guidance and instead finds a community of 'cool butts.'"
      },
      {
        "id": "tvmaze:2122701",
        "title": "Lumberjerk",
        "season": 17,
        "episode": 12,
        "released": "2021-07-05",
        "overview": "Stan is forced to partner with Jeff in a lumberjack competition. Meanwhile, Steve, Francine and Snot enter a contest to win a vintage pickup truck."
      },
      {
        "id": "tvmaze:2118882",
        "title": "Stan & Francine & Stan & Francine & Radika",
        "season": 17,
        "episode": 13,
        "released": "2021-07-12",
        "overview": "Stan and Francine go back in time to settle an argument."
      },
      {
        "id": "tvmaze:2125959",
        "title": "Flush After Reading",
        "season": 17,
        "episode": 14,
        "released": "2021-07-19",
        "overview": "Francine and Roger get lost in a good book (or five) after Francine escapes an embarrassing situation. Stan reluctantly hangs out at the library."
      },
      {
        "id": "tvmaze:2131396",
        "title": "Comb Over: A Hair Piece",
        "season": 17,
        "episode": 15,
        "released": "2021-07-26",
        "overview": "Stan finally decides to do something about his secret baldness and enlists the help of Josay Bosay, Roger's famed hair-stylist-to-the-stars persona."
      },
      {
        "id": "tvmaze:2131630",
        "title": "Plot Heavy",
        "season": 17,
        "episode": 16,
        "released": "2021-08-02",
        "overview": "After Stan sells off the coveted family plot, the family opens their own cemetery in the backyard with the help of basketball Hall-of-Famer Scottie Pippen."
      },
      {
        "id": "tvmaze:2137765",
        "title": "The Sinister Fate!!",
        "season": 17,
        "episode": 17,
        "released": "2021-08-09",
        "overview": "A new friendship causes Hayley to start worrying she might be slowly turning into Francine. Steve and his friends try out for Roger's improv troupe."
      },
      {
        "id": "tvmaze:2142291",
        "title": "Dr. Sunderson's SunSuckers",
        "season": 17,
        "episode": 18,
        "released": "2021-08-16",
        "overview": "Hayley and Jeff help one of Roger's personas run a solar company."
      },
      {
        "id": "tvmaze:2146677",
        "title": "Family Time",
        "season": 17,
        "episode": 19,
        "released": "2021-08-23",
        "overview": "Stan and the family go out to dinner at a buffet restaurant! Meanwhile, Roger becomes a flower."
      },
      {
        "id": "tvmaze:2151104",
        "title": "Cry Baby",
        "season": 17,
        "episode": 20,
        "released": "2021-08-30",
        "overview": "When Stan realizes he can't cry, he asks Steve to teach him empathy."
      },
      {
        "id": "tvmaze:2155847",
        "title": "Crystal Clear",
        "season": 17,
        "episode": 21,
        "released": "2021-09-06",
        "overview": "Stan gets in over his head trying to impress Toshi's dad; Klaus and Jeff head to the country for a weekend getaway."
      },
      {
        "id": "tvmaze:2178064",
        "title": "Steve's Franken Out",
        "season": 17,
        "episode": 22,
        "released": "2021-10-25",
        "overview": "When Principal Lewis threatens to cancel science club, Steve takes matters into his own hands in a monstrous way."
      },
      {
        "id": "tvmaze:2209746",
        "title": "Langley Dollar Listings",
        "season": 18,
        "episode": 1,
        "released": "2022-01-24",
        "overview": "Francine becomes a realtor in Langley's world of high-end real estate, while the rest of the family sells coffee from the front yard."
      },
      {
        "id": "tvmaze:2261600",
        "title": "Dressed Down",
        "season": 18,
        "episode": 2,
        "released": "2022-01-31",
        "overview": "When Stan doesn't feel confident in anything but his suits, Roger assumes a fashion designer persona to craft him a life-changing new wardrobe. Hayley and Jeff raise chickens in the back yard."
      },
      {
        "id": "tvmaze:2265124",
        "title": "The Book of Fischer",
        "season": 18,
        "episode": 3,
        "released": "2022-02-07",
        "overview": "Stan takes Steve to his favourite barbershop to hang with his crew; Jeff starts journaling to help with his bad memory."
      },
      {
        "id": "tvmaze:2265125",
        "title": "A Roger Story",
        "season": 18,
        "episode": 4,
        "released": "2022-02-14",
        "overview": "Steve and Snot's friendship is put to the test when their mothers get in a fight."
      },
      {
        "id": "tvmaze:2265126",
        "title": "Epic Powder Dump",
        "season": 18,
        "episode": 5,
        "released": "2022-02-21",
        "overview": "Stan insists everyone help him recreate the rustic family ski trips of his childhood while Klaus falls in love with a tech support operator."
      },
      {
        "id": "tvmaze:2265127",
        "title": "American Dad Graffito",
        "season": 18,
        "episode": 6,
        "released": "2022-02-28",
        "overview": "To save a beloved restaurant from closing, Stan must bring the 1950s back to Langley."
      },
      {
        "id": "tvmaze:2265128",
        "title": "Beyond the Alcove or: How I Learned to Stop Worrying and Love Klaus",
        "season": 18,
        "episode": 7,
        "released": "2022-03-07",
        "overview": "Francine is jealous of the new and improved Klaus and vows to take him down."
      },
      {
        "id": "tvmaze:2288156",
        "title": "A Song of Knives and Fire",
        "season": 18,
        "episode": 8,
        "released": "2022-03-14",
        "overview": "Stan and Francine inject some much-needed fire into their relationship."
      },
      {
        "id": "tvmaze:2291335",
        "title": "The Curious Case of the Old Hole",
        "season": 18,
        "episode": 9,
        "released": "2022-09-05",
        "overview": "Wheels and the Legman try to hunt down the perpetrators who destroyed Steve's secret swimming hole. Meanwhile, Klaus helps an aging Principal Lewis reclaim his confidence."
      },
      {
        "id": "tvmaze:2291334",
        "title": "Gold Top Nuts",
        "season": 18,
        "episode": 10,
        "released": "2022-09-12",
        "overview": "The Smiths return from a difficult, quarrelsome vacation, but they can't get a break from each other."
      },
      {
        "id": "tvmaze:2371357",
        "title": "The Three Fs",
        "season": 18,
        "episode": 11,
        "released": "2022-09-19",
        "overview": "Francine's newfound friendship with a frog brings excitement to the whole Smith household; unfortunately, it drives their neighbor, Greg, crazy."
      },
      {
        "id": "tvmaze:2371358",
        "title": "Smooshed: A Love Story",
        "season": 18,
        "episode": 12,
        "released": "2022-09-26",
        "overview": "Steve goes on a class trip to Philadelphia, where he hopes to fall in love."
      },
      {
        "id": "tvmaze:2399092",
        "title": "The Fast and the Spurious",
        "season": 18,
        "episode": 13,
        "released": "2022-10-03",
        "overview": "Roger is forced to confront himself after a series of accidents; Klaus and Jeff bond."
      },
      {
        "id": "tvmaze:2400408",
        "title": "A League of His Own",
        "season": 18,
        "episode": 14,
        "released": "2022-10-10",
        "overview": "Steve profiles Stan for an essay contest at school; Francine uses a port-a-potty."
      },
      {
        "id": "tvmaze:2413363",
        "title": "You Are Here",
        "season": 18,
        "episode": 15,
        "released": "2022-10-31",
        "overview": "Roger and Steve try to save a dying mall."
      },
      {
        "id": "tvmaze:2413364",
        "title": "I Heard You Wanna Buy Some Speakers",
        "season": 18,
        "episode": 16,
        "released": "2022-11-07",
        "overview": "Barry blows out his dad's speakers and Snot helps him replace them. Stan attempts to do a standing backflip."
      },
      {
        "id": "tvmaze:2425079",
        "title": "Hayley Was a Girl Scout?",
        "season": 18,
        "episode": 17,
        "released": "2022-11-14",
        "overview": "Stan is forced to co-lead a scouts troop with Hayley while Steve blunders in his fantasy world."
      },
      {
        "id": "tvmaze:2428945",
        "title": "Please Please Jeff",
        "season": 18,
        "episode": 18,
        "released": "2022-11-21",
        "overview": "Jeff's people pleasing nature gets in the way of his relationship with Hayley; Stan wears a confusing costume to the CIA costume party."
      },
      {
        "id": "tvmaze:2433870",
        "title": "Jambalaya",
        "season": 18,
        "episode": 19,
        "released": "2022-11-28",
        "overview": "Francine successfully grows a garden, which reminds Roger that he has a recipe for truly authentic jambalaya."
      },
      {
        "id": "tvmaze:2436844",
        "title": "Gernot and Strudel",
        "season": 18,
        "episode": 20,
        "released": "2022-12-05",
        "overview": "Hoping to teach him the value of sharing, the family recreates a television show from Klaus' childhood. Roger has a piano recital."
      },
      {
        "id": "tvmaze:2440651",
        "title": "Echoes",
        "season": 18,
        "episode": 21,
        "released": "2022-12-12",
        "overview": "Steve starts a work-study program and discovers that not all is what it seems at Channel 3 News. Roger seeks redemption in the Nashville country music scene."
      },
      {
        "id": "tvmaze:2443864",
        "title": "The Grounch",
        "season": 18,
        "episode": 22,
        "released": "2022-12-19",
        "overview": "When Roger has his famous Christmas sex party stolen from him the results are...monstrous. Stan creates a magazine for men."
      },
      {
        "id": "tvmaze:2500720",
        "title": "Fellow Traveler",
        "season": 19,
        "episode": 1,
        "released": "2023-03-27",
        "overview": "A lunar misstep sends Roger on an unexpected detour to New Mexico."
      },
      {
        "id": "tvmaze:2511278",
        "title": "The Professor and the Coach",
        "season": 19,
        "episode": 2,
        "released": "2023-04-03",
        "overview": "Hayley tries to help Roger write a book."
      },
      {
        "id": "tvmaze:2512865",
        "title": "Viced Principal",
        "season": 19,
        "episode": 3,
        "released": "2023-04-10",
        "overview": "Steve and Principal Lewis get caught in a dangerous situation at the school; the rest of the family make an adorable new friend."
      },
      {
        "id": "tvmaze:2520475",
        "title": "The Pleasanting at Smith House",
        "season": 19,
        "episode": 4,
        "released": "2023-04-17",
        "overview": "Klaus and Jeff's friendship is threatened by Klaus' girlfriend from another realm."
      },
      {
        "id": "tvmaze:2527627",
        "title": "Stretched Thin",
        "season": 19,
        "episode": 5,
        "released": "2023-05-01",
        "overview": "When Jeff finds out that the family thinks he makes terrible decisions, he decides to take a job selling stretchy leggings to prove them wrong."
      },
      {
        "id": "tvmaze:2536194",
        "title": "Better on Paper",
        "season": 19,
        "episode": 6,
        "released": "2023-05-08",
        "overview": "When Stan discovers anonymous love letters written to Francine, he worries that this secret admirer could threaten their relationship."
      },
      {
        "id": "tvmaze:2540137",
        "title": "Cow I Met Your Moo-ther",
        "season": 19,
        "episode": 7,
        "released": "2023-05-15",
        "overview": "The judgmental voice in Hayley's head makes it impossible for her to enjoy a girls' night with Nerfer and Danuta."
      },
      {
        "id": "tvmaze:2545948",
        "title": "Stan Fixes a Shingle",
        "season": 19,
        "episode": 8,
        "released": "2023-05-22",
        "overview": "Francine insists that Steve let her help with his school project, Stan finally fixes that shingle, and the rest of the family goes on a quest to return Gallagher's mallet."
      },
      {
        "id": "tvmaze:2551611",
        "title": "Saving Face",
        "season": 19,
        "episode": 9,
        "released": "2023-05-29",
        "overview": "In an attempt to maintain his \"prime,\" Stan explores some cosmetic solutions that could not go worse."
      },
      {
        "id": "tvmaze:2568461",
        "title": "Frantastic Voyage",
        "season": 19,
        "episode": 10,
        "released": "2023-09-04",
        "overview": "When Stan goes too far to keep his work friend away from Francine, she is forced to save her new \"little\" friend."
      },
      {
        "id": "tvmaze:2634446",
        "title": "A Little Mystery",
        "season": 19,
        "episode": 11,
        "released": "2023-09-11",
        "overview": "Hayley makes Jeff get a friend to add some mystery to their relationship but gets more mystery than she bargained for; Francine attempts to grow the world's longest fingernails."
      },
      {
        "id": "tvmaze:2639754",
        "title": "Don't You Be My Neighbor",
        "season": 19,
        "episode": 12,
        "released": "2023-09-18",
        "overview": "The Smiths get new neighbors; Roger dreads having to be a little boy's kite for a day."
      },
      {
        "id": "tvmaze:2644861",
        "title": "Productive Panic",
        "season": 19,
        "episode": 13,
        "released": "2023-09-25",
        "overview": "Francine becomes an overnight sensation when a famous art dealer discovers her homemade pottery."
      },
      {
        "id": "tvmaze:2649467",
        "title": "Multiverse of American Dadness",
        "season": 19,
        "episode": 14,
        "released": "2023-10-02",
        "overview": "Hayley searches for a runaway Steve so they can go to a Shaggy concert."
      },
      {
        "id": "tvmaze:2667975",
        "title": "Z.O.I.N.C.S.",
        "season": 19,
        "episode": 15,
        "released": "2023-10-30",
        "overview": "It's Halloween night and Stan is missing, so the Smith gang heads to the spooky, abandoned CIA headquarters to investigate."
      },
      {
        "id": "tvmaze:2673366",
        "title": "A New Era for the Smith House",
        "season": 19,
        "episode": 16,
        "released": "2023-11-06",
        "overview": "Klaus house sits for the Smiths while they are away on vacation; Roger investigates the origin of powerful winds plaguing the Eastern Seaboard."
      },
      {
        "id": "tvmaze:2674307",
        "title": "Between a Ring and a Hardass",
        "season": 19,
        "episode": 17,
        "released": "2023-11-13",
        "overview": "Social Services threatens to take Steve away from the family when someone files a complaint about Steve's chaotic home life."
      },
      {
        "id": "tvmaze:2674308",
        "title": "Footprints",
        "season": 19,
        "episode": 18,
        "released": "2023-11-20",
        "overview": "Stan and Roger go on a mission to leave their mark on humanity. Jeff finally deals with the reality of losing his signature hat."
      },
      {
        "id": "tvmaze:2674309",
        "title": "Steve, Snot, and the Quest for the Og 4LOCO",
        "season": 19,
        "episode": 19,
        "released": "2023-11-27",
        "overview": "In order to have a chance with a girl, Steve and Snot must track down a keg of 4Loko."
      },
      {
        "id": "tvmaze:2674310",
        "title": "The Pink Sphinx Holds Her Hearts on the Turn",
        "season": 19,
        "episode": 20,
        "released": "2023-12-04",
        "overview": "Francine enters the strange and dangerous world of poker in order to learn how to hide her true feelings from Steve and Hayley."
      },
      {
        "id": "tvmaze:2674311",
        "title": "A Little Extra Scratch",
        "season": 19,
        "episode": 21,
        "released": "2023-12-11",
        "overview": "Suspicious about Hayley's mysterious, newfound wealth, Francine decides to get to the bottom of it. Roger sets out to make Stan an internet celebrity."
      },
      {
        "id": "tvmaze:2674312",
        "title": "Into the Jingleverse",
        "season": 19,
        "episode": 22,
        "released": "2023-12-18",
        "overview": "When Steve gives the family better Christmas gifts than Stan, Stan goes to great lengths to regain his title of \"King of Presents.\""
      },
      {
        "id": "tvmaze:3024958",
        "title": "The Grocery Store Bank",
        "season": 20,
        "episode": 1,
        "released": "2024-10-28",
        "overview": "Stan, Francine and Roger concoct the perfect plan to rob a bank but agree never to do it. Peace reigns."
      },
      {
        "id": "tvmaze:3040902",
        "title": "Brown Lotus",
        "season": 20,
        "episode": 2,
        "released": "2024-11-04",
        "overview": "Hayley and Jeff take a staycation at a nearby luxury resort, while the CIA is forced to rebrand."
      },
      {
        "id": "tvmaze:3041703",
        "title": "I've Got a Friend in Me",
        "season": 20,
        "episode": 3,
        "released": "2024-11-11",
        "overview": "After a freak accident, Stan and Roger end up stuck together in the worst possible way. Klaus contends with an impostor."
      },
      {
        "id": "tvmaze:3043541",
        "title": "Touch the Sun: A Chimborazo Adventure",
        "season": 20,
        "episode": 4,
        "released": "2024-11-18",
        "overview": "The family's dream of climbing Mount Everest turns into a nightmare when Stan tries to save a buck and takes them to a different, much cheaper mountain."
      },
      {
        "id": "tvmaze:3044916",
        "title": "Under (and Over, and Beside) the Boardwalk",
        "season": 20,
        "episode": 5,
        "released": "2024-11-25",
        "overview": "The Smiths are overjoyed when the Langley Falls boardwalk reopens."
      },
      {
        "id": "tvmaze:3044917",
        "title": "The Violence of the Clams",
        "season": 20,
        "episode": 6,
        "released": "2024-12-02",
        "overview": "Steve feels isolated when he dislikes a new fast food restaurant popular among his friends; Stan and Francine attempt to return misdelivered mail."
      },
      {
        "id": "tvmaze:3058817",
        "title": "An Adult Woman",
        "season": 20,
        "episode": 7,
        "released": "2024-12-09",
        "overview": "After Hayley is deemed a big child by The Lady from The Hamster Rescue Society, she gets involved with two Roger personas who have a complicated family dynamic in an effort to prove that she is an adult woman."
      },
      {
        "id": "tvmaze:3058818",
        "title": "Piece by Piece",
        "season": 20,
        "episode": 8,
        "released": "2024-12-16",
        "overview": "After a nearly fatal interaction with one of Roger's personas, Steve and Stan work together to uncover the persona's mysterious past. Meanwhile, Jeff, Hayley and Francine explore new hobbies."
      },
      {
        "id": "tvmaze:3066470",
        "title": "Nasty Christmas",
        "season": 20,
        "episode": 9,
        "released": "2024-12-23",
        "overview": "Bullock throws a private, star-studded Christmas party the exact same night as the CIA work party. Stan and Klaus are determined to get in, by any means necessary."
      },
      {
        "id": "tvmaze:3066471",
        "title": "Idiot Rich",
        "season": 20,
        "episode": 10,
        "released": "2024-12-30",
        "overview": "Jeff gets a job after the family calls him out for being a mooch. When he unexpectedly strikes it rich, Hayley must protect Jeff from the family's greed."
      },
      {
        "id": "tvmaze:3077399",
        "title": "Killer Mimosa",
        "season": 20,
        "episode": 11,
        "released": "2025-01-06",
        "overview": "Hayley scores an internship at Morning Mimosa but finds herself on thin ice when she tries to inject real journalism into the show. Meanwhile, the rest of the family suffers through a ravaging case of food poisoning."
      },
      {
        "id": "tvmaze:3084732",
        "title": "The Legend of Mike Madonia, the Rototiller Man",
        "season": 20,
        "episode": 12,
        "released": "2025-01-13",
        "overview": "Francine joins Tuttle's gardening club, but he wants her gone; the rest of the family practice the power of yes."
      },
      {
        "id": "tvmaze:3084734",
        "title": "The Clearview Motel",
        "season": 20,
        "episode": 13,
        "released": "2025-01-20",
        "overview": "Francine and Roger become addicted to peeping in on people at a mysterious motel."
      },
      {
        "id": "tvmaze:3084736",
        "title": "The Girl Who Cried Space Jam",
        "season": 20,
        "episode": 14,
        "released": "2025-01-27",
        "overview": "Forces of evil beyond human comprehension bully Hayley into doing a Space Jam."
      },
      {
        "id": "tvmaze:3084738",
        "title": "Get Him to the Greek Life Style",
        "season": 20,
        "episode": 15,
        "released": "2025-02-03",
        "overview": "Stan attempts to live forever in order to do everything on his bucket list."
      },
      {
        "id": "tvmaze:3084744",
        "title": "The Mystery of the Missing Bazooka Shark Babe",
        "season": 20,
        "episode": 16,
        "released": "2025-02-10",
        "overview": "After Danuta goes missing, Hayley joins forces with Wheels and The Legman detective to investigate the Bazooka Shark Babes' involvement in her friend's mysterious disappearance."
      },
      {
        "id": "tvmaze:3117576",
        "title": "Pork 'N Feelings",
        "season": 20,
        "episode": 17,
        "released": "2025-02-17",
        "overview": "To save their marriage, Jeff needs Hayley to open up more to him, but she wants no part in it."
      },
      {
        "id": "tvmaze:3117577",
        "title": "Oh Brothel, Where Art Thou?",
        "season": 20,
        "episode": 18,
        "released": "2025-02-24",
        "overview": "After Greg receives a plaque from the local historical society, Stan goes to great lengths to get the same honor. Roger becomes a traveling salesman."
      },
      {
        "id": "tvmaze:3117578",
        "title": "The Sickness",
        "season": 20,
        "episode": 19,
        "released": "2025-03-03",
        "overview": "When Rogu comes down with a mysterious illness, the Smiths struggle to find a cure."
      },
      {
        "id": "tvmaze:3117579",
        "title": "Silicon Steve",
        "season": 20,
        "episode": 20,
        "released": "2025-03-10",
        "overview": "Steve spends his summer working on an app with some unlikely friends, while the rest of the family become cord-cutters."
      },
      {
        "id": "tvmaze:3117581",
        "title": "Guardian",
        "season": 20,
        "episode": 21,
        "released": "2025-03-17",
        "overview": "Stan uses a mothballed military computer to do Steve's math homework, starting the clock toward nuclear annihilation."
      },
      {
        "id": "tvmaze:3117580",
        "title": "What Great Advancements!",
        "season": 20,
        "episode": 22,
        "released": "2025-03-24",
        "overview": "An aspiring inventor leaves the Farm to make a go of it in The Big City."
      },
      {
        "id": "tvmaze:3438907",
        "title": "TBA",
        "season": 21,
        "episode": 1,
        "released": "2026-02-22",
        "overview": ""
      }
    ]
  }
}