{
  "meta": {
    "id": "tvmaze:77045",
    "type": "series",
    "name": "Murder at the Motel",
    "description": "Formerly known as iconic, family-friendly interstate stops, many American motels have become places where transience and anonymity often go hand-in-hand. Murder at the Motel explores tragic murder cases set in motels and the pursuit to bring justice to the victims. The personal stories of the victims and of how the investigations unfolded are told from the perspective of family members and law enforcement officers who work tirelessly in their quest to solve these horrific crimes.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/594/1487324.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/594/1487324.jpg",
    "videos": [
      {
        "id": "tvmaze:3429830",
        "title": "Sportsmans Lodge",
        "season": 2,
        "episode": 5,
        "released": "2025-12-06",
        "overview": "On April 23, 2018, the battered body of Aileen Seiden was discovered off a highway on Florida's Forgotten Coast. Investigators traced the crime to Room 15 of the Sportsman's Lodge Motel, where blood evidence and a palm print revealed a violent struggle and ultimately led them to uncover a tale of how jealousy and control turned a toxic relationship deadly."
      },
      {
        "id": "tvmaze:2870155",
        "title": "Tragedy in the Township",
        "season": 1,
        "episode": 1,
        "released": "2024-05-15",
        "overview": "July 1, 2021, Falls Township, Pennsylvania. Falls Township Police are dispatched to the New Falls Motel after receiving a call about an unresponsive female. Upon arrival, officers discover a 39-year-old victim and quickly disregard the story that she suffered a cardiac arrest when they see the extent of her injuries. The investigation into what happened that night reveal a tragic 18-year history of domestic abuse."
      },
      {
        "id": "tvmaze:2870156",
        "title": "The Bad Guy Did It",
        "season": 1,
        "episode": 2,
        "released": "2024-05-22",
        "overview": "May 13, 2020, Reno, Nevada. Officers from the Reno Police Department are dispatched to the La Quinta Inn after several motel guests report hearing gunshots in the middle of the night. When they arrive, police discover the remains of a 42-year-old woman who was shot twenty-three times and is pronounced dead at the scene. A key piece of evidence is from one of the victim's young sons who tells police, \"The bad guy did it.\" The search to find the \"bad guy\" and bring justice to the victim's family leads investigators on a multi-state manhunt."
      },
      {
        "id": "tvmaze:2870157",
        "title": "I Saw the Devil",
        "season": 1,
        "episode": 3,
        "released": "2024-05-29",
        "overview": "November 23, 2014, Springfield, Oregon. A housekeeper at the Village Inn Motel calls police when she finds a guest unresponsive and cold to the touch. While there are no immediate signs of a struggle or foul play, the autopsy confirms the cause of death was murder. More questions arise when the housekeeper informs police that the victim's car has been stolen. The murder inquiry becomes a race against the clock as police try to stop a killer on the loose."
      },
      {
        "id": "tvmaze:2870158",
        "title": "Murder in the Parish",
        "season": 1,
        "episode": 4,
        "released": "2024-06-05",
        "overview": "March 24th. 2016. The Sheriff's Office in DeRidder, La. receives a distressing phone call from the owner of Dee's Motel; the man tells them that he's found a woman dead in room 6. At the motel, police find a bloody scene which indicates the woman was the victim of a brutal attack. The victim is identified as Sonya Ortego, she and her fiancee had been staying at the motel for almost two months. Detectives get to work interviewing witnesses and collecting evidence from the scene. As the investigation continues, police start to believe DeRidder may well have a killer on the loose."
      },
      {
        "id": "tvmaze:2879264",
        "title": "A Krazy Killing",
        "season": 1,
        "episode": 5,
        "released": "2024-06-12",
        "overview": "August 29, 2006, Riverside County, CA. Deputies from the Riverside County Sheriff's Department respond to the scene of an abandoned vehicle in a remote area of the Gavilan HIlls. Investigators are shocked to discover the brutalized corpses of two men stuffed in the trunk. As law enforcement chases every possible lead in the search for answers, their investigation brings them to the National Inn on South Lincoln Avenue in Corona."
      },
      {
        "id": "tvmaze:2891351",
        "title": "A Chance Encounter",
        "season": 1,
        "episode": 6,
        "released": "2024-06-19",
        "overview": "January 5, 2016, Baltimore, MD. Police officers respond to a report of a deceased man found at the Deluxe Plaza Hotel in Northeast Baltimore. The victim, US Navy veteran Edward Yesaitis, was discovered by the motel's cleaning crew. Medical examiners confirmed he had suffered fatal injuries from a horrific beating. His neck and skull had been crushed, he had fractured ribs, a broken spine and collapsed lungs. Homicide detectives must determine who inflicted this brutal abuse and catch the killer before the trail goes cold."
      },
      {
        "id": "tvmaze:2902814",
        "title": "A Night Terror",
        "season": 1,
        "episode": 7,
        "released": "2024-06-26",
        "overview": "July 9th 2018, officers from the Beckley, West Virginia, Police Department receive a distressing call from a woman claiming she and her friends have been kidnapped and terrorized at the travelodge on Harper Road. One of them has sustained a fatal gunshot wound. On arrival, investigators discover the body of 19-year-old Amber Meadows amongst the disarray of room 48. Over the course of several days, their investigation focuses on hunting down the four perpetrators involved in young Amber's brutal murder."
      },
      {
        "id": "tvmaze:2917895",
        "title": "Killer Cried Wolf",
        "season": 1,
        "episode": 8,
        "released": "2024-07-03",
        "overview": "In the early hours of September 6th, 2020, local police receive a distressing 911 call from 32-year-old Brian Redding. He is heard crying and screaming that he has found his 16-year-old girlfriend, Cypress Noonan, dead in their room at the Forest Motel in Ridgeland, South Carolina. Cypress has suffered a single shot to the head, her body found seated on the bed, suggesting that she had not suspected the attack. When investigators arrive, Redding's behavior at the crime scene raises suspicion. In time, police learn about the dark side of Cypress and Brian's relationship."
      },
      {
        "id": "tvmaze:3365112",
        "title": "Surf Motel",
        "season": 2,
        "episode": 1,
        "released": "2025-10-31",
        "overview": "Late on the night of March 19, 2017, police respond to a call from a witness who hears a gunshot at the Surf Motel on Auburn Boulevard in Sacramento, California. At the motel, they find the body of 53-year-old Leonora Montoya."
      },
      {
        "id": "tvmaze:3423862",
        "title": "Primrose Motel",
        "season": 2,
        "episode": 2,
        "released": "2025-11-07",
        "overview": "In 2015, a woman with a brain injury that made her overly trusting was found dead in a Colorado motel room."
      },
      {
        "id": "tvmaze:3423863",
        "title": "Lincoln Motel",
        "season": 2,
        "episode": 3,
        "released": "2025-11-14",
        "overview": "Fire crews tackling a blaze in a motel room discover a body burned beyond recognition lying in the wreckage."
      },
      {
        "id": "tvmaze:3423864",
        "title": "Fallbrook Inn",
        "season": 2,
        "episode": 4,
        "released": "2025-11-21",
        "overview": ""
      },
      {
        "id": "tvmaze:3429830",
        "title": "Sportsmans Lodge",
        "season": 2,
        "episode": 5,
        "released": "2025-12-06",
        "overview": "On April 23, 2018, the battered body of Aileen Seiden was discovered off a highway on Florida's Forgotten Coast. Investigators traced the crime to Room 15 of the Sportsman's Lodge Motel, where blood evidence and a palm print revealed a violent struggle and ultimately led them to uncover a tale of how jealousy and control turned a toxic relationship deadly."
      },
      {
        "id": "tvmaze:3433222",
        "title": "Rodeway Inn",
        "season": 2,
        "episode": 6,
        "released": null,
        "overview": ""
      },
      {
        "id": "tvmaze:3440461",
        "title": "America's Best Value Inn",
        "season": 2,
        "episode": 7,
        "released": null,
        "overview": ""
      },
      {
        "id": "tvmaze:3440462",
        "title": "Davis Motel",
        "season": 2,
        "episode": 8,
        "released": null,
        "overview": ""
      }
    ]
  }
}