{
  "meta": {
    "id": "tvmaze:4561",
    "type": "series",
    "name": "First Dates",
    "description": "The First Dates restaurant throws open its doors to single people looking for love.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472914.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1472914.jpg",
    "videos": [
      {
        "id": "tvmaze:3464755",
        "title": "First Dates at Christmas",
        "season": 24,
        "episode": null,
        "released": "2025-12-23",
        "overview": "It's Christmas and the First Dates restaurant prepares for an unforgettable night of festive flirting. Essex barber Wes has bravado and banter, but he's been hurt in past relationships and all he wants this Christmas is someone honest and who doesn't take themselves too seriously. Wes is matched with Chloe, who has a track record of choosing the wrong guys. Their date goes well, but will Chloe be turned off by Wes's choice of a flirty festive gift?Retired nurse Linda is 75 years old and off on her first date in 16 years. She seeks someone who'll make her feel young again. Her date Harry is a furniture maker with a rusty flirting technique. For maths genius Bobby, love is a numbers game, but those numbers haven't been coming up in his favour, leaving him single for the last 11 years. Bobby meets Doctor Rebecca, a quiz enthusiast who's recently had her heart broken. It's a great meeting of minds but will it be a meeting of hearts? And Cindy and Elan return six years after they met on First Dates to share some exciting news."
      },
      {
        "id": "tvmaze:294183",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2013-06-20",
        "overview": "Faliraki DJ Terry wants to tame his wild love life and settle down. Richard is venturing into online dating three years after losing his wife. And can Will's unusual flirting techniques impress Fayhe?"
      },
      {
        "id": "tvmaze:294184",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2013-06-27",
        "overview": "Chris hopes to overcome his geeky stereotype on his date. Soifra is looking for personality as well as looks; will a young pilot-turned-model fit the bill? And cheerleading coach Fayhe returns."
      },
      {
        "id": "tvmaze:294185",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2013-07-04",
        "overview": "Can well-heeled head hunter Phil sweep picky wine aficionado Lucinda off her feet? Glamour model Danielle is returning to the dating scene after having her heart broken. Rajan's back for another date."
      },
      {
        "id": "tvmaze:294186",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2013-07-11",
        "overview": "Daniel, who's 31, is on his first ever date, hoping to overcome his nervousness around women. Hank, who's 4' 11\", wants to meet a lady to love him for who he is."
      },
      {
        "id": "tvmaze:294187",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2013-07-18",
        "overview": "Lothario Lewis intends to use a tried and tested plan to charm his date, Megan, until he's bowled over by her warmth and personality. And she's met men with similar intentions all too often..."
      },
      {
        "id": "tvmaze:294188",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2013-07-25",
        "overview": "Two previous daters return. Will it be third time lucky for ladies' man Terry, and will Rajan's bold dating techniques and unique line of questioning work this time?"
      },
      {
        "id": "tvmaze:294189",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2014-02-12",
        "overview": "Paul is desperate for love and also heart-wrenchingly worried that fear makes his stutter worse. And do chat-up lines work in modern dating?"
      },
      {
        "id": "tvmaze:294190",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2014-02-19",
        "overview": "Ed is young and well-spoken and is meeting the equally inexperienced Purdey, who tries to hide her 'crazy' personality. Could this be first love for the pair of them?"
      },
      {
        "id": "tvmaze:294191",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2014-02-26",
        "overview": "Series one favourite Rajan returns to the First Dates restaurant, hoping to be fourth time lucky. Will his chat-up lines impress Corinne, who has a history of meeting all the wrong men?"
      },
      {
        "id": "tvmaze:294192",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2014-03-05",
        "overview": "Can metrosexual Jon find headstrong Mancunian Regan's soft side? Playboy Mostafa believes every girl would like to marry him. And opinionated heavy metal fan Dan returns to the restaurant."
      },
      {
        "id": "tvmaze:294193",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2014-03-12",
        "overview": "There's a theme of second chances in this episode, with diners returning to the First Dates restaurant hoping not to repeat past mistakes"
      },
      {
        "id": "tvmaze:294194",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2014-03-19",
        "overview": "Talkative primary school teacher Sarah-Jayne is looking for her Prince Charming, but would Martin shave off his beard for her?"
      },
      {
        "id": "tvmaze:294195",
        "title": "Episode 7",
        "season": 2,
        "episode": 7,
        "released": "2014-03-26",
        "overview": "DJ Terry Turbo is back and he says he's changed his Jack-the-lad ways. Are Ben and Gary's dates more interested in each other? Model Rochelle's looking for love that's more than skin-deep."
      },
      {
        "id": "tvmaze:294196",
        "title": "Episode 8",
        "season": 2,
        "episode": 8,
        "released": "2014-04-02",
        "overview": "Computer programmer Andrew has been single for over a decade. Will he click with old-fashioned romantic Sarah? And Kenny and his biceps James and Andrew are back in the restaurant."
      },
      {
        "id": "tvmaze:294197",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2015-03-06",
        "overview": "Sparks fly between dancers Frankie and Muhala. Kate and Liam have a lot in common, but how will she score their date's 'fun level'? Can Tim, who's in his late thirties, charm Jenny into a second date?"
      },
      {
        "id": "tvmaze:294198",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2015-03-11",
        "overview": "Can Jayden hide his Don Juan ways from Isabel? Will estate agent John give Sarah, who's deaf, the butterflies in the stomach she's hoping for?"
      },
      {
        "id": "tvmaze:294199",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2015-03-18",
        "overview": "Will Ryan's unique chat-up lines laugh aspiring embalmer Kerry into bed? How will nervous Mark react when free spirit Sophia reads his palm?"
      },
      {
        "id": "tvmaze:294200",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2015-03-25",
        "overview": "Olive and Terence, who are both in their 80s, bond over memories of lost loves, tennis and amateur dramatics. Occasional poet Frankie wants a relationship that fits her unique philosophy of romance."
      },
      {
        "id": "tvmaze:294201",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2015-04-01",
        "overview": "Will historical re-enactor Rory's knowledge of Viking beards impress cross-stitcher Maddie? And can fireman Rich be beautician Steph's knight in shining armour?"
      },
      {
        "id": "tvmaze:294202",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2015-04-08",
        "overview": "Nathania's writing a dissertation about marriage as a form of punishment in fairy tales, but will songwriter Dan - who hasn't had a girlfriend since he left school - be her Prince Charming?"
      },
      {
        "id": "tvmaze:294203",
        "title": "Episode 7",
        "season": 3,
        "episode": 7,
        "released": "2015-04-15",
        "overview": "Mula, who was stood up on her last date, is hoping Round 2 will be better. Her blind date is another returner, funny man AJ, who compares women to a bucket of KFC."
      },
      {
        "id": "tvmaze:294204",
        "title": "Episode 8",
        "season": 3,
        "episode": 8,
        "released": "2015-04-22",
        "overview": "Ann-Marie visits the First Dates restaurant on her 50th birthday. She's survived four bouts of cancer and believes time is precious. Will she want to spend it with her date Carl?"
      },
      {
        "id": "tvmaze:294205",
        "title": "Episode 9",
        "season": 3,
        "episode": 9,
        "released": "2015-04-29",
        "overview": "Joe used to be a model and is often compared to James Bond. His date, Nicole, is used to men dropping at her feet. Has Joe met his Bond girl?"
      },
      {
        "id": "tvmaze:294206",
        "title": "Episode 1",
        "season": 4,
        "episode": 1,
        "released": "2015-09-10",
        "overview": "First through the doors is Anna, who has a lengthy list of what she wants from her perfect man. She meets her date Liam, who likens dating to hunting a gazelle."
      },
      {
        "id": "tvmaze:294207",
        "title": "Episode 2",
        "season": 4,
        "episode": 2,
        "released": "2015-09-17",
        "overview": "Aaron from Texas moved to London 10 months ago and is still figuring out how to charm British women. His date Sophie claims to have perfected the art of enticing a man with a well-practised stare."
      },
      {
        "id": "tvmaze:294208",
        "title": "Episode 3",
        "season": 4,
        "episode": 3,
        "released": "2015-09-24",
        "overview": "Memories of childhood bullies have knocked Zoe's confidence. Can former ballroom dancer David, who describes himself as 'The Don of the Friendzone', sweep Zoe off her feet?"
      },
      {
        "id": "tvmaze:294209",
        "title": "Episode 4",
        "season": 4,
        "episode": 4,
        "released": "2015-10-01",
        "overview": "Self-confessed 'player' Geo wants a steady relationship. Will his flowers and champagne impress Heather? Meanwhile, 82-year-old 'Sauve Harv' meets lifelong singleton Dinah."
      },
      {
        "id": "tvmaze:337515",
        "title": "Episode 5",
        "season": 4,
        "episode": 5,
        "released": "2015-10-08",
        "overview": "Can weightlifter Lucy strike gold with Caroline? Will Star Wars fan Rachel give self-confessed nerd Lachlan a new hope? Art gallery administrator Grace meets Chuks, who was born with short arms."
      },
      {
        "id": "tvmaze:387212",
        "title": "Celebrity Special for SU2C",
        "season": 4,
        "episode": 6,
        "released": "2015-10-12",
        "overview": "In this special episode for Stand Up To Cancer, some of the daters discover that they've been matched with celebrity singletons, from Jamie Laing to Jorgie Porter, Anthea Turner and Alexandra Burke"
      },
      {
        "id": "tvmaze:373035",
        "title": "Episode 7",
        "season": 4,
        "episode": 7,
        "released": "2015-10-15",
        "overview": "Some like it hot, but is Marilyn Monroe lookalike Elle too hot for fireman Marc to handle? Self-confessed 'player' Geo returns for another shot at love, and he's upping his game."
      },
      {
        "id": "tvmaze:392305",
        "title": "Episode 8",
        "season": 4,
        "episode": 8,
        "released": "2015-10-22",
        "overview": "Model Georgia hits it off with hunky banker Alex. But he's meant to be on a date with Heather. And Hugo returns; can trainee opera singer Olympia hit enough high notes to win him over?"
      },
      {
        "id": "tvmaze:392306",
        "title": "Episode 9",
        "season": 4,
        "episode": 9,
        "released": "2015-10-29",
        "overview": "Georgia returns for a date with Alex, who she flirted with in the previous episode. Family life's on the agenda for mum Verona, who meets fireman Paul, and dad Patrick, who meets German-born Thomas."
      },
      {
        "id": "tvmaze:409181",
        "title": "Episode 10",
        "season": 4,
        "episode": 10,
        "released": "2015-11-05",
        "overview": "South London supermarket worker Luke returns. His last visit to the restaurant came off the rails when conversation turned to 'Netflix and chill', but might it be second time lucky, with Shannon?"
      },
      {
        "id": "tvmaze:418262",
        "title": "Episode 11",
        "season": 4,
        "episode": 11,
        "released": "2015-11-12",
        "overview": "Bisexual Jo embarks on her first ever date with a woman: 4' 7\" personal trainer Naomi. Dean's dream of dating a lady 'kissed by fire' comes true when he meets flame-haired estate agent Kate."
      },
      {
        "id": "tvmaze:453296",
        "title": "Episode 12",
        "season": 4,
        "episode": 12,
        "released": "2015-11-19",
        "overview": "Can policeman Mark cross the thin line between hate and love on a date with self-confessed 'nightmare' Abi? And will latex-loving Shirlie bond with her fellow divorcee Dave?"
      },
      {
        "id": "tvmaze:482371",
        "title": "Episode 13",
        "season": 4,
        "episode": 13,
        "released": "2015-11-26",
        "overview": "Can Rhys handle the one-way stream of nanny Georgia's conversation topics, which include: Georgia's schooling, Georgia's dinner preferences, Georgia's holidays and Georgia's fish phobia?"
      },
      {
        "id": "tvmaze:491801",
        "title": "Episode 14",
        "season": 4,
        "episode": 14,
        "released": "2015-12-03",
        "overview": "Locksmith Roberto is proud of his Italian roots, but will his poor knowledge of European countries harm his chances with Croatian-born nanny Aleksandra?"
      },
      {
        "id": "tvmaze:491802",
        "title": "Episode 15",
        "season": 4,
        "episode": 15,
        "released": "2015-12-10",
        "overview": "Can executive PA Victoria mend sales manager Scott's broken heart, following the break-up of his eight-year relationship? And when stunning Sasha is stood up, waiter Sam comes to the rescue."
      },
      {
        "id": "tvmaze:491803",
        "title": "The Proposal",
        "season": 4,
        "episode": 16,
        "released": "2015-12-17",
        "overview": "Three daters return to the restaurant hoping to pull a cracker in time for Christmas, while some couples who had more luck first time round return too. And one of them gets down on one knee..."
      },
      {
        "id": "tvmaze:551950",
        "title": "Episode 1",
        "season": 5,
        "episode": 1,
        "released": "2016-01-15",
        "overview": "A 29-year-old bingo player goes on a date with a veterinary surgeon. Retired bookmaker David dates retired factory girl Margaret. Darcy is looking for her Mr. Right."
      },
      {
        "id": "tvmaze:564331",
        "title": "Episode 2",
        "season": 5,
        "episode": 2,
        "released": "2016-01-22",
        "overview": "Nicole is determined to not go down the same path as Bridget Jones. Will her date with Gary, who is no Mr Darcy prove successful in the romance department?"
      },
      {
        "id": "tvmaze:574025",
        "title": "Episode 3",
        "season": 5,
        "episode": 3,
        "released": "2016-01-28",
        "overview": "Danny, a party boy from Essex wants to leave his fun-loving ways behind and find a woman to settle down with. Now aged 38, he wants something different from the younger girls he normally hooks up with. Emma, aged 33 is after a man's man."
      },
      {
        "id": "tvmaze:599007",
        "title": "Episode 4",
        "season": 5,
        "episode": 4,
        "released": "2016-02-04",
        "overview": "Alex wants a more traditional date as she is fed up of meeting 'posh boys'. Zina, aged 50, is young-at-heart and on the hunt for husband number 4."
      },
      {
        "id": "tvmaze:638099",
        "title": "Episode 1",
        "season": 6,
        "episode": 1,
        "released": "2016-03-15",
        "overview": "Maître D Fred and his team are back, opening the doors of the First Dates restaurant once again to hopeful singletons from all over the country."
      },
      {
        "id": "tvmaze:659401",
        "title": "Episode 2",
        "season": 6,
        "episode": 2,
        "released": "2016-03-22",
        "overview": "Maître D Fred and his team are back, opening the doors of the First Dates restaurant once again to hopeful singletons from all over the country."
      },
      {
        "id": "tvmaze:668990",
        "title": "Episode 3",
        "season": 6,
        "episode": 3,
        "released": "2016-03-29",
        "overview": "Mum and daughter Maria and Charlotte visit the restaurant for the mother of all double dates. Self-confessed 'acquired taste' Dan tries his 'intellectual' flirting technique with biologist Jemma."
      },
      {
        "id": "tvmaze:682796",
        "title": "Episode 4",
        "season": 6,
        "episode": 4,
        "released": "2016-04-05",
        "overview": "How will Loren react when Oliver reveals that he used to run an erotic toy business? Fran, who was named the UK's hottest Milf in 2014, meets builder and part-time erotic thriller writer Colin."
      },
      {
        "id": "tvmaze:691351",
        "title": "Episode 5",
        "season": 6,
        "episode": 5,
        "released": "2016-04-12",
        "overview": "Twelve years ago, a brain injury turned Ben's world upside down. He worries about how dates will react when they learn about his condition. His date Charlotte also has confidence issues."
      },
      {
        "id": "tvmaze:703864",
        "title": "Episode 6",
        "season": 6,
        "episode": 6,
        "released": "2016-04-19",
        "overview": "A Brummie hunk meets a lady who likes tattooed giants, anaesthetist David is looking for a husband but can't remember his date's name, and a couple have four divorces between them"
      },
      {
        "id": "tvmaze:880481",
        "title": "Episode 1",
        "season": 7,
        "episode": 1,
        "released": "2016-08-09",
        "overview": "On the menu in this episode are five pairs of hopefuls, including an Irishman with Tourette's looking for the man of his dreams, and two singletons with strange dance moves"
      },
      {
        "id": "tvmaze:893645",
        "title": "Episode 2",
        "season": 7,
        "episode": 2,
        "released": "2016-08-16",
        "overview": "Pop star Preston of Big Brother fame, Scarlett Moffatt from Gogglebox, rock chick Jo Wood and Britain's Got Talent winner Ashleigh Butler visit the restaurant for dates with members of the public"
      },
      {
        "id": "tvmaze:899759",
        "title": "Episode 3",
        "season": 7,
        "episode": 3,
        "released": "2016-08-24",
        "overview": "Vamps lead singer Brad Simpson, rugby league star Keegan Hirst, Bernie Clifton - without his ostrich - and Atomic Kitten Natasha Hamilton visit the restaurant for dates with members of the public"
      },
      {
        "id": "tvmaze:901217",
        "title": "Episode 4",
        "season": 7,
        "episode": 4,
        "released": "2016-08-29",
        "overview": "Hannah and Lee both love festivals; will they make sweet music together? Mary from Liverpool is looking for a 'straight Paul O'Grady'. And 'edgy librarian' lookalike Olivia is on her first ever date."
      },
      {
        "id": "tvmaze:921342",
        "title": "Episode 5",
        "season": 7,
        "episode": 5,
        "released": "2016-09-19",
        "overview": "How will Lorna react when Charlie tells her he's looking for his perfect 'unicorn'? And can Olympic kickboxer Aston inspire Olympic bobsleigh athlete Jordan to turn over a new leaf and settle down?"
      },
      {
        "id": "tvmaze:929392",
        "title": "Episode 6",
        "season": 7,
        "episode": 6,
        "released": "2016-09-26",
        "overview": "Can meat-loving teacher Marie control her sledgehammer wit when she finds out that her date, Davin, is a vegan? Sexagenarians Lynda and Philip both like younger men. And DJ Tom is back."
      },
      {
        "id": "tvmaze:943659",
        "title": "Episode 7",
        "season": 7,
        "episode": 7,
        "released": "2016-10-03",
        "overview": "Will young-at-heart octogenarians Patricia and Alan find love? Ruby's only ever had dates with bad boys; how will she react when Kriss reveals his sensitive side? And Jonas says he's completed Tinder."
      },
      {
        "id": "tvmaze:945155",
        "title": "Episode 8",
        "season": 7,
        "episode": 8,
        "released": "2016-10-10",
        "overview": "Are tennis-playing Stephanie and ex-rugby player Stuart a match made in heaven? Janet, who's 71, and George, who's 87, both crave bedtime antics. And self-confessed cougar Marie returns."
      },
      {
        "id": "tvmaze:960743",
        "title": "Episode 9",
        "season": 7,
        "episode": 9,
        "released": "2016-10-17",
        "overview": "Charlotte, who's 24, is bravely returning to the dating scene a year after she was tragically widowed. Teresa's 66 and has a lust for life; can James keep her entertained? And Ruby's back."
      },
      {
        "id": "tvmaze:964764",
        "title": "Episode 10",
        "season": 7,
        "episode": 10,
        "released": "2016-10-24",
        "overview": "Justin's 25 and has never had a girlfriend; how will Maisie react to the dating methods he learned from a book? Ekow thinks love is insane; will Deborah change his mind? And Teresa returns."
      },
      {
        "id": "tvmaze:971837",
        "title": "Episode 11",
        "season": 7,
        "episode": 11,
        "released": "2016-10-31",
        "overview": "A surprise ending leads to a First Dates first in this episode. The diners looking for love include self-confessed failure Arj, stand-up comedian Lynn, who's 82, and fantasy novelist Sarah."
      },
      {
        "id": "tvmaze:978471",
        "title": "Episode 12",
        "season": 7,
        "episode": 12,
        "released": "2016-11-07",
        "overview": "A storm brews as 27-year-old hairdresser Ben breezes in for his date with Daisy, and fantasy writer Sarah returns after her last date went awry. And a steamy first kiss is on the cards."
      },
      {
        "id": "tvmaze:984686",
        "title": "Episode 13",
        "season": 7,
        "episode": 13,
        "released": "2016-11-14",
        "overview": "With his cover boy looks and cut-glass accent, Adam comes straight off the slopes at Verbier for a date with 'ex-pat brat' Sophie. And can diamond in the rough Kevin charm blonde glamazon Meguel?"
      },
      {
        "id": "tvmaze:988348",
        "title": "Episode 14",
        "season": 7,
        "episode": 14,
        "released": "2016-11-21",
        "overview": "Danielle is 18 and tired of boys asking to take her for a drive. Is Tom what she's looking for? Colin was born with a birth defect that resulted in a missing leg. He meets bubbly phlebotomist Tracey."
      },
      {
        "id": "tvmaze:988446",
        "title": "Episode 15",
        "season": 7,
        "episode": 15,
        "released": "2016-11-28",
        "overview": "Carl and Marissa's date gets intense, spiritual and really quite steamy"
      },
      {
        "id": "tvmaze:991534",
        "title": "Episode 16",
        "season": 7,
        "episode": 16,
        "released": "2016-12-05",
        "overview": "Will Tallulah's date with singer Teddy hit the high notes? Visual glazing enhancer (window cleaner) Daniel bonds with Margot Robbie lookalike Lora over nostril waxing and raving but is he over his ex?"
      },
      {
        "id": "tvmaze:995906",
        "title": "Episode 17",
        "season": 7,
        "episode": 17,
        "released": "2016-12-12",
        "overview": "Lee from Leigh meets the girl of his dreams but forgets her name. Meanwhile, in a First Dates first, a mum and her son, Jane and Bobby, visit the restaurant together, each looking for love."
      },
      {
        "id": "tvmaze:1132160",
        "title": "Episode 1",
        "season": 8,
        "episode": 1,
        "released": "2017-04-18",
        "overview": "Cupid has a big surprise for mum-of-two Emma. Is lofty rocker Squid the man for six-foot-tall Kat? Charming science student Sameer hopes to meet Mr Right. And will Fran be dapper Will's English rose?"
      },
      {
        "id": "tvmaze:1144153",
        "title": "Episode 2",
        "season": 8,
        "episode": 2,
        "released": "2017-04-25",
        "overview": "Nervous rugby player Phil meets Sarah who's 21 and has overcome bone cancer. Raymon's 90. He meets ballroom dancing enthusiast Cecelia. And can brickie turned model Frankie charm glamorous PA Rosie?"
      },
      {
        "id": "tvmaze:1151202",
        "title": "Episode 3",
        "season": 8,
        "episode": 3,
        "released": "2017-05-02",
        "overview": "Susie, a teaching assistant and burlesque performer meets Trekkie-fan Martin. And hairdresser Bonnie hopes semi-pro boxer Perry can show her his more sensitive side."
      },
      {
        "id": "tvmaze:1157204",
        "title": "Episode 4",
        "season": 8,
        "episode": 4,
        "released": "2017-05-09",
        "overview": "Eve, who's 22, has alopecia. She's never been on a night out without her wig... until now. Showing off her amazing head tattoo, she stuns teaching assistant Jordan with her beauty."
      },
      {
        "id": "tvmaze:1172640",
        "title": "Episode 5",
        "season": 8,
        "episode": 5,
        "released": "2017-05-16",
        "overview": "Can retired policeman Alistair hit the right notes with violinist Maggie? Can charmer Hussein handle bricklayer Molly's banter? Are self-proclaimed misfits Patrick and Angharad perfect for each other?"
      },
      {
        "id": "tvmaze:1179358",
        "title": "Episode 6",
        "season": 8,
        "episode": 6,
        "released": "2017-05-23",
        "overview": "Twice-divorced Jo commits a faux pas on her date with Dubliner Robbie. Can marketing assistant Alice handle dairy farmer Ben's tales of the finer details of farm life?"
      },
      {
        "id": "tvmaze:1179359",
        "title": "Episode 7",
        "season": 8,
        "episode": 7,
        "released": "2017-05-30",
        "overview": "Ladies' man Luke meets PR manager Sophie, but can she remember his name? Mum of three Mandy's date with gentle giant Andrew is going well until Mandy - who has Crohn's disease - starts to feel unwell."
      },
      {
        "id": "tvmaze:1202481",
        "title": "Episode 8",
        "season": 8,
        "episode": 8,
        "released": "2017-06-06",
        "overview": "Two diners decide to serenade their dates in this episode. Meanwhile, Greig is looking for a feisty man, but is John's brutal honesty a step too far? And Hebe, who's 20, is on her first ever date."
      },
      {
        "id": "tvmaze:1202482",
        "title": "Episode 9",
        "season": 8,
        "episode": 9,
        "released": "2017-06-13",
        "overview": "Trainee astronaut Nicky hopes her date, motoring journalist Daniel, can take her to the stars. And road sweeper Bruce, 58, hopes he can find a lady who'll love him for who he is."
      },
      {
        "id": "tvmaze:1211431",
        "title": "Episode 10",
        "season": 8,
        "episode": 10,
        "released": "2017-06-20",
        "overview": "Can entrepreneur Russell handle stand-up comedian Kelly's banter? Will self-confessed nerd Mark sweet talk archaeologist Sophie with tales of battle grounds and pyramids?"
      },
      {
        "id": "tvmaze:1217523",
        "title": "Episode 11",
        "season": 8,
        "episode": 11,
        "released": "2017-06-27",
        "overview": "Dad-of-two Graeme, who's 33 and six foot five, is on his first date since his wife passed away. Rock fan Anthony, who's 64, meets retired nurse and amateur magician Barbara."
      },
      {
        "id": "tvmaze:1226580",
        "title": "Episode 12",
        "season": 8,
        "episode": 12,
        "released": "2017-07-04",
        "overview": "Is t'ai chi enthusiast John the yin to dominatrix Sherry's yang? And can karaoke crooner David help Jenni overcome her dating nerves by serenading her at the table?"
      },
      {
        "id": "tvmaze:1232008",
        "title": "Episode 13",
        "season": 8,
        "episode": 13,
        "released": "2017-07-11",
        "overview": "Ex-cruise ship worker Dale is ready to start looking for love again, five years after his partner passed away. Meanwhile, Fred lets Cici off work early to go on a date of her own."
      },
      {
        "id": "tvmaze:1295590",
        "title": "Episode 1",
        "season": 9,
        "episode": 1,
        "released": "2017-09-18",
        "overview": "Teaching assistant Liberty's looking for a man who can handle her 'right amount of crazy'. Octogenarian Doreen wants a man who can keep her on her toes; is author James the one?"
      },
      {
        "id": "tvmaze:1308529",
        "title": "Episode 2",
        "season": 9,
        "episode": 2,
        "released": "2017-09-25",
        "overview": "Will glamorous dental nurse Cece make DJ Collins' heart skip a beat? And science technician Ian has never been on a date; can he find a spark with shy nursery nurse Stacie?"
      },
      {
        "id": "tvmaze:1316961",
        "title": "Episode 3",
        "season": 9,
        "episode": 3,
        "released": "2017-10-02",
        "overview": "Dramatic events unfold on fashion assistant Jade's date with wrestler Lewis. Chelsea girl Montana meets cheeky chappy Joe. Can gregarious aristocrat Count Anthony bring shy Silvia out of her shell?"
      },
      {
        "id": "tvmaze:1319080",
        "title": "Episode 4",
        "season": 9,
        "episode": 4,
        "released": "2017-10-09",
        "overview": "Alasdair and Lee bond over their love of the pop parade. Stu lost his sight 13 years ago; he hopes to meet a feisty redhead. Wrestler Lewis returns to the restaurant, for a date with barista Lauren."
      },
      {
        "id": "tvmaze:1334000",
        "title": "Episode 5",
        "season": 9,
        "episode": 5,
        "released": "2017-10-23",
        "overview": "Finding the right man has been a tall order for 6' 3\" Nikki; how does 6' 4\" Ross measure up? And is there a spark when laboratory engineer Daniel meets lingerie designer Lauren?"
      },
      {
        "id": "tvmaze:1338764",
        "title": "Episode 6",
        "season": 9,
        "episode": 6,
        "released": "2017-10-30",
        "overview": "Can dancing accountant Robert sweep French aristocrat Gladys off her feet? Self-confessed Jack the Lad Joey and fashion blogger Jodie have a chance encounter the night before their date."
      },
      {
        "id": "tvmaze:1348905",
        "title": "Episode 7",
        "season": 9,
        "episode": 7,
        "released": "2017-11-06",
        "overview": "Can painter and lawyer Josh court student and waitress Sophia? And Lesley and Babs bond over their mutual admiration of Michelle Obama."
      },
      {
        "id": "tvmaze:1351522",
        "title": "Episode 8",
        "season": 9,
        "episode": 8,
        "released": "2017-11-13",
        "overview": "Natasha, who's been out of the dating game for a couple of years, meets laid-back Oskar. Glamorous Emily and model Matt discuss aliens. And 73-year-old Michael's roaming eye gets him into trouble."
      },
      {
        "id": "tvmaze:1354758",
        "title": "Episode 9",
        "season": 9,
        "episode": 9,
        "released": "2017-11-20",
        "overview": "Student Leah's on her first ever date. Welder Daniel and student midwife Emily bond over their shared love of romcoms. Pilot Antonia hopes to meet a man who wants to know the woman behind the uniform."
      },
      {
        "id": "tvmaze:1354759",
        "title": "Episode 10",
        "season": 9,
        "episode": 10,
        "released": "2017-11-27",
        "overview": "Will mods Neil and Eileen ride off into the sunset together? Fire-breathing podium dancer Khloe and former club promoter Rick both love music; will their date hit the right note?"
      },
      {
        "id": "tvmaze:1358585",
        "title": "Episode 11",
        "season": 9,
        "episode": 11,
        "released": "2017-12-04",
        "overview": "How will model Laura react when she finds out what tall, dark Dan does for a living? And will sausage roll maker Joel's culinary creativity impress recipe developer Mimi?"
      },
      {
        "id": "tvmaze:1372018",
        "title": "Episode 12",
        "season": 9,
        "episode": 12,
        "released": "2017-12-11",
        "overview": "Tattooed yoga lover Jack, vibrant 70-year-old fashion stylist Christine, Stetson-wearing Simon from Dallas and performance artist and poet Justin are among the diners looking for love in this episode."
      },
      {
        "id": "tvmaze:1372019",
        "title": "Episode 13",
        "season": 9,
        "episode": 13,
        "released": "2017-12-18",
        "overview": "Bina runs a bridal business; does Joban make her want to don her dream wedding dress? Will born adventurer Stephen run a mile when he finds out that Dina wants to start a family?"
      },
      {
        "id": "tvmaze:1430252",
        "title": "Episode 1",
        "season": 10,
        "episode": 1,
        "released": "2018-04-04",
        "overview": "Mandy and her ex-husband Stuart visit the restaurant together for dates with globetrotting Adam and divorcee Claire. Meanwhile, can tall, handsome J prove there's more to him than meets the eye?"
      },
      {
        "id": "tvmaze:1441000",
        "title": "Episode 2",
        "season": 10,
        "episode": 2,
        "released": "2018-04-11",
        "overview": "Lyn has a surprise for her date Steve: she's pregnant. Can Rebecca see past Freddie's nerves? And Cindy and Elan, who have matching outfits, bond over matters of the heart and family."
      },
      {
        "id": "tvmaze:1441001",
        "title": "Episode 3",
        "season": 10,
        "episode": 3,
        "released": "2018-04-18",
        "overview": "Do six-foot-tall legal PA Jordan and basketball player William have too much in common? Plus: First Dates' oldest ever dater, and the return of science technician Ian."
      },
      {
        "id": "tvmaze:1448372",
        "title": "Episode 4",
        "season": 10,
        "episode": 4,
        "released": "2018-04-25",
        "overview": "Dental nurse Jade hopes to get her teeth into a tall alpha male. She meets strapping, handsome tree surgeon Tom. Female sumo wrestler Sharran meets ex-bingo-caller David, who's been unlucky in love."
      },
      {
        "id": "tvmaze:1450191",
        "title": "Episode 5",
        "season": 10,
        "episode": 5,
        "released": "2018-05-02",
        "overview": "Will student James's unconventional party trick impress Emilie? And pop singer Ben, who was a smash hit in the 1980s, meets Sarah, who used to have his poster above her bed."
      },
      {
        "id": "tvmaze:1457399",
        "title": "Episode 6",
        "season": 10,
        "episode": 6,
        "released": "2018-05-09",
        "overview": "Ketan, who has autism, meets Brodie, who's looking for a man with quirks. Emily - Miss Essex 2016/17 - is looking for a man who won't just see her as a trophy girlfriend."
      },
      {
        "id": "tvmaze:1463061",
        "title": "Episode 7",
        "season": 10,
        "episode": 7,
        "released": "2018-05-17",
        "overview": "Kit has been single for 37 years. He wants to meet a man who shares his passion for the royal family. And will James from Hertfordshire get the seal of approval from Kate Middleton lookalike Jodie?"
      },
      {
        "id": "tvmaze:1468795",
        "title": "Episode 8",
        "season": 10,
        "episode": 8,
        "released": "2018-05-24",
        "overview": "Will Harry Potter fans Claudia and Jack have a magical date? Will Michael's cheeky comment about carnival dancer Ruth's derrière hit a bum note?"
      },
      {
        "id": "tvmaze:1469426",
        "title": "Episode 9",
        "season": 10,
        "episode": 9,
        "released": "2018-05-31",
        "overview": "How does New Yorker Bryan react when art dealer Simon says his ideal man would have a more toned physique? Max and Esther bond over a shared love of words. And is Ben the nice guy Leora's looking for?"
      },
      {
        "id": "tvmaze:1476068",
        "title": "Episode 10",
        "season": 10,
        "episode": 10,
        "released": "2018-06-07",
        "overview": "Primary school teacher Richard gives his date Jess a '15 out of 10'. Ex-pop star Jay and call centre manager Brett reveal some surprises from their past and play a game of dare."
      },
      {
        "id": "tvmaze:1551753",
        "title": "Episode 1",
        "season": 11,
        "episode": 1,
        "released": "2018-10-29",
        "overview": "Can Cameron help politics graduate Joe leave the singles market? Meanwhile, Lee's ready to hang up his party hat and settle down, and Abbi immediately catches his eye."
      },
      {
        "id": "tvmaze:1556175",
        "title": "Episode 2",
        "season": 11,
        "episode": 2,
        "released": "2018-11-05",
        "overview": "'Cupcake king' Sunny meets fellow self-professed boffin Misha. Twins Rebecca and Stephen nervously embark on dates with engineer Kristian and legal assistant Emily. Fred's dad visits the restaurant."
      },
      {
        "id": "tvmaze:1561666",
        "title": "Episode 3",
        "season": 11,
        "episode": 3,
        "released": "2018-11-12",
        "overview": "Will the stars align for sci-fi fans Warren and John? Former reality TV star Aisleyne is looking for a man with 'the heart of the Dalai Lama, the personality of Russell Brand and the body of Rocky'."
      },
      {
        "id": "tvmaze:1565150",
        "title": "Episode 4",
        "season": 11,
        "episode": 4,
        "released": "2018-11-19",
        "overview": "Diamond grader Sachen and financial lawyer Priya discover that they've met before. Make-up artist and model Danni meets bar manager Aiden, the tallest man to ever enter the First Dates restaurant."
      },
      {
        "id": "tvmaze:1569470",
        "title": "Episode 5",
        "season": 11,
        "episode": 5,
        "released": "2018-11-26",
        "overview": "Flirtation turns to faux pas as the drinks flow on songwriter Kristina's date with photographer Nicola. And will cheeky charmer Billy's fear of butter harm his chances with blonde bombshell Olivia?"
      },
      {
        "id": "tvmaze:1569471",
        "title": "Episode 6",
        "season": 11,
        "episode": 6,
        "released": "2018-12-03",
        "overview": "Chrissie and Jonny have one of First Dates' most sexually charged dates ever. Meanwhile, Rodney, who's 45 and has never had a girlfriend, meets Mandy, but they don't have flirting down to a fine art."
      },
      {
        "id": "tvmaze:1574694",
        "title": "Episode 7",
        "season": 11,
        "episode": 7,
        "released": "2018-12-10",
        "overview": "Ruth wants to find a man who can keep up with her in her saucy seventies. Meanwhile, TJ, who's been told that he looks like Johnny Depp, turns up for his date after a few daytime drinks."
      },
      {
        "id": "tvmaze:1574774",
        "title": "Episode 8",
        "season": 11,
        "episode": 8,
        "released": "2018-12-17",
        "overview": "Helicopter pilot Paul, who's also a cross-dresser, embarks on his first ever date dressed in women's clothing. Sexy geeks Hannah and Dan bond over everything from video games to school insecurities."
      },
      {
        "id": "tvmaze:1637629",
        "title": "Episode 1",
        "season": 12,
        "episode": 1,
        "released": "2019-04-16",
        "overview": "Josh and Natasha bond over having fabulous hair, but commit some hilarious dining faux pas. Georgia is looking for a football-playing Cara Delevingne."
      },
      {
        "id": "tvmaze:1641066",
        "title": "Episode 2",
        "season": 12,
        "episode": 2,
        "released": "2019-04-23",
        "overview": "Serial dater Jack, who's looking for a 'naughty sort', thinks his luck's in when he meets glamorous fire-breather Safina. But will his laddish charm impress her?"
      },
      {
        "id": "tvmaze:1645329",
        "title": "Episode 3",
        "season": 12,
        "episode": 3,
        "released": "2019-04-30",
        "overview": "Is 6' 4\" trucker Tony the 'Neanderthal rock god' that Lynda's looking for? And is there chemistry between neuroscientist Michael and publishing assistant Hannah?"
      },
      {
        "id": "tvmaze:1647825",
        "title": "Episode 4",
        "season": 12,
        "episode": 4,
        "released": "2019-05-07",
        "overview": "Can kizomba dancing queen Carina side-step away from situationships and into a real relationship with actor Kevan? Meanwhile, romcom fanatic Becky is looking for her very own Hugh Grant."
      },
      {
        "id": "tvmaze:1654012",
        "title": "Episode 5",
        "season": 12,
        "episode": 5,
        "released": "2019-05-14",
        "overview": "Recruitment consultant Jack returns for a second first date at the restaurant, this time with hairdresser Shauna. Mark, who's been single for 10 years, meets Claire, who's never had a relationship."
      },
      {
        "id": "tvmaze:1656293",
        "title": "Episode 6",
        "season": 12,
        "episode": 6,
        "released": "2019-05-21",
        "overview": "The dating hopefuls in this episode include a builder who's finally ready for a concrete relationship, a naked bike rider, a pair of gamers, and a man who's been married five times"
      },
      {
        "id": "tvmaze:1657696",
        "title": "Episode 7",
        "season": 12,
        "episode": 7,
        "released": "2019-05-28",
        "overview": "Can 61-year-old Italian restaurant owner Giovanni give Fred a run for his money on the charm front? Can Jason see past Tyrone's ADHD? And does barber Chris smell good enough for dental nurse Debbie?"
      },
      {
        "id": "tvmaze:1662075",
        "title": "Episode 8",
        "season": 12,
        "episode": 8,
        "released": "2019-06-04",
        "overview": "Will romance blossom for a pest controller and a good time Essex girl, a glamorous granny and a poet, or a working mum with a sideline selling and renting sex dolls?"
      },
      {
        "id": "tvmaze:1665658",
        "title": "Episode 9",
        "season": 12,
        "episode": 9,
        "released": "2019-06-11",
        "overview": "Singletons looking for love include a makeup artist with strong family ties, a pair of microbiologists, and an ice cream man hoping to go from Mr Whippy to Mr Right"
      },
      {
        "id": "tvmaze:1668377",
        "title": "Episode 10",
        "season": 12,
        "episode": 10,
        "released": "2019-06-18",
        "overview": "Magazine editor Alex arrives at the restaurant sporting bright blue hair. She meets professional story-teller Wilf. Meanwhile, teacher Masackia doesn't like exotic food but would like an exotic man."
      },
      {
        "id": "tvmaze:1748487",
        "title": "Episode 1",
        "season": 13,
        "episode": 1,
        "released": "2019-11-12",
        "overview": "The restaurant opens its doors again. Jessica seeks a James Corden doppelgänger. Dottie, who's 71, goes on her first date in 51 years. Single mum Keely meets market trader Ben."
      },
      {
        "id": "tvmaze:1755822",
        "title": "Episode 2",
        "season": 13,
        "episode": 2,
        "released": "2019-11-19",
        "overview": "Fellow Italians Marco and Chiara bond over their roots; criminology student Luka, who's fascinated by serial killers, meets musician Daniel; and two care workers from Preston date"
      },
      {
        "id": "tvmaze:1755823",
        "title": "Episode 3",
        "season": 13,
        "episode": 3,
        "released": "2019-11-26",
        "overview": "Reiki practitioner Sairaphina hopes to re-energise her love life. Gym-bunny James arrives for his date with Mum in tow. Fiona bonds with her date over shared life experiences."
      },
      {
        "id": "tvmaze:1755824",
        "title": "Episode 4",
        "season": 13,
        "episode": 4,
        "released": "2019-12-03",
        "overview": "Model Tahiry, who's 23, struggles with stage fright and seeks a man who can calm her nerves. Thrice-married octogenarian Cliff dates 84-year-old Margaret."
      },
      {
        "id": "tvmaze:1755825",
        "title": "Episode 5",
        "season": 13,
        "episode": 5,
        "released": "2019-12-10",
        "overview": "Music producer Barry, who's 71, dates a former member of a pop group. PR exec Claudia, who's 26, looks for a date who won't make her feel 'ick'."
      },
      {
        "id": "tvmaze:1755826",
        "title": "Episode 6",
        "season": 13,
        "episode": 6,
        "released": "2019-12-17",
        "overview": "Welsh hairdresser Jess, who's 25, looks for a man who's a cut above the rest. Casey, a 25-year-old charity shop manager, has his dream white wedding all mapped out. Is his date husband material?"
      },
      {
        "id": "tvmaze:1800303",
        "title": "Episode 1",
        "season": 14,
        "episode": 1,
        "released": "2020-02-20",
        "overview": "Semi-pro footballer Reece worries that being 5' 4'' will stop him from scoring with Ria"
      },
      {
        "id": "tvmaze:1801614",
        "title": "Episode 2",
        "season": 14,
        "episode": 2,
        "released": "2020-02-27",
        "overview": "Chloe 'flirts her way through life' and seeks a 'geezer' who can handle her. Is Anthony her man? Dog walker Scearcia has a steamy date with Aurita."
      },
      {
        "id": "tvmaze:1809219",
        "title": "Episode 3",
        "season": 14,
        "episode": 3,
        "released": "2020-03-05",
        "overview": "Anthony is 31 and has a wild past. He meets Lawrence, who's never been in love and feels his 'dating river has run dry'. Bev meets Howard, a former bank manager with a famous face."
      },
      {
        "id": "tvmaze:1813246",
        "title": "Episode 4",
        "season": 14,
        "episode": 4,
        "released": "2020-03-12",
        "overview": "'Alpha male' Josh is looking for his very own Kardashian. Is glam 25-year-old Yasmin his match? And will waxing entrepreneur Sherie's Marilyn Monroe dress be a hit with Richard?"
      },
      {
        "id": "tvmaze:1813247",
        "title": "Episode 5",
        "season": 14,
        "episode": 5,
        "released": "2020-03-19",
        "overview": "Ex-market trader Dave meets Sara, whose previous marriage lasted five days. Trendy Dennis and Chris wear matching trainers. Ruth has come to her date with 'Mike' - her colostomy bag."
      },
      {
        "id": "tvmaze:1937302",
        "title": "Episode 1",
        "season": 15,
        "episode": 1,
        "released": "2020-10-01",
        "overview": "A new crop of singletons roll up to the First Dates restaurant, including a self-confessed party animal seeking someone just as wild, a disco dancer, an ex-Playboy bunny, and a biker daredevil"
      },
      {
        "id": "tvmaze:1937303",
        "title": "Episode 2",
        "season": 15,
        "episode": 2,
        "released": "2020-10-08",
        "overview": "Aryeh seeks a man who can handle his big personality. Meryl, a 60-year-old widow, hopes for someone 'with a pulse' who can keep up out clubbing. And two sisters try double dating."
      },
      {
        "id": "tvmaze:1946048",
        "title": "Episode 3",
        "season": 15,
        "episode": 3,
        "released": "2020-10-14",
        "overview": "Jamie, a plumber, who hasn't had a girlfriend for years, meets Leigh, who's looking for a guy who's good with his hands. Steampunk enthusiast Joe meets Jess, who used to dress up as a Victorian."
      },
      {
        "id": "tvmaze:1946049",
        "title": "Episode 4",
        "season": 15,
        "episode": 4,
        "released": "2020-10-21",
        "overview": "American beauty queen and PhD student Camille seeks a gent who's not daunted by brains or beauty. And 'ladette' Shannen is ready to love again after losing her husband to cancer."
      },
      {
        "id": "tvmaze:2008742",
        "title": "Episode 1",
        "season": 16,
        "episode": 1,
        "released": "2021-01-19",
        "overview": "As a new series launches from an all-new Manchester venue, more singletons are looking for love, from a glamorous gran to a parliamentary worker who loves to talk sex and politics"
      },
      {
        "id": "tvmaze:2008743",
        "title": "Episode 2",
        "season": 16,
        "episode": 2,
        "released": "2021-01-26",
        "overview": "Double-divorcee and 'hopeless romantic' Ian hopes it's third time lucky, with Amy. Scientist Gerald meets 'free spirit' Lisa. And will nervous Danny regret his five pre-date pints?"
      },
      {
        "id": "tvmaze:2017813",
        "title": "Episode 3",
        "season": 16,
        "episode": 3,
        "released": "2021-02-02",
        "overview": "Luxury car seller Sam likes his women 'fast and topless'. Is former teacher MJ open to Sam's desire to explore the kinkier side of sex? And black belt Keira meets ex-footballer Max."
      },
      {
        "id": "tvmaze:2023679",
        "title": "Episode 4",
        "season": 16,
        "episode": 4,
        "released": "2021-02-09",
        "overview": "Can Fred and co rustle up some love action on Valentine's for more hopeful singletons - from a wedding planner to an ex-politician and a West End actor who's looking for a first boyfriend?"
      },
      {
        "id": "tvmaze:2025519",
        "title": "Episode 5",
        "season": 16,
        "episode": 5,
        "released": "2021-02-16",
        "overview": "Beauty queen and bricklayer Chloe seeks a girl with similar grand designs for a future together. India wants a tall, dark, handsome guy. And financial investigator Sylthea gives her date a grilling."
      },
      {
        "id": "tvmaze:2037505",
        "title": "Episode 6",
        "season": 16,
        "episode": 6,
        "released": "2021-02-23",
        "overview": "Ex-strongman Matt meets midwife Kat, who has a big story to tell. And is David from Portugal the 'upbeat, fun Latino' of Devon housekeeper Luke's dreams?"
      },
      {
        "id": "tvmaze:2159447",
        "title": "Episode 1",
        "season": 17,
        "episode": 1,
        "released": "2021-09-06",
        "overview": "The first of this series' couples bond over a love of Japanese culture, although nerves threaten their chances. A police detective goes on a date with a man who used to be on the force, an actor meets a journalist and Latin ballroom dancer, and an entrepreneur with a flashy exterior and even flashier car is hoping to find someone to settle down with."
      },
      {
        "id": "tvmaze:2166247",
        "title": "Episode 2",
        "season": 17,
        "episode": 2,
        "released": "2021-09-13",
        "overview": "A Disney fan seeks a fresh start after losing her last partner due to a tragic accident, while 27-year-old Craig wants to find a man who will share his love of dogs. A retired Butlins redcoat has high hopes for her date, and a woman who has not enjoyed much luck on the dating scene may have finally found the man she is looking for."
      },
      {
        "id": "tvmaze:2166248",
        "title": "Episode 3",
        "season": 17,
        "episode": 3,
        "released": "2021-09-20",
        "overview": "Those taking part include 23-year-old Rory, who meets 24-year-old Ella, along with 54-year-old self-confessed man-eater Caroline, who has been on 50 dates in the past two years. Tattoo enthusiast Adam returns to First Dates hoping to romance 30-year-old single mum Laura, who is yet to meet a man who accepts she has a child. Urologist Abi may know all about the male anatomy, but realises her job can scare off some men."
      },
      {
        "id": "tvmaze:2172971",
        "title": "Episode 4",
        "season": 17,
        "episode": 4,
        "released": "2021-09-27",
        "overview": "Medical student Alice gets together with Max, the self-styled 'Wolf of Wallington High Street'. Veteran house music groover Mark meets Alison - a call centre worker by day and raver by night."
      },
      {
        "id": "tvmaze:2172972",
        "title": "Episode 5",
        "season": 17,
        "episode": 5,
        "released": "2021-10-04",
        "overview": "Sexual health advisor Liza meets father-of-five Simon. Singer Saskia dates Luke the magician. And a car buff from Grimsby meets a self-confessed 'nerd' yet to fall in love."
      },
      {
        "id": "tvmaze:2248306",
        "title": "Episode 1",
        "season": 18,
        "episode": 1,
        "released": "2022-01-06",
        "overview": "Return of the dating show in which singletons meet up with possible partners at a restaurant. First up is Carol, once a Monty Python star, who meets interior designer Keith. Could he be the leading man she's been waiting for all these years? Twenty-six-year-old Charles has never had a girlfriend and is yet to experience his first kiss. Could 22-year-old Freya be the one to change that? With a shared passion for origami, it isn't long before Charles impresses Freya with his talents."
      },
      {
        "id": "tvmaze:2248307",
        "title": "Episode 2",
        "season": 18,
        "episode": 2,
        "released": "2022-01-13",
        "overview": "Cake-maker and self-confessed `princess\" Fiona seeks someone `chunky and funky\", finding herself paired with recruitment consultant Rakim. Ex-soldier Tristan from Exeter is on a mission to find his perfect woman after being single for four years. Will beach-loving Ema get swept away by his passion for the south west? Twenty-nine-year-old Lewis - whose narcolepsy caused him to fall asleep on a previous date - is paired with DJ Thom, while lager and football-lover Jessica is introduced to fellow northerner and pub-lover Ryan."
      },
      {
        "id": "tvmaze:2248308",
        "title": "Episode 3",
        "season": 18,
        "episode": 3,
        "released": "2022-01-20",
        "overview": "Becky, a 22-year-old from Bristol, seeks a man who will accept her and her snake. It remains to be seen whether leather-clad Lee from London will prove to be the open-minded guy she's looking for. Paul, a 54-year-old lorry driver from Newcastle, is looking for a woman who appreciates his softer side. He is paired with three-time divorced Ruth - who it turns out is his brother's ex. Plus, primary school assistant teacher Michael struggles to control his nerves for his date with student Imogen."
      },
      {
        "id": "tvmaze:2262750",
        "title": "Episode 4",
        "season": 18,
        "episode": 4,
        "released": "2022-01-27",
        "overview": "Twenty one-year-old post-grad student Madeleine struggles to find guys who stimulate her mentally, and would love to meet a rugby boy who's marriage material. She's paired with rugby-playing Tom Hardy impersonator Ewan. Returning to the restaurant after a problem first date is truck driver Paul. His date is 50-year-old fellow Geordie Tracey. Meanwhile, 35-year-old Sophie from York seeks a man who isn't going to 'mess her around'."
      },
      {
        "id": "tvmaze:2262751",
        "title": "Episode 5",
        "season": 18,
        "episode": 5,
        "released": "2022-02-03",
        "overview": "Twenty seven-year-old single mother and dog groomer Brenna seeks a man who won't be put off by the fact she has a daughter. She hopes to find a connection with dog-loving electrician Ross. Twenty-four-year-old party girl Tori is looking for someone to bring a bit of sparkle into her life. She's matched with 30-year-old beautician Sophie, who's on the lookout for a life partner. Plus, actress Alice meets 26-year-old cocktail bartender Jac, who is hoping to shake his life up a bit."
      },
      {
        "id": "tvmaze:2268524",
        "title": "Episode 6: Valentine's",
        "season": 18,
        "episode": 6,
        "released": "2022-02-10",
        "overview": "It's Valentine's at the First Dates restaurant, and there's an extra serving of romance - for broken-hearted Chris, singer twins Hazel and Brenda, and Saskia and Roisin, who can't stop flirting"
      },
      {
        "id": "tvmaze:2273938",
        "title": "Episode 7",
        "season": 18,
        "episode": 7,
        "released": "2022-02-17",
        "overview": "Thirty two-year-old Sophie needs to find the right guy to earn her trust and tempt her away from the comforts and convenience of living with her parents. She hopes Adam from the Wirral will change her outlook on life. Connor, who owns a collection of brightly coloured ties, is introduced to fellow accessory-lover Kemis, while adventurous 73-year-old Mike is paired with fitness fanatic Coleen, a widow who is ready to meet someone to share fresh experiences with."
      },
      {
        "id": "tvmaze:2357857",
        "title": "Episode 1",
        "season": 19,
        "episode": 1,
        "released": "2022-07-21",
        "overview": "Maître d' Fred Sirieix and his team prepare once again to play Cupid at their Manchester restaurant. Essex-born cleaning fanatic Fleur is paired with Essex boy Louis, who reveals he has been working as a high-end escort. Thirty five-year-old Ian, from Co Durham, is full of contradictions, which include working as a gas fitter while also running an art gallery with a champagne bar. it remains to be seen if similarly-aged medical lab assistant Michaela could be the woman to love all of his quirks."
      },
      {
        "id": "tvmaze:2360210",
        "title": "Episode 2",
        "season": 19,
        "episode": 2,
        "released": "2022-07-28",
        "overview": "Once again, maître d' Fred Sirieix plays Cupid at the Manchester restaurant. First to arrive is 36-year-old, larger-than-life stand-up comedian Mani. Despite his confidence on stage, he's yet to find a strong, independent Pakistani Muslim woman he can settle down with off stage. His match is 30-year-old nursing home owner Natasha, whose quick wit and dry sense of humour seem set to give Mani a run for his money. Twenty nine-year-old hairdresser Scott has a history of relationships being cut short. He's paired with gentle giant and self-confessed Nintendo geek Lewis, who wonders if his love of computer games is the thing that's keeping him single."
      },
      {
        "id": "tvmaze:2365433",
        "title": "Episode 3",
        "season": 19,
        "episode": 3,
        "released": "2022-08-04",
        "overview": "Luca, a 31-year-old tiler from Essex, is hoping to polish up his love life by visiting the First Dates restaurant, and is keen to prove he's not the 'player' women judge him to be. His date is TV presenter Hayley, who may be confident on camera, but finds dating rather daunting. Next in is 72-year-old retired prison officer Sandie who, having modelled the first police-issue trousers for women, completed a Masters, and written a book, has lived a full life and wants to find someone to share an active retirement with. Her date is 79-year-old tennis coach Chris, who is also on the lookout for someone fit and active."
      },
      {
        "id": "tvmaze:2369428",
        "title": "Episode 4",
        "season": 19,
        "episode": 4,
        "released": "2022-08-11",
        "overview": "Barrister clerk Bethany is worried that she intimidates men and scares them away. She is paired with tall telephone engineer Dan, keen to see whether he measures up to her expectations. However, Dan's party boy ways may well prove an obstacle to the pair making a connection. Truck driver Beth is fed up with riding solo. Her date is freelance pilot Aristos, who rarely encounters women in his day-to-day life. Theodora ended her marriage of 46 years and is now searching for romance. She meets widower Simon, who promised his wife he would find love again after she died."
      },
      {
        "id": "tvmaze:2371861",
        "title": "Episode 5",
        "season": 19,
        "episode": 5,
        "released": "2022-08-18",
        "overview": "Returning to the restaurant from earlier in the series is 31-year-old Luca from Essex. After his last date with TV presenter Hayley didn't work out, the self-proclaimed `Italian Stallion\" is paired with 32-year-old Natalie, a saleswoman and amateur Tina Turner impersonator. Plus, nanny and pony groom Fabia is matched with country boy George, who supposedly sports a bit of an edge. Also seeking companionship are English teacher and facial piercing addict George, bibliophile Ria, handyman David and care worker Denise."
      },
      {
        "id": "tvmaze:2375425",
        "title": "Episode 6",
        "season": 19,
        "episode": 6,
        "released": "2022-08-25",
        "overview": "Thirty four-year-old Dan, a construction manager from Essex putting a broken engagement behind him. He is partnered with 35-year-old Jess, a personal trainer whose love life is in need of a good workout. Twenty-five-year-old Emily from Leeds boasts a master's degree in law. Her date is rom-com-loving Yorkshire lad Ryan. Carpet salesman Nathan, 28, has been round the block and back again in his home town of Burnley. But he is here to turn over a new leaf. His date is retail assistant Chloe, 23, a Lancashire woman who hates a pushover and is looking for a man to challenge her."
      },
      {
        "id": "tvmaze:2527010",
        "title": "Episode 1",
        "season": 20,
        "episode": 1,
        "released": "2023-04-17",
        "overview": "The first guests in the 20th series get off to a rocky start when 39-year-old Craig drops the bombshell that he has three children - all with different mothers. Avid gamer Olivia feels she needs to play down her interests when on dates, and hopes to meet someone who will accept them, while dog lover Billy is troubled to discover her date has tattoos of 40 people's names."
      },
      {
        "id": "tvmaze:2527011",
        "title": "Episode 2",
        "season": 20,
        "episode": 2,
        "released": "2023-04-24",
        "overview": "A cheesemaker meets a marketer with an endless line of jokes, and a company director and a fan of motorbikes and rockabilly share their love of the 1950s. Two gym enthusiasts seem to hit it off, but disaster strikes later in the night, while two executives with a taste for sharp suits seem like a good fit."
      },
      {
        "id": "tvmaze:2529884",
        "title": "Episode 3",
        "season": 20,
        "episode": 3,
        "released": "2023-05-01",
        "overview": "A nutrition student hoping to meet a man who is open with his feelings finds she is not used to compliments during a date with a football coach, and has to brush up on her flirting. Elsewhere, two diners bond over their shared love of dogs, a farmer presents his date with a gift of beetroot, and a woman discovers she has met her supposedly blind date before."
      },
      {
        "id": "tvmaze:2541582",
        "title": "Episode 4",
        "season": 20,
        "episode": 4,
        "released": "2023-05-08",
        "overview": "Sonya, a 77-year-old tour guide who has been widowed for 15 years, is looking for a man to share experiences with, and is set up on a date with 69-year-old film rigger Graham. Meanwhile, 26-year-old florist Charlotte meets 29-year-old data analyst Adam from Blackpool, and 26-year-old alpha female Mabel is paired with Lion, a self-proclaimed lion by name and nature."
      },
      {
        "id": "tvmaze:2541583",
        "title": "Episode 5",
        "season": 20,
        "episode": 5,
        "released": "2023-05-15",
        "overview": "Guests include a woman whose exes tend to marry someone else soon after the break-up, who is paired with a wedding photographer in search of a picture-perfect love of his own. A divorced grandfather trying to conceal his age connects with a business analyst who has been called `unapproachable\", while a former youth Olympic trampolinist from Essex fears his ginger hair is holding him back."
      },
      {
        "id": "tvmaze:2725754",
        "title": "Episode 1",
        "season": 21,
        "episode": 1,
        "released": "2024-01-02",
        "overview": "The first dater through the doors is no-nonsense Mercedes who worries her date, gamer Greg, won't be able to handle her secret. Fifty-three-year-old jetsetter Georgina has endured many a heartbreak, but still craves fun and excitement, hopefully part-time DJ Steve is the man to provide a romantic soundtrack to her life. Having endured a very public on-screen divorce, Lauren from reality series The Real Housewives of Cheshire, now seeks something a bit more real. Trainee teacher Ashley has been doing his homework when it comes to love and has a long list of requirements for a potential suitor."
      },
      {
        "id": "tvmaze:2725755",
        "title": "Episode 2",
        "season": 21,
        "episode": 2,
        "released": "2024-01-09",
        "overview": "Double-daters mum and son Andrea and Stephan enter the restaurant. Andrea is looking for a debonair, cultured and passionate man while Stephan is mainly hoping that his mum won't embarrass him. Seventy-year-old Diane refuses to let age get in the way of love and meets retired trucker and part-time crooner 'Neil the Wheel'. Bagpipe instructor Adam is hoping that fellow Scot, Conor can bring back his excitement for dating."
      },
      {
        "id": "tvmaze:2740831",
        "title": "Episode 3",
        "season": 21,
        "episode": 3,
        "released": "2024-01-16",
        "overview": "Barrister Sarah enters the restaurant looking for love and finds herself paired with ex-military man Dan. Mancunian besties Megan and Ellena are on a double date hoping that Liverpudlian Liam and Yorkshireman Dylan are the partners they've been looking for. Self-described maximalist Aayziat meets astro-chemist Zac."
      },
      {
        "id": "tvmaze:2748477",
        "title": "Episode 4",
        "season": 21,
        "episode": 4,
        "released": "2024-01-30",
        "overview": "Sixty-one-year-old finance worker and raver Sandra is paired with part-time DJ Lance in her search for love and competitive Pokemon player Isaac who struggles to meet women who appreciate his passions on a date with book lover Molly who is searching for a nerdy guy. Dog walker Holly goes on a date with science graduate Joe, the pair bond over their love of pub quizzes but Joe's attempts at 'playground flirting' might ruin his chances."
      },
      {
        "id": "tvmaze:2759234",
        "title": "Episode 5",
        "season": 21,
        "episode": 5,
        "released": "2024-02-06",
        "overview": ""
      },
      {
        "id": "tvmaze:2958714",
        "title": "Episode 1",
        "season": 22,
        "episode": 1,
        "released": "2024-08-06",
        "overview": "The restaurant heats up as fire performer Hayley goes on a date with business owner Glen who claims if he were a movie character it would be Christian Grey. Heavily tattooed Sarah, 36-years-old from Wales, is looking for a man to take her bins out on a Tuesday and hopes to find that quality in the equally inked Dan. Twenty-four year-old William is matched with with 23-year-old Zara, both parties are on their first date ever. The final couple into the restaurant are 34-year-old Ashauna and 38-year-old Kurt who lends a sympathetic ear when Ashauna discusses her self-esteem taking a hit after facing dating discrimination over her albinism."
      },
      {
        "id": "tvmaze:2982038",
        "title": "Episode 2",
        "season": 22,
        "episode": 2,
        "released": "2024-08-20",
        "overview": "Best friends Emma and Dani hope that going on a double date will double their chances of leaving with the one for them. Emma is matched with wildlife documentary filmmaker Joe while Dani is paired with construction worker Clinton but the girls start to wonder if they should swap partners. Factory worker Mark is hoping Venezuelan cleaner Aire will be his perfect salsa partner and DJ Mel goes on a date with fashion graduate Samira."
      },
      {
        "id": "tvmaze:2982039",
        "title": "Episode 3",
        "season": 22,
        "episode": 3,
        "released": "2024-08-27",
        "overview": "Sixty-three-year-old Jean, a French teacher and avid reader, is looking for someone to match her intellect. Enter 65-year-old crime fiction writer Andy, they're both eager to find love later in life after overcoming obstacles. Plus, trainee barrister Holly, who's 28, is matched with 26-year-old artist Marcella."
      },
      {
        "id": "tvmaze:3002007",
        "title": "Episode 4",
        "season": 22,
        "episode": 4,
        "released": "2024-09-13",
        "overview": "Pink-jacket-rocking Taiwo is first into the restaurant, for a date with fellow content creator Hemah. Hemah's opening gambit is to tell Taiwo to choose her drink, and he spends the rest of the date trying to keep up. Enthusiastic adventure swimmer Lindsey is paired with Sicilian chef Stefano, while party-loving DJ Bear is matched with matched with keen-to-get-married nanny Hollie."
      },
      {
        "id": "tvmaze:3002008",
        "title": "Episode 5",
        "season": 22,
        "episode": 5,
        "released": "2024-09-20",
        "overview": "Hoping to meet someone 'feral, but not too feral', divorcee Jo is introduced to pub landlord Sam. They bond over Tank Girl and Jo soon feels comfortable enough to speak about her alopecia. Fiftysomething voice-over artist Ingrid is paired with 57-year-old cinema operator Simon and they quickly connect over a shared passion for film. Marina is a 28-year-old jewellery designer searching for a Christian who believes in chastity before marriage. Twenty-nine-year-old barber Costa is a man of faith who says grace before they eat. Has Marina found her miracle man?"
      },
      {
        "id": "tvmaze:3011107",
        "title": "Episode 6",
        "season": 22,
        "episode": 6,
        "released": "2024-09-27",
        "overview": "Twenty six-year-old graphic designer Charlie says that some people describe her optimism as 'relentless'. She's matched with 25-year-old Australian osteopath Benj, who loves to talk about his feelings and is fond of a cry. Bus driver Tommy and electrician Luke both agree that they hate dating apps and hook-up culture. However, Luke then learns something about Tommy that leaves their date hanging by a thread. Stephen is divorced with two kids, he's 46, and he works as a toiletry products salesman. He gives his date, 42-year-old mum-of-one Rachel, a lesson in loo paper. Will she be happy to roll with it?"
      },
      {
        "id": "tvmaze:3017920",
        "title": "Episode 7",
        "season": 22,
        "episode": 7,
        "released": "2024-10-04",
        "overview": "After suffering a life-threatening illness, 29-year-old Georgina is back on the dating scene and looking for a rugged man. Her needs might be supplied in the shape of 36-year-old heavily tattooed security guard Seb. Ashleigh, who's 37 and looking for someone to share her love of Dungeons and Dragons, meets 34-year-old Hailey, a scholar of Shakespeare who hasn't had a relationship with a woman since she came out. Single mother-of-two Kate loves the Viking look. Her match, Jim, may look tough on the outside, but confesses that he's emotional on the inside and has experienced his fair share of sadness."
      },
      {
        "id": "tvmaze:3017921",
        "title": "Episode 8",
        "season": 22,
        "episode": 8,
        "released": "2024-10-11",
        "overview": "Italian 'nice guy' Matteo's date is Sam, a 38-year-old marketing consultant, who pursues a rather intense line of questioning - with babies mentioned before they've even ordered dinner. Hoping to turn over a new leaf in love is 28-year-old self-proclaimed tree-hugger Nathan. Entering the restaurant wearing a skirt, Nathan is on the hunt to find someone to share a life on the wild side. In walks 26-year-old Love, a fellow nature lover and Hare Krishna believer, whose spirituality has been a turn-off for dates in the past. A chef and a wedding singer are also among those hoping to meet their match."
      },
      {
        "id": "tvmaze:3017922",
        "title": "Episode 9",
        "season": 22,
        "episode": 9,
        "released": "2024-10-18",
        "overview": "Shaven-headed aspiring rapper Matt is romantically minded enough to present a bouquet of flowers to his date, music producer Breda. Dynamic grandmother Karen sets out to give retired teacher Jim's dating game a boost, while Abbie is matched with Matt, who struggles with confidence and battles to make an order in restaurants. Abbie warms up her tongue-tied date - before dropping a bombshell."
      },
      {
        "id": "tvmaze:3123479",
        "title": "Episode 1",
        "season": 23,
        "episode": 1,
        "released": "2025-02-03",
        "overview": "More hopeful singletons visit the First Dates restaurant looking for love. Glamorous 53-year-old Justine loves chocolate; 59-year-old chocolate expert Angus is hoping to melt her heart. Their date sizzles, but is Angus coming on too strong? Fashionista Lucy, who's 24, has never had a boyfriend. She suffered a long illness, which means she now uses a stoma bag. Lucy's date is the moustachioed, pearl-necklace-wearing Ben, who's also 24. They connect over fashion, charity shops and a shared obsession with Harry Styles. Hairdresser Clint, who's 39, admits that dates tend to find him rude. His match is long-haul flight attendant Dani, who's also 39, and who finds his jet-setting job is a hindrance to settling down. Writer Jack bears more than a passing resemblance to his namesake Captain Jack Sparrow. His date Chloe, a singer in a rock band, arrives in an eye-catching leather dress. From the moment Jack and Chloe meet and compliment each other's eyeliner, sparks fly. Jack writes Chloe a poem. But she goes one better, performing a serenade that brings the restaurant to a standstill and leaves Jack stunned."
      },
      {
        "id": "tvmaze:3135304",
        "title": "Be My Valentine",
        "season": 23,
        "episode": 2,
        "released": "2025-02-10",
        "overview": "On Valentine's, the most romantic day of the year, 50-year-old Dave, a singer and wedding celebrant who unites couples in matrimonial bliss, hopes to find a piece of that bliss for himself. Enter Matthew, who's also 50, a single dad sporting a beard that he himself classes as a mistake. Betty, who's 23, has never had a boyfriend. Her date tonight is Robbie, a 31-year-old shoe salesman whose banter sometimes lets him down. After a slightly awkward start, they bond over past hardships as young love starts to blossom. Martin, a 66-year-old poet from West Yorkshire, has memory problems after a serious motorbike accident. Martin's date is Denise, a grandmother of six. And Martin's so inspired he writes Denise a poem on the spot. Jade is a 29-year-old artist who turns heads. Jade thinks women are 'the most beautiful thing in the world' but finds them very hard to read. Her date with Genell, a mum of one, is one of the flirtiest encounters the restaurant has ever seen."
      },
      {
        "id": "tvmaze:3143386",
        "title": "Episode 3",
        "season": 23,
        "episode": 3,
        "released": "2025-02-17",
        "overview": "Hugo is 19 and, although he wears a cravat, he's never been on a date. He meets career-focussed Rose, who's also 19 and knows exactly what she wants: becoming a self-made millionaire, holidaying on a yacht in Monaco, and finding a man who looks like a young Hugh Grant. Hugo's dating inexperience is clearly demonstrated by a series of clangers; he even asks Rose if she's pregnant. Next up: at the age of 61 Candy is an eternal optimist who believes her knight in shining armour is still out there. Cue dapper 61-year-old fitness aficionado David. Trainee paramedic Holly has a weakness for bad boys and a habit of getting their names tattooed 'in a private area' shortly before they dump her. TV salesman Taylor has the bad boy looks but a heart of gold. Kirsty, a 42-year-old mother-of-two and amateur boxer, is ready to put her gloves down for love and is looking for a 'gym buff'. Avid gym-goer and kebab shop entrepreneur Paul credits his love of doners for helping him achieve his muscular physique. Is Kirsty in for a sizzling date? Or will it all go up in flames?"
      },
      {
        "id": "tvmaze:3147712",
        "title": "Episode 4",
        "season": 23,
        "episode": 4,
        "released": "2025-02-24",
        "overview": "Social activist Shamsa dreams of a man who's fun, respectful, handsome and, most importantly, tall. Enter 6' 3\" software salesman Hamish, a gentleman who proves chivalry is alive and well. Sparks fly, they bond over a shared love of Whitney Houston, and Shamsa feels comfortable enough to tell Hamish about a powerful and traumatic event from her childhood. Meanwhile, school caretaker Dominic, who's 27, hasn't had much luck in love; one date took him shopping in TK Maxx. His match is 30-year-old Rebecca, a free spirit who loves swimming with sharks and travelling to exotic parts of the world. Dominic can't swim and has a phobia of butterflies; can he turn his luck around, or is adventurous Rebecca too much for him to handle? Rock singer Brocarde is hoping to meet a fellow creative who'll accept the 'ghosts' of her past and make her heart sing. She bonds with youth worker and fellow musician James over shared passions. But how will James react when Brocarde opens up about her romantic dealings within the paranormal world? Retired fire-fighter Ian hasn't dated since his wife passed away. Can he re-ignite the flame of love and find a second chance at happiness with passionate and playful Coral?"
      },
      {
        "id": "tvmaze:3154201",
        "title": "Episode 5",
        "season": 23,
        "episode": 5,
        "released": "2025-03-03",
        "overview": "After racing at Le Mans and winning Daytona, retired sports car driver Johnny, who's 54, is looking to inject some va-va-voom into his love life. His date is 49-year-old champion ballroom dancer Snieguole, whose name means Snow White in Lithuanian. Snieguole seeks a man 'with balls, who won't be scared of me'. School caretaker Dominic returns to the restaurant after his first visit ended in tears. His second shot at romance comes in the form of 29-year-old animal charity worker Beth. The two quickly connect over a shared love of camper vans. And then there's 21-year-old dog groomer Pollyanna, who is deaf and whose sign name is 'Prosecco Polly'. Her date is stablehand Rob. Rebecca, who's 22, works as a model for adult TV channel Babestation - a job she loves but which has 'caused hell' with her dating life. Leather-clad fitness photographer Mak, who's 35, is Rebecca's date, and sparks fly. But how will Mak react when Rebecca reveals her side-hustle as a dominatrix specialising in foot worship?"
      },
      {
        "id": "tvmaze:3293854",
        "title": "Episode 1",
        "season": 24,
        "episode": 1,
        "released": "2025-07-04",
        "overview": "Newly married Fred Sirieix watches on as serial dater Conner, from Surrey, tries to connect with tech consultant Charlie, a self-described geek who turns heads. Next in is Sophie, a tattoo-loving mum-of-three from Cheshire who has never dated a woman before. Her date, Emily, is a massage therapist with a calming energy. The two bond quickly, but a twist lies in store as it becomes apparent that one has her husband in tow."
      },
      {
        "id": "tvmaze:3293855",
        "title": "Episode 2",
        "season": 24,
        "episode": 2,
        "released": "2025-07-11",
        "overview": "It's a night of personality, passion and surprise pairings as Rebecca, a Boris Johnson fan, finds her political match in Bradley. Paris and Serena navigate chemistry and chaos over a spilled drink, while seaside-loving midwife Anna meets her sensitive surfer in Luke. Cormac, a vintage-obsessed 24-year-old, finds the heat with bold 58-year-old Lorraine."
      },
      {
        "id": "tvmaze:3305136",
        "title": "Episode 3",
        "season": 24,
        "episode": 3,
        "released": "2025-07-18",
        "overview": "Daters who believe it's never too late to find that elusive spark, including Cornwall romantics Mark and Josie, single mum Maisie and guarded Dan, and gaming duo Joe and Rebecca."
      },
      {
        "id": "tvmaze:3305137",
        "title": "Episode 4",
        "season": 24,
        "episode": 4,
        "released": "2025-07-25",
        "overview": "Kathleen, a 64-year-old singer with a Top of the Pops past, meets Sue, a campervan-loving former handywoman who's embracing her new life after coming out. Holiday park performer Edward connects with musical-loving Rosie, who's never even held hands with a boy but might just find her leading man. Jet-setting superyacht steward Natasha seeks love with yacht captain Alex. And ex-copper Kerry wants an alpha male who's fit for royalty. Is Dan her king in waiting?"
      },
      {
        "id": "tvmaze:3317435",
        "title": "Episode 5",
        "season": 24,
        "episode": 5,
        "released": "2025-08-01",
        "overview": "Forty-six year-old ex-Traitors contestant Ash prepares for a date with 46-year-old self-confessed cheesy Spanish poet Miguel. However, feeling less than adept at flirting, she turns to Fred Sirieix for a crash-course in romantic banter. Luxury sales assistant Dominic is looking for a geek with heart who can handle his big personality. Enter Stephen, a sound engineer armed with a library of flirty one-liners. Self-proclaimed smoothie Wayne from Kent is a handyman who can fix almost anything - except his love life. With a ukulele in hand and chat-up lines at the ready, he prepares to serenade music-lover Teresa."
      },
      {
        "id": "tvmaze:3317436",
        "title": "Episode 6",
        "season": 24,
        "episode": 6,
        "released": "2025-08-08",
        "overview": "Sarah from Port Talbot returns to the restaurant to be paired with Welshman Ryan. However, the duo quickly realise this may not be the first time they've met. Outdoor lover Carmen and softly spoken hairstylist Eddie bond over camping, fitness and fun. Meanwhile, James is looking for someone kind, grounded and emotionally available and is hoping dog-loving estate agent Michael will fit the bill. Angela, a fun-loving 81-year-old, dreams of meeting someone who'll make her laugh. Enter 77-year-old John, who has an undeniable zest for life."
      },
      {
        "id": "tvmaze:3328619",
        "title": "Episode 7",
        "season": 24,
        "episode": 7,
        "released": "2025-08-15",
        "overview": "Warm-hearted widow Susan steps back into the dating world after seven years alone, hoping to find laughter - and maybe love - again. Apprehensive content creator Mark meets a well-travelled romantic, high-energy Chris connects with Keturah, who's re-entering the dating scene after a decade, and confident boss Jo is matched with Keith, a champion speed skater."
      },
      {
        "id": "tvmaze:3328620",
        "title": "Episode 8",
        "season": 24,
        "episode": 8,
        "released": "2025-08-22",
        "overview": "Sisters Caitlin and Lucy have never been in a romantic relationship with a guy. They decide to visit the restaurant to each take a dive into dating. Naked cleaner Elleigha is confident in everything - except romance. She's matched with head chef Louis, a man searching for a wild connection with someone with strong opinions. Aspiring erotic-fiction-writer Immogen also attends, finally ready to live out her passions in real life."
      },
      {
        "id": "tvmaze:3340024",
        "title": "Episode 9",
        "season": 24,
        "episode": 9,
        "released": "2025-08-28",
        "overview": "Sparks fly as TOWIE's Leah Wright attends the restaurant seeking some old-school romance with ex-bouncer Adam from Runcorn. While one dater hopes for luxury gifts, a free spirit wrestles with commitment. Plus, a nervous first-timer meets a confident dater and the two of them get caught up in silence."
      }
    ]
  }
}