{
  "meta": {
    "id": "tvmaze:84627",
    "type": "series",
    "name": "Killer Grannies",
    "description": "A true-crime series that chronicles the most shocking and unpredictable cases involving a killer no one would suspect: Grandma. In every self-contained episode, a rollercoaster ride of a case unfolds as investigators dig deep and chase every lead until they finally catch their unexpected killer. Through gripping archival footage, selective recreations and cinematic imagery, and in-depth interviews with investigators, prosecutors, friends and family, every episode will peel back the plastic cover on the couch to uncover a world of sinister plots and evil deeds unpacking why and how these maternal matriarchs of the family can turn deadly.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492434.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492434.jpg",
    "videos": [
      {
        "id": "tvmaze:3420995",
        "title": "Granny's Word v Granny's Word",
        "season": 1,
        "episode": 6,
        "released": "2025-12-14",
        "overview": "An Army vet is found dead on his farm. It first looks like the tragic suicide of a troubled veteran, but police uncover a sprawling cover-up and two grannies whose dueling stories collide in a troubling \"she said, she said\" murder mystery."
      },
      {
        "id": "tvmaze:3420996",
        "title": "Granny's Killer Gravy",
        "season": 1,
        "episode": 7,
        "released": "2025-12-21",
        "overview": "A veteran cop falls for a beloved grandma he hopes to spend the rest of his life with, but when a home cooked meal sends them both racing to the hospital - this granny's gravy, and her sordid past, are brought under scrutiny."
      },
      {
        "id": "tvmaze:3420997",
        "title": "Granny's Wishing Well",
        "season": 1,
        "episode": 8,
        "released": "2025-12-28",
        "overview": "A respected Fire Department Captain disappears during a fishing trip, but an exhaustive search turns up nothing. Almost two years later, a tip reveals a sinister tale of manipulation and a granny whose wishing well hides buried secrets."
      },
      {
        "id": "tvmaze:3420994",
        "title": "Granny's Boarding House",
        "season": 1,
        "episode": 5,
        "released": "2025-12-07",
        "overview": "A Granny is thought of as a 'Mother Teresa' to the downtrodden thanks to the boarding house she runs. But when a social worker raises fears for a missing client, investigators find that Granny's carefully tended garden hides horrors."
      }
    ]
  }
}