{
  "meta": {
    "id": "tvmaze:63875",
    "type": "series",
    "name": "New Year's Eve Live: Nashville's Big Bash",
    "description": "Originating from downtown Nashville across multiple locations, the star-studded special will be packed with high-energy performances celebrating the excitement and anticipation of a new year.Music City has built an outstanding reputation for throwing the most musical New Year's celebration and country's biggest party. The five-hour celebration features nearly 50 performances from locations across the city, including the mainstage in Nashville's Bicentennial Capitol Mall State Park. The broadcast will cross multiple time zones, with the traditional countdown at midnight ET, culminating with the renowned Nashville Music Note Drop and fireworks at midnight CT.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/494/1237304.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/494/1237304.jpg",
    "videos": [
      {
        "id": "tvmaze:3459692",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 1)",
        "season": 2025,
        "episode": 1,
        "released": "2025-12-31",
        "overview": "The five-hour broadcast will feature electrifying performances from Jason Aldean, Lainey Wilson and Bailey Zimmerman, uniting country music fans for one of the nation's largest New Year's Eve celebrations. Joining the celebration as a special guest will be gospel music legend CeCe Winans."
      },
      {
        "id": "tvmaze:3469082",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 2)",
        "season": 2025,
        "episode": 2,
        "released": "2025-12-31",
        "overview": ""
      },
      {
        "id": "tvmaze:2383657",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 1)",
        "season": 2022,
        "episode": 1,
        "released": "2022-12-31",
        "overview": "Will be hosted by country music stars and GRAMMY®-nominated artists Jimmie Allen and Elle King and ENTERTAINMENT TONIGHT's Rachel Smith.New Performers Include Jason Aldean, Jimmie Allen, Dierks Bentley, Luke Bryan, King Calaway, Sheryl Crow, Flo-Rida, Riley Green, Elle King, Ashley McBryde, Steve Miller, Thomas Rhett, Darius Rucker, Lainey Wilson, and The War and Treaty."
      },
      {
        "id": "tvmaze:2456415",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 2)",
        "season": 2022,
        "episode": 2,
        "released": "2022-12-31",
        "overview": ""
      },
      {
        "id": "tvmaze:2657980",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 1)",
        "season": 2023,
        "episode": 1,
        "released": "2023-12-31",
        "overview": "Joining previously announced performers Old Dominion, Elle King, Thomas Rhett, Lynyrd Skynyrd and Lainey Wilson are Trace Adkins, Grace Bowers, Kane Brown, Jackson Dean, HARDY, Cody Johnson, Parker McCollum, Megan Moroney, Brothers Osborne, Jon Pardi, Carly Pearce, Blake Shelton, Trombone Shorty, Morgan Wallen and Bailey Zimmerman. CMT television and radio host Cody Alan and CBS anchor Lonnie Quinn will be corresponding from New York City's Times Square, along with Dustin Lynch, who will also be performing live."
      },
      {
        "id": "tvmaze:2657981",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 2)",
        "season": 2023,
        "episode": 2,
        "released": "2023-12-31",
        "overview": ""
      },
      {
        "id": "tvmaze:3008396",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 1)",
        "season": 2024,
        "episode": 1,
        "released": "2024-12-31",
        "overview": ""
      },
      {
        "id": "tvmaze:3008397",
        "title": "New Year's Eve Live: Nashville's Big Bash (Part 2)",
        "season": 2024,
        "episode": 2,
        "released": "2024-12-31",
        "overview": ""
      }
    ]
  }
}