{
  "meta": {
    "id": "tvmaze:2246",
    "type": "series",
    "name": "Chicago Med",
    "description": "An emotional thrill ride through the day-to-day chaos of the city's newest state-of-the-art trauma center and into the lives of the courageous doctors, nurses and staff who hold it all together. This is one of those days.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/588/1471713.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/588/1471713.jpg",
    "videos": [
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:182007",
        "title": "Derailed",
        "season": 1,
        "episode": 1,
        "released": "2015-11-17",
        "overview": "The emergency department's grand opening is interrupted by an onslaught of crash victims, pushing hospital administrator Sharon Goodwin and her staff to their limits as they frantically work to triage and treat patients. It's all hands on deck as newly hired trauma surgeon Dr. Connor Rhodes, pregnant pediatrics specialist Dr. Natalie Manning, third-year resident Dr. Will Halstead, military-trained Dr. Ethan Choi, nurse April Sexton and head of psychiatry Dr. Daniel Charles must pull together to save lives. Rounding out the team is medical student Sarah Reese, who quickly learns some of the hard lessons that come with life in the Emergency Department."
      },
      {
        "id": "tvmaze:390463",
        "title": "iNO",
        "season": 1,
        "episode": 2,
        "released": "2015-11-24",
        "overview": "As Dr. Ethan Choi treats a bleeding teenage girl, he discovers she's just given birth, sparking a frantic search for her abandoned baby. When the details of the teen's troubled past emerge, Ethan finds himself at odds with pediatrician Dr. Natalie Manning and hospital administrator Sharon Goodwin as they're forced to make some difficult decisions about the teen's future. Dr. Will Halstead treats a hypochondriac with chest pains while struggling to navigate his overbearing wife. Meanwhile, med student Sarah Reese and psychiatrist Dr. Daniel Charles treat a patient suffering from dementia, only to discover she may not have dementia at all."
      },
      {
        "id": "tvmaze:393912",
        "title": "Fallback",
        "season": 1,
        "episode": 3,
        "released": "2015-12-01",
        "overview": "When Dr. Connor Rhodes takes the case of a close family friend who's been impaled by glass shards, he's reunited with his sister, Claire Rhodes, and forced to confront his past. Meanwhile, Dr. Natalie Manning convinces a young musician to undergo a surgery that will save her life but could destroy her hearing."
      },
      {
        "id": "tvmaze:450453",
        "title": "Mistaken",
        "season": 1,
        "episode": 4,
        "released": "2015-12-08",
        "overview": "After shots ring out at a movie theater, the Chicago Med doctors work to treat the victims while hospital administrator Sharon Goodwin attempts to keep the press at bay. To treat a teenager with an eating disorder, Dr. Natalie Manning enlists the help of Dr. Daniel Charles, but his unorthodox methods rub Natalie and the teenage girl's mother the wrong way. Meanwhile, Nurse April Sexton, Dr. Will Halstead and Dr. Ethan Choi treat a racist patient whose strange form of bigotry surprises them all."
      },
      {
        "id": "tvmaze:457568",
        "title": "Malignant",
        "season": 1,
        "episode": 5,
        "released": "2016-01-05",
        "overview": "Following a knife attack, a member of the team lies in peril and their condition takes a sudden turn for the worse, leaving Dr. Rhodes and Dr. Zanetti scrambling to race against the clock. Word quickly spreads that some of Connor's fellow doctors feel he should have operated sooner, causing tension at the hospital. Dr. Manning makes preparations for her pregnancy and Nurse Sexton's brother struggles through his first day at the hospital. Meanwhile, members of the Chicago P.D. Intelligence Unit help investigate whether the case of a women clinging to life after Firehouse 51 pulled her out of a burning building is attempted suicide or murder. As the investigation deepens, a surprising parallel to other patients surfaces."
      },
      {
        "id": "tvmaze:549809",
        "title": "Bound",
        "season": 1,
        "episode": 6,
        "released": "2016-01-19",
        "overview": "Two airplane stowaways are brought into the hospital after suffering major injuries from the travel, prompting Sharon Goodwin to receive a visit from the Department of Homeland Security regarding the undocumented immigrants. Cornelius Rhodes, the wealthy father of Dr. Connor Rhodes, is honored after making a big donation to the hospital for a new psych ward, forcing dark family secrets to the surface. Dr. Natalie Manning's big day arrives and Dr. Will Halstead's good intentions to help are misconstrued by her mother-in-law, Helen. Meanwhile, Dr. Sarah Reese asks Dr. Charles for advice on how to deliver heartbreaking news to a young boy while also warning his family about the possibility that their other son may also have the same life-threatening disease."
      },
      {
        "id": "tvmaze:559091",
        "title": "Saints",
        "season": 1,
        "episode": 7,
        "released": "2016-01-26",
        "overview": "When legal issues complicate matters that stall a life-saving bone marrow transplant, Sharon Goodwin must decide whether to disobey direct orders or stand by and put a patient's life in jeopardy. April tends to a caring, homeless man who Dr. Charles evaluates, only to come to an unusual diagnosis that explains his recent behavior. Dr. Natalie Manning's parents come to town to see their new grandchild, much to the dismay of her mother-in-law, Helen. Dr. Connor Rhodes treats a couple who are injured on their first date by a hit-and-run driver, who Dr. Halstead discovers has his own reasons for causing the accident."
      },
      {
        "id": "tvmaze:567225",
        "title": "Reunion",
        "season": 1,
        "episode": 8,
        "released": "2016-02-02",
        "overview": "Dr. Manning returns from maternity leave and helps treat a teen with a long history of medical issues. Dr. Choi attends to a former Navy shipmate with a potentially life-threatening ailment and goes above and beyond the scope of his duties to ensure he gets the proper treatment. Saudi Prince Faisal arrives at the hospital for a planned surgical procedure, but only from Dr. David Downey, the hot-shot surgeon who takes a shine to the work of Dr. Rhodes. Meanwhile, a budding romance between Sarah and hospital lab tech Joey looks hopeful, but April might think otherwise."
      },
      {
        "id": "tvmaze:577014",
        "title": "Choices",
        "season": 1,
        "episode": 9,
        "released": "2016-02-09",
        "overview": "Dr. Halstead revives a \"do-not-resuscitate\" terminally ill cancer patient, and the repercussions prompt his quick removal from the case and a pending lawsuit against Chicago Med. A homeless man's arrival is passed down to April and an uneager Dr. Reese, but the circumstances surrounding his short stay catch both off-guard. Following the assessment and treatment of a bi-polar patient with an unhealthy dependence for lithium, Dr. Choi's own personal issues come to the surface, prompting him to seek the advice of Dr. Charles. The medical staff is shocked to learn one of their own has life-threatening disease."
      },
      {
        "id": "tvmaze:585199",
        "title": "Clarity",
        "season": 1,
        "episode": 10,
        "released": "2016-02-16",
        "overview": "Dr. Rhodes and Dr. Downey make plans to operate on Ray, a 9/11 hero who is suffering from pulmonary fibrosis. A new set of lungs could save his life through an innovative surgical procedure but an unforeseen medical problem arises with Ray that might derail the doctor's grand plans. Sarah contemplates which hospital to select for her residency match while Maggie and April make their push for her to remain at Chicago Med. Meanwhile, Dr. Choi works to determine the cause of an injured teenage star hockey player with an overbearing father while Dr. Halstead and Dr. Manning continue to clash."
      },
      {
        "id": "tvmaze:596893",
        "title": "Intervention",
        "season": 1,
        "episode": 11,
        "released": "2016-02-23",
        "overview": "Dr. Rhodes and Dr. Choi disagree over the final decision made by a patient suffering from a life-threatening heart condition. The pending lawsuit against Dr. Halstead continues to move forward and Sarah Reese and Dr. Zanetti scramble to save a patient with a misdiagnosed flesh-eating bacterial disease. Elsewhere, Dr. Manning treats a young girl diagnosed with a contagious bacteria, prompting her and Dr. Halstead to take action to avoid a major outbreak."
      },
      {
        "id": "tvmaze:628005",
        "title": "Guilty",
        "season": 1,
        "episode": 12,
        "released": "2016-03-29",
        "overview": "Nurse Lockwood gets arrested for refusing to violate hospital policy and draw blood from a suspected DUI patient without his consent. Dr. Halstead discusses with his lawyer the severity of the pending lawsuit against him. Elsewhere, Dr. Manning and Sharon Goodwin deal with a single mother and her 6-month old, but when the baby's injuries come into question, concerns are raised. Meanwhile, Dr. Charles, who is dealing with some personal issues, and Sarah Reese attend to a patient that was hit by a car, but suspicions abound when they dig deeper."
      },
      {
        "id": "tvmaze:653150",
        "title": "Us",
        "season": 1,
        "episode": 13,
        "released": "2016-04-05",
        "overview": "Dr. Halstead and Sharon Goodwin deal with a husband intent on harvesting his recently deceased wife's eggs, but soon discover some vital information that surprises everyone. Dr. Charles is brought in by Dr. Choi to aid a patient who is trying to remove his own arm from his body because he feels like it doesn't belong. Nurse Sexton befriends the father of a child who is rushed into the hospital after swallowing magnets - a situation that Dr. Rhodes and Dr. Manning are concerned could present dangerous complications. Meanwhile, Sarah Reese finally learns about where she will do her residency, but has last-minute second thoughts"
      },
      {
        "id": "tvmaze:655734",
        "title": "Hearts",
        "season": 1,
        "episode": 14,
        "released": "2016-04-19",
        "overview": "An erratic patient comes to the emergency department claiming that his heart is pounding inside his head and takes drastic measures to stop it, leaving Dr. Choi and Dr. Charles to figure out the best course of action. Dr. Manning works on a young boy with a broken wrist, but her suspicions abound when the facts don't add up, prompting her to report the situation to Goodwin and Dr. Charles, who must make a serious decision. Dr. Rhodes impresses Dr. Downey with his skills inside the operating room, but the pressure takes a toll. Elsewhere, Will receives news about the pending lawsuit, April feels a spark in her social life and Sarah tries to determine the cause of her recent anxiety."
      },
      {
        "id": "tvmaze:657674",
        "title": "Inheritance",
        "season": 1,
        "episode": 15,
        "released": "2016-04-26",
        "overview": "Dr. Manning and Dr. Charles deal with a 16-year-old patient suffering from abdominal pain who adamantly refuses any drugs for fear of winding up like her drug-addicted father. Dr. Halstead relives a bit of his past when a patient, along with his brother, turn out to be former high school classmates whose past history with him is anything but stellar. Meanwhile, Dr. Choi works on a woman 32 weeks pregnant who has a big reason to do everything in her power not to deliver the child, much to the dismay of Goodwin, Charles and the hospital staff. Elsewhere, April is less than thrilled to discover her brother Noah has an enterprising side-business that involves her new boyfriend Tate Dr. Rhodes avoids meeting up with his sister Claire so he doesn't have to deal with family issues."
      },
      {
        "id": "tvmaze:657703",
        "title": "Disorder",
        "season": 1,
        "episode": 16,
        "released": "2016-05-03",
        "overview": "When Dr. Rhodes and Dr. Downey treat a patient with a multitude of health and heart issues, they uncover he might be misdiagnosed and disagree over the best course of action. Dr. Choi, riding along with paramedic Sylvie Brett, responds to a call for a man with a leg injury, but complications arise in getting to him since the home is wrought with excessive hoarding. Meanwhile, treating a patient who was bitten by her own dog, Dr. Manning and Sarah have suspicions about the reason for the injury and what it might mean. Meanwhile, Goodwin ensures that everyone is on their best behavior when the Joint Commission makes a surprise visit to Chicago Med to evaluate and rate the hospital's standards."
      },
      {
        "id": "tvmaze:657718",
        "title": "Withdrawal",
        "season": 1,
        "episode": 17,
        "released": "2016-05-10",
        "overview": "April and Dr. Halstead handle an alcoholic homeless man with a broken leg, but they don't see eye to eye on how to best treat his illness. Still grieving the death of her late husband, Dr. Manning experiences a medical event after realizing her wedding ring has gone missing. Dr. Charles and Sarah treat two elderly women with the exact same symptoms, but uncover a surprise that links the two cases together. Dr. Downey and Dr. Rhodes operate on a patient refusing their recommended treatment due to religious reasons. Meanwhile, a frustrated Dr. Halstead considers a job offer in California."
      },
      {
        "id": "tvmaze:657733",
        "title": "Timing",
        "season": 1,
        "episode": 18,
        "released": "2016-05-17",
        "overview": "Dr. Rhodes tends to the care of Dr. Downey while Goodwin is forced to deal with personal issues. April bears the brunt of a punch while attending to a disorderly patient, but the incident could actually prove to be a blessing in disguise. Dr. Halstead discovers Goodwin has a trick up her sleeve and Dr. Manning finds her past catching up with her. Sarah's graduation day finally arrives, but she remains conflicted about mapping out her career plans for the future. Meanwhile, at the urging of Dr. Charles, Dr. Choi turns to an unlikely source for help."
      },
      {
        "id": "tvmaze:825387",
        "title": "Soul Care",
        "season": 2,
        "episode": 1,
        "released": "2016-09-22",
        "overview": "Dr. Rhodes begins his fellowship in cardiothoracic surgery, but gets off on the wrong foot with his challenging new boss, Dr. Latham. Dr. Choi navigates life as the new chief resident and finds the road a bit rocky, while Dr. Charles approaches Sarah with an interesting opportunity that catches her off-guard. Elsewhere, April works to come to terms with her recently discovered illness and Dr. Manning deals with a complicated case involving a pregnant woman who was a victim in a high speed collision. Meanwhile, Dr. Halstead takes exception to the actions of fourth-year medical student Jeff Clarke, whose past history with Dr. Manning may be a factor. Sharon Goodwin tries to pick up the pieces and move on with her life in the aftermath of Bert leaving."
      },
      {
        "id": "tvmaze:891926",
        "title": "Win Loss",
        "season": 2,
        "episode": 2,
        "released": "2016-09-29",
        "overview": "Dr. Manning and Dr. Rhodes separately treat complicated cases involving sick babies, only to uncover that the two cases could actually be intertwined. Elsewhere, Dr. Halstead and Dr. Charles treat a homeless man with an upbeat disposition who sheds some valuable insight that prompts one of the doctors to learn a thing or two along the way. Dr. Choi has a Navy corpsman follow him for the day as they deal with the toll of gang violence in the city, while Dr. Reese tries to understand the delicate balance required in her new position."
      },
      {
        "id": "tvmaze:891925",
        "title": "Natural History",
        "season": 2,
        "episode": 3,
        "released": "2016-10-06",
        "overview": "Dr. Manning and fourth-year medical student Jeff Clarke are forced to figure out a mystery illness when an Indonesian man who doesn't speak English arrives at the hospital in dire straights. Maggie takes Dr. Halstead to her family reunion where he meets her sibling Denise and uncovers deep-rooted family secrets. Meanwhile, Dr. Rhodes takes on a complicated heart surgery without consulting Dr. Latham and Dr. Reese and Dr. Charles encounter a woman experiencing an unusual pregnancy."
      },
      {
        "id": "tvmaze:891927",
        "title": "Brother's Keeper",
        "season": 2,
        "episode": 4,
        "released": "2016-10-13",
        "overview": "Several patients are discovered to have the same rare infection, prompting Dr. Charles' daughter Robyn, an epidemiologist, to be brought in to find the common link. Dr. Choi and Dr. Rhodes work on an elderly man who is discovered to be very ill, but a conflict in how to best treat him develops between his son and his young girlfriend. Meanwhile, Dr. Reese tries to help a young drug addict and Maggie tends to a patient who is dear to her heart.."
      },
      {
        "id": "tvmaze:939130",
        "title": "Extreme Measures",
        "season": 2,
        "episode": 5,
        "released": "2016-10-20",
        "overview": "A car accident that occurs at the Chicago Marathon leaves a victim in critical condition and tests the mettle of Dr. Halstead, April and her fourth-year medical resident brother Noah, who must perform a difficult procedure in the field. A mother brings in her 8-year-old girl experiencing a sudden hearing loss and Dr. Manning is left to tend to the case, which takes a complicated turn. Dr. Choi deals with Olga, a woman who is malnourished, prompting him to bring in Dr. Charles to help assess the case. Meanwhile, Goodwin takes measures to get her personal life in order."
      },
      {
        "id": "tvmaze:939131",
        "title": "Alternative Medicine",
        "season": 2,
        "episode": 6,
        "released": "2016-10-27",
        "overview": "Dr. Manning tends to a young cancer patient and struggles to inform the parents of her dire condition. Elsewhere, Dr. Reese gets contacted by Danny, the troubled young man, and turns to Dr. Charles and Det. Lindsay for help in resolving a difficult situation. Goodwin and Maggie do their best to clear the logjam in the hospital and Dr. Rhodes fine-tunes his instincts after both Dr. Latham and Dr. Halstead pick up on things he doesn't. Meanwhile, a teenage science geek and her friends impress Dr. Choi and Natalie with their bio-engineering lab."
      },
      {
        "id": "tvmaze:939463",
        "title": "Inherent Bias",
        "season": 2,
        "episode": 7,
        "released": "2016-11-03",
        "overview": "Sharon Goodwin's childhood sweetheart arrives at the hospital, but finds himself in dire straits. To help get his financial footing, Dr. Halstead gets lured into a concierge doctor app idea. Meanwhile, a young woman with a heart infection is treated by Dr. Rhodes against Dr. Charles' advice and Reese's former patient, a sex trafficking victim, reaches out to her for help."
      },
      {
        "id": "tvmaze:939464",
        "title": "Free Will",
        "season": 2,
        "episode": 8,
        "released": "2016-11-10",
        "overview": "Dr. Halstead and Dr. Manning deal with two warring brothers who are brought together when one finds himself in desperate need of a kidney. Dr. Reese's former patient Danny comes to a crossroad. Dr. Rhodes and Dr. Latham treat a 16-year-old girl with a genetic condition in need of surgery, but whose overprotective mother disagrees with that course of action. A convict with unusual intentions puts himself in the hospital and Dr. Charles meddles in his daughter Robyn's personal life, much to her dismay. Meanwhile, Dr. Halstead and April make a discovery that complicates her treatment for TB."
      },
      {
        "id": "tvmaze:981771",
        "title": "Uncharted Territory",
        "season": 2,
        "episode": 9,
        "released": "2017-01-05",
        "overview": "Goodwin tasks Dr. Charles with evaluating a patient as a possible heart recipient, while Jeff makes a confession to Dr. Manning. Dr. Choi deals with two MMA fighters who are brought into Chicago Med in bad shape. Elsewhere, Dr. Stohl returns to the hospital from his sabbatical leave and immediately offers up different medical opinion regarding the treatment of a patient under the care of Dr. Halstead. April discovers her TB medication may lead to further complications."
      },
      {
        "id": "tvmaze:981772",
        "title": "Heart Matters",
        "season": 2,
        "episode": 10,
        "released": "2017-01-12",
        "overview": "Dr. Rhodes and Dr. Charles' heart transplant patient gets into a car crash, revealing issues that could complicate her surgery. A past arrest causes trouble for Maggie when the arresting officer is brought to Chicago Med with a serious injury. Elsewhere, Dr. Manning and Dr. Halstead must defend their actions when explaining a patient's cause of death. Meanwhile, Dr. Halstead attempts to treat an uncooperative horse jockey."
      },
      {
        "id": "tvmaze:981774",
        "title": "Graveyard Shift",
        "season": 2,
        "episode": 11,
        "released": "2017-01-19",
        "overview": "It's a long night on the graveyard shift at Chicago Med, especially for Dr. Reese, who must deal with pronouncing patients dead on more than one occasion. April gets called in to work, much to the dismay of Tate, who pressures her to slow down. Meanwhile, Dr. Charles passes along some vital news to Dr. Latham, and Goodwin asks Dr. Rhodes to work on a most unusual patient."
      },
      {
        "id": "tvmaze:992251",
        "title": "Mirror Mirror",
        "season": 2,
        "episode": 12,
        "released": "2017-02-02",
        "overview": "Dr. Manning and Dr. Charles treat a teenage girl with a rapidly changing set of symptoms that has everyone perplexed. Dr. Choi and medical student Jeff Clark encounter a 19 year-old tough guy who is brought into the hospital in severe distress. Once they establish the cause of the pain, the situation quickly turns dangerous and a resolved Dr. Reese does her best to help. Elsewhere, Dr. Latham makes a big admission to Dr. Rhodes while Dr. Halstead must deal with a difficult case that is further complicated by Dr. Stohl, who has a camera crew following him around to shoot a promotional video spotlighting the hospital."
      },
      {
        "id": "tvmaze:1028527",
        "title": "Theseus' Ship",
        "season": 2,
        "episode": 13,
        "released": "2017-02-09",
        "overview": "Dr. Rhodes convinces Dr. Latham to join him for a medical trip out of town, which puts Latham's personality issues to the test. Dr. Manning treats an 8 year-old cancer patient who wants to give up on his battle until she makes a surprise discovery. Elsewhere, an unhealthy woman with heart problems is brought in and doesn't want to listen to doctors, much to the dismay of Dr. Halstead. Meanwhile, Dr. Choi, Dr. Charles and Dr. Reese work on a complicated case involving a woman with a personality disorder. Will and Nina work through their first relationship test."
      },
      {
        "id": "tvmaze:1047951",
        "title": "Cold Front",
        "season": 2,
        "episode": 14,
        "released": "2017-02-16",
        "overview": "The doctors and nurses of Chicago Med brace for an influx of trauma patients when a pre-dawn pileup finds the hospital in full scramble mode. With Dr. Rhodes and Dr. Latham handling duties in triage, difficult decisions are made. As a result of the storm and emergencies, supplies become limited and Goodwin, Dr. Manning and Dr. Halstead must deal with making an impossible decision. Meanwhile, Dr. Choi handles a severely burned patient who has one final request. Dr. Charles deals with an agitated patient who makes his presence known in the waiting room."
      },
      {
        "id": "tvmaze:1064861",
        "title": "Lose Yourself",
        "season": 2,
        "episode": 15,
        "released": "2017-03-02",
        "overview": "It's a miracle when a trauma patient survives the trip to the hospital, putting the pressure on Dr. Rhodes to keep the man alive. Dr. Choi and Dr. Manning have difficulty diagnosing the location of infection in a paralyzed patient. Dr. Reese must find purpose for a grieving widower who relies on a superhero costume. Meanwhile, April pushes Dr. Halstead to use unproved medications to help a patient with no other options."
      },
      {
        "id": "tvmaze:1071393",
        "title": "Prisoner's Dilemma",
        "season": 2,
        "episode": 16,
        "released": "2017-03-09",
        "overview": "Dr. Reese is contacted for help by a troubled teen in a psychiatric facility and Dr. Manning tries to help parents make a decision about their comatose daughter's surprise pregnancy. April begins to deal with repercussions from her personal life. Meanwhile, Dr. Choi and Dr. Rhodes work to save both a young girl from Ecuador who collapsed mid-flight, as well as her mother, who made great sacrifices for her daughter."
      },
      {
        "id": "tvmaze:1071394",
        "title": "Monday Mourning",
        "season": 2,
        "episode": 17,
        "released": "2017-03-16",
        "overview": "Dr. Choi and Dr. Halstead face off over how to treat a patient with stroke symptoms while Dr. Manning treats a young boy who fell in the river and watches the family turmoil unfold. Meanwhile, Dr. Rhodes examines the man who saved Dr. Manning's patient and emphasizes the importance of learning from your mistakes to Dr. Reese."
      },
      {
        "id": "tvmaze:1071395",
        "title": "Lesson Learned",
        "season": 2,
        "episode": 18,
        "released": "2017-03-30",
        "overview": "Will is troubled with a moral decision when his former teacher, Dr. Bella Rowan, is faced with a life-threating disease. Dr. Rhodes and Dr. Bardovi get involved in a sensitive situation when Rhodes disagrees with the father of a young patient regarding a risky procedure. Dr. Charles and Sarah handle an unusual case with a pilot that causes Sarah to have memories of Jason Wheeler's suicide. Maggie takes an aggressive approach to training a new nurse."
      },
      {
        "id": "tvmaze:1098482",
        "title": "Ctrl Alt",
        "season": 2,
        "episode": 19,
        "released": "2017-04-06",
        "overview": "A hacker demanding a ransom payment shuts down the hospital computer system, forcing the doctors to diagnose patients without the aid of technology. A stressed Goodwin struggles to keep the hospital afloat when an unexpected visit from her ex-husband Bert and his new girlfriend make matters worse. Making use of his former navy experience, Dr. Choi and Noah have to locate a bullet inside a patient with a gunshot wound. Meanwhile, Sarah feels Dr. Charles may be trying to push her out and Robin's unusual behavior worries Dr. Rhodes."
      },
      {
        "id": "tvmaze:1098596",
        "title": "Generation Gap",
        "season": 2,
        "episode": 20,
        "released": "2017-04-13",
        "overview": "Things get personal for Dr. Halstead when his unsupportive father is admitted to the hospital against his wishes. When treating Will's father, Dr. Rhodes reflects on his relationship with his dad. Dr. Charles gets involved when his daughter Robin's strange behavior continues to intensify and Dr. Choi struggles to help a teenage boy who is desperate to control his sexual urges. Dr. Manning feels the impact of being a working mother when a young boy is brought in for neglect. Meanwhile, Sarah teaches a group of high school students about the responsibilities of having a child by using fake baby dolls."
      },
      {
        "id": "tvmaze:1098597",
        "title": "Deliver Us",
        "season": 2,
        "episode": 21,
        "released": "2017-04-27",
        "overview": "Dr. Rhodes fights to save a mother who's desperate to help her daughter beat cancer. Dr. Charles asks Sarah to conduct his daughter Robin's psych evaluation but has difficulty staying out of the case. When Will and Dr. Manning spend more time together at work, Nina goes to extreme measures to get Will's attention. Meanwhile, Dr. Choi puts pressure on Noah when a residency spot becomes available."
      },
      {
        "id": "tvmaze:1098598",
        "title": "White Butterflies",
        "season": 2,
        "episode": 22,
        "released": "2017-05-04",
        "overview": "Dr. Rhodes challenges Dr. Charles and other hospital staff over the proper treatment for Robin. Dr. Manning seeks help from Det. Halstead when a sensitive case involving a young girl turns into a crime. Dr. Choi and April work together on a conflicting case. Meanwhile, Goodwin helps a friend in distress and, after eagerly awaiting, the doctors are surprised to learn who the new med resident is when match day finally arrives."
      },
      {
        "id": "tvmaze:1098599",
        "title": "Love Hurts",
        "season": 2,
        "episode": 23,
        "released": "2017-05-11",
        "overview": "A new hotshot doctor arrives at Chicago Med causing competition for Dr. Rhodes. Dr. Halstead and Dr. Manning work together to diagnose a Syrian refugee without a medical record. When Robin is admitted back into the hospital for more complications, Dr. Reese takes a different approach to her treatment. Distracted from work because of Robin's worsening case, Dr. Charles is challenged by Goodwin and Noah hosts a graduation party that brings everyone together."
      },
      {
        "id": "tvmaze:1264286",
        "title": "Speak Your Truth",
        "season": 3,
        "episode": 1,
        "released": "2017-11-21",
        "overview": "The doctors of Chicago Med take their opinions to the extreme as they try to bring justice to the perpetrator in the shooting of Dr. Charles. Dr. Halstead and Dr. Manning work on a heart-wrenching case that forces them to examine their own matters of the heart. Though Robin's brain tumor was removed and she is discharged from the rehabilitation center, Dr. Rhodes remains on edge that her problems are not quite resolved. Meanwhile, Rhodes gets blindsided by his colleague Dr. Bekker, Maggie sticks up for a patient and Dr. Choi and April try to navigate their new working relationship."
      },
      {
        "id": "tvmaze:1264287",
        "title": "Nothing to Fear",
        "season": 3,
        "episode": 2,
        "released": "2017-11-28",
        "overview": "Dr. Manning goes to extreme measures to help a fearful pregnant woman whose baby is severely underdeveloped. April is angered by Dr. Choi when he uses their personal relationship as leverage to convince a patient of a risky procedure. As Dr. Rhodes attempts to balance his personal and professional life, it appears the stress of his current situation may have caused him to make a huge mistake. Dr. Charles and Dr. Reese continue to disagree about their psych patients."
      },
      {
        "id": "tvmaze:1264288",
        "title": "Trust Your Gut",
        "season": 3,
        "episode": 3,
        "released": "2017-12-05",
        "overview": "When Goodwin receives financial complaints from the hospital board, she is forced to implement new guidelines that cause headaches for the doctors. Dr. Rhodes and Ava continue to compete in the operating room, while Dr. Charles and Dr. Reese are surprised when they treat a man who has a peculiar theory about his sickness. Dr. Manning and Dr. Choi can't figure out what is wrong with a young girl, leading them to look to a questionable source for answers."
      },
      {
        "id": "tvmaze:1271511",
        "title": "Naughty or Nice",
        "season": 3,
        "episode": 4,
        "released": "2017-12-12",
        "overview": "Dr. Charles learns a troubling fact about the man who shot him. Dr. Rhodes and Dr. Bekker come to an agreement during a complicated surgery. Will and Natalie are trapped by legal ethics when an unfaithful husband refuses to tell his wife about his inconclusive Zika test. Meanwhile, April and Noah discover working together isn't always easy while Goodwin continues to argue with the board over hospital costs after an avoidable patient death."
      },
      {
        "id": "tvmaze:1290605",
        "title": "Mountains and Molehills",
        "season": 3,
        "episode": 5,
        "released": "2018-01-02",
        "overview": "When a young woman with HIV symptoms and no insurance refuses to take the test, Goodwin and Dr. Choi attempt to treat her without taking a toll on the hospital's resources. Natalie and Will try to diagnose a young girl with increasing paralysis. Noah deals with his first death as a resident and takes it upon himself to inform the family. Sarah continues to avoid work as her fear over the hospital's security increases."
      },
      {
        "id": "tvmaze:1284882",
        "title": "Ties That Bind",
        "season": 3,
        "episode": 6,
        "released": "2018-01-09",
        "overview": "Ethan attempts to diagnose a man with no symptoms while Sarah's paranoia goes to the extreme when she uses pepper spray on an aggressive patient. Will treats a young couple willing to sacrifice anything in order to have a baby. Meanwhile, Natalie must inform a woman that she was sterilized as a young girl without knowledge, and Goodwin and Maggie devise a way to persuade paramedics to bring in more patients."
      },
      {
        "id": "tvmaze:1333573",
        "title": "Over Troubled Water",
        "season": 3,
        "episode": 7,
        "released": "2018-01-16",
        "overview": "Dr. Charles feels pressure when Dr. Choi and Dr. Manning criticize his medical decision regarding an ill newborn baby. Dr. Rhodes comes to terms with his relationship issues. Goodwin helps Bert understand Lyla's sickness."
      },
      {
        "id": "tvmaze:1333574",
        "title": "Lemons and Lemonade",
        "season": 3,
        "episode": 8,
        "released": "2018-01-23",
        "overview": "Dr. Choi struggles to help a woman cope with anorexia. After a two-week suspension, Dr. Reese is immediately put to the test upon her return by Dr. Charles. Dr. Rhodes takes a stand when one of his patients is forcibly transferred. Meanwhile, Dr. Halstead is on a mission to get Dr. Manning's son to like him."
      },
      {
        "id": "tvmaze:1333575",
        "title": "On Shaky Ground",
        "season": 3,
        "episode": 9,
        "released": "2018-02-06",
        "overview": "After discovering that a patient's family might have been abusive, Dr. Choi and April contemplate calling child services. Dr. Manning and Dr. Halstead struggle to see eye to eye in guiding a family who is dealing with their premature baby. Dr. Rhodes is persuaded into performing a risky surgery on Dr. Bekker's mentor and world renowned surgeon, Dr. Marvin Jaffrey. Meanwhile, Dr. Reese joins Dr. Charles on a visit to the Cook County jail."
      },
      {
        "id": "tvmaze:1352588",
        "title": "Down by Law",
        "season": 3,
        "episode": 10,
        "released": "2018-02-27",
        "overview": "After witnessing a drive-by shooting and hitting her head, Dr. Manning struggles with the aftermath of a head injury. Complicating matters, she and Dr. Halstead deal with a teenage patient and her overbearing older husband, who might not be looking out for his young wife's best interests. Dr. Rhodes finds himself in a unique situation when he learns alarming information about the woman he went on a date with. Maggie is surprised to discover some unexpected things about the man she has been seeing. Dr. Charles is frustrated when Dr. Reese disobeys his orders and puts herself at risk."
      },
      {
        "id": "tvmaze:1410587",
        "title": "Folie à Deux",
        "season": 3,
        "episode": 11,
        "released": "2018-03-06",
        "overview": "After a neighbor is stabbed, Dr. Choi enlists the help of April to figure out who is the real cause of the incident. Dr. Bekker and Dr. Rhodes expertise is put to the test when Noah misdiagnoses a patient. Dr. Charles is put in an uncomfortable position when Dr. Reese's estranged father comes to him as a patient without her knowledge. Meanwhile, Dr. Manning rushes to save a baby with whooping cough."
      },
      {
        "id": "tvmaze:1418589",
        "title": "Born This Way",
        "season": 3,
        "episode": 12,
        "released": "2018-03-20",
        "overview": "Upon hearing news of a pregnant teen, Dr. Manning and Dr. Choi venture to a homeless encampment to help deliver a baby under dire circumstances. Dr. Rhodes and Dr. Bekker argue about the best way to treat a young boy with a chronic disease. Dr. Halstead and April are put in an uncomfortable situation when they find out their patient is a pedophile. Goodwin and Maggie have to deal with a lawsuit against the hospital. Dr. Charles learns of important news pertaining to Dr. Reese's father."
      },
      {
        "id": "tvmaze:1419126",
        "title": "Best Laid Plans",
        "season": 3,
        "episode": 13,
        "released": "2018-03-27",
        "overview": "When a mother makes a decision regarding care of her vegetative adult son, Dr. Halstead and Dr. Manning find themselves at odds. Dr. Rhodes goes behind Dr. Bekker's back to figure out a way to get his patient at the top of the transplant list. Dr. Choi is at a loss when a woman in the waiting room falls asleep and won't wake up."
      },
      {
        "id": "tvmaze:1419127",
        "title": "Lock It Down",
        "season": 3,
        "episode": 14,
        "released": "2018-04-03",
        "overview": "After a baby is abducted from Med, Goodwin enlists the help of Dr. Charles and Dr. Reese to find the suspect. Due to the lockdown, Dr. Rhodes must figure out a way to get into the operating room to help perform open-heart surgery. Dr. Manning and Dr. Halstead disagree on the right treatment for a patient."
      },
      {
        "id": "tvmaze:1419128",
        "title": "Devil in Disguise",
        "season": 3,
        "episode": 15,
        "released": "2018-04-10",
        "overview": "Dr. Charles and Dr. Reese search for answers when a mother brings in her daughter claiming she is possessed. Dr. Rhodes and Dr. Bekker are tasked with finding a way to save a pair of conjoined twins. Dr. Halstead struggles to get Dr. Manning's attention. Maggie measures her options in the wake of her recent actions."
      },
      {
        "id": "tvmaze:1419129",
        "title": "An Inconvenient Truth",
        "season": 3,
        "episode": 16,
        "released": "2018-04-17",
        "overview": "After taking the lead on a surgery, Dr. Bekker feels the heat after something goes wrong. Dr. Manning and Dr. Charles are faced with a tough decision concerning the gender of a 9-year-old girl. April and Dr. Reese rush to find the son of a dying patient. Goodwin's godson is admitted to the hospital."
      },
      {
        "id": "tvmaze:1419130",
        "title": "The Parent Trap",
        "season": 3,
        "episode": 17,
        "released": "2018-04-24",
        "overview": "After a 10-year-old boy is admitted to the hospital, Dr. Manning and Dr. Halstead disagree on how to best handle the boy's parents. Dr. Rhodes rushes to fix a heart that will be given to Dr. Reese's estranged father."
      },
      {
        "id": "tvmaze:1419131",
        "title": "This is Now",
        "season": 3,
        "episode": 18,
        "released": "2018-05-01",
        "overview": "After a shooting occurs during a block party at a local park, Med is overrun with victims that stretch the hospital and staff to its limits. In the midst of the chaos, Dr. Choi devises a new mass casualty plan on the fly and Dr. Manning struggles to stay focused when she realizes her son and nanny might have been at the scene."
      },
      {
        "id": "tvmaze:1419132",
        "title": "Crisis of Confidence",
        "season": 3,
        "episode": 19,
        "released": "2018-05-08",
        "overview": "Dr. Manning rushes to save a young boy who has a life-threatening case of the flu. After discovering that opioid pain killers were stolen during last week's mass casualty, April believes Dr. Choi's sister took them. Dr. Rhodes and Dr. Bekker disagree over the best treatment for a cardiac patient who is 21 weeks pregnant."
      },
      {
        "id": "tvmaze:1419133",
        "title": "The Tipping Point",
        "season": 3,
        "episode": 20,
        "released": "2018-05-15",
        "overview": "Dr. Rhodes second guesses his decision to remove himself from the team of doctors who work to separate conjoined twins. Dr. Choi and April make a startling discovery about his sister, Emily, and Dr. Charles uncovers troubling information concerning Dr. Reese's father."
      },
      {
        "id": "tvmaze:1482234",
        "title": "Be My Better Half",
        "season": 4,
        "episode": 1,
        "released": "2018-09-26",
        "overview": "Goodwin finds herself quickly clashing with the new hospital COO Gwen Garrett while April questions whether or not Ethan's sister, Emily, is using again. Dr. Charles deals with his past actions."
      },
      {
        "id": "tvmaze:1511244",
        "title": "When to Let Go",
        "season": 4,
        "episode": 2,
        "released": "2018-10-03",
        "overview": "The doctors and nurses of Chicago Med find themselves on high alert when an overflow of patients are rushed into the doors following a terrifying apartment complex blaze. Dr. Rhodes fights to save the life of one of \"Chicago Fire's\" own, while Dr. Halstead and his brother Jay struggle with their own personal battle."
      },
      {
        "id": "tvmaze:1511245",
        "title": "Heavy is the Head",
        "season": 4,
        "episode": 3,
        "released": "2018-10-10",
        "overview": "When a sick boy is brought in, Ethan is faced with a tough decision that quickly escalates into a complicated and dangerous situation. Connor and Maggie are put to the test, while Natalie and Ethan aren't sure what to make of Elsa, the new third year medical student."
      },
      {
        "id": "tvmaze:1511246",
        "title": "Backed Against the Wall",
        "season": 4,
        "episode": 4,
        "released": "2018-10-17",
        "overview": "Dr. Halstead gets an unplanned visit from the CPD while Ethan is skeptical of a woman who is experiencing chronic pain. Natalie tends to a cancer patient whose brother has strong feelings on why he is refusing to lend his assistance."
      },
      {
        "id": "tvmaze:1519370",
        "title": "What You Don't Know",
        "season": 4,
        "episode": 5,
        "released": "2018-10-24",
        "overview": "When things become complicated, Will is forced to lie to Natalie. Ethan and April find out some compromising information about Emily's boyfriend and Ava is unsure of what to do with a patient who is refusing treatment."
      },
      {
        "id": "tvmaze:1543141",
        "title": "Lesser of Two Evils",
        "season": 4,
        "episode": 6,
        "released": "2018-10-31",
        "overview": "Dr. Manning and Dr. Halstead become skeptical of a patient's injuries when the victim of a car accident is brought into the hospital. Ethan and April have a difficult time understanding Emily's attachment to her boyfriend despite recent developments. Will and Natalie brace for their joint bachelor/bachelorette party."
      },
      {
        "id": "tvmaze:1544600",
        "title": "The Poison Inside Us",
        "season": 4,
        "episode": 7,
        "released": "2018-11-07",
        "overview": "The hospital is forced to evacuate when a toxic chemical is brought into the E.D., leaving patients and the staff in grave danger. Stuck in an elevator, Dr. Charles and Dr. Manning are forced to take drastic measures with a pregnant woman. Goodwin is tasked with making difficult choices and Dr. Rhodes discovers a secret that Dr. Bekker has been holding from him."
      },
      {
        "id": "tvmaze:1544601",
        "title": "Play By My Rules",
        "season": 4,
        "episode": 8,
        "released": "2018-11-14",
        "overview": "Dr. Charles struggles to convince Dr. Choi that surgery isn't always the answer. Dr. Rhodes finds himself in hot water with Goodwin when he disobeys her direct order. April becomes frustrated with Maggie when she continues to question her leadership role as the stand-in charge nurse. Dr. Manning suspects Dr. Halstead is keeping something from her."
      },
      {
        "id": "tvmaze:1544861",
        "title": "Death Do Us Part",
        "season": 4,
        "episode": 9,
        "released": "2018-12-05",
        "overview": "Will and Natalie prepare for their big day, but an unsuspecting Will soon finds himself sidetracked. Dr. Charles disagrees with Goodwin on how to best handle a patient's treatment while Dr. Choi and April are on their own when a pregnant woman delivers. Dr. Rhodes finds himself operating on a patient that is of great importance to Det. Halstead."
      },
      {
        "id": "tvmaze:1575320",
        "title": "All the Lonely People",
        "season": 4,
        "episode": 10,
        "released": "2019-01-09",
        "overview": "April finds herself in a dangerous situation and Natalie gets an update on Will. Dr. Rhodes gears up for a gala honoring his hybrid O.R. and tries to convince Dr. Bekker to join him."
      },
      {
        "id": "tvmaze:1585293",
        "title": "Who Can You Trust",
        "season": 4,
        "episode": 11,
        "released": "2019-01-16",
        "overview": "Will adjusts to hospital life in the aftermath of his recent undercover activities. Ethan and April's personal relationship starts to interfere with their working situation. Dr. Charles and Dr. Manning collaborate on a patient suffering from Alzheimer's. Dr. Rhodes and Dr. Bekker have a difference of opinion in dealing with a woman in desperate need of a liver transplant."
      },
      {
        "id": "tvmaze:1587000",
        "title": "The Things We Do",
        "season": 4,
        "episode": 12,
        "released": "2019-01-23",
        "overview": "Dr. Halstead rushes to rescue Dr. Manning after she is involved in a Medevac helicopter crash. The personal drama between Dr. Rhodes and Dr. Bekker boils over. Dr. Charles and Dr. Choi work to help a patient come to terms with their addiction. April helps Elsa deal with the loss of her first patient."
      },
      {
        "id": "tvmaze:1595362",
        "title": "Ghosts in the Attic",
        "season": 4,
        "episode": 13,
        "released": "2019-02-06",
        "overview": "Dr. Halstead withholds some important information from Dr. Manning and she begins to question his suspect behavior. Dr. Choi comes to some difficult conclusions involving April over a patient's care. An incident in the OR involving Dr. Bekker at the hands of Dr. Rhodes may have serious implications."
      },
      {
        "id": "tvmaze:1599128",
        "title": "Can't Unring That Bell",
        "season": 4,
        "episode": 14,
        "released": "2019-02-13",
        "overview": "Will's personal issues continue to interfere with his relationship with Natalie and his life at the hospital. Dr. Bekker tries to mend things with Dr. Rhodes. Goodwin questions Maggie's life-threatening decision and Dr. Charles tries to lend a hand to the daughter of a new friend."
      },
      {
        "id": "tvmaze:1604837",
        "title": "We Hold These Truths",
        "season": 4,
        "episode": 15,
        "released": "2019-02-20",
        "overview": "After witnessing a pick-up truck plow through a street fair, Natalie and Maggie are forced to make some tough decisions on the fly. The doctors and nurses of Chicago Med find themselves on high alert with the influx of patients arriving in need of aid. Dr. Charles ex-wife comes to town with news."
      },
      {
        "id": "tvmaze:1607966",
        "title": "Old Flames, New Sparks",
        "season": 4,
        "episode": 16,
        "released": "2019-02-27",
        "overview": "Natalie and Will grow further apart. Dr. Charles struggles to come to terms with his feelings toward his ex-wife. The personal issues between Dr. Rhodes and Dr. Bekker continue to cause problems at the hospital."
      },
      {
        "id": "tvmaze:1616047",
        "title": "The Space Between Us",
        "season": 4,
        "episode": 17,
        "released": "2019-03-27",
        "overview": "When a car unexpectedly smashes through the ambulance bay doors, Dr. Choi makes some difficult decisions in an effort to save a worker trapped beneath the wreckage and April, who's also in danger. Dr. Rhodes and Dr. Bekker tend to a patient whose best chance at survival is an extremely risky heart surgery. Dr. Charles struggles to come to terms with ex-wife Caroline's treatment."
      },
      {
        "id": "tvmaze:1616048",
        "title": "Tell Me the Truth",
        "season": 4,
        "episode": 18,
        "released": "2019-04-03",
        "overview": "Dr. Rhodes receives an alarming phone call that prompts him to rush out in the middle of an important surgery. Dr. Halstead comes to the aid of an FBI agent who is brought into the ER, but he suspects there is more to the story than he is being told. Dr. Manning and Dr. Choi find themselves on opposite sides of a major disagreement over doctor-patient confidentiality."
      },
      {
        "id": "tvmaze:1616049",
        "title": "Never Let You Go",
        "season": 4,
        "episode": 19,
        "released": "2019-04-24",
        "overview": "The hospital goes into lockdown mode when a man with a gun holds medical staff hostage. Goodwin is forced to make a tough decision. Dr. Rhodes begins to realize his time with his father is getting short."
      },
      {
        "id": "tvmaze:1616050",
        "title": "More Harm Than Good",
        "season": 4,
        "episode": 20,
        "released": "2019-05-08",
        "overview": "Dr. Charles and Dr. Manning disagree on how to handle a patient who they discover is poisoning herself. Dr. Rhodes throws some serious accusations at Dr. Bekker. Dr. Halstead has suspicions about Natalie's new boyfriend and Dr. Choi tends to Bernie."
      },
      {
        "id": "tvmaze:1632441",
        "title": "Forever Hold Your Peace",
        "season": 4,
        "episode": 21,
        "released": "2019-05-15",
        "overview": "Caroline has news to share, forcing Dr. Charles to make a serious decision about their relationship. Maggie meets her sister's new boyfriend, but discovers danger may lie ahead. Dr. Rhodes experiences a devastating loss while Dr. Choi and April are faced with an unexpected challenge that strengthens their relationship."
      },
      {
        "id": "tvmaze:1632442",
        "title": "With a Brave Heart",
        "season": 4,
        "episode": 22,
        "released": "2019-05-22",
        "overview": "Dr. Charles and Caroline set some major plans. Ava fights to keep her relationship with Connor. Agent Lee informs Will of news that may put his life in danger."
      },
      {
        "id": "tvmaze:1671999",
        "title": "Never Going Back to Normal",
        "season": 5,
        "episode": 1,
        "released": "2019-09-25",
        "overview": "Will and Natalie face the aftermath of a horrific car incident and are left to battle for their lives. An investigation is launched following the suspicious death of the elder Cornelius Rhodes, Dr. Rhodes' father. Maggie receives life changing news. Dr. Charles cuts his honeymoon short to tend to a young patient he suspects might have schizophrenia."
      },
      {
        "id": "tvmaze:1683174",
        "title": "We're Lost in the Dark",
        "season": 5,
        "episode": 2,
        "released": "2019-10-02",
        "overview": "A power outage at Med puts multiple patients at risk and tests the skills of the staff and their enthusiastic med students. Natalie returns following her traumatic brain injury. Ethan and April wonder if a family is in their future."
      },
      {
        "id": "tvmaze:1690701",
        "title": "In the Valley of the Shadows",
        "season": 5,
        "episode": 3,
        "released": "2019-10-09",
        "overview": "Dr. Choi and Dr. Charles have difficult decisions to make as a dying man tries to preserve his future life with a controversial scientific method. Dr. Marcel and April clash over how to handle a mysterious patient and Will questions Natalie's capabilities. Sharon assigns a nurse to shadow Maggie, much to her dismay."
      },
      {
        "id": "tvmaze:1690702",
        "title": "Infection, Part II",
        "season": 5,
        "episode": 4,
        "released": "2019-10-16",
        "overview": "An entire apartment complex is forced into quarantine when cases of the deadly virus turns into an epidemic. P.D. chases a lead that could point to a case of bioterrorism and Will gets dangerously close to the suspect.Part I starts with Chicago Fire; Part III on Chicago PD"
      },
      {
        "id": "tvmaze:1728818",
        "title": "Got a Friend in Me",
        "season": 5,
        "episode": 5,
        "released": "2019-10-23",
        "overview": "Dr. Choi and Dr. Marcel don't see eye-to-eye over the treatment of a patient's chronic pain and rumors start to circulate about Maggie. Dr. Manning works to help a young boy, but her treatment suggestions are challenged by the parents who believe in only using holistic remedies."
      },
      {
        "id": "tvmaze:1705939",
        "title": "It's All in the Family",
        "season": 5,
        "episode": 6,
        "released": "2019-10-30",
        "overview": "Dr. Manning's actions with a recent patient lead to serious repercussions. April and Noah disagree over a patient who is injured after a beating. Dr. Charles is visited by a childhood friend with a surprising revelation."
      },
      {
        "id": "tvmaze:1714422",
        "title": "Who Knows What Tomorrow Brings",
        "season": 5,
        "episode": 7,
        "released": "2019-11-06",
        "overview": "Dr. Charles and Dr. Halstead sink their teeth into a bloodthirsty case. Dr. Marcel and Maggie throw a traditional crawfish boil for the staff. A new relationship blossoms while another is left on rocky ground."
      },
      {
        "id": "tvmaze:1690703",
        "title": "Too Close to the Sun",
        "season": 5,
        "episode": 8,
        "released": "2019-11-13",
        "overview": "Maggie gets unsettling news about a new friend and breaks protocol to support him. One of the doctors from the Med family is rushed into emergency surgery after a violent assault. A social media influencer lets his users vote on medical advice, forcing Dr. Charles to make a decision."
      },
      {
        "id": "tvmaze:1745463",
        "title": "I Can't Imagine the Future",
        "season": 5,
        "episode": 9,
        "released": "2019-11-20",
        "overview": "April receives unfortunate news that makes her question her future with Ethan. Dr. Charles and Maggie see tough times on the horizon. Natalie's memory from the accident starts to return."
      },
      {
        "id": "tvmaze:1746988",
        "title": "Guess It Doesn't Matter Anymore",
        "season": 5,
        "episode": 10,
        "released": "2020-01-08",
        "overview": "Dr. Halstead's world is thrown into turmoil when a former patient resurfaces. April has a secret she considers confessing to Ethan. Dr. Charles tries to maintain his focus during a difficult time."
      },
      {
        "id": "tvmaze:1779950",
        "title": "The Ground Shifts Beneath Us",
        "season": 5,
        "episode": 11,
        "released": "2020-01-15",
        "overview": "After a major accident at O'Hare, the E.D. is concerned one of their own is in mortal danger. Will's proposal for a safe injection site goes to the board for consideration. Natalie and Goodwin become concerned for Gwen."
      },
      {
        "id": "tvmaze:1779951",
        "title": "Leave the Choice to Solomon",
        "season": 5,
        "episode": 12,
        "released": "2020-01-22",
        "overview": "The team deals with the aftermath of a school bus crash. Dr. Charles worries Dr. Halstead is putting his medical license in jeopardy. Maggie helps a friend in need."
      },
      {
        "id": "tvmaze:1779952",
        "title": "Pain is for the Living",
        "season": 5,
        "episode": 13,
        "released": "2020-02-05",
        "overview": "Two brothers in critical condition are rushed into the hospital by their parents, leaving Dr. Choi, April and Dr. Charles to tend to their care and left to piece together what actually transpired. Dr. Manning becomes suspicious of a new mother entering the E.D. Dr. Halstead's tireless activities at the safe injection site start to take a toll on his work."
      },
      {
        "id": "tvmaze:1780281",
        "title": "It May Not Be Forever",
        "season": 5,
        "episode": 14,
        "released": "2020-02-12",
        "overview": "Dr. Manning and Dr. Marcel disagree over an abusive husband. Dr. Halstead struggles with ethics and his decision to work at the safe injection site. Dr. Charles and Elsa reveal a misdiagnosis that may change a family's life."
      },
      {
        "id": "tvmaze:1794071",
        "title": "I Will Do No Harm",
        "season": 5,
        "episode": 15,
        "released": "2020-02-26",
        "overview": "Dr. Charles and Dr. Manning treat a patient who is fully invested in pretending to be someone other than himself. Noah begins to doubt his abilities as a doctor. Dr. Marcel and Dr. Choi are faced with a tough ethical decision. Dr. Halstead puts his faith in an addict."
      },
      {
        "id": "tvmaze:1801986",
        "title": "Who Should Be the Judge",
        "season": 5,
        "episode": 16,
        "released": "2020-03-04",
        "overview": "A convicted murderer's escape hits close to home when several members of the team find themselves in danger. Dr. Charles and Dr. Halstead continue to clash over patient treatment plans. Dr. Choi and April discover the truth about a patient's scam. Maggie finally receives some good news."
      },
      {
        "id": "tvmaze:1801987",
        "title": "The Ghosts of the Past",
        "season": 5,
        "episode": 17,
        "released": "2020-03-18",
        "overview": "Marking the series milestone 100th episode, Dr. Manning and Dr. Charles assist in a complicated case helping a 4-year old who they quickly learn is no stranger to the ED. Dr. Marcel and Dr. Choi tend to a police officer with a mysterious gunshot wound to the abdomen. Relationships are put to the test as secrets are revealed."
      },
      {
        "id": "tvmaze:1814617",
        "title": "In the Name of Love",
        "season": 5,
        "episode": 18,
        "released": "2020-03-25",
        "overview": "Dr. Charles and Goodwin fear Dr. Halstead is repeating his past mistakes when a patient with early-onset Alzheimer's is brought into the E.D. Maggie and Ben become concerned when one of Ben's students is admitted. Dr. Manning and Dr. Marcel treat a terminally ill patient and disagree over the best course of action."
      },
      {
        "id": "tvmaze:1822321",
        "title": "Just a River in Egypt",
        "season": 5,
        "episode": 19,
        "released": "2020-04-08",
        "overview": "Dr. Charles evaluates a 15-year old who is brought into the E.D. after an apparent fall off an overpass. Will sides with Dr. Asher on a risky treatment plan. Tensions run high between Dr. Choi and Dr. Marcel."
      },
      {
        "id": "tvmaze:1826872",
        "title": "A Needle in the Heart",
        "season": 5,
        "episode": 20,
        "released": "2020-04-15",
        "overview": "Dr. Crockett is visited by two New Orleans detectives who have questions about his past; Dr. Choi puts his life in danger to save a child; Dr. Charles gives fatherly advice to his young daughter."
      },
      {
        "id": "tvmaze:1920536",
        "title": "When Did We Begin to Change",
        "season": 6,
        "episode": 1,
        "released": "2020-11-11",
        "overview": "The entire staff at Chicago Med adjusts to the new normal of the pandemic. Dr. Choi, Dr. Lanik and April fight on the front lines. Dr. Halstead and Hannah face a troubling reality.  Dr. Charles tries to clear the air with his daughter following recent developments."
      },
      {
        "id": "tvmaze:1963554",
        "title": "Those Things Hidden in Plain Sight",
        "season": 6,
        "episode": 2,
        "released": "2020-11-18",
        "overview": "Goodwin announces a new ED Chief and the choice doesn't make everyone happy. Dr. Manning takes a stand for her patient and finds herself dealing with the repercussions. Dr. Charles tends to family affairs."
      },
      {
        "id": "tvmaze:1972301",
        "title": "Do You Know the Way Home",
        "season": 6,
        "episode": 3,
        "released": "2021-01-13",
        "overview": "Dr. Charles and April team up to take on a mysterious patient in the ED. Dr. Halstead is forced to make a life-or-death decision for one of his trial patients. Dr. Marcel is confronted by his past when a former acquaintance is brought into the ED."
      },
      {
        "id": "tvmaze:1992722",
        "title": "In Search of Forgiveness, Not Permission",
        "season": 6,
        "episode": 4,
        "released": "2021-01-27",
        "overview": "Dr. Marcel and Dr. Manning lay everything on the line to assist a sick woman. Dr. Halstead faces an uphill battle in getting participants involved in his clinical trial. Dr. Choi clashes with a patient who demands absolute perfection of himself."
      },
      {
        "id": "tvmaze:1995720",
        "title": "When Your Heart Rules Your Head",
        "season": 6,
        "episode": 5,
        "released": "2021-02-03",
        "overview": "Dr. Halstead finds continued success in his trial. Dr. Charles' daughter, Anna, receives life-changing news. Noah finds himself in a situation not even April can fix."
      },
      {
        "id": "tvmaze:1995721",
        "title": "Don't Want to Face This Now",
        "season": 6,
        "episode": 6,
        "released": "2021-02-10",
        "overview": "Dr. Choi helps a patient with chronic pain find a solution. Dr. Halstead considers a new path. Dr. Charles and Anna bond over a scary situation."
      },
      {
        "id": "tvmaze:1995722",
        "title": "Better Is the Enemy of Good",
        "season": 6,
        "episode": 7,
        "released": "2021-02-17",
        "overview": "Will runs into trouble when one of his trial patients falls ill. His own stress and symptoms have Ethan struggling to get through the day."
      },
      {
        "id": "tvmaze:1995723",
        "title": "Fathers and Mothers, Daughters and Sons",
        "season": 6,
        "episode": 8,
        "released": "2021-03-10",
        "overview": "Ethan hires an old Navy colleague to join him in the ED. A final custody hearing threatens to separate Charles and his daughter. Maggie must make a choice that will change Auggie's life."
      },
      {
        "id": "tvmaze:1995724",
        "title": "For the Want of a Nail",
        "season": 6,
        "episode": 9,
        "released": "2021-03-17",
        "overview": "As Maggie deals with her own trauma, she steps in to help a mother in need. Dean continues to stir the pot with more than one doctor. A patient comes to Med needing immediate treatment, but doesn't want it from them."
      },
      {
        "id": "tvmaze:1995725",
        "title": "So Many Things We've Kept Buried",
        "season": 6,
        "episode": 10,
        "released": "2021-03-31",
        "overview": "Crockett deals with a patient who ends up having more in common with him than he thinks. Will and Ethan clash over a pregnant patient with an irregular heartbeat."
      },
      {
        "id": "tvmaze:1995726",
        "title": "Letting Go Only to Come Together",
        "season": 6,
        "episode": 11,
        "released": "2021-04-07",
        "overview": "Choi teams up with an unexpected person to treat a famous tennis player who is afraid his career might be over. Goodwin's new protocols cause a stir."
      },
      {
        "id": "tvmaze:2043641",
        "title": "Some Things Are Worth the Risk",
        "season": 6,
        "episode": 12,
        "released": "2021-04-21",
        "overview": "Dean and Ethan respond to a scene that brings back some bad memories. When Carol's condition worsens, Natalie is willing to do whatever it takes to get her mom feeling better."
      },
      {
        "id": "tvmaze:2043642",
        "title": "What a Tangled Web We Weave",
        "season": 6,
        "episode": 13,
        "released": "2021-05-05",
        "overview": "An auto accident sends Goodwin into a spiral as she tries to help a young boy and his mother. Natalie's secretive behavior begins to draw the attention of Dr. Marcel and Dr. Halstead."
      },
      {
        "id": "tvmaze:2077035",
        "title": "A Red Pill, a Blue Pill",
        "season": 6,
        "episode": 14,
        "released": "2021-05-12",
        "overview": "Third-year med students begin their rotation in the ED and Maggie keeps a careful eye on one of them. Natalie, whose mom's health takes another decline, tries to cover up how she broke the rules to treat her."
      },
      {
        "id": "tvmaze:2083350",
        "title": "Stories, Secrets, Half Truths and Lies",
        "season": 6,
        "episode": 15,
        "released": "2021-05-19",
        "overview": "Crockett worries he made a surgical error when a recent transplant patient comes in with complications. Carol is once again in distress. Will and Natalie must take action to right their wrong."
      },
      {
        "id": "tvmaze:2060972",
        "title": "I Will Come to Save You",
        "season": 6,
        "episode": 16,
        "released": "2021-05-26",
        "overview": "Carol receives a second chance at life when a new heart becomes available. Ethan and Dean find themselves in hot water with an old patient. Will faces the consequences of the stolen trial medication."
      },
      {
        "id": "tvmaze:2131696",
        "title": "You Can't Always Trust What You See",
        "season": 7,
        "episode": 1,
        "released": "2021-09-22",
        "overview": "Will Halstead returns to Med to help Goodwin with a secret investigation. Archer and Charles deal with twins who insist on being identical inside and out. Stevie and Dylan treat a young patient with sickle cell anemia."
      },
      {
        "id": "tvmaze:2157198",
        "title": "To Lean In, or to Let Go",
        "season": 7,
        "episode": 2,
        "released": "2021-09-29",
        "overview": "Vanessa and Archer disagree on how to handle the victim of a motorcycle accident. Dylan and Charles deal with a UNICEF negotiator with repressed trauma. Stevie and Will treat a high schooler with Addison's disease and a clingy mother."
      },
      {
        "id": "tvmaze:2172156",
        "title": "Be the Change You Want to See",
        "season": 7,
        "episode": 3,
        "released": "2021-10-06",
        "overview": "Dylan and Will deal with a dishonest patient whose lupus is in remission. A wealthy donor makes inappropriate advances toward Stevie. Vanessa, Crockett and Charles try to convince a young woman to have life-saving surgery."
      },
      {
        "id": "tvmaze:2175389",
        "title": "Status Quo, aka The Mess We're in",
        "season": 7,
        "episode": 4,
        "released": "2021-10-13",
        "overview": "Charles helps Dylan with a longtime patient who was recently diagnosed with schizophrenia. Stevie, Maggie and Vanessa investigate the legitimacy of a patient's cancer diagnosis. Crockett is caught off-guard. Will pitches a new medical technology."
      },
      {
        "id": "tvmaze:2175390",
        "title": "Change Is a Tough Pill to Swallow",
        "season": 7,
        "episode": 5,
        "released": "2021-10-20",
        "overview": "Dylan and Charles treat patients suffering from Glass Child Syndrome and misdiagnosed ADHD. Crockett has to navigate hospital politics when he cares for the daughter of a transplant surgeon. Will and Stevie must lay egos aside to help save an elderly patient."
      },
      {
        "id": "tvmaze:2175391",
        "title": "When You're a Hammer Everything's a Nail",
        "season": 7,
        "episode": 6,
        "released": "2021-10-27",
        "overview": "Stevie's personal and professional worlds collide when her mother becomes her patient. Dylan's history with the father of a patient interferes with his perception of a case. Crockett's allegiances are challenged when his patient's liver is a potential match for one of Dr. Blake's patients."
      },
      {
        "id": "tvmaze:2196921",
        "title": "A Square Peg in a Round Hole",
        "season": 7,
        "episode": 7,
        "released": "2021-11-03",
        "overview": "Crockett helps Dr. Blake replace a patient's liver. Vanessa tries to prove herself. Will continues to pursue the truth about Cooper. Ethan gets closer to returning to life in the E.D."
      },
      {
        "id": "tvmaze:2200467",
        "title": "Just as a Snake Sheds Its Skin",
        "season": 7,
        "episode": 8,
        "released": "2021-11-10",
        "overview": "Dylan's loyalty to Med and the police department is challenged when an old family friend and veteran cop exhibits concerning behavior. The annual random drug testing puts a doctor's career in jeopardy. Ethan tries a risky old-school method on a patient. Will helps Stevie search for her mother."
      },
      {
        "id": "tvmaze:2212270",
        "title": "Secret Santa Has a Gift for You",
        "season": 7,
        "episode": 9,
        "released": "2021-12-08",
        "overview": "The outcome of Will's investigation weighs heavily on his mind as he works with Dylan to save a 4-month-old patient. Stevie and Vanessa both struggle to keep their secrets. Crockett and Blake work with Abrams to save a patient in need of a liver transplant."
      },
      {
        "id": "tvmaze:2212727",
        "title": "No Good Deed Goes Unpunished...in Chicago",
        "season": 7,
        "episode": 10,
        "released": "2022-01-05",
        "overview": "In the aftermath of the Vas-COM scandal, Goodwin clashes with the hospital's new compliance officer. Crockett and Blake try to save a patient who has a son with severe autism. A patient's son lies to his father about his diagnosis."
      },
      {
        "id": "tvmaze:2243757",
        "title": "The Things We Thought We Left Behind",
        "season": 7,
        "episode": 11,
        "released": "2022-01-12",
        "overview": "Crockett and Blake clash with Randall when a famous alcoholic football player needs a liver transplant. Dylan is reluctantly reunited with old friends when their son breaks his arm. Stevie and Charles work together when a patient falls ill after back-alley plastic surgery."
      },
      {
        "id": "tvmaze:2243758",
        "title": "What You Don't Know Can't Hurt You",
        "season": 7,
        "episode": 12,
        "released": "2022-01-19",
        "overview": "Will and Stevie get stuck in the middle of a marital face-off. Dr. Blake's entire surgical team mysteriously collapses during a liver transplant. Charles encourages Ethan to reconcile with his father."
      },
      {
        "id": "tvmaze:2243759",
        "title": "Reality Leaves a Lot to the Imagination",
        "season": 7,
        "episode": 13,
        "released": "2022-02-23",
        "overview": "Dylan and Archer diagnose a pregnant woman with a serious infection. Maggie receives shocking news. Will and Charles question an elderly patient's Alzheimer's diagnosis. In an effort to help a patient, Crockett takes a risk."
      },
      {
        "id": "tvmaze:2244513",
        "title": "All the Things That Could Have Been",
        "season": 7,
        "episode": 14,
        "released": "2022-03-02",
        "overview": "Goodwin assigns Med's new compliance officer to a patient with a long-hauler Covid condition. Maggie helps Will treat a patient who's been in an iron lung for 60 years. Stevie learns hard truths about her mother. Terrell returns to Med under dire circumstances."
      },
      {
        "id": "tvmaze:2244514",
        "title": "Things Meant to Be Bent Not Broken",
        "season": 7,
        "episode": 15,
        "released": "2022-03-09",
        "overview": "Dylan's cop instincts come to life when he suspects his patient may be a drug dealer. Will must decide how to spend his whistleblower settlement. Charles and Vanessa help a patient who believes she's infested with parasites. Crockett and Blake are paired with an arrogant surgeon."
      },
      {
        "id": "tvmaze:2264369",
        "title": "May Your Choices Reflect Hope, Not Fear",
        "season": 7,
        "episode": 16,
        "released": "2022-03-16",
        "overview": "Will helps a patient with long-haul Covid symptoms. Vanessa reflects on her dating life when she learns that a patient's daughter is having an arranged marriage. A new family is born out of tragedy."
      },
      {
        "id": "tvmaze:2264370",
        "title": "If You Love Someone, Set Them Free",
        "season": 7,
        "episode": 17,
        "released": "2022-04-06",
        "overview": "Rival gangs bring their war to Med. Will and Charles work with a teenage brain cancer patient who's refusing treatment. Tensions run high in the OR when a patient's transplanted uterus fails, forcing Crockett and Blake to decide whether to try another transplant using a uterus from the patient's sister."
      },
      {
        "id": "tvmaze:2264371",
        "title": "Judge Not, For You Will Be Judged",
        "season": 7,
        "episode": 18,
        "released": "2022-04-13",
        "overview": "Archer and Hannah clash over a patient with close ties to Goodwin. After a patient is shot during a home invasion, Dylan and Crockett help with the investigation. Maggie and Will work to protect a patient who is in the country illegally."
      },
      {
        "id": "tvmaze:2298359",
        "title": "Like a Phoenix Rising from the Ashes",
        "season": 7,
        "episode": 19,
        "released": "2022-04-20",
        "overview": "Will and Hannah work to save a surrogate's baby. Charles cares for a former patient of Lonnie's who's on a hunger strike. Ethan and Archer help a patient with ties to Ethan's late father. Dylan and Maggie are stumped by a drunk patient who claims to be sober."
      },
      {
        "id": "tvmaze:2301238",
        "title": "End of the Day, Anything Can Happen",
        "season": 7,
        "episode": 20,
        "released": "2022-05-11",
        "overview": "Dylan helps the daughter of a mob boss. A grandmother comes to Med desperate to save her grandson. Ethan struggles with some shocking news about his father. Will and Vanessa care for Maggie's high school classmate."
      },
      {
        "id": "tvmaze:2301239",
        "title": "Lying Doesn't Protect You from the Truth",
        "season": 7,
        "episode": 21,
        "released": "2022-05-18",
        "overview": "Dylan and Ethan treat a patient shot during a drug raid. Charles and Vanessa work together to properly diagnose a motivational speaker. Will and Hannah must turn to Crockett for help with a patient who's pregnant."
      },
      {
        "id": "tvmaze:2301240",
        "title": "And Now We Come to the End",
        "season": 7,
        "episode": 22,
        "released": "2022-05-25",
        "overview": "Will and Hannah clash over a patient in need of a kidney transplant. Crockett is faced with a tough decision when Blake is in surgery. Ethan and Archer treat the son of Med's general counsel. Med's family grows."
      },
      {
        "id": "tvmaze:2355087",
        "title": "How Do You Begin to Count the Losses",
        "season": 8,
        "episode": 1,
        "released": "2022-09-21",
        "overview": "In the aftermath of Halstead's apartment fire, Marcel, Choi and Archer work together to try to save the survivors. Charles and Med's new fellow, Cuevas, help a paranoid patient. Scott makes a life-changing decision."
      },
      {
        "id": "tvmaze:2373096",
        "title": "(Caught Between) The Wrecking Ball and the Butterfly",
        "season": 8,
        "episode": 2,
        "released": "2022-09-28",
        "overview": "Supply chain disruptions dramatically impact Med causing Crockett and Kai, a new surgical resident, to clash with other doctors. Maggie reveals something to Ben. Ethan and Archer help a patient with ALS."
      },
      {
        "id": "tvmaze:2390651",
        "title": "Winning the Battle, but Still Losing the War",
        "season": 8,
        "episode": 3,
        "released": "2022-10-05",
        "overview": "Charles and Nellie clash over the treatment of a paranoid patient. Ethan treats a pregnant patient from Hannah's past. Crockett and Vanessa help a man who needs a risky neurosurgery."
      },
      {
        "id": "tvmaze:2390652",
        "title": "The Apple Doesn't Fall Far from the Teacher",
        "season": 8,
        "episode": 4,
        "released": "2022-10-12",
        "overview": "When a subway train goes off the tracks, Crockett volunteers to help the victims. Vanessa and Will must decide if they're willing to risk their jobs to save a patient. Hannah and Archer clash over a pregnant patient."
      },
      {
        "id": "tvmaze:2390653",
        "title": "Yep, This Is the World We Live In",
        "season": 8,
        "episode": 5,
        "released": "2022-10-19",
        "overview": "The effects of the supply chain shortages continue to impact the E.D. when Vanessa's drug dealer reappears. One of the victims of the recent train crash needs a transplant, forcing Crockett to improvise. Charles and Nellie help a patient with amnesia."
      },
      {
        "id": "tvmaze:2390654",
        "title": "Mama Said There Would Be Days Like This",
        "season": 8,
        "episode": 6,
        "released": "2022-11-02",
        "overview": "Crockett adjusts to his newfound fame when he helps Will treat a local restaurant owner. Ethan, Charles and Goodwin aid a new mother worried about hurting her baby. Maggie and Vanessa clash with a patient eager to get back to work."
      },
      {
        "id": "tvmaze:2420020",
        "title": "The Clothes Make the Man... Or Do They?",
        "season": 8,
        "episode": 7,
        "released": "2022-11-09",
        "overview": "Med runs out of scrubs, forcing the staff to improvise. The life of Archer's son is in danger. Crockett and Charles help a kidney transplant patient experiencing psychosis. Hannah and Will grow closer."
      },
      {
        "id": "tvmaze:2424861",
        "title": "Everyone's Fighting a Battle You Know Nothing About",
        "season": 8,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "Will, Crockett and Justin Lieu try to facilitate a trans-organ exchange. Hannah and Nellie help a sexual assault survivor. Ethan and Archer treat a patient whose case could expose a fraudulent doctor. Grant and Maggie take a trip down memory lane."
      },
      {
        "id": "tvmaze:2427580",
        "title": "This Could Be the Start of Something New",
        "season": 8,
        "episode": 9,
        "released": "2022-12-07",
        "overview": "Will relies on Crockett and Med's newly donated OR 2.0 to save his patient. Charles helps an elderly confused patient who's mourning the loss of his high school sweetheart. As their wedding day approaches, Ethan and April run into some roadblocks."
      },
      {
        "id": "tvmaze:2427581",
        "title": "A Little Change Might Do You Some Good",
        "season": 8,
        "episode": 10,
        "released": "2023-01-04",
        "overview": "Charles and Nellie help an elderly patient and her developmentally disabled grandson. Will treats a high school swimmer with a heart condition. Crockett considers using the O.R. 2.0 for surgery. Hannah and Dr. Justin Lieu search for a patient's missing pregnant wife in the woods."
      },
      {
        "id": "tvmaze:2448450",
        "title": "It Is What It Is, Until It Isn't",
        "season": 8,
        "episode": 11,
        "released": "2023-01-11",
        "overview": "Crockett and Charles treat Justin's gym buddy. Maggie and Will help a robbery-homicide suspect. Hannah and Archer use Med's new opiate abuse A.I. program."
      },
      {
        "id": "tvmaze:2458950",
        "title": "We All Know What They Say About Assumptions",
        "season": 8,
        "episode": 12,
        "released": "2023-01-18",
        "overview": "Goodwin, Maggie and Crockett help victims of a hit-and-run accident. Will struggles to diagnose a patient with seizures. Hannah and Archer clash with Jack Dayton."
      },
      {
        "id": "tvmaze:2470829",
        "title": "It's an Ill Wind That Blows Nobody Good",
        "season": 8,
        "episode": 13,
        "released": "2023-02-15",
        "overview": "A brutal storm rocks Chicago. Will encourages Dr. Grace Song to go against her own findings for the benefit of their patient. Hannah rushes to the hospital to help Archer's pregnant patient. Maggie's concern for Ben consumes her."
      },
      {
        "id": "tvmaze:2478983",
        "title": "On Days Like Today... Silver Linings Become Lifelines",
        "season": 8,
        "episode": 14,
        "released": "2023-02-22",
        "overview": "Crockett relies on O.R. 2.0 to save a construction worker's severed hand. Charles and Goodwin clash as negotiations drag on between the administration and the custodial workers' union. Hannah fights to keep a mother and her newborn baby together."
      },
      {
        "id": "tvmaze:2488722",
        "title": "Those Times You Have to Cross the Line",
        "season": 8,
        "episode": 15,
        "released": "2023-03-01",
        "overview": "The hospital is in disarray when the janitors go on strike. Crockett treats a young girl injured on her family's farm. Charles and Nellie's schizophrenic patient returns to Med. Archer encounters a patient with foreign material in her stomach."
      },
      {
        "id": "tvmaze:2495072",
        "title": "What You See Isn't Always What You Get",
        "season": 8,
        "episode": 16,
        "released": "2023-03-22",
        "overview": "Will and Nellie struggle to diagnose a patient with a rare disorder. CFD and Med staff work to free a paranoid father trapped in the MRI suite. Kai gets an ego check."
      },
      {
        "id": "tvmaze:2505433",
        "title": "Know When to Hold and When to Fold",
        "season": 8,
        "episode": 17,
        "released": "2023-03-29",
        "overview": "A documentary crew visits Med to film Crockett and Abrams' groundbreaking surgery. Archer refuses to ask for help for his kidney issues despite the staff's unrelenting kindness. Will starts to develop feelings for a co-worker."
      },
      {
        "id": "tvmaze:2509773",
        "title": "I Could See the Writing on the Wall",
        "season": 8,
        "episode": 18,
        "released": "2023-04-05",
        "overview": "Dr. Grace Song launches her pilot program, giving the E.D. a technological facelift. As his health worsens, Archer clashes with Charles on a patient faking paralysis. Hannah helps a pregnant mother with a heart condition."
      },
      {
        "id": "tvmaze:2514050",
        "title": "Look Closely and You Might Hear the Truth",
        "season": 8,
        "episode": 19,
        "released": "2023-05-03",
        "overview": "The fate of the hospital rests on the vote of an incapacitated board member. Archer helps a mother with a rare stem cell disease while Hannah treats the woman's pregnant daughter. Charles encounters a schizophrenic patient with a serious hearing impairment."
      },
      {
        "id": "tvmaze:2514051",
        "title": "The Winds of Change Are Starting to Blow",
        "season": 8,
        "episode": 20,
        "released": "2023-05-10",
        "overview": "Maggie clashes with Charles over a patient who is distrustful of hospitals. Marcel and Halstead fight against Med's new policies to save their cancer patient. Asher and Archer pull surprising things out of their unsuspecting patients."
      },
      {
        "id": "tvmaze:2514052",
        "title": "Might Feel Like It's Time for a Change",
        "season": 8,
        "episode": 21,
        "released": "2023-05-17",
        "overview": "As Jack Dayton prepares to launch OR 2.0's IPO, Marcel and Grace search for data that may put a wrench in his plans. Charles helps a schizophrenic patient who is anxious about prom. Asher clashes with Abrams when his wife becomes her patient."
      },
      {
        "id": "tvmaze:2514053",
        "title": "Does One Door Close and Another One Open?",
        "season": 8,
        "episode": 22,
        "released": "2023-05-24",
        "overview": "Shocking information threatens Jack Dayton's surgery and the future of OR 2.0. Archer goes rogue to save a patient in need. Maggie questions her future at Med."
      },
      {
        "id": "tvmaze:2691455",
        "title": "Row Row Row Your Boat on a Rocky Sea",
        "season": 9,
        "episode": 1,
        "released": "2024-01-17",
        "overview": "When the E.D. is flooded with patients from a crash, the entire team is pulled in to help. Charles can't shake the feeling that he knows the new E.D. attending. Archer has second thoughts on the eve of his kidney transplant."
      },
      {
        "id": "tvmaze:2696321",
        "title": "This Town Ain't Big Enough for Both of Us",
        "season": 9,
        "episode": 2,
        "released": "2024-01-24",
        "overview": "A woman from Archer's past returns and threatens his transplant surgery."
      },
      {
        "id": "tvmaze:2696322",
        "title": "What Happens in the Dark Always Comes to Light",
        "season": 9,
        "episode": 3,
        "released": "2024-01-31",
        "overview": "Frustrated with an insurance company, Ahmad takes matters into her own hands, jeopardizing Med's negotiations and Marcel's first day on the board; Charles helps a woman's depressed husband; Asher's first date takes a surprising turn."
      },
      {
        "id": "tvmaze:2743314",
        "title": "These Are Not the Droids You Are Looking For",
        "season": 9,
        "episode": 4,
        "released": "2024-02-07",
        "overview": "Goodwin is worried after an accident lands two people close to her in the E.D. Archer returns to Med and treats a man concerned about a family curse. Maggie and Ahmad help a patient on a cross-country road trip."
      },
      {
        "id": "tvmaze:2749691",
        "title": "I Make a Promise, I Will Never Leave You",
        "season": 9,
        "episode": 5,
        "released": "2024-02-21",
        "overview": "Goodwin recruits Charles to evaluate her ex-husband's memory. Archer treats one of Sean's peers from the rehab center. Hannah treats a woman from a rural clinic whose miscarriage was improperly treated."
      },
      {
        "id": "tvmaze:2749692",
        "title": "I Told Myself That I Was Done With You",
        "season": 9,
        "episode": 6,
        "released": "2024-02-28",
        "overview": "Maggie empathizes with a patient whose mother is afraid to consent to her son's risky surgery. Ripley treats someone from his past. Zola questions her instincts after her actions have unexpected consequences."
      },
      {
        "id": "tvmaze:2749778",
        "title": "Step on a Crack and Break Your Mother's Back",
        "season": 9,
        "episode": 7,
        "released": "2024-03-20",
        "overview": "Ripley and Charles treat a patient with OCD. Hannah and Archer encounter a woman with a foreign object lodged in her heart. Crockett clashes with the Chief of Oncology."
      },
      {
        "id": "tvmaze:2773548",
        "title": "A Penny for Your Thoughts, Dollar for Your Dreams",
        "season": 9,
        "episode": 8,
        "released": "2024-03-27",
        "overview": "Archer, Hannah and Charles encounter an expecting father who claims he's telepathic and receiving messages from his yet-to-be born son. Zola works to thaw out a frozen criminal. Ripley treats Liliana's brother as a favor to Charles."
      },
      {
        "id": "tvmaze:2800196",
        "title": "Spin a Yarn, Get Stuck in Your Own String",
        "season": 9,
        "episode": 9,
        "released": "2024-04-03",
        "overview": "Ripley and Charles treat members of a cult. Zola's suspension takes an unexpected toll on Crockett. Dr. Abrams' 5-month-old son lands in the E.D. under questionable circumstances."
      },
      {
        "id": "tvmaze:2804155",
        "title": "You Just Might Find You Get What You Need",
        "season": 9,
        "episode": 10,
        "released": "2024-05-01",
        "overview": "Maggie's budding romance takes flight. After a woman's shocking suicide attempt, Dr. Charles searches for answers. Hannah works to diagnose a patient who's new to the city and appears with mysterious symptoms."
      },
      {
        "id": "tvmaze:2804156",
        "title": "I Think There Is Something You're Not Telling Me",
        "season": 9,
        "episode": 11,
        "released": "2024-05-08",
        "overview": "Ripley struggles to keep Sully's diagnosis a secret when the latter's pregnant girlfriend comes to Med for help. Loren works to earn a spot in Med's trauma fellowship. Charles and a medical student treat a bipolar artist."
      },
      {
        "id": "tvmaze:2829172",
        "title": "Get By with a Little Help from My Friends",
        "season": 9,
        "episode": 12,
        "released": "2024-05-15",
        "overview": "An infection threatens Crockett's risky liver transplant. Maggie and Charles help a struggling burn unit nurse. Goodwin is forced to make a tough decision about Bert's future."
      },
      {
        "id": "tvmaze:2829173",
        "title": "I Think I Know You, But Do I Really?",
        "season": 9,
        "episode": 13,
        "released": "2024-05-22",
        "overview": "Ripley and Charles treat a high-risk prisoner who may have dementia. Archer and Sean clash when a resident from Margo's facility lands in the E.D. Crockett receives shocking news."
      },
      {
        "id": "tvmaze:2939447",
        "title": "Sink or Swim",
        "season": 10,
        "episode": 1,
        "released": "2024-09-25",
        "overview": "When a commuter ship capsizes, the ED finds itself under water as the staff struggles to treat the influx of new patients and deal with bold new employees taking charge."
      },
      {
        "id": "tvmaze:3006219",
        "title": "Bite Your Tongue",
        "season": 10,
        "episode": 2,
        "released": "2024-10-02",
        "overview": "Lenox continues to rankle Archer as the two tackle their new roles; Ripley faces possible suspension over what really happened to Pawel; Goodwin is forced to make layoffs."
      },
      {
        "id": "tvmaze:3013009",
        "title": "Trust Fall",
        "season": 10,
        "episode": 3,
        "released": "2024-10-09",
        "overview": "Hannah treats a woman whose undiagnosed condition threatens the lives of both her and her unborn child. Goodwin receives a chilling message while battling the hospital higher-ups."
      },
      {
        "id": "tvmaze:3015749",
        "title": "Blurred Lines",
        "season": 10,
        "episode": 4,
        "released": "2024-10-16",
        "overview": "A familiar face returns to the E.D. Ripley and Charles treat a woman with a rare disorder. Frost suspects that his patient's father is lying about his daughter's condition."
      },
      {
        "id": "tvmaze:3015750",
        "title": "Bad Habits",
        "season": 10,
        "episode": 5,
        "released": "2024-10-23",
        "overview": "Halloween chaos takes over the E.D. Hannah helps a pregnant woman with an autistic son. Charles clashes with nurse Jackie on a psych case."
      },
      {
        "id": "tvmaze:3031854",
        "title": "Forget Me Not",
        "season": 10,
        "episode": 6,
        "released": "2024-11-06",
        "overview": "Chicago P.D. steps up Goodwin's security after she's threatened online by a former employee. Archer and Frost treat victims from a disciplinary camp injured during a rockslide. Maggie gets roped into delivering a high schooler's baby."
      },
      {
        "id": "tvmaze:3031855",
        "title": "Family Matters",
        "season": 10,
        "episode": 7,
        "released": "2024-11-13",
        "overview": "Ripley and Frost uncover shocking information that conflicts with their patient's DNR. Hannah facilitates an unexpected reunion. The tension between Archer and Lenox comes to a head."
      },
      {
        "id": "tvmaze:3031856",
        "title": "Love Will Tear Us Apart",
        "season": 10,
        "episode": 8,
        "released": "2024-11-20",
        "overview": "Goodwin's troubles persist. Charles clashes with his former resident over a depressed patient. Lenox and Ripley treat a car accident victim who recently reunited with his college sweetheart."
      },
      {
        "id": "tvmaze:3031857",
        "title": "No Love Lost",
        "season": 10,
        "episode": 9,
        "released": "2025-01-08",
        "overview": "The team fights to save the life of one of their own. Frost and Abrams butt heads with their patient. Dr. Charles and Dr. Reese continue to clash over a patient, dredging up unresolved issues between them."
      },
      {
        "id": "tvmaze:3078391",
        "title": "Broken Hearts",
        "season": 10,
        "episode": 10,
        "released": "2025-01-22",
        "overview": "An army of surgeons prepare to separate conjoined twins. Hannah reconnects with someone from her past. Archer treats a tyrannical boss with a heart problem."
      },
      {
        "id": "tvmaze:3078393",
        "title": "In the Trenches: Part II",
        "season": 10,
        "episode": 11,
        "released": "2025-01-29",
        "overview": "Following the subway tunnel collapse, Ruzek and Kidd treat injured passengers and track down the missing offender; Archer and Frost perform a life-saving amputation; Lenox feels the weight of the CPD's hopes as she fights to save one of their own."
      },
      {
        "id": "tvmaze:3116655",
        "title": "In the Wake",
        "season": 10,
        "episode": 12,
        "released": "2025-02-05",
        "overview": "Goodwin struggles with the psychological aftermath of her attack. Ripley treats a patient with helicopter parents. An E.D. staffer makes a mistake that may cost them their job."
      },
      {
        "id": "tvmaze:3129871",
        "title": "Take a Look in the Mirror",
        "season": 10,
        "episode": 13,
        "released": "2025-02-19",
        "overview": "Lenox's abilities as a mentor are tested; Hannah helps a religious woman deal with an ectopic pregnancy; Ripley's self-destructive tendencies continue."
      },
      {
        "id": "tvmaze:3133124",
        "title": "Acid Test",
        "season": 10,
        "episode": 14,
        "released": "2025-02-26",
        "overview": "Gaffney gets a surprise visit from a National Accreditation Board of Hospitals representative. Hannah and Naomi search for the cause of a young girl's infection. Lenox and Frost work together to save the victim of an accidental shooting."
      },
      {
        "id": "tvmaze:3143521",
        "title": "Down in a Hole",
        "season": 10,
        "episode": 15,
        "released": "2025-03-05",
        "overview": "Ripley struggles to rescue a woman and her daughter trapped in an abandoned well. An old friend from Frost's TV days shadows Maggie. Asher discovers an extremely rare condition in her patient's ultrasound."
      },
      {
        "id": "tvmaze:3156524",
        "title": "Poster Child",
        "season": 10,
        "episode": 16,
        "released": "2025-03-26",
        "overview": "When her former patient returns to Med, Goodwin learns that time doesn't heal all wounds. Frost and Charles treat a patient struggling with his sexuality. Lenox and Abrams work to save a woman who has been in a coma for 20 years."
      },
      {
        "id": "tvmaze:3179067",
        "title": "The Book of Archer",
        "season": 10,
        "episode": 17,
        "released": "2025-04-02",
        "overview": "Charles and Archer treat a heart transplant patient who believes his new heart doesn't want to be in his body. Lenox takes a personal day. Hannah discovers a mass on a pregnant woman's ovary."
      },
      {
        "id": "tvmaze:3176857",
        "title": "Together One Last Time",
        "season": 10,
        "episode": 18,
        "released": "2025-04-16",
        "overview": "Hannah makes a tough call to save a life. Frost and Ripley treat a young boy with a snake bite. Archer gives Naomi a patient to handle on her own on her last day in the E.D."
      },
      {
        "id": "tvmaze:3176883",
        "title": "The Stories We Tell Ourselves",
        "season": 10,
        "episode": 19,
        "released": "2025-04-23",
        "overview": "Maggie and Goodwin's friendship is tested as tensions rise during the nurses union's negotiations with the hospital. Ripley and Archer treat a skateboarder struck by an emergency vehicle. Frost helps a young boy abandoned by his mother."
      },
      {
        "id": "tvmaze:3190530",
        "title": "The Invisible Hand",
        "season": 10,
        "episode": 20,
        "released": "2025-05-07",
        "overview": "The hospital faces a staffing crisis as the nurses stage a sick-out. Archer and Frost bet on who can discharge their patients first. Charles' distrust of a patient complicates his treatment."
      },
      {
        "id": "tvmaze:3190535",
        "title": "Baby Mine...",
        "season": 10,
        "episode": 21,
        "released": "2025-05-14",
        "overview": "Maggie and Frost fight to get a pair of lungs for a young cystic fibrosis patient. Hannah learns whether she can become a surrogate. Ripley and Morris treat the daughter of a tech billionaire battling leukemia."
      },
      {
        "id": "tvmaze:3190536",
        "title": "...Don't You Cry",
        "season": 10,
        "episode": 22,
        "released": "2025-05-21",
        "overview": "Following orders, Goodwin is tasked with enforcing difficult cuts to hospital personnel. Charles' daughter is hospitalized after a car accident. A transplant patient makes a life-changing decision."
      },
      {
        "id": "tvmaze:3316803",
        "title": "We All Fall Down",
        "season": 11,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "A family of victims from a house fire are rushed to Gaffney. Lenox fights to save two sisters injured in an all-night rave turned tragedy. Tensions mount between Goodwin and Abrams over difficult staffing changes."
      },
      {
        "id": "tvmaze:3374966",
        "title": "A Game of Inches",
        "season": 11,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "Things get personal when Ripley and Archer butt heads over the treatment plans tied to an unusual case. Asher makes a surprising discovery with an expectant couple. A patient throws the hospital into chaos."
      },
      {
        "id": "tvmaze:3384763",
        "title": "Horseshoes and Hand Grenades",
        "season": 11,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "Lenox and Frost receive an unusual request from the parents of a patient on life support. Ripley and Charles work with a man who can't remember who he is."
      },
      {
        "id": "tvmaze:3389064",
        "title": "Found Family",
        "season": 11,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "Charles races to convince a patient to accept treatment before it's too late. Frost bonds with a young girl battling immunodeficiency. Lenox makes a chilling discovery."
      },
      {
        "id": "tvmaze:3389065",
        "title": "What's Hiding in the Dark",
        "season": 11,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "A personal clash between Asher and Archer reaches a breaking point. Charles and Ripley uncover a rare neurological disorder in a patient. Goodwin's personal life is put to the test."
      },
      {
        "id": "tvmaze:3389068",
        "title": "The Story of Us",
        "season": 11,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "Secrets are uncovered when Goodwin's family comes together for Bert. Ripley and Frost treat two children stung by hornets in a treehouse. A member of the team struggles with relationship woes."
      },
      {
        "id": "tvmaze:3423075",
        "title": "Double Down",
        "season": 11,
        "episode": 7,
        "released": "2025-11-12",
        "overview": "Dr. Charles grows increasingly suspicious of a colleague's intentions. Dr. Lenox crosses a line to protect a patient. Hannah and Archer treat a soon-to-be father battling cancer."
      },
      {
        "id": "tvmaze:3439750",
        "title": "TBA",
        "season": 11,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      }
    ]
  }
}