{
  "meta": {
    "id": "tvmaze:70237",
    "type": "series",
    "name": "Celebrity Race Across the World",
    "description": "In Celebrity Race Across the World four celebrities and their racing partners will race to a finish line that's thousands of miles away – without the use of air travel or any trappings of modern-day life. Stripped of all mod-cons and all luxuries they will have to rely on their skills, cunning, ingenuity, and hard work in order to succeed. Without the use of credit cards, smartphones or access to the internet and with just the cash equivalent of completing the route to their final destination by air, they will have to earn extra money along the way as well as call upon the kindness of strangers to help them progress. This incredible journey will give a unique insight into the celebrities and their relationships with their travelling companions.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/597/1494501.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/597/1494501.jpg",
    "videos": [
      {
        "id": "tvmaze:3450096",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2025-12-11",
        "overview": ""
      },
      {
        "id": "tvmaze:2635402",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2023-09-20",
        "overview": "The hit BBC series Race Across the World is back with another instalment - but this time there's a twist. The heart-warming series will see celebrities taking on the challenge of the Bafta-winning format for the first time. Four famous faces will leave behind their lives of luxury to embark upon an epic 10,000km race from Africa to the Arctic.They must ditch their reliance on luxury travel, smartphones and credit cards, and learn to travel on a limited budget. They will face the same hardships, twists and turns as the regular series, but will enjoy the same rewards that the thrill of the race has to offer. The only support the celebrities will have is their travelling partner – a trusted family member.Taking on the race are McFly drummer, Harry Judd, and his mum, Emma, British racing driver and pundit Billy Monger with his sister, Bonny, singer-songwriter Mel Blatt and her mum, Helene, and broadcaster Alex Beresford with his dad, Noel."
      },
      {
        "id": "tvmaze:2639831",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2023-09-27",
        "overview": "The race intensifies as the four pairs must leave Pinhão in Portugal's Douro Valley, and navigate 2000km through Spain and France to the second checkpoint in Bonifacio on the island of Corsica."
      },
      {
        "id": "tvmaze:2656151",
        "title": "Episode 3",
        "season": 1,
        "episode": 3,
        "released": "2023-10-04",
        "overview": "As the teams approach the halfway point on the journey from Africa to the Arctic, they must navigate their way from the Mediterranean island of Corsica to the third checkpoint in Zermatt, a mountain resort nestled in the Swiss Alps. However, only three teams have reached the checkpoint in Corsica, with one team yet to arrive…"
      },
      {
        "id": "tvmaze:2656158",
        "title": "Episode 4",
        "season": 1,
        "episode": 4,
        "released": "2023-10-11",
        "overview": "The race is well underway with four celebrities taking on the challenge of a breathtaking 10,000km journey from Africa to the Arctic.Having left behind their luxurious lifestyles and all the trappings of modern-day life, the celebrities are now more focused than ever on reaching the finish line in Tromsø. Budgets are dwindling and the intensity of the race is stepping up as the teams leave western Europe behind.Through the eyes of their loved ones, viewers will gain a unique insight into some of their favourite celebrities and their personal relationships. As the pace, scale and unpredictability of the race continues, the final rush to the checkpoint in Sarajevo takes an unexpected turn..."
      },
      {
        "id": "tvmaze:2663806",
        "title": "Episode 5",
        "season": 1,
        "episode": 5,
        "released": "2023-10-18",
        "overview": "The race has reached its fifth and penultimate leg as the four celebrities and their loved ones navigate their way 1500km north from Sarajevo to Germany's capital, Berlin, the final checkpoint before they race to the finish line in Tromsø.The thrilling unpredictability of the race continues to reveal new depths to the famous faces we think we know. Through the eyes of the celebrities' loved ones, viewers will gain a unique insight into them and their relationships. With the end finally in sight, which team has what it takes to be first over the finish line in this adrenaline-charged race across the world?"
      },
      {
        "id": "tvmaze:2663807",
        "title": "Episode 6",
        "season": 1,
        "episode": 6,
        "released": "2023-10-25",
        "overview": "It's a race to the finish line for the four celebrity teams. Which will get there first and be crowned champions?To reach the finish line in Tromsø, gateway to the Arctic, the teams need to keep their eyes on the prize and balance speed with cost. With budgets critically low, and the teams only separated by a few hours, every decision counts, and one mistake could cost them their position in the race."
      },
      {
        "id": "tvmaze:2960069",
        "title": "Episode 1",
        "season": 2,
        "episode": 1,
        "released": "2024-08-14",
        "overview": "Four new famous faces embark on an adventure of a lifetime, a journey that will be harder than ever yet equally rewarding. They'll be leaving behind their luxurious lifestyles for an epic 12,500km race from the Amazon rainforest all the way to the Andes at ground level.They say goodbye to lavish transport, smartphones and bank cards armed with just a map and a limited budget to help them reach the finish line. Tested to the extremes, they'll need to rely on their ingenuity as well as the kindness of strangers. Once again, joining the celebrities will be their nearest and dearest, providing a unique insight into people we thought we knew through the eyes of those who know them best.Competing this series are broadcaster Kelly Brook and her husband, Jeremy, Ted Lasso star Kola Bokinni and his cousin Mary Ellen, Radio 2 host Scott Mills and his fiancé, Sam, and broadcaster Jeff Brazier and his son Freddy."
      },
      {
        "id": "tvmaze:2980225",
        "title": "Episode 2",
        "season": 2,
        "episode": 2,
        "released": "2024-08-21",
        "overview": "The race to Frutillar in southern Chile is underway. The four teams must leave the beach town of Canoa Quebrada and race through the north east region of Brazil to their second checkpoint, Lençóis, the gateway to the sprawling Chapada Diamantina National Park."
      },
      {
        "id": "tvmaze:2980226",
        "title": "Episode 3",
        "season": 2,
        "episode": 3,
        "released": "2024-08-28",
        "overview": "The teams race from the charming, cobblestoned town of Lençóis, Bahia, to the gigantic metropolis of São Paulo, via Salvador, Rio de Janeiro, Porto Seguro and Brasília."
      },
      {
        "id": "tvmaze:2980227",
        "title": "Episode 4",
        "season": 2,
        "episode": 4,
        "released": "2024-09-04",
        "overview": "The teams reach the halfway mark, and after 16 days traversing the length of Brazil, it's time to cross the border and enter the heart of South America and three new countries."
      },
      {
        "id": "tvmaze:2980228",
        "title": "Episode 5",
        "season": 2,
        "episode": 5,
        "released": "2024-09-11",
        "overview": "Four celebs, 24 countries, zero VIP treatment. With no phones or flights allowed, famous faces and family pairs must get from the Amazon Rainforest to the Andes - by any means necessary."
      },
      {
        "id": "tvmaze:2980229",
        "title": "Episode 6",
        "season": 2,
        "episode": 6,
        "released": "2024-09-18",
        "overview": "The race reaches its climax as one lucky team crosses the finish line in first place to claim their title as champions of Celebrity Race Across the World. The teams face their biggest challenge yet, racing a budget-crippling 2,750km across the mighty Andes into Chile. With just 39 minutes separating the four teams, it is all to play for.After 30 days and 12,500km, which team will be the first to sign the all-important book and be crowned winners?"
      },
      {
        "id": "tvmaze:3431219",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2025-11-06",
        "overview": "Four familiar faces - Roman Kemp, Dylan Llewellyn, Anita Rani and Molly Rainford - set off with a loved one on an epic 5,900km race across Central America."
      },
      {
        "id": "tvmaze:3431220",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2025-11-13",
        "overview": "The race to the Guajira Peninsula is under way. The teams can choose to travel through Guatemala, southern Belize or Honduras to reach the second checkpoint of El Zonte in El Salvador."
      },
      {
        "id": "tvmaze:3431221",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2025-11-20",
        "overview": "Four celebs, numerous countries, zero VIP treatment. With no phones or flights allowed, famous faces and family pairs take on a race across the world - by any means necessary."
      },
      {
        "id": "tvmaze:3450094",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2025-11-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3450095",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2025-12-04",
        "overview": ""
      }
    ]
  }
}