{
  "meta": {
    "id": "tvmaze:87543",
    "type": "series",
    "name": "Sweet Empire: Winter Wars",
    "description": "Sweet Empire: Winter Wars where fourteen of the most competitive and talented sweets makers are invited to the Yuletide Lodge for a competition unlike any other. While the competitors enter as individuals, their goal will be to get on-- and stay on-- the strongest team by any means necessary, because in this game the bakers must create incredible edible works of art to grow their teams and avoid elimination. In the end, teams will crumble until only the strongest will be left standing to become the Sweet Empire.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492474.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492474.jpg",
    "videos": [
      {
        "id": "tvmaze:3442514",
        "title": "Finale",
        "season": 1,
        "episode": 6,
        "released": "2025-12-14",
        "overview": "The final two empires face off in a holiday showdown. Host Wells Adams gives the bakers complete creative freedom to build an entire edible world that celebrates the holiday season. Alongside their showpiece, each team must deliver a tasting element worthy of the finale for judges Yolanda Gampp and Jacques Torres. Only one empire will rise above the rest to claim the $50,000 prize and the crown of Sweet Empire."
      },
      {
        "id": "tvmaze:3442513",
        "title": "North Pole Animals",
        "season": 1,
        "episode": 5,
        "released": "2025-12-07",
        "overview": "The empires journey to the Arctic for their biggest build yet, as host Wells Adams asks the baking teams to make towering showpieces of iconic North Pole animals. Polar bears, walrus, and even snow owls come to life through sugar, chocolate, and cake. Judges Yolanda Gampp and Jacques Torres are looking for scale, accuracy, and cozy flavors that could warm even the coldest winter's night."
      }
    ]
  }
}