{
  "meta": {
    "id": "tvmaze:80196",
    "type": "series",
    "name": "The Last Woodsmen",
    "description": "The Last Woodsmen takes us deep into the secluded wilderness with these courageous and highly skilled loggers as they literally risk their lives. It's a rarely explored, dangerous business which translates to incredibly engrossing television.On a floating barge hundreds of miles from civilization, veteran logger Jared Douglas puts everything on the line to harvest the largest timber in the world. One misstep in this high-risk industry could cost tens of thousands of dollars, or even a life. Joining him at the edge of the world is a tight-knit crew of lumbermen who, with only axes and hand-held power saws, take down massive, highly valuable trees that can be worth up to $70K each.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/598/1495269.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/598/1495269.jpg",
    "videos": [
      {
        "id": "tvmaze:3452563",
        "title": "Crash and Burn",
        "season": 2,
        "episode": 5,
        "released": "2025-12-12",
        "overview": "Stretched thin and desperately off-pace, Jared watches a loader tumble down the road; foreman Brad attempts to land his plane in choppy weather but is forced to shelter nearby; Barge Day arrives, but Brad has news for Jared that could destroy the season."
      },
      {
        "id": "tvmaze:3465029",
        "title": "Fat Truck and a Prayer",
        "season": 2,
        "episode": 6,
        "released": "2025-12-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3448083",
        "title": "Moving the Monster",
        "season": 2,
        "episode": 4,
        "released": "2025-12-05",
        "overview": "Fallers face gnarly timber challenges, but it will all be for nothing if Jared and crew can't get the 140-ton super snorkel up the mountain. A series of mechanical setbacks threatens to delay the first $100,000 barge royalty, due in less than two weeks."
      },
      {
        "id": "tvmaze:3030190",
        "title": "Jared vs. Goliaths",
        "season": 1,
        "episode": 1,
        "released": "2024-11-15",
        "overview": "Jared Douglas and his old-school logging crew risk life and limb to harvest the planet's biggest, most valuable trees. But getting these giants from the forest to market could kill him."
      },
      {
        "id": "tvmaze:3046631",
        "title": "Broken Limbs",
        "season": 1,
        "episode": 2,
        "released": "2024-11-22",
        "overview": "To make up for lost profits, Jared takes a huge gamble on bringing two valuable pieces of machinery back to life after decades of neglect. Handfallers Jim and Rob go toe-to-toe with a giant cedar that threatens to shut down the entire operation."
      },
      {
        "id": "tvmaze:3053854",
        "title": "Back from the Dead",
        "season": 1,
        "episode": 3,
        "released": "2024-11-29",
        "overview": "Jared moves into an abandoned logging camp, placing a $250,000 bet on a remote, dangerous site that will either sink or save his business. Ross is charged with moving the float camp ten miles deeper into the wilderness."
      },
      {
        "id": "tvmaze:3064312",
        "title": "Fowl Play",
        "season": 1,
        "episode": 4,
        "released": "2024-12-06",
        "overview": "Drowning in debt, Jared is doing everything he can to keep his business afloat and his workers employed. When 'fowl play' threatens to sink his float camp, Jared fights back as his fallers play a deadly game of dominos to get high-dollar trees to market."
      },
      {
        "id": "tvmaze:3069449",
        "title": "Stranded",
        "season": 1,
        "episode": 5,
        "released": "2024-12-13",
        "overview": "Jared needs to move $1,000,000 of wood down a treacherous river to market but can't find anyone brave enough to lead the journey. Moving deeper into the wilderness to chase big wood, the road builders prepare a massive blast to gain access."
      },
      {
        "id": "tvmaze:3077435",
        "title": "Deadly Waters",
        "season": 1,
        "episode": 6,
        "released": "2024-12-20",
        "overview": "In an all-out push to turn a profit at Grizzly Camp, Jared enlists Dave to navigate $200,000 of wood down the deadly Grizzly River while fallers Chris and Jeff tackle steep terrain in search of big wood."
      },
      {
        "id": "tvmaze:3079961",
        "title": "If You Can't Stand the Heat",
        "season": 1,
        "episode": 7,
        "released": "2024-12-27",
        "overview": "As fire season approaches, Jared races to save as many logs as he can. Plus, the road crew blasts its way to one last stand of money trees."
      },
      {
        "id": "tvmaze:3087222",
        "title": "Cash or Ash",
        "season": 1,
        "episode": 8,
        "released": "2025-01-03",
        "overview": "With fire season looming, Jared is under the gun to get all his product out of the woods before it turns to ash. Fallers race to drop trees without sparking a backcountry blaze and an alarming discovery at float camp could sink the whole operation."
      },
      {
        "id": "tvmaze:3092295",
        "title": "Shut It Down",
        "season": 1,
        "episode": 9,
        "released": "2025-01-10",
        "overview": "With just days left to move timber before fire season shuts him down, Jared races to save his float camp from sinking. Dave struggles to send one last haul down Grizzly River while Ross is called to the scene of a shocking accident."
      },
      {
        "id": "tvmaze:3400470",
        "title": "The King-Maker Claim",
        "season": 2,
        "episode": 1,
        "released": "2025-11-14",
        "overview": "In the premiere, Jared finally breaks free of his old business partner and lands a do-or-die shot to buy a legendary, virgin timber claim. With just 10 days to raise $200,000, the crew must battle monster cedars along with an out-of-control fire that threatens not only their massive machinery, but also their lives."
      },
      {
        "id": "tvmaze:3433481",
        "title": "Splash for Cash",
        "season": 2,
        "episode": 2,
        "released": "2025-11-21",
        "overview": "Only 48 hours remain until the bid deadline, and Jared and his crew race to stack high-dollar cedar before the buzzer rings. One last splash could launch them into the logging big leagues -- or sink the whole company."
      },
      {
        "id": "tvmaze:3440535",
        "title": "Raw Deal",
        "season": 2,
        "episode": 3,
        "released": "2025-11-28",
        "overview": "Facing the devastation of losing the Forever Claim, Jared makes a desperate deal with the powerful businessman who outbid him -- but new challenges could destroy his logging season before it begins."
      }
    ]
  }
}