{
  "meta": {
    "id": "tvmaze:80020",
    "type": "series",
    "name": "Ancient Aliens: Origins",
    "description": "Ancient Aliens: Origins takes viewers back to where it all began, revisiting the most compelling mysteries explored over the past 15 years of \"Ancient Aliens.\" In each episode, experts like Giorgio Tsoukalos, David Childress, William Henry, and Jason Martell engage in thought-provoking conversations on topics central to the Ancient Astronaut Theory. From astonishing feats of engineering to enigmatic UFOs and sky gods, they delve deep into the series' extensive archive, reflecting on past investigations, sharing personal insights from their adventures, and offering new perspectives on the ancient enigmas that have captivated humanity for centuries.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/538/1346105.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/538/1346105.jpg",
    "videos": [
      {
        "id": "tvmaze:3440472",
        "title": "Alien Brotherhoods And Codes",
        "season": 2,
        "episode": 10,
        "released": "2025-12-15",
        "overview": "For thousands of years, secret societies are said to have guarded hidden knowledge of otherworldly origin."
      },
      {
        "id": "tvmaze:3440473",
        "title": "Alien Time Travelers",
        "season": 2,
        "episode": 11,
        "released": "2025-12-29",
        "overview": ""
      },
      {
        "id": "tvmaze:3440471",
        "title": "Alien Reinventions",
        "season": 2,
        "episode": 9,
        "released": "2025-12-08",
        "overview": "From military-grade exoskeletons that grant superhuman strength to advances in visual spectrometers that enhance human perception, today's technologies are rapidly transforming myth into reality."
      },
      {
        "id": "tvmaze:3023839",
        "title": "Extraordinary Engineering",
        "season": 1,
        "episode": 1,
        "released": "2024-10-07",
        "overview": "One of the most compelling arguments for the Ancient Astronaut theory is the remarkable engineering evident in the construction of ancient megalithic sites worldwide. Even with the most advanced machinery available today, replicating these ancient wonders would be a daunting task. The colossal stones, precise cuts, and perfectly fitted blocks at many of these sites hint at the fascinating prospect of advanced technology. Join experts Giorgio Tsoukalos, William Henry, and Jason Martell as they embark on a global investigation, revisiting the series archives of \"Ancient Aliens\" to explore the most enigmatic archaeological sites, including Giza, Puma Punku, Nan Madol, Baalbek, and others."
      },
      {
        "id": "tvmaze:3023840",
        "title": "Ancient Close Encounters",
        "season": 1,
        "episode": 2,
        "released": "2024-10-14",
        "overview": "Compelling evidence of ancient flying machines is found in cultures across the globe. The Saqqara Bird, an artifact from ancient Egypt on display at the Cairo Museum, strikingly resembles modern aircraft. Ancient Sanskrit texts describe vimanas–intricate flying machines of the gods–in remarkable detail, while early biblical accounts contain similar technical references to the \"chariots of the gods.\" Ancient Astronaut theorists Giorgio Tsoukalos, William Henry, and Jason Martell delve into the series archives of \"Ancient Aliens\" to reveal the most compelling evidence of ancient flying machines and explore the possibility that these extraterrestrial close encounters have persisted throughout the ages."
      },
      {
        "id": "tvmaze:3023841",
        "title": "Sky Gods and Star Beings",
        "season": 1,
        "episode": 3,
        "released": "2024-10-21",
        "overview": "Are we truly alone in the Universe? Ancient Astronaut theorists propose that descriptions of sky gods and star beings might reflect real encounters with extraterrestrial visitors in the remote past. Could this be true? Follow experts Giorgio Tsoukalos, William Henry, and Jason Martell as they sift through the series archives of \"Ancient Aliens\" to uncover in-depth descriptions and portrayals of these entities from Egyptian, Sumerian, Chinese, Mesoamerican, and Native American traditions. Could the evidence reveal these beings to be… ancient astronauts?"
      },
      {
        "id": "tvmaze:3023842",
        "title": "Human Genesis",
        "season": 1,
        "episode": 4,
        "released": "2024-10-28",
        "overview": "Based solely on Charles Darwin's Theory of Evolution, the rapid development of modern humans seems impossible without a ‘missing link.' Could this link involve extraterrestrial intervention? Join Giorgio Tsoukalos, William Henry, and Jason Martell as they delve into the series archives of \"Ancient Aliens\" to uncover compelling clues about mankind's true origins. Discover evidence within religious texts, records from Earth's first civilizations, unexplained anomalies in human physiology, and clues embedded within our very own DNA. Could extraterrestrials have really guided human evolution? And if so, does the experiment with the human genome persist even today?"
      },
      {
        "id": "tvmaze:3025834",
        "title": "Mysterious Underground Worlds",
        "season": 1,
        "episode": 5,
        "released": "2024-11-04",
        "overview": "Beneath the surface of China lies the Longyou Grottoes, a breathtaking subterranean marvel featuring grand staircases, expansive hallways, and colossal ten-story columns carved from rock–believed to be over 15,000 years old. This remarkable discovery mirrors Derinkuyu, an enigmatic underground city found in Turkey. Meanwhile, in the American Southwest, secret tunnels linked to Native American lore of the Ant and Snake People are rumored to house covert government UFO programs. And in Egypt and Ecuador, libraries from a lost civilization have long been speculated to be concealed in underground caverns. Might these locations, and others, validate ancient legends of underground realms inhabited by extraterrestrial beings? And if so, what other otherworldly secrets might lie beneath our feet?"
      },
      {
        "id": "tvmaze:3025835",
        "title": "Alien Arsenal",
        "season": 1,
        "episode": 6,
        "released": "2024-11-18",
        "overview": "Throughout history, legendary weaponry and advanced technologies have often been attributed to divine or extraterrestrial influences. Japanese swords were believed to be forged with the help of the supernatural, while mythical weapons granted by otherworldly beings were wielded by iconic figures like Joan of Arc and King Arthur. The enigmatic Greek fire, whose origins remain a mystery to historians, is yet another weapon attributed to these so-called-gods. And as humanity developed nuclear capabilities, references in ancient Vedic scriptures to weapons of similar destructive power raise profound questions about our past. Even more intriguing is the evidence suggesting the existence of intelligent defense systems seemingly protecting Earth. Could all of these weapons have originated from… an alien arsenal?"
      },
      {
        "id": "tvmaze:3028029",
        "title": "Mystery of the Pyramids",
        "season": 1,
        "episode": 7,
        "released": "2024-11-25",
        "overview": "The Great Pyramid of Giza remains one of the most captivating mysteries of the ancient world, with compelling evidence suggesting it may have functioned as an ancient power plant. Adding to the intrigue, the pyramids at Teotihuacan in Mexico feature heat-shielding mica in their design. Across the globe, hundreds of ancient pyramids exhibit strikingly similar alignments and architectural styles, with many more yet to be discovered. Recent finds in Alaska, China, and even Bosnia expand this growing list and while Japan's Yonaguni pyramid lies submerged underwater, researchers claim to have found pyramids buried beneath miles of ice in Antarctica. Could these enigmatic structures hold the key to unraveling the truth about humanity's extraterrestrial past?"
      },
      {
        "id": "tvmaze:3042303",
        "title": "Alien Observatories",
        "season": 1,
        "episode": 8,
        "released": "2024-12-02",
        "overview": "Ancient sites like Stonehenge, Newgrange, and Egypt's Pyramids of Giza reveal astonishing celestial alignments that seem far from coincidence. Across the globe, from the Mayan temples and Hopi settlements to the pyramid complex of Teotihuacan, massive structures seem to mirror the heavens above–especially when seen from the skies. What purpose do they serve? Were these alignments crafted to signal entities from the stars? Do they mark the origins of otherworldly visitors? Or do they conceal a hidden purpose–one that humanity has yet to uncover?"
      },
      {
        "id": "tvmaze:3052742",
        "title": "Extraterrestrial Devices",
        "season": 1,
        "episode": 9,
        "released": "2024-12-09",
        "overview": "The Ark of the Covenant has inspired awe for centuries. It was said to have wielded extraordinary powers–creating food, collapsing walls, and communicating directly with God. Were these powers divine, or could the Ark have been an advanced technological device? Meanwhile, other mysterious objects including Solomon's ring are said to command supernatural forces. The Golden Disk of the Inca is believed to function as a communication tool with distant realm while the enigmatic Mayan crystal skull is speculated to be ancient storage device. Do these legendary objects suggest the possibility that ancient civilizations may have possessed advanced technology? Could they represent powerful devices from our forgotten, extraterrestrial past?"
      },
      {
        "id": "tvmaze:3052743",
        "title": "Submerged Evidence",
        "season": 1,
        "episode": 10,
        "released": "2024-12-16",
        "overview": "Earth's deep, uncharted waters have long been a source of wonder and speculation about what lies beneath. From the submerged ruins of Dwarka and Japan's Yonaguni Monument to the strange \"road\" discovered near the Bermuda Triangle, ancient underwater structures hint at civilizations lost to time. From legends of aquatic cities ruled by gods and creatures like Loch Ness and the Kraken to frequent UFO sightings, might these point to an otherworldly presence lurking in Earth watery depths?"
      },
      {
        "id": "tvmaze:3052744",
        "title": "Alien Beacons",
        "season": 1,
        "episode": 11,
        "released": "2024-12-30",
        "overview": "For centuries, ancient monuments and mysterious markings, visible only from the sky, have captivated and puzzled researchers. The Nazca Lines in Peru, with their sprawling designs of animal shapes and a humanoid figure, stretch across miles of desert while Ohio's Serpent Mound and France's precisely arranged Carnac Stones exhibit an advanced knowledge of astronomy and geometry. Around the world, similar enigmas emerge from crop circles inscribed with complex codes to ley lines linking sacred sites along energy-rich pathways. Could these sites be more than just ancient wonders? Might they have been placed intentionally as navigational signposts for extraterrestrial visitors who once journeyed through Earth's skies?"
      },
      {
        "id": "tvmaze:3077773",
        "title": "Alien Messengers",
        "season": 1,
        "episode": 12,
        "released": "2025-01-05",
        "overview": "Across cultures and throughout history, stories of individuals receiving wisdom from otherworldly sources are widespread. In biblical accounts, prophets are granted moral codes through divine encounters. The Oracle of Delphi communicated directly with the Greek god Apollo, delivering his messages to humanity. Similarly, external influences appear to have shaped pivotal moments in history. Joan of Arc claimed to have had visions that drove her to lead the French army, while George Washington reported an apparition that guided him during the Revolutionary War. Many of history's greatest minds, including Albert Einstein, Nikola Tesla, and Srinivasa Ramanujan, attributed their groundbreaking insights to inspiration that seemed to come from beyond our world. Could it be that key events and monumental breakthroughs in human history were guided by extraterrestrial messengers?"
      },
      {
        "id": "tvmaze:3365407",
        "title": "Extraterrestrial Teachers",
        "season": 2,
        "episode": 1,
        "released": "2025-10-06",
        "overview": "Across time and cultures, from ancient Egypt and Sumeria to Mesoamerica and ancient India, civilizations have preserved remarkably similar accounts of sky beings who bestowed the foundational elements of civilization.   Get Instant Access to Free Updates"
      },
      {
        "id": "tvmaze:3365408",
        "title": "Extraterrestrial Rituals",
        "season": 2,
        "episode": 2,
        "released": "2025-10-13",
        "overview": "Could these practices be echoes of real encounters with something–or someone–not of this Earth? And if so, might modern rituals still carry the imprint of contact with extraterrestrial beings?"
      },
      {
        "id": "tvmaze:3365409",
        "title": "Gateways To The Stars",
        "season": 2,
        "episode": 3,
        "released": "2025-10-20",
        "overview": "Across the globe, sacred sites have long been viewed as gateways to the stars. Could there be more to the legends? If so, might they serve as wormholes, intentionally designed to connect humanity with its ancient alien ancestors?"
      },
      {
        "id": "tvmaze:3365410",
        "title": "Otherworldly Rulers",
        "season": 2,
        "episode": 4,
        "released": "2025-10-27",
        "overview": "In the ancient world, it was said that the gods did not watch from afar–they ruled among us. Could these dynasties be more than myth?"
      },
      {
        "id": "tvmaze:3394691",
        "title": "Extraterrestrial Deluge",
        "season": 2,
        "episode": 5,
        "released": "2025-11-03",
        "overview": "Across the world, thousands of flood stories persist—often involving powerful beings described as gods who played a role in humanity's fate. But were these events truly the work of divine forces?"
      },
      {
        "id": "tvmaze:3394692",
        "title": "The Cryptid Mystery",
        "season": 2,
        "episode": 6,
        "released": "2025-11-17",
        "overview": "Ancient accounts of monstrous creatures appear in cultures across the globe, often closely tied to the gods themselves. Could it be that these strange creatures are part of a deeper pattern of contact with something not of this world?"
      },
      {
        "id": "tvmaze:3394693",
        "title": "Are We Alone?",
        "season": 2,
        "episode": 7,
        "released": "2025-11-24",
        "overview": "For centuries, humans have pondered a profound question: Are we alone in the universe?"
      },
      {
        "id": "tvmaze:3440470",
        "title": "Messengers Among Us",
        "season": 2,
        "episode": 8,
        "released": "2025-12-01",
        "overview": "Throughout history, key moments in the evolution of religious belief and moral law have revealed uncanny parallels to accounts of extraterrestrial contact."
      }
    ]
  }
}