{
  "meta": {
    "id": "tvmaze:6310",
    "type": "series",
    "name": "Portrait Artist of the Year",
    "description": "Portrait Artist of the Year is hosted by UK TV personalities Joan Bakewell and Frank Skinner; an esteemed group of judges travel across the Europe in search of a new star in the art world. Each episode features a regional competition where artists are shortlisted and challenged to produce a portrait of one of three famous sitters. At the end of each round, the judges select an artist to go to the semifinal. The finalists will have their work displayed at the world-famous National Portrait Gallery in London and the winner will receive a £10,000 commission to paint a portrait which will become part of the permanent collection at the British Library.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1473173.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1473173.jpg",
    "videos": [
      {
        "id": "tvmaze:3457125",
        "title": "Best of 2025",
        "season": 12,
        "episode": 12,
        "released": "2025-12-10",
        "overview": "A look back at the most memorable moments from the 12th series of the competition, featuring sitters including Tim Peake, Emily Atack, Mary Berry and Brian Cox."
      },
      {
        "id": "tvmaze:375513",
        "title": "London",
        "season": 1,
        "episode": 1,
        "released": "2013-11-05",
        "overview": "Joan Bakewell and Frank Skinner begin their search for the Portrait Artist of the Year in London, where artists are asked to paint stars such as actors Alison Steadman, Robert Lindsay and Juliet Stevenson."
      },
      {
        "id": "tvmaze:375514",
        "title": "Glasgow",
        "season": 1,
        "episode": 2,
        "released": "2013-11-12",
        "overview": "Frank Skinner, Joan Bakewell and the judges head to Glasgow as 21 competitors capture celebrity sitters including Game of Thrones actress Sophie Turner, actor John Hannah and Paralympian Michael Kerr."
      },
      {
        "id": "tvmaze:375515",
        "title": "Dublin",
        "season": 1,
        "episode": 3,
        "released": "2013-11-19",
        "overview": "Frank Skinner and Joan Bakewell take the competition to Dublin where 21 artists hope to wow judges with portraits of actors Pauline McLynn, David Rawle and rapper Lethal Bizzle."
      },
      {
        "id": "tvmaze:375516",
        "title": "Cardiff",
        "season": 1,
        "episode": 4,
        "released": "2013-11-26",
        "overview": "The final tryout takes Joan Bakewell and Frank Skinner to Wales where artists paint rugby player Gavin Henson, artist Lucian Freud's muse Sue Tilley and war veteran Simon Weston."
      },
      {
        "id": "tvmaze:375517",
        "title": "Paris",
        "season": 1,
        "episode": 5,
        "released": "2013-12-03",
        "overview": "The penultimate stage of the competition takes the four finalists to Paris where they have six hours to paint author and model Sophie Dahl."
      },
      {
        "id": "tvmaze:375518",
        "title": "National Portrait Gallery",
        "season": 1,
        "episode": 6,
        "released": "2013-12-10",
        "overview": "The finalists unveil one last portrait before the judges enter tense discussions over the winner. The portrait artist of the year is awarded a commission to paint writer Hilary Mantel."
      },
      {
        "id": "tvmaze:375520",
        "title": "Sol Campbell, John Humphrys, Maisie Williams",
        "season": 2,
        "episode": 1,
        "released": "2014-11-04",
        "overview": "Season two premiere. Frank Skinner and Joan Bakewell begin their hunt for the next Portrait Artist of the Year. The first episode sees artists paint sitters including English footballer Sol Campbell, broadcaster John Humphrys and Game of Thrones actress Maisie Williams."
      },
      {
        "id": "tvmaze:375521",
        "title": "Julian Fellowes, Ronni Ancona, Helena Kennedy QC",
        "season": 2,
        "episode": 2,
        "released": "2014-11-11",
        "overview": "More artists put their nerves and artistic flair to the test as they paint celebrities including Downton Abbey creator Julian Fellowes, actress Ronni Ancona and barrister Helena Kennedy QC in Edinburgh, Scotland."
      },
      {
        "id": "tvmaze:375522",
        "title": "Gary Kemp, Daniela Nardini, Ashley Jensen",
        "season": 2,
        "episode": 3,
        "released": "2014-11-18",
        "overview": "Artists in Scotland paint stars such as Spandau Ballet's guitarist Gary Kemp and actresses Daniela Nardini and Ashley Jensen (Ugly Betty). An incredibly close heat means there's a twist in store."
      },
      {
        "id": "tvmaze:375523",
        "title": "Non Evans, Ade Adepitan, Greg Davies",
        "season": 2,
        "episode": 4,
        "released": "2014-11-25",
        "overview": "Frank Skinner, Joan Bakewell and the judges move the competition to Wales, where 12 gifted artists get just four hours to paint celebrities including athlete Non Evans, Paralympian Ade Adepitan and comedian Greg Davies."
      },
      {
        "id": "tvmaze:375524",
        "title": "Jilly Cooper, Daniel Roche, Melvyn Bragg",
        "season": 2,
        "episode": 5,
        "released": "2014-12-02",
        "overview": "In London, 12 artists attempt to impress the judges by capturing celebrities including writer Jilly Cooper and actor Daniel Roche. One contestant uses tapestry to depict broadcaster Melvyn Bragg."
      },
      {
        "id": "tvmaze:375525",
        "title": "Neil Hannon, Sharon Corr, Colm Meaney",
        "season": 2,
        "episode": 6,
        "released": "2014-12-09",
        "overview": "Artists vie for the final place in the semi-final by painting singers Neil Hannon and Sharon Corr, as well as actor Colm Meaney in Dublin."
      },
      {
        "id": "tvmaze:375526",
        "title": "Richard Dawkins, Sally Hitchiner",
        "season": 2,
        "episode": 7,
        "released": "2014-12-16",
        "overview": "The seven semi-finalists battle for a place in the final by painting a double portrait of Professor Richard Dawkins and the Reverend Sally Hitchiner."
      },
      {
        "id": "tvmaze:375527",
        "title": "Sir Ian McKellen",
        "season": 2,
        "episode": 8,
        "released": "2014-12-23",
        "overview": "It is crunch time as the three finalists get four nerve-wracking hours to paint actor Sir Ian McKellen. The portrait artist of the year is awarded a commission to paint actor Alan Cumming."
      },
      {
        "id": "tvmaze:375528",
        "title": "Alan Cumming",
        "season": 2,
        "episode": 9,
        "released": "2014-12-30",
        "overview": "The final episode follows the winning artist painting the multi award-winning actor Alan Cumming. After three days of painting, the final portrait is revealed at a special reception at the Scottish National Portrait Gallery."
      },
      {
        "id": "tvmaze:1048021",
        "title": "Episode 1",
        "season": 3,
        "episode": 1,
        "released": "2017-01-24",
        "overview": "Frank Skinner and Joan Bakewell launch a new search for a star portrait artist. The contestants will paint celebrity sitters as they hope to win the £10,000 prize."
      },
      {
        "id": "tvmaze:1032788",
        "title": "Episode 2",
        "season": 3,
        "episode": 2,
        "released": "2017-01-31",
        "overview": "This week, the contestants paint celebrity sitters Sue Perkins, Richard E Grant and Nina Sosanya. But who will the judges send through to the next round of the competition?"
      },
      {
        "id": "tvmaze:1049948",
        "title": "Episode 3",
        "season": 3,
        "episode": 3,
        "released": "2017-02-07",
        "overview": "James Norton, Raleigh Ritchie and Lesley Manville are the celebrity sitters as the artists compete for the £10,000 commission. Frank Skinner and Joan Bakewell host."
      },
      {
        "id": "tvmaze:1049951",
        "title": "Episode 4",
        "season": 3,
        "episode": 4,
        "released": "2017-02-14",
        "overview": "Actor Trevor Eve, Fortitude star Parminder Nagra and author Ben Okri are the celebrity sitters."
      },
      {
        "id": "tvmaze:1063095",
        "title": "Episode 5",
        "season": 3,
        "episode": 5,
        "released": "2017-02-21",
        "overview": "Musician Rick Wakeman, Hairy Biker Dave Myers and singer Katie Kissoon are the sitters awaiting a new group of portrait artists as the competition continues."
      },
      {
        "id": "tvmaze:1090619",
        "title": "Episode 6",
        "season": 3,
        "episode": 6,
        "released": "2017-02-28",
        "overview": ""
      },
      {
        "id": "tvmaze:1090620",
        "title": "Episode 7",
        "season": 3,
        "episode": 7,
        "released": "2017-03-07",
        "overview": ""
      },
      {
        "id": "tvmaze:1097977",
        "title": "Episode 8",
        "season": 3,
        "episode": 8,
        "released": "2017-03-14",
        "overview": "It's the final and the three remaining artists hope to impress the judges as they paint celebrity sitter Tom Courtenay and win a career-changing £10,000 commission."
      },
      {
        "id": "tvmaze:1097978",
        "title": "Episode 9",
        "season": 3,
        "episode": 9,
        "released": "2017-03-14",
        "overview": "This special film joins the Sky Arts Portrait Artist of the Year 2017 winner to take a look at their journey through the competition and their stunning work"
      },
      {
        "id": "tvmaze:1390586",
        "title": "David Tennant, Michaela Coel, James Morrison",
        "season": 4,
        "episode": 1,
        "released": "2018-01-16",
        "overview": "Frank Skinner and Joan Bakewell search for a new star portrait artist. The celebrity sitters opening the series are David Tennant, Michaela Coel and James Morrison."
      },
      {
        "id": "tvmaze:1390587",
        "title": "Noel Fielding, Reggie Yates, Daphne Selfe",
        "season": 4,
        "episode": 2,
        "released": "2018-01-23",
        "overview": "Comedian Noel Fielding, TV presenter Reggie Yates and model Daphne Selfe are the celebrity sitters this week as a group of artists attempts to impress the judges."
      },
      {
        "id": "tvmaze:1390588",
        "title": "Ross Kemp, Freddie Fox, Vicky McClure",
        "season": 4,
        "episode": 3,
        "released": "2018-01-30",
        "overview": "Investigative journalist Ross Kemp, actor Freddie Fox and Broadchurch star Vicky McClure strike a pose for a new group of portrait artists."
      },
      {
        "id": "tvmaze:1392666",
        "title": "Rachel Hunter, Stefanie Martini, Conleth Hil",
        "season": 4,
        "episode": 4,
        "released": "2018-02-06",
        "overview": "This week's famous sitters are model Rachel Hunter, actress Stefanie Martini and Game of Thrones star Conleth Hill as the portrait painting competition continues."
      },
      {
        "id": "tvmaze:1398533",
        "title": "Elizabeth McGovern, Fiona Shaw, Kadeena Cox",
        "season": 4,
        "episode": 5,
        "released": "2018-02-13",
        "overview": "Downton Abbey actress Elizabeth McGovern, Harry Potter film star Fiona Shaw and Paralympic gold medalist Kadeena Cox sit for a new group of portrait artists."
      },
      {
        "id": "tvmaze:1410341",
        "title": "Kenneth Cranham, Claire Skinner, Sope Dirisu",
        "season": 4,
        "episode": 6,
        "released": "2018-02-20",
        "overview": "A new group of portrait artists attempt to capture the likeness of actors Kenneth Cranham, Claire Skinner and Sope Dirisu on canvas. Frank Skinner and Joan Bakewell host."
      },
      {
        "id": "tvmaze:1410342",
        "title": "Michael Ball, Robert Bathurst, Anita Rani",
        "season": 4,
        "episode": 7,
        "released": "2018-02-27",
        "overview": "Singer Michael Ball, actor Robert Bathurst and broadcaster Anita Rani are this week's celebrity sitters as the portrait painting competition continues."
      },
      {
        "id": "tvmaze:1418221",
        "title": "Meera Syal, Derek Jacobi, Kirsty Wark",
        "season": 4,
        "episode": 8,
        "released": "2018-03-06",
        "overview": "In the last of the heats, actress Meera Syal, star of stage and screen Sir Derek Jacobi and broadcaster Kirsty Wark sit for a new group of portrait artists."
      },
      {
        "id": "tvmaze:1418222",
        "title": "Lily Cole, Simon Callow",
        "season": 4,
        "episode": 9,
        "released": "2018-03-13",
        "overview": "It's the semi-final and the remaining artists attempt to impress the judges with their portraits of this week's celebrity sitters - model Lily Cole and actor Simon Callow."
      },
      {
        "id": "tvmaze:1424426",
        "title": "Emeli Sande",
        "season": 4,
        "episode": 10,
        "released": "2018-03-20",
        "overview": "It's the final and the portrait artists are challenged to paint multi award-winning singer-songwriter Emeli Sande before the judges pick a series winner."
      },
      {
        "id": "tvmaze:1424427",
        "title": "Kim Cattrall",
        "season": 4,
        "episode": 11,
        "released": "2018-03-20",
        "overview": "This special film follows the winner of Portrait Artist of the Year 2018 as they paint a commissioned portrait of Sex and the City actress Kim Cattrall."
      },
      {
        "id": "tvmaze:1600883",
        "title": "Matthew Goode, Geraldine James, Andi Oliver",
        "season": 5,
        "episode": 1,
        "released": "2019-02-12",
        "overview": "Ready, set, paint! Nine eager artists get four hours to capture stars including Matthew Goode as this year's search begins. Joan Bakewell and Stephen Mangan host."
      },
      {
        "id": "tvmaze:1600884",
        "title": "David Gandy, Anne Reid, Ashley Walters",
        "season": 5,
        "episode": 2,
        "released": "2019-02-19",
        "overview": "Model David Gandy and actors Ashley Walters and Anne Reid strike a pose as nine more hopefuls bid to paint their way to the semi-final. Joan Bakewell and Stephen Mangan host."
      },
      {
        "id": "tvmaze:1616199",
        "title": "Eddie Hall, Jodie Kidd, James Purefoy",
        "season": 5,
        "episode": 3,
        "released": "2019-02-26",
        "overview": "Nine artists race the clock to capture Eddie Hall, Jodie Kidd and James Purefoy on canvas. Whose work will land them a spot in the semi-final? Let the judges decide."
      },
      {
        "id": "tvmaze:1616266",
        "title": "Anna Chancellor, Stephen Graham, Beverley Knight",
        "season": 5,
        "episode": 4,
        "released": "2019-03-05",
        "overview": "Another spot in the semi-final is up for grabs as nine more fledgling Frida Kahlos get set to paint stars Anna Chancellor, Stephen Graham and Beverley Knight."
      },
      {
        "id": "tvmaze:1616267",
        "title": "Georgina Campbell, Mark Gatiss, Tanni Grey-Thompson",
        "season": 5,
        "episode": 5,
        "released": "2019-03-12",
        "overview": "The next bunch of hopefuls pitch their easels as they bid to paint their way to the semi-finals. Mark Gatiss, Georgina Campbell and Tanni Grey-Thompson strike a pose."
      },
      {
        "id": "tvmaze:1619518",
        "title": "Sophie Ellis-Bextor, Adrian Lester, Nitin Sawhney",
        "season": 5,
        "episode": 6,
        "released": "2019-03-19",
        "overview": "Nine more hopefuls get just four hours to make their mark on the judges as they paint Nitin Sawhney, Sophie Ellis-Bextor and Adrian Lester."
      },
      {
        "id": "tvmaze:1632971",
        "title": "Angela Griffin, Gina McKee, Jamael Westman",
        "season": 5,
        "episode": 7,
        "released": "2019-03-26",
        "overview": "Nine more artists fight for a spot in the semi-final, getting just four hours to wow the judges with paintings of Angela Griffin, Gina McKee and Jamael Westman."
      },
      {
        "id": "tvmaze:1632972",
        "title": "Jodie Comer, Daniel Lismore, Nick Moran",
        "season": 5,
        "episode": 8,
        "released": "2019-04-02",
        "overview": "It's brushes at the ready as nine more artists battle for the last spot in the semi-final. With designer Daniel Lismore and actors Jodie Comer and Nick Moran."
      },
      {
        "id": "tvmaze:1632973",
        "title": "Courtney Pine",
        "season": 5,
        "episode": 9,
        "released": "2019-04-09",
        "overview": "The semi-finalists battle for three spots in the series final as they paint jazz star Courtney Pine at Hackney's Round Chapel. Joan Bakewell and Stephen Mangan host."
      },
      {
        "id": "tvmaze:1632974",
        "title": "Final - Laura Linney",
        "season": 5,
        "episode": 10,
        "released": "2019-04-16",
        "overview": "It's crunch time as the finalists get four nerve-wrecking hours to paint Laura Linney at the National Portrait Gallery."
      },
      {
        "id": "tvmaze:1641881",
        "title": "Winner's Film Tom Jones",
        "season": 5,
        "episode": 11,
        "released": "2019-04-16",
        "overview": ""
      },
      {
        "id": "tvmaze:1777284",
        "title": "Asa Butterfield, Micky Flanagan, Anjli Mohindra",
        "season": 6,
        "episode": 1,
        "released": "2020-01-21",
        "overview": "Joan Bakewell and Stephen Mangan launch another talent search, with the first batch of contestants painting celebrity sitters Asa Butterfield, Micky Flanagan and Anjli Mohindra."
      },
      {
        "id": "tvmaze:1792956",
        "title": "Trevor Nelson, Noel Clarke and Ashley Roberts",
        "season": 6,
        "episode": 2,
        "released": "2020-01-28",
        "overview": "The contestants are challenged to paint DJ Trevor Nelson, actor and director Noel Clarke and former Pussycat Doll Ashley Roberts. Joan Bakewell and Stephen Mangan present."
      },
      {
        "id": "tvmaze:1798214",
        "title": "Len Goodman, Tinie Tempah and Harriet Walter",
        "season": 6,
        "episode": 3,
        "released": "2020-02-04",
        "overview": "The contestants are challenged to paint former Strictly judge Len Goodman, rapper Tinie Tempah and actress Harriet Walter. Joan Bakewell and Stephen Mangan present."
      },
      {
        "id": "tvmaze:1798215",
        "title": "Asim Chaudhry, Russell Tovey and Doreen Mantle",
        "season": 6,
        "episode": 4,
        "released": "2020-02-11",
        "overview": "The contestants are challenged to paint comedian Asim Chaudhry, actor Russell Tovey and actress Doreen Mantle. Joan Bakewell and Stephen Mangan present."
      },
      {
        "id": "tvmaze:1798216",
        "title": "John Cooper Clarke, Fearne Cotton and Haydn Gwynne",
        "season": 6,
        "episode": 5,
        "released": "2020-02-18",
        "overview": "The contestants are challenged to paint poet John Cooper Clarke, TV presenter Fearne Cotton and actress Haydn Gwynne. Joan Bakewell and Stephen Mangan present."
      },
      {
        "id": "tvmaze:1808608",
        "title": "Ricky Wilson, Adrian Dunbar and Zawe Ashton",
        "season": 6,
        "episode": 6,
        "released": "2020-02-25",
        "overview": ""
      },
      {
        "id": "tvmaze:1812550",
        "title": "Ken Stott, Mike Leigh, Lydia Leonard",
        "season": 6,
        "episode": 7,
        "released": "2020-03-03",
        "overview": ""
      },
      {
        "id": "tvmaze:1815520",
        "title": "Deborah Findlay, Wunmi Mosaku and Omid Djalili",
        "season": 6,
        "episode": 8,
        "released": "2020-03-10",
        "overview": "The nine contestants are challenged to paint Deborah Findlay, Wunmi Mosaku and Omid Djalili."
      },
      {
        "id": "tvmaze:1818168",
        "title": "Elaine Paige",
        "season": 6,
        "episode": 9,
        "released": "2020-03-17",
        "overview": "The semi-final sees the remaining artists attempt to impress the judges with their portraits of musical theatre star Elaine Paige"
      },
      {
        "id": "tvmaze:1818169",
        "title": "Lemn Sissay",
        "season": 6,
        "episode": 10,
        "released": "2020-03-24",
        "overview": "The three remaining artists compete in the final, painting poet Lemn Sissay before the winner of the career-changing £10,000 commission is announced."
      },
      {
        "id": "tvmaze:1827662",
        "title": "Portrait Artist of the Year 2020: Nile Rodgers",
        "season": 6,
        "episode": 11,
        "released": "2020-03-31",
        "overview": ""
      },
      {
        "id": "tvmaze:1946064",
        "title": "Ncuti Gatwa, Lady Glenconner, Fay Ripley",
        "season": 7,
        "episode": 1,
        "released": "2020-10-14",
        "overview": ""
      },
      {
        "id": "tvmaze:1956808",
        "title": "Trevor McDonald, Mirren Mack and the Vivienne",
        "season": 7,
        "episode": 2,
        "released": "2020-10-21",
        "overview": ""
      },
      {
        "id": "tvmaze:1957402",
        "title": "Deborah James, Eamonn Walker and Melanie Sykes",
        "season": 7,
        "episode": 3,
        "released": "2020-10-28",
        "overview": ""
      },
      {
        "id": "tvmaze:1961201",
        "title": "Ray BLK, James Nesbitt and Pam Hogg",
        "season": 7,
        "episode": 4,
        "released": "2020-11-04",
        "overview": ""
      },
      {
        "id": "tvmaze:1965346",
        "title": "Robert Rinder, Katie Piper and Don Letts",
        "season": 7,
        "episode": 5,
        "released": "2020-11-11",
        "overview": ""
      },
      {
        "id": "tvmaze:1969101",
        "title": "Eddie Marsan, Sian Clifford and Paul Mescal",
        "season": 7,
        "episode": 6,
        "released": "2020-11-18",
        "overview": ""
      },
      {
        "id": "tvmaze:1972459",
        "title": "David Haig, Jordan Stephens and Jane Horrocks",
        "season": 7,
        "episode": 7,
        "released": "2020-11-25",
        "overview": ""
      },
      {
        "id": "tvmaze:1976864",
        "title": "Kwame Kwei-Armah, Dame Katherine Grainger and Fred Sirieix",
        "season": 7,
        "episode": 8,
        "released": "2020-12-02",
        "overview": ""
      },
      {
        "id": "tvmaze:1980410",
        "title": "Bernardine Evaristo",
        "season": 7,
        "episode": 9,
        "released": "2020-12-09",
        "overview": ""
      },
      {
        "id": "tvmaze:1983910",
        "title": "Eddie Izzard",
        "season": 7,
        "episode": 10,
        "released": "2020-12-16",
        "overview": "The competition reaches its climax as the remaining artists attempt to capture the likeness of comedian, actor and political activist Eddie Izzard."
      },
      {
        "id": "tvmaze:1983911",
        "title": "Carlos Acosta",
        "season": 7,
        "episode": 11,
        "released": "2020-12-16",
        "overview": "Following the winner as they complete a £10,000 commission to paint Carlos Acosta, director of the Birmingham Royal Ballet, for a piece that will be exhibited at the Birmingham Art Gallery."
      },
      {
        "id": "tvmaze:2191821",
        "title": "Gabrielle, Jacob Fortune-Lloyd, Grace Neutral",
        "season": 8,
        "episode": 1,
        "released": "2021-10-13",
        "overview": "Stephen Mangan and Joan Bakewell return with the contest, as the first heat sees nine artists create portraits of singer Gabrielle, actor Jacob Fortune-Lloyd and model Grace Neutral. Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan judge their efforts."
      },
      {
        "id": "tvmaze:2191827",
        "title": "Gyles Brandreth, Karen Gibson, Sophie Cookson",
        "season": 8,
        "episode": 2,
        "released": "2021-10-20",
        "overview": "The competition continues as the artists create portraits of Gyles Brandreth, Karen Gibson and Sophie Cookson, judged by Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan."
      },
      {
        "id": "tvmaze:2191828",
        "title": "Alexa Chung, Nish Kumar, Philip Glenister",
        "season": 8,
        "episode": 3,
        "released": "2021-10-27",
        "overview": "The third heat sees contestants creating portraits of celebrity sitters Alexa Chung, Nish Kumar and Philip Glenister. Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan judge."
      },
      {
        "id": "tvmaze:2208146",
        "title": "Celeste, Lydia West, Alastair Campbell",
        "season": 8,
        "episode": 4,
        "released": "2021-11-03",
        "overview": "The competition continues as artists create portraits of sitters Celeste, Lydia West and Alastair Campbell, while Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan judge."
      },
      {
        "id": "tvmaze:2208147",
        "title": "Kelly Macdonald, Hugh Skinner, Polly Walker",
        "season": 8,
        "episode": 5,
        "released": "2021-11-10",
        "overview": "The competition continues as artists create portraits of Kelly Macdonald, Hugh Skinner and Polly Walker. Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan judge."
      },
      {
        "id": "tvmaze:2208148",
        "title": "David Olosuga, Maggie Aderin-Pocock, Sergei Polunin",
        "season": 8,
        "episode": 6,
        "released": "2021-11-17",
        "overview": "David Olusoga, Maggie Aderin-Pocock, Sergei Polunin sit for the next batch of contenders, with Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan judging their efforts."
      },
      {
        "id": "tvmaze:2208149",
        "title": "Chris Packham, Arlene Phillips, Ali Jawad",
        "season": 8,
        "episode": 7,
        "released": "2021-11-24",
        "overview": "Chris Packham, Arlene Phillips sit for the next batch of contestants create portraits and present them to judges Kathleen Soriano, Tai Shan Schierenberg and Kate Bryan."
      },
      {
        "id": "tvmaze:2223194",
        "title": "Ian Hislop, Emma Dabiri, Daniel Mays",
        "season": 8,
        "episode": 8,
        "released": "2021-12-01",
        "overview": ""
      },
      {
        "id": "tvmaze:2231556",
        "title": "Nick Mason",
        "season": 8,
        "episode": 9,
        "released": "2021-12-08",
        "overview": "The semi-final sees the eight qualifying artists create portraits of Nick Mason of Pink Floyd and present them to the judges, with only three progressing to the grand final."
      },
      {
        "id": "tvmaze:2231845",
        "title": "Barry Humphries",
        "season": 8,
        "episode": 10,
        "released": "2021-12-15",
        "overview": "The competition reaches its climax as the remaining artists attempt to capture the likeness of comedian and actor Barry Humphries, before the winner is announced."
      },
      {
        "id": "tvmaze:2240311",
        "title": "Nicola Benedetti",
        "season": 8,
        "episode": 11,
        "released": "2021-12-22",
        "overview": "Following the winner as they complete a £10,000 commission to paint violinist Nicola Benedetti for the Scottish National Portrait Gallery."
      },
      {
        "id": "tvmaze:2240312",
        "title": "Best Of",
        "season": 8,
        "episode": 12,
        "released": "2021-12-22",
        "overview": "Highlights of the eighth series of the competition to find the UK's most talented portrait artist."
      },
      {
        "id": "tvmaze:3002692",
        "title": "Elizabeth Day, Khadija Mellah, Nick Grimshaw",
        "season": 9,
        "episode": 1,
        "released": "2022-10-05",
        "overview": "The opening heat of 2022's search gets underway."
      },
      {
        "id": "tvmaze:3002693",
        "title": "Lulu, Alex Brooker, Phil Manzanera",
        "season": 9,
        "episode": 2,
        "released": "2022-10-12",
        "overview": "The search continues as the artists create portraits to get the ball rolling in the second heat of 2022's competition."
      },
      {
        "id": "tvmaze:3002694",
        "title": "Suggs, Miquita Oliver, Eve Muirhead",
        "season": 9,
        "episode": 3,
        "released": "2022-10-19",
        "overview": ""
      },
      {
        "id": "tvmaze:3002695",
        "title": "Bruno Tonioli, Yolanda Brown, Helen Sharman",
        "season": 9,
        "episode": 4,
        "released": "2022-10-26",
        "overview": "The competition rolls on with the artists creating and presenting portraits to the judges."
      },
      {
        "id": "tvmaze:3002697",
        "title": "Dame Stella Rimington, Big Zuu, Alexis Ffrench",
        "season": 9,
        "episode": 5,
        "released": "2022-11-02",
        "overview": "The competition continues at full speed with the artists creating portraits for a new crop of celebrity guests."
      },
      {
        "id": "tvmaze:3002698",
        "title": "Jim Carter, Benjamin Zephaniah, Ellie Simmonds",
        "season": 9,
        "episode": 6,
        "released": "2022-11-09",
        "overview": "Three new celebrity guests stand before the artists as they produce portraits in a bid to catch the judges' eyes."
      },
      {
        "id": "tvmaze:3002699",
        "title": "Henning Wehn, Lemar, Candice Carty-Williams",
        "season": 9,
        "episode": 7,
        "released": "2022-11-16",
        "overview": "A set of new celebrities enter the fore as the painters put their artistic flair to the test."
      },
      {
        "id": "tvmaze:3002700",
        "title": "Rebecca Ferguson",
        "season": 9,
        "episode": 8,
        "released": "2022-11-23",
        "overview": "The semi-final stage arrives as the contestants create portraits of the acclaimed singer Rebecca Ferguson"
      },
      {
        "id": "tvmaze:3002701",
        "title": "Jonathan Van-Tam",
        "season": 9,
        "episode": 9,
        "released": "2022-11-30",
        "overview": "The contestants arrive at the final hurdle, tasked with creating portraits of the former Deputy Chief Medical Officer."
      },
      {
        "id": "tvmaze:3002702",
        "title": "Sir Lenny Henry",
        "season": 9,
        "episode": 10,
        "released": "2022-12-07",
        "overview": "The competition winner's £10,000 prize is to paint a portrait of Sir Lenny Henry for London's National Gallery's permanent collection."
      },
      {
        "id": "tvmaze:3002716",
        "title": "Best Of Portrait Artist Of The Year 2022",
        "season": 9,
        "episode": 11,
        "released": "2022-12-14",
        "overview": "Look back on the best moments from the ninth season of Portrait Artist of the Year."
      },
      {
        "id": "tvmaze:2640354",
        "title": "Richard Curtis, Emma Freud, Fleur East",
        "season": 10,
        "episode": 1,
        "released": "2023-10-11",
        "overview": "Stephen Mangan and Joan Bakewell host the first heat of this year's competition from Battersea Art Centre, where a new crop of artists looks to impress the judges with a portrait of Richard Curtis, Emma Freud or Fleur East."
      },
      {
        "id": "tvmaze:2663263",
        "title": "Jay Rayner, Nihal Arthanayake, Susanna Reid",
        "season": 10,
        "episode": 2,
        "released": "2023-10-18",
        "overview": "Nine more contestants take part in the second heat of the competition, where the celebrity sitters are Jay Rayner, Nihal Arthanayake and Susanna Reid."
      },
      {
        "id": "tvmaze:2663264",
        "title": "Rory Stewart, Ainsley Harriott, Rob Delaney",
        "season": 10,
        "episode": 3,
        "released": "2023-10-25",
        "overview": "Nine more artists are challenged with creating portraits of one of celebrity sitters Rory Stewart, Ainsley Harriott and Rob Delaney."
      },
      {
        "id": "tvmaze:2669111",
        "title": "Sue Barker, Alan Titchmarsh, Philippa Perry",
        "season": 10,
        "episode": 4,
        "released": "2023-11-01",
        "overview": "A set of new celebrities strike a pose as the painters put their artistic flair to the test."
      },
      {
        "id": "tvmaze:2669113",
        "title": "Nigel Havers, Mishal Husain, Vanessa Kingori",
        "season": 10,
        "episode": 5,
        "released": "2023-11-08",
        "overview": "Three new guests strike a pose as the artists produce portraits to catch the eye of the judges."
      },
      {
        "id": "tvmaze:2674058",
        "title": "Josh Widdicombe, Nicky Spence, Shirley Ballas",
        "season": 10,
        "episode": 6,
        "released": "2023-11-15",
        "overview": "Josh Widdicombe, Nicky Spence, Shirley Ballas: A set of new celebrities enter the fore as the painters put their artistic flair to the test."
      },
      {
        "id": "tvmaze:2691041",
        "title": "Joe Sugg, Daryl McCormack, Lenny Rush",
        "season": 10,
        "episode": 7,
        "released": "2023-11-22",
        "overview": "Nine contestants take part in the seventh heat of the competition at Battersea Arts Centre, where the celebrity sitters are Joe Sugg, Daryl McCormack and Lenny Rush."
      },
      {
        "id": "tvmaze:2691042",
        "title": "Emma Bunton",
        "season": 10,
        "episode": 8,
        "released": "2023-11-29",
        "overview": "The semi-final stage arrives as the contestants create portraits of Spice Girls star Emma Bunton, with only three artists progressing to the final."
      },
      {
        "id": "tvmaze:2691043",
        "title": "Joan Bakewell",
        "season": 10,
        "episode": 9,
        "released": "2023-12-06",
        "overview": "The final of the competition to find the UK's most talented portrait artist, with the programme's presenter Joan Bakewell sitting for the three contenders hoing to win the £10,000 commission to paint a portrait of conservationist Jane Goodall."
      },
      {
        "id": "tvmaze:2691044",
        "title": "The Winner's Story",
        "season": 10,
        "episode": 10,
        "released": "2023-12-06",
        "overview": "Following the winner as they complete a £10,000 commission to paint conservationist Jane Goodall, which is then unveiled at the National Portrait Gallery."
      },
      {
        "id": "tvmaze:2706093",
        "title": "Best Of",
        "season": 10,
        "episode": 11,
        "released": "2023-12-13",
        "overview": "Look back on the best moments from the tenth season of Portrait Artist of the Year."
      },
      {
        "id": "tvmaze:3002667",
        "title": "Hannah Waddingham, Richard Madeley, Saskia Reeves",
        "season": 11,
        "episode": 1,
        "released": "2024-10-09",
        "overview": "To open this year's competition, we welcome actress, singer and all round national treasure Hannah Waddingham, along with veteran TV presenter Richard Madeley and Slow Horses star Saskia Reeves, to sit for our first round of artists."
      },
      {
        "id": "tvmaze:3009140",
        "title": "Cush Jumbo, Baaba Maal, Carly Paoli",
        "season": 11,
        "episode": 2,
        "released": "2024-10-16",
        "overview": "A fresh round of artists look to impress our judges in the second heat of this series, joined by this week's celebrity sitters -  actress and star of The Good Wife Cush Jumbo, Senegalese singer and guitarist Baaba Mal, and classically trained singer Carly Paoli."
      },
      {
        "id": "tvmaze:3014916",
        "title": "Dan Snow, Layton Williams, Steven Frayne (Dynamo)",
        "season": 11,
        "episode": 3,
        "released": "2024-10-23",
        "overview": "Stephen Mangan invites artists to paint celebrity sitters Dan Snow, Layton Williams and Steven Frayne as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3014917",
        "title": "Rosie Jones, Linton Kwesi Johnson, Andy Cole",
        "season": 11,
        "episode": 4,
        "released": "2024-10-30",
        "overview": "Stephen Mangan invites artists to paint celebrity sitters Rosie Jones, Linton Kewsi Johnson and Andy Cole. Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3014918",
        "title": "Lucy Worsley, Ricky Hatton, Musa Motha",
        "season": 11,
        "episode": 5,
        "released": "2024-11-06",
        "overview": "Stephen Mangan invites artists to paint celebrity sitters Lucy Worsley, Ricky Hatton and Musa Motha as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3042004",
        "title": "Jill Scott, Jimi Famurewa, Lyall Hakaraia",
        "season": 11,
        "episode": 6,
        "released": "2024-11-13",
        "overview": "Stephen Mangan invites artists to paint celebrity sitters Jill Scott, Jimi Famurewa and Lyall Hakaraia as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3042005",
        "title": "Heather Mills, Kevin McCloud, Martha Kearney",
        "season": 11,
        "episode": 7,
        "released": "2024-11-20",
        "overview": "Stephen Mangan invites artists to paint celebrity sitters Heather Mills, Kevin McCloud and Martha Kearney. Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3042006",
        "title": "Rebecca Taylor, Emma Thynn, Dr Karan Rajan",
        "season": 11,
        "episode": 8,
        "released": "2024-11-27",
        "overview": "The final heat sees Stephen Mangan inviting artists to paint celebrity sitters Rebecca Taylor, Emma Thynn and Karan Rajan as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge their efforts."
      },
      {
        "id": "tvmaze:3053913",
        "title": "Joely Richardson",
        "season": 11,
        "episode": 9,
        "released": "2024-12-04",
        "overview": ""
      },
      {
        "id": "tvmaze:3053914",
        "title": "Lorraine Ashbourne & Andy Serkis",
        "season": 11,
        "episode": 10,
        "released": "2024-12-11",
        "overview": "It's the grand final of the 2024 competition, where the top three finalists will battle for the title by capturing the essence of one of Britain's most iconic acting duos, Andy Serkis and Lorraine Ashbourne. Once the paint has dried, our judges will crown this year's winner, who along with the prestigious title of Portrait Artist of the Year, will earn a £10,000 commission to create a portrait of renowned broadcaster Lorraine Kelly to be exhibited at National Galleries Scotland: Portrait – with our cameras following their creative process."
      },
      {
        "id": "tvmaze:3071229",
        "title": "The Winner's Story",
        "season": 11,
        "episode": 11,
        "released": "2024-12-11",
        "overview": "Following the winner as they complete a £10,000 commission to paint a portrait of TV presenter Lorraine Kelly."
      },
      {
        "id": "tvmaze:3083326",
        "title": "Best of 2024",
        "season": 11,
        "episode": 12,
        "released": "2024-12-18",
        "overview": "A look back at the most memorable moments from the 11th series of the competition presented by Stephen Mangan."
      },
      {
        "id": "tvmaze:3377695",
        "title": "Alex Jones, Yungblud, Kyla Harris",
        "season": 12,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "Stephen Mangan returns with the competition to find the UK's most talented portrait artist, with Alex Jones, Yungblud and Kyla Harris the first celebrity sitters. Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the contestants' efforts."
      },
      {
        "id": "tvmaze:3377696",
        "title": "Si King, Elif Shafak, Joe Marler",
        "season": 12,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "Stephen Mangan invites the artists to paint celebrity sitters Si King, Elif Shafak and Joe Marler as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3395328",
        "title": "James May, Billy Porter, Emma Barnett",
        "season": 12,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "Stephen Mangan invites nine artists to paint celebrity sitters James May, Billy Porter and Emma Barnett as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3395329",
        "title": "Adjoa Andoh, Cat Burns, Clara Amfo",
        "season": 12,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "Stephen Mangan invites nine artists to paint celebrity sitters Adjoa Andoh, Cat Burns and Clara Amfo as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3395330",
        "title": "Melvin Odoom, Max Beesley, Emily Atack",
        "season": 12,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "Stephen Mangan invites nine artists to paint celebrity sitters Melvin Odoom, Max Beesley and Emily Atack as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts"
      },
      {
        "id": "tvmaze:3431454",
        "title": "Shane Lynch, Gabby Logan, Beth Rigby",
        "season": 12,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "Stephen Mangan invites nine artists to paint celebrity sitters Shane Lynch, Gabby Logan and Beth Rigby as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts."
      },
      {
        "id": "tvmaze:3431455",
        "title": "Jacob Collier, Fatiha El-Ghorri, Jack Dee",
        "season": 12,
        "episode": 7,
        "released": "2025-11-12",
        "overview": "The artists are challenged to capture on canvas the portrait of one of three celebrity sitters - Jacob Collier, Fatiha El-Ghorri and Jack Dee"
      },
      {
        "id": "tvmaze:3431456",
        "title": "Jack Rooke, Reece Clarke, Tim Peake",
        "season": 12,
        "episode": 8,
        "released": "2025-11-19",
        "overview": "Stephen Mangan invites nine artists to paint celebrity sitters Jack Rooke, Reece Clarke and Tim Peake as Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judge the efforts"
      },
      {
        "id": "tvmaze:3431457",
        "title": "Mary Berry",
        "season": 12,
        "episode": 9,
        "released": "2025-11-26",
        "overview": "Stephen Mangan presents as the semi-finalists paint celebrity sitter Mary Berry, with Tai Shan Schierenberg, Kathleen Soriano and Kate Bryan judging their efforts"
      },
      {
        "id": "tvmaze:3457123",
        "title": "Brian Cox",
        "season": 12,
        "episode": 10,
        "released": "2025-12-03",
        "overview": "Stephen Mangan hosts as the three finalists paint actor Brian Cox, with the winner earning a £10,000 commision to create a portrait of mathematician and broadcaster Hannah Fry."
      },
      {
        "id": "tvmaze:3457124",
        "title": "Winner's Film",
        "season": 12,
        "episode": 11,
        "released": "2025-12-03",
        "overview": "Following the victorious contestant as they undertake a commission from the Royal Society to paint mathematician and broadcaster Hannah Fry."
      }
    ]
  }
}