{
  "meta": {
    "id": "tvmaze:56",
    "type": "series",
    "name": "Chicago P.D.",
    "description": "District 21 of the Chicago Police Department is made up of two distinctly different groups. There are the uniformed cops who patrol the beat and go head to head with the city's street crimes. And there's the Intelligence Unit, the team that combats the city's major offenses - organized crime, drug trafficking, high profile murders and beyond. These are their stories.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/590/1475641.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/590/1475641.jpg",
    "videos": [
      {
        "id": "tvmaze:3428059",
        "title": "Good Old Desk",
        "season": 13,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2122",
        "title": "Stepping Stone",
        "season": 1,
        "episode": 1,
        "released": "2014-01-08",
        "overview": "After a slew of brutal slayings, District 21, led by Sergeant Hank Voight go after a Columbian drug cartel cleaning house in Chicago. They discover D'Anthony who proves to be an asset in the investigation. At District, complicated histories and unit rivalries surface which could end up costing them one of their own. Meanwhile, Rookie Kyle Ruzek is pulled from the police academy by Olinski to join the team."
      },
      {
        "id": "tvmaze:2123",
        "title": "Wrong Side of the Bars",
        "season": 1,
        "episode": 2,
        "released": "2014-01-15",
        "overview": "Antonio's son was kidnapped and he has a feeling the Columbian drug gang is to blame. Pulpo, the Columbian gang leader, is being held in jail and suggests his release may trigger the release of Diego. During the investigation, Halstead learns some new information about Lindsay. Voight offers Antonio a new approach to get information on Diego's whereabouts."
      },
      {
        "id": "tvmaze:2124",
        "title": "Chin Check",
        "season": 1,
        "episode": 3,
        "released": "2014-01-22",
        "overview": "Voight and team head to a house that's been associated with a number of top gangs. Events at the search result in Ruzek, being encouraged to seek some counseling which may have lasting repercussions professionally and personally. Meanwhile Halstead's temper rises when he comes in contact with some unwelcomed people from his past."
      },
      {
        "id": "tvmaze:2125",
        "title": "Now is Always Temporary",
        "season": 1,
        "episode": 4,
        "released": "2014-01-29",
        "overview": "More is learned about Halstead's dislike of the Rodiger family and it's family relationships all around as Olinsky shows a paternal side with his daughter Lexi in an attempt to protect her and as Voight's trying to help his son who has recently been released from jail. Meanwhile the Intelligence Unit investigates a counterfeiting operation after discovering some high end cloth-like paper. Sergeant Platt sends Atwater and Burgess to arrest a hoarder where they discover more than just clutter."
      },
      {
        "id": "tvmaze:2126",
        "title": "Thirty Balloons",
        "season": 1,
        "episode": 5,
        "released": "2014-02-05",
        "overview": "Atwater and Burgess are given a new patrol car, but are challenged with keeping it brand new. A run in with a psychotic woman leads the Intelligence Unit to discover a drug smuggling operation which has put several girl's lives in peril. Voight's overprotective act with Lindsay leads her right where he doesn't want as she also helps to keep Justin out of trouble. Meanwhile on stakeout, things get tense between Olinsky and Ruzek as Olinski tries to teach him the finer points of surveillance."
      },
      {
        "id": "tvmaze:2127",
        "title": "Conventions",
        "season": 1,
        "episode": 6,
        "released": "2014-02-26",
        "overview": "Voight and Antonio enlist the help of agents at the Special Victims Unit in New York, Fin and Rollins, to help track down the culprit of a series of rape/murders. Burgess has an opportunity to prove herself to Intelligence. Elsewhere Lindsay enlists the help of Halstead to act as her date for her high school reunion to get back at an old rival."
      },
      {
        "id": "tvmaze:2128",
        "title": "The Price We Pay",
        "season": 1,
        "episode": 7,
        "released": "2014-03-05",
        "overview": "The Fitori murder case is brought to the intelligence unit and Voight's son, Justin, may be involved. Gradishar fills Antonio in on the arrangement between Internal Affairs and Voight which increases friction between Voight and Antonio. Back at the precinct Ruzek helps Burgess get back at desk sergeant Platt."
      },
      {
        "id": "tvmaze:2129",
        "title": "Different Mistakes",
        "season": 1,
        "episode": 8,
        "released": "2014-03-12",
        "overview": "Voight is assigned a new Internal Affairs handler, Stillwell who proves to be suspicious of Voight's actions. During an investigation involving a gambling ring Voight is forced to work with his former partner from the Gang Unit, Shi. At the same time Halsted remains fixated on Lonnie Rodiger and enlists Jin's help to gather more information. Meanwhile, Ruzek's inflated ego leads Olinsky to take him down a peg and offer a great opportunity to Atwater."
      },
      {
        "id": "tvmaze:2130",
        "title": "A Material Witness",
        "season": 1,
        "episode": 9,
        "released": "2014-03-19",
        "overview": "In responding to a call Atwater and Burgess discover a gunshot victim and the only witness is Lexi Olinsky. The shooting is tied to a Latin gang. To protect Olinsky's daughter, Voight takes the case from the Gang Unit. Ruzek pulls up Burgess to help with an undercover mission that he hopes will help solve the case."
      },
      {
        "id": "tvmaze:2131",
        "title": "At Least It's Justice",
        "season": 1,
        "episode": 10,
        "released": "2014-04-02",
        "overview": "Voight pulls Halstead's badge when Lonnie Rodiger is found dead. After a car accident Severide and Clarke discover the torso of Dr. Elliot who has been instrumental in putting away high profile criminals. With Intelligence down one Sumner is given an opportunity to prove herself. Meanwhile during all the investigation Lindsay and Severide share a moment."
      },
      {
        "id": "tvmaze:2132",
        "title": "Turn the Light Off",
        "season": 1,
        "episode": 11,
        "released": "2014-04-09",
        "overview": "Voight and the team discover a massacre, eight million in cash stolen and two wounded men in a clearing house. During questioning, one guy, Perko, provides some intel that is key to the case and leads Antonio to realize that two gangs were involved. Burgess steps up to help the unit and prove herself to Voight. Meanwhile, a softer light is cast on Platt when she enlists the help of Ruzek."
      },
      {
        "id": "tvmaze:2133",
        "title": "8:30 PM",
        "season": 1,
        "episode": 12,
        "released": "2014-04-30",
        "overview": "The Intelligence Unit works to find the bombers. Even with government agencies in the mix, Voight and his team work the case from their own angles and connections. Lindsay and Antonio question doctors who handled the transplant surgery for an Ambassador from Syria, but no clues emerge. Olinsky gets some solid intel and the team work from there. It's a race against time as they realize there may be additional bombs targeted to detonate. Meanwhile Burgess sits vigil for her niece whose life hangs in the balance."
      },
      {
        "id": "tvmaze:2134",
        "title": "My Way",
        "season": 1,
        "episode": 13,
        "released": "2014-05-07",
        "overview": "Commander Perry notifies the Intelligence unit that Pulpo has been released to help track down a dangerous cartel leader. This doesn't sit well with our team as he kidnapped one of their own and no love is lost between sides. Meanwhile, Ruzek gets some difficult news as a blast from Lindsay's past comes back, giving us a glimpse at where she came from. Voight reminds her that she's come too far to screw it up. At the same time we learn something about Jin that is bound to be a problem."
      },
      {
        "id": "tvmaze:2135",
        "title": "The Docks",
        "season": 1,
        "episode": 14,
        "released": "2014-05-14",
        "overview": "As Antonio's life is now in question, Voight and Platt open up about their pasts. Jin is caught while tinkering with Voight's computer and uses the only scapegoat possible to keep him in the clear. At the same time with Charlie back in town Lindsay realizes she's going to have to come clean about a few things. Halstead finally gets answers he's been wanting about Voight's and Olinsky's past."
      },
      {
        "id": "tvmaze:2136",
        "title": "A Beautiful Friendship",
        "season": 1,
        "episode": 15,
        "released": "2014-05-21",
        "overview": "Atwater is settling into his new gig on intelligence as Antonio is relegated to desk duty while recovering. Lindsay finally realizes she has no way out and confides in Voight for help. Meanwhile Jin is confronted about his secret meetings with Stillwell. It all comes to a head in the season finale."
      },
      {
        "id": "tvmaze:2137",
        "title": "Call It Macaroni",
        "season": 2,
        "episode": 1,
        "released": "2014-09-24",
        "overview": "In the season premiere, as the Sheldon Jin murder investigation moves forward, Voight is under close watch by Internal Affairs but he's still in complete command of the intelligence unit. A routine undercover job becomes anything but when Voight's SUV is T-boned while trailing an armored car carrying Ruzek. At District, Burgess meets her new partner, Sean Roman and tension is high from the start. Soon she realizes there's more to his story. After a long day, Lindsay pays a visit to someone she hasn't seen in a very long time - her mom, Bunny."
      },
      {
        "id": "tvmaze:2138",
        "title": "Get My Cigarettes",
        "season": 2,
        "episode": 2,
        "released": "2014-10-01",
        "overview": "Intelligence begins to look into a string of murders where the victims have a dollar bill pinned to their chests. Thanks to some digging by Ruzek , Voight learns his friend was involved in some shady business dealings. Antonio and Halstead follow-up on some leads that help focus in on the culprit and motives for the murders. Meanwhile, Burgess and Roman investigate a series of house break-ins and get some help from Desk Sgt. Platt."
      },
      {
        "id": "tvmaze:2139",
        "title": "The Weigh Station",
        "season": 2,
        "episode": 3,
        "released": "2014-10-08",
        "overview": "The bounty on Halstead's head becomes a serious reality as an innocent bartender takes a bullet meant for him. Olinsky tries to reason with Bembenek to call off the hit, but to no avail. Voight and the team keep this investigation in-house to find the hired assassin. Meanwhile, after a tense interaction at district Platt and Nadia come to an understanding."
      },
      {
        "id": "tvmaze:2140",
        "title": "Chicken, Dynamite, Chainsaw",
        "season": 2,
        "episode": 4,
        "released": "2014-10-15",
        "overview": "Two teenage girls have gone missing and the team know the clock is ticking to find them. Halstead, Antonio and Lindsay investigate a tenement which gives them a much needed lead. Voight brings the father of one of the girls to district in order to get some honest answers. Meanwhile, Platt puts Roman and Burgess on gun buy-back duty where they ask questions when they aren't supposed to."
      },
      {
        "id": "tvmaze:2141",
        "title": "An Honest Woman",
        "season": 2,
        "episode": 5,
        "released": "2014-10-22",
        "overview": "While trying to help out Olive Voight is attacked and taken. When he doesn't show for work the team gets suspicious and begin investigating. Ruzek and Atwater prove they do belong on the team when they demonstrate smarts and savvy tracking down a lead that will hopefully bring them to Voight. Meanwhile Burgess and Roman are trying to track down a girl who has run off with a police badge."
      },
      {
        "id": "tvmaze:2142",
        "title": "Prison Ball",
        "season": 2,
        "episode": 6,
        "released": "2014-11-05",
        "overview": "Following the death of a 10-year old girl the intelligence unit have one option to gain access to their suspect, go on the inside. Ruzek and Atwater act as inmates to work the case from the inside. Outside prison, Voight and Olinsky follow-up on a good lead to answer some questions about the shooting. Meanwhile, Burgess and Roman show three boys around district thinking they are part of the Police Explorers program, only to realize that's not quite the case."
      },
      {
        "id": "tvmaze:6920",
        "title": "They'll Have to Go Through Me",
        "season": 2,
        "episode": 7,
        "released": "2014-11-12",
        "overview": "The final part of the crossover event finds our intelligence unit joined by detectives from New York's special victims unit to help solve the pedophile ring case. Ruzek and Det. Amaro along with Halstead and Antonio continue to hunt for the link to foster care and child trafficking. Meanwhile Burgess and Roman try to find the shooter from the hospital after using surveillance footage to identify him. Platt shows her deep respect for police and the dangerous work they do by honoring their fallen brother."
      },
      {
        "id": "tvmaze:28363",
        "title": "Assignment of the Year",
        "season": 2,
        "episode": 8,
        "released": "2014-11-19",
        "overview": "While Antonio continues his off-duty security job for Asher and Layla, Asher is killed. Voight and Olinsky make sure Antonio is covered. While they work the case Halstead and Lindsay go undercover in a rather uncomfortable location. Kot shows up to ask Lindsay for an answer."
      },
      {
        "id": "tvmaze:46971",
        "title": "Called in Dead",
        "season": 2,
        "episode": 9,
        "released": "2014-12-10",
        "overview": "A friend of Nadia's leads the intelligence unit to a huge heroin bust. Unfortunately this bust results in Olinsky arriving home to find the suspects are holding his wife. Voight and the team think they've found a common thread with the suspects but it's not who they think. Meanwhile Burgess and Roman are given an assignment where they get paired with a K-9 officer, Jenn Cassidy who is Roman's former partner and girlfriend."
      },
      {
        "id": "tvmaze:57565",
        "title": "Shouldn't Have Been Alone",
        "season": 2,
        "episode": 10,
        "released": "2015-01-07",
        "overview": "With Burgess in the hospital after suffering gunshot wounds, the intelligence team is determined to find the people responsible. Lindsay delays her start so she can help with this case. Search of the house provides a lead and when a bomb is triggered a key suspect is found. Meanwhile the team takes turns watching over Burgess. Voight informs Burgess of a new opportunity that this affords her."
      },
      {
        "id": "tvmaze:107045",
        "title": "We Don't Work Together Anymore",
        "season": 2,
        "episode": 11,
        "released": "2015-01-14",
        "overview": "Lindsay has her first case with the task force and realizes she needs to call on Voight and the Intelligence unit to assist. Meanwhile Burgess is back on the job, but relegated to desk duty which allows Desk Sgt. Platt the opportunity to partner up with Roman."
      },
      {
        "id": "tvmaze:107046",
        "title": "Disco Bob",
        "season": 2,
        "episode": 12,
        "released": "2015-01-21",
        "overview": "Bob Ruzek is the first to arrive on the scene of a double murder. Intelligence arrives to take over the investigation tensions arise as Bob needs to hand over the case to his son and Voight. Lindsay's new gig has her planning a trip to Bolivia for an undercover investigation that could be for an extended amount of time. Burgess and Roman realize they need to put past events behind them so it doesn't jeopardize them going forward."
      },
      {
        "id": "tvmaze:109548",
        "title": "A Little Devil Complex",
        "season": 2,
        "episode": 13,
        "released": "2015-02-04",
        "overview": "Antonio and his sister Gabriela go to the office of Elliot Gish, the man they believe started the fire that killed Shay. Intelligence along with patrol officers Burgess and Roman put pressure on Gish to try and make him confess. Lindsay approaches Voight about returning to Intelligence when she realizes that the task force isn't what she thought it would be. At the same time Desk Sgt. Platt is acting strange and has everyone curious as to why she's being overly cheery, friendly and nice."
      },
      {
        "id": "tvmaze:117531",
        "title": "Erin's Mom",
        "season": 2,
        "episode": 14,
        "released": "2015-02-11",
        "overview": "Bunny comes to Lindsay concerned about a suspicious repeat customer at her husband's rental company. This lead brings Intelligence into a case which robbery-homicide has been working for months. Detective Gina Gawronski downloads their intel to the team, she also happens to be Antonio's former co-worker from Vice. Voight doesn't trust Bunny's motives for the tip."
      },
      {
        "id": "tvmaze:117532",
        "title": "What Do You Do",
        "season": 2,
        "episode": 15,
        "released": "2015-02-18",
        "overview": "With her recent decision to stay on the beat, Burgess begins to feel a little regret. While at a convenience store she sees some suspicious activity and pursues it without calling in for backup. Roman warns against it, but it's too late, they chase the suspect (Chang) into a warehouse and confiscates their guns and radios. They are trapped with no means to communicate out for support. Meanwhile, it's a slow day in intelligence and they are spending the day receiving taser certification."
      },
      {
        "id": "tvmaze:117533",
        "title": "What Puts You on That Ledge",
        "season": 2,
        "episode": 16,
        "released": "2015-02-25",
        "overview": "Commander Fischer updates Voight on a missing officer that Narcotics had deep undercover with a robbery crew. Antonio connected with one of the crew members years ago, so he's asked to reestablish contact to help them find the officer. Meanwhile, Roman and Burgess are dealing with a squatter situation and they enlist Chicago Fire's Mouch to help."
      },
      {
        "id": "tvmaze:139550",
        "title": "Say Her Real Name",
        "season": 2,
        "episode": 17,
        "released": "2015-03-25",
        "overview": "With a World Trade conference in Chicago, all members of intelligence are undercover in various protest groups to determine potential threats. Ruzek, infiltrates the Black Grid group and befriends Sierra. When she ends up dead intelligence is suspicious of an Argentine Secretary, Fabian Sosa. Voight and Olinsky question Sosa about the death and the team enlists Mouse to help with their tech needs in tracking Sosa. Meanwhile Halstead's brother, Dr. Will Halstead shows up in town for an undetermined amount of time and is already stirring up trouble."
      },
      {
        "id": "tvmaze:144326",
        "title": "Get Back to Even",
        "season": 2,
        "episode": 18,
        "released": "2015-04-01",
        "overview": "Intelligence responds to a drug robbery gone wrong and in their investigation it's revealed that the first person Voight ever gave his card to is linked to a double murder. Voight will fight to keep her family safe. At the same time, we learn the real reason why Halstead's brother Will came to Chicago. Meanwhile Desk Sgt. Platt takes care of a young girl at district."
      },
      {
        "id": "tvmaze:144327",
        "title": "The Three G's",
        "season": 2,
        "episode": 19,
        "released": "2015-04-08",
        "overview": "When the father of one of the dead girls explains that he paid Dennis Lee to have her brought to America, this hits home with Olinsky. Lee is one of the Chicago's most wanted fugitives and escaped Olinsky once before. Intelligence isn't about to let Lee dupe them again and Olinsky's past files prove valuable in finding Lee's whereabouts. Meanwhile, Sean Roman has an altercation with a fellow officer which lands him in a bit of trouble. At the same time Platt helps prepare Nadia to take her polygraph test after passing the CPD written exam."
      },
      {
        "id": "tvmaze:152995",
        "title": "The Number of Rats",
        "season": 2,
        "episode": 20,
        "released": "2015-04-29",
        "overview": "Benson has traveled into Chicago to help Voight and intelligence with a rape/murder case that is frighteningly similar to a case from New York a decade ago. She calls in Fin and Amaro to assist. The prime suspect, Yates is let go after rigorous questioning. He then requests a meeting with Lindsay and he warns of unintended consequences from what intelligence is doing."
      },
      {
        "id": "tvmaze:152996",
        "title": "There's My Girl",
        "season": 2,
        "episode": 21,
        "released": "2015-05-06",
        "overview": "As District 21 is struggling to come to terms with the loss of one of the team they are forced to put their personal feelings aside when a café is bombed. The unit has several suspects and only one good eye-witness, who happens to be a minor. Halstead pulls some strings to convince the mom to let him question Isabella on what she saw. Atwater finds himself in hot water when he makes a crucial mistake. Thanks to the tech savvy Mouse the team is able to gain important intel that could help solve the case. Meanwhile Voight helps Platt when she comes up against several roadblocks in an attempt to get a memorial stone for their fallen member."
      },
      {
        "id": "tvmaze:142329",
        "title": "Push the Pain Away",
        "season": 2,
        "episode": 22,
        "released": "2015-05-13",
        "overview": "When multiple people are shot inside an athletic club intelligence work to find and take down the shooters before there's any more victims. When they discover that all the targets were from the same law firm it's apparent that it is a case of corporate revenge. Now they need to find out what the motive for these killings. Atwater is dealing with his new assignment, while doing so he plays a key role in locating the shooters. Meanwhile Platt and Halstead are trying to approach Lindsay to see how she's coping with a recent death."
      },
      {
        "id": "tvmaze:153263",
        "title": "Born Into Bad News",
        "season": 2,
        "episode": 23,
        "released": "2015-05-20",
        "overview": "Retired Commander Perry enlists Voight and the team to help extract his cop nephew from a unit of corrupt officers who are robbing drug dealers. When things go bad Voight must take down a younger, more violent version of himself. Meanwhile, Lindsay struggles to stay clean. At the same time a woman from Olinsky's past reaches out to him."
      },
      {
        "id": "tvmaze:181897",
        "title": "Life is Fluid",
        "season": 3,
        "episode": 1,
        "released": "2015-09-30",
        "overview": "Intelligence is in pursuit of Derek Keyes, number one on Chicago's Most Wanted list and heroin kingpin. Meanwhile, Halstead tries to get through to Lindsay as her downward spiral continues after her three-week absence from the unit. At District, Olinsky opens up to Platt about a secret from his past. Roman expresses his concerns to Burgess about what she's getting into by marrying Ruzek."
      },
      {
        "id": "tvmaze:206505",
        "title": "Natural Born Storyteller",
        "season": 3,
        "episode": 2,
        "released": "2015-10-07",
        "overview": "While pursuing a gangbanger, Burgess and Roman come across the body of an eight-year-old boy who was reported missing. Intelligence launches an investigation to find the killer and Antonio and Lindsay question a prime suspect. Meanwhile, Burgess confides in Ruzek about Roman's suspicious behavior and Bunny heads to the Ivory Tower with a statement that could be detrimental to Voight's career."
      },
      {
        "id": "tvmaze:206506",
        "title": "Actual Physical Violence",
        "season": 3,
        "episode": 3,
        "released": "2015-10-14",
        "overview": "While Platt tries to manage a chaotic desk area, a man struggling to get her attention takes a drastic action and demands that the unit find his missing daughter. At the same time, Commander Fischer informs Voight that Bunny is bringing up new accusations on a case from his past. Lindsay urges her mother to fix the situation. Meanwhile, Antonio is shocked to learn a secret Olinksy has been keeping."
      },
      {
        "id": "tvmaze:206507",
        "title": "Debts of the Past",
        "season": 3,
        "episode": 4,
        "released": "2015-10-21",
        "overview": "After surviving a hit against him, Voight is convinced the culprit is a criminal he and Olinksy once put away and is determined to catch him before he injures anyone else. At District, Atwater accidentally spills information about Ruzek's past which unsettles Burgess and Platt assigns Burgess and Roman a high society dognapping case."
      },
      {
        "id": "tvmaze:206508",
        "title": "Climbing Into Bed",
        "season": 3,
        "episode": 5,
        "released": "2015-10-28",
        "overview": "After a botched undercover job, Ruzek is under scrutiny by the new Street Deputy Crowley who will determine his future with the unit. A suspicious person call turns into a murder investigation when Burgess and her temporary partner Price discover the body of a dead man in an SUV. After Mouse identifies the victim as the owner of a security company, the unit soon realizes there might be more to his story. Halstead and Lindsay take a step forward in their relationship."
      },
      {
        "id": "tvmaze:260876",
        "title": "You Never Know Who's Who",
        "season": 3,
        "episode": 6,
        "released": "2015-10-28",
        "overview": "After a botched undercover job, Ruzek is under scrutiny by the new Street Deputy Crowley who will determine his future with the unit. A suspicious person call turns into a murder investigation when Burgess and her temporary partner Price discover the body of a dead man in an SUV. After Mouse identifies the victim as the owner of a security company, the unit soon realizes there might be more to his story. Halstead and Lindsay take a step forward in their relationship."
      },
      {
        "id": "tvmaze:260880",
        "title": "A Dead Kid, a Notebook and a Lot of Maybes",
        "season": 3,
        "episode": 7,
        "released": "2015-11-04",
        "overview": "Intelligence sets out to find a missing teenaged boy who they believe poses a serious threat to the students at his wealthy school after finding disturbing drawings in his notebook. Meanwhile, Atwater is eager to make a good impression on a prominent African American police Captain and Olinsky and Michelle find themselves in a difficult situation and turn to Ruzek and Burgess for help."
      },
      {
        "id": "tvmaze:260881",
        "title": "Forget My Name",
        "season": 3,
        "episode": 8,
        "released": "2015-11-11",
        "overview": "When Intelligence follows up on a tip Antonio and Halstead received from a reliable informant about an upcoming drug trade, the team is shocked to discover the mutilated body of a man. Upon further investigation, the body is identified as a government official and when Olinksy, Ruzek, Lindsay and Halstead question the man's acquaintances they discover he had access to very important devices. Meanwhile, Burgess helps plan a surprise for Platt."
      },
      {
        "id": "tvmaze:362939",
        "title": "Never Forget I Love You",
        "season": 3,
        "episode": 9,
        "released": "2015-11-18",
        "overview": "When the decapitated body of a woman found in Lake Michigan is connected to Voight's social circle, Lindsay fears his relationship with the group may hinder his ability to approach the case objectively. Roman is having a hard time coping with recent events and an error in judgment causes him to make a grave mistake."
      },
      {
        "id": "tvmaze:526411",
        "title": "Now I'm God",
        "season": 3,
        "episode": 10,
        "released": "2016-01-06",
        "overview": "A doctor with personal connections to Voight is under investigation when four of his patients are committed to Chicago Med after an overdose of chemo. The doctor denies Lindsey and Halstead access to his files, but after obtaining a warrant the team is able to track down his patients and discover all of them have been poisoned with unnecessary chemo. Meanwhile, Burgess and Platt work together to clear Roman's name."
      },
      {
        "id": "tvmaze:541977",
        "title": "Knocked the Family Right Out",
        "season": 3,
        "episode": 11,
        "released": "2016-01-13",
        "overview": "After a luxury condo is robbed, the team is shocked to learn that not only was the family fast asleep when the crime occurred, but their teenaged daughter was violated during the invasion as well. Voight consults Jimmy from Firehouse 51 to confirm his suspicion that the family was knocked out by a powerful gas and Lindsay, Halstead, Atwater and Ruzek go undercover to seek out the perpetrators. Meanwhile, Voight tries to help a former acquaintance get back on his feet and Platt and Mouch receive disappointing news regarding their upcoming wedding."
      },
      {
        "id": "tvmaze:549806",
        "title": "Looking Out for Stateville",
        "season": 3,
        "episode": 12,
        "released": "2016-01-20",
        "overview": "Voight convinces Deputy Crowley to bring in his former cellmate, Eddie Little, as a CI for the unit in order to help bring down a big-time cocaine supplier and his local dealers. Antonio is skeptical of this decision but Voight puts him at ease when he opens up about his time in prison with Little. Meanwhile, Burgess makes a difficult decision regarding her relationship with Ruzek and Roman devises a plan to help fund Platt and Mouch's wedding with the help of Firehouse 51."
      },
      {
        "id": "tvmaze:567161",
        "title": "Hit Me",
        "season": 3,
        "episode": 13,
        "released": "2016-02-03",
        "overview": "Lindsay goes undercover in an effort to track down a rogue police officer targeting women leaving a local casino. When Detective Martin Watts, who oversees all cases out of the casino, gets word of the investigation he becomes involved much to Voight's dismay. After recent events, Burgess sets plans in motion to transfer Districts pending Platt's approval and Mouse attempts to lift Ruzek's spirits by offering to set him up with a friend. Meanwhile, Antonio volunteers to take Roman's place in the upcoming boxing match against Jimmy from Firehouse 51."
      },
      {
        "id": "tvmaze:577010",
        "title": "The Song of Gregory Williams Yates",
        "season": 3,
        "episode": 14,
        "released": "2016-02-10",
        "overview": "After infamous criminal Gregory Yates escapes from a New York prison, Lindsay and the team learn that he intends to flee New York and is headed for Chicago. The SVU team informs Intelligence that Yates has been gathering information on Lindsay and after Platt calls in a triple homicide likely at the hand of Yates, Benson and Fin catch the next plane to Chicago. Upon investigation of the crime scene, the team learns that another tenant in the building is missing and they work to find a connection between Yates and the woman."
      },
      {
        "id": "tvmaze:585212",
        "title": "A Night Owl",
        "season": 3,
        "episode": 15,
        "released": "2016-02-17",
        "overview": "While working at a sobriety checkpoint, Burgess finds a duffel bag full of heroin in the truck of a respected college professor who claims to know nothing about how the drugs ended up there. Voight decides to hold off on charging the unlikely suspect and Olinksy and Antonio follow up on a lead to see who is behind the drug smuggling. At District, Roman expresses his desires to become a Field Training Office to Platt and Mouse sets Halstead up with an off-duty security job working for the attractive owner of a medical marijuana clinic."
      },
      {
        "id": "tvmaze:596856",
        "title": "The Cases That Need to Be Solved",
        "season": 3,
        "episode": 16,
        "released": "2016-02-24",
        "overview": "When a young boy is executed, Intelligence turn to the boy's parents for information and upon further investigation, discover the father has a criminal background and was a part of a local gang. After another shooting in gang territory, this time nonfatal, Lindsay and Halstead speak to the victim's mother to see if the two crimes are related and Mouse works to find a connection. To honor the deceased young victim, Antonio, Platt, Roman, Burguess, Mouse and a number of other CPD officers and members of the community come together for a candlelight vigil."
      },
      {
        "id": "tvmaze:608543",
        "title": "Forty-Caliber Bread Crumb",
        "season": 3,
        "episode": 17,
        "released": "2016-03-02",
        "overview": "While out on a bank run for his off-duty security job at the dispensary, Halstead and his co-workers find themselves under attack by a violent robbery crew which quickly becomes a full-scale shootout. Voight and Lindsay question the owner of the dispensary who mentions her business has received threats from local gangs upset she's cutting into their revenue. Meanwhile Roman, Burgess, Antonio, Halstead, Ruzek and Atwater follow-up on a lead and track down a potential suspect."
      },
      {
        "id": "tvmaze:633513",
        "title": "Kasual with a K",
        "season": 3,
        "episode": 18,
        "released": "2016-03-23",
        "overview": "While responding to a call of shots fired, Voight, Antonio, Halstead and the team come across a secret battered woman's shelter and discover the owner has been wounded and a resident of the shelter has been kidnapped. The team faces a challenge as the gunman is still at large and the identities of the women are kept confidential. Meanwhile, Burgess and Roman go undercover to track down a man robbing people by catfishing them on a dating app and Lindsay opens up to Halstead about her past"
      },
      {
        "id": "tvmaze:644508",
        "title": "If We Were Normal",
        "season": 3,
        "episode": 19,
        "released": "2016-03-30",
        "overview": "When a call comes in about a woman stabbing a man then fleeing the scene, Burgess and Lindsay go investigate and find a young woman with the weapon in her hand. The suspect turns out to be a victim and she tells Olinsky that she was held hostage for months and her kidnapper attempted to psychologically manipulate her into forgetting her identity while he physically abused her. The team sets out to find the woman's abductor before he can harm anyone else. Meanwhile, tensions are high at the station when Ruzek accuses Roman of having feelings for Burgess."
      },
      {
        "id": "tvmaze:650455",
        "title": "In a Duffel Bag",
        "season": 3,
        "episode": 20,
        "released": "2016-05-04",
        "overview": "Responding to a call about a suspicious duffle bag at the Chicago Lakefront, Voight is horrified to discover that the bag contains the frigid and unmoving body of a newborn baby. Determined to find the culprit who abandoned the infant, Intelligence receives a promising lead based on information provided by Chicago Med and Ruzek helps zero in on a potential suspect. Meanwhile, Voight is surprised to hear that his son is in town and Burgess and Roman grow closer."
      },
      {
        "id": "tvmaze:650456",
        "title": "Justice",
        "season": 3,
        "episode": 21,
        "released": "2016-05-11",
        "overview": "After a hooded man open fires on their patrol car, Roman is left wounded and Burgess takes off after the shooter, briefly losing sight of him, and shoots when she relocates him turning in her direction with a glimmer of silver in his hand. No gun has been found at the crime scene and the shooter is identified as a 17-year-old honor student who will likely never walk again due to his injuries. Protests begin as the public views the case as another incidence of a police officer shooting an unarmed African American teenager. Assistant State Attorney Peter Stone, the same man who sent Voight to prison, has been assigned to help defend Burgess and conduct his own investigation under the supervision of State Attorney Mark Jefferies. Stone and his team need to collect enough evidence to indict the teen and clear Burgess, but must tread with caution on this high profile case as tensions run high."
      },
      {
        "id": "tvmaze:666137",
        "title": "She's Got Us",
        "season": 3,
        "episode": 22,
        "released": "2016-05-18",
        "overview": "While responding to a call of shots fired at a family residence, Lindsay and Halstead discover the only survivor is the youngest daughter who is traumatized. While Lindsay and Dr. Charles evaluate the girl and see if she can help identify the killer, Antonio and Olinsky look into a pyramid scheme \"self-help\" group for potential suspects. Meanwhile, Platt tries to make the case to Commander Crowley for Burgess and Roman to remain partners."
      },
      {
        "id": "tvmaze:666138",
        "title": "Start Digging",
        "season": 3,
        "episode": 23,
        "released": "2016-05-25",
        "overview": "When the team finds the body of a widowed, single-mother in the trunk of her car, they are shocked to discover that the victim was in constant contact with Voight's now-reformed son, Justin. After Lindsay and Voight find Justin has been attacked in the same manor and is critically injured, Antonio and the team know that Voight will be out for revenge. Meanwhile, Roman makes a difficult decision and Commander Crowley has plans to make changes within the unit."
      },
      {
        "id": "tvmaze:806726",
        "title": "The Silos",
        "season": 4,
        "episode": 1,
        "released": "2016-09-21",
        "overview": "Intelligence investigates a gruesome case. Upon further examination, it appears the victim was wearing a CPD-issued wire at the time of his death. Meanwhile, Burgess meets her new partner, Julie Tay, who came from one of the worst assignments in the city. Together they respond to their first call, and Tay shares details of her past. Additionally, Commander Crowley confronts Lindsay about why she and Voight were at that location on the night that Intelligence pursued Justin's killer."
      },
      {
        "id": "tvmaze:854960",
        "title": "Made a Wrong Turn",
        "season": 4,
        "episode": 2,
        "released": "2016-09-28",
        "overview": "When a call comes in reporting a car being stripped, Burgess and Tay respond and discover a badly beaten young man and his fiancé missing. Fearing a public relations nightmare Voight and the team are on their best behavior as they search for answers and the missing woman. At the same time, Lindsay surprises Halstead with a big question. Commander Fogel berates Platt for going over his head to have Tay assigned to District 21."
      },
      {
        "id": "tvmaze:929395",
        "title": "All Cylinders Firing",
        "season": 4,
        "episode": 3,
        "released": "2016-10-05",
        "overview": "When Platt goes to her father Robert's house for dinner, she warns him to be careful with his new girlfriend Natalie. Following dinner, Platt is physically assaulted as she's getting into her car and is rushed to Chicago Med. Voight, Lindsay and Halstead arrive at the hospital to investigate, and a concerned Mouch finds himself being questioned. Meanwhile, Antonio leads the rest of Intelligence at the scene as they look into previous threats against Platt, but his attention shifts when he is called into Robert's townhouse and finds signs of an even more gruesome attack on Platt's father."
      },
      {
        "id": "tvmaze:854962",
        "title": "Big Friends, Big Enemies",
        "season": 4,
        "episode": 4,
        "released": "2016-10-12",
        "overview": "When a car plows through a crowd of concert goers and gunfire erupts, Lindsay and Ruzek are on the scene. Unsure of the motive and concerned a terrorist group may be responsible, Voight orders in Homeland security, customs and the F.B.I. to assist. At the same time, Burgess spots Atwater's brother, Jordan, out where he shouldn't be. The team use their connections to throughout the city to bring some peace to the community before more blood is shed."
      },
      {
        "id": "tvmaze:854961",
        "title": "A War Zone",
        "season": 4,
        "episode": 5,
        "released": "2016-10-26",
        "overview": "Intelligence is tasked with tracking down the dealers of fentanyl - a drug that has been linked to multiple overdoses around the city. As they investigate possible sources, the team uncovers a series of dealers in a college smuggling ring. Meanwhile, Tay and Burgess come across a bloodied child who exposes a dark and twisted secret about his home life with his parents. Additionally, Mouse causes tension as he looks to reenlist in the army, and Platt tells Tay that she has been reassigned to her original post."
      },
      {
        "id": "tvmaze:980980",
        "title": "Some Friend",
        "season": 4,
        "episode": 6,
        "released": "2016-11-09",
        "overview": "After receiving a complaint from a frustrated neighbor, Burgess and Officer Sorensen arrive to the house of baseball player Jake McCoy, and find the dead body of a 16-year-old girl, Maya Collins. There is conflict within the case as Intelligence learns that Olinsky and McCoy are friends, and McCoy admits that he was helping Maya and other girls try to escape the sex trade. Meanwhile, Burgess and Sorensen track down a thief who turns out to be a cop with a rocky past, and Lindsay gets a mysterious flower delivery that may be tied to her past."
      },
      {
        "id": "tvmaze:939013",
        "title": "300,000 Likes",
        "season": 4,
        "episode": 7,
        "released": "2016-11-16",
        "overview": "Voight calls the team to investigate a homicide involving the only witness in a rape and murder case against an extremely young man, Oliver Tuxhorn. Intelligence looks into Tuxhorn's family and their finances as they try to determine if someone was paid to take out the victim. Meanwhile, Stone offers Antonio a job as lead investigator for the state attorney's office, and Burgess and Sorensen's body cameras capture a bizarre exchange with a man that they pull over."
      },
      {
        "id": "tvmaze:952246",
        "title": "A Shot Heard Round the World",
        "season": 4,
        "episode": 8,
        "released": "2016-11-16",
        "overview": "When a young officer is shot dead in the lobby of an apartment building, Intelligence looks to the latest known offenders who have threatened the police. But when a second officer is killed, the team finds that they are dealing with someone who is highly trained and knowledgeable. Voight works to keep the case contained as they deal with Chicago's ever-present war against the police. Meanwhile, Lindsay confronts Antonio about his new job with the State's Attorney."
      },
      {
        "id": "tvmaze:1006522",
        "title": "Don't Bury This Case",
        "season": 4,
        "episode": 9,
        "released": "2017-01-03",
        "overview": "Severide is brought into the District for questioning after his car is found to have caused a deadly crash. As the investigation gets underway, the team works to uncover a group of car-jackers who may be the key to Severide's innocence. Meanwhile, Voight pairs Burgess with Olinsky, who has a hard time feigning his excitement about this new partnership, and Lindsay considers meeting her estranged father who is now out of prison."
      },
      {
        "id": "tvmaze:981757",
        "title": "Don't Read the News",
        "season": 4,
        "episode": 10,
        "released": "2017-01-04",
        "overview": "After the body of young woman is found with multiple gunshot wounds, Intelligence uncovers details of her case that are similar to other deaths. They work to link all of these murders together to pin down the serial killer, and appease the families of the victims who have been looking for answers. Meanwhile, Lindsay decides to meet her biological father for the first time, and Voight welcomes Kenny Rixton to the team when Ruzek takes an undercover assignment."
      },
      {
        "id": "tvmaze:981758",
        "title": "You Wish",
        "season": 4,
        "episode": 11,
        "released": "2017-01-11",
        "overview": "When a mutilated sex offender is found dead, it is unclear if he was the victim of a hate crime, sexual assault or self-mutilation. As Intelligence questions those related to the case, they find themselves up against a private \"special police\" force who may be covering up illegal activities. Meanwhile, Halstead runs Jimmy's DNA to confirm whether he is actually Lindsay's father."
      },
      {
        "id": "tvmaze:981759",
        "title": "Sanctuary",
        "season": 4,
        "episode": 12,
        "released": "2017-01-18",
        "overview": "After a female jogger is brutally murdered in the park, Rixton and Atwater arrive to see two suspects fleeing the scene. When the men make their way inside a church, the priest and parishioners gather outside to block law enforcement from entering. While investigating the case, Rixton gets caught in a lie with Voight."
      },
      {
        "id": "tvmaze:1043710",
        "title": "I Remember Her Now",
        "season": 4,
        "episode": 13,
        "released": "2017-02-08",
        "overview": "The body of a 15-year-old girl is found crushed in an abandoned building after she runs away from a treatment center for troubled girls. Voight sends Halstead undercover as a guard to work from the inside at the center, where he believes the girls are trading sexual favors for something in return. Meanwhile, Platt feels guilty because the victim was brought into the District last year, and Platt doesn't remember her."
      },
      {
        "id": "tvmaze:1044218",
        "title": "Seven Indictments",
        "season": 4,
        "episode": 14,
        "released": "2017-02-15",
        "overview": "When a charred body is found in a torched house, Intelligence must work to identify the victim, as well as a young boy who is found badly injured inside. As they look to determine the cause and who may have been involved, they are faced with a web of secrets and lies. Meanwhile, Lindsay and Halstead receive an odd warning about Rixton that leaves them suspicious."
      },
      {
        "id": "tvmaze:1044219",
        "title": "Favor, Affection, Malice or Ill-Will",
        "season": 4,
        "episode": 15,
        "released": "2017-02-22",
        "overview": "When Lindsay is tipped off about a grieving father looking to avenge his daughter's death, Olinsky goes undercover as a hitman-for-hire. With Gang Intelligence lacking enough evidence to arrest the original gangbanger in question, the team works to reinvestigate the case. Meanwhile, Ruzek comes back after finishing his undercover assignment only to have Voight knock him down to patrol duty."
      },
      {
        "id": "tvmaze:1044217",
        "title": "Emotional Proximity",
        "season": 4,
        "episode": 16,
        "released": "2017-03-01",
        "overview": "Olinsky's daughter remains in critical condition following a massive fire - leaving Intelligence on edge, but more determined than ever to track down the suspect. Voight opens up the case, knowing that he has Stone and his team's full support in the investigation, and all of Firehouse 51 behind him to examine potential origins of the fire. Intelligence works to connect the dots between the building owner, those who were inside, and a string of potential suspects."
      },
      {
        "id": "tvmaze:1071391",
        "title": "Remember the Devil",
        "season": 4,
        "episode": 17,
        "released": "2017-03-22",
        "overview": "After being tipped off about a woman running barefoot through the woods, Intelligence is led to a kidnapping victim locked up in a shipping container. The bizarre scenario leaves Voight questioning the legitimacy of the case, and sends the team on a twisted trail to get to the bottom of it. Meanwhile, a former relationship of Halstead's comes back into the picture, much to the surprise of Lindsay."
      },
      {
        "id": "tvmaze:1071392",
        "title": "Little Bit of Light",
        "season": 4,
        "episode": 18,
        "released": "2017-03-29",
        "overview": "When Chicago's \"Night Crawler\" Bobby Trent is murdered over a single piece of mysterious footage, Intelligence must investigate one of Chicago's wealthiest families -- uncovering a lineage of old money and secrets. Meanwhile, Burgess's sister Nicole arrives at the District for a visit, and presents an icy attitude towards Ruzek."
      },
      {
        "id": "tvmaze:1098528",
        "title": "Last Minute Resistance",
        "season": 4,
        "episode": 19,
        "released": "2017-04-05",
        "overview": "After encouraging her sister to spend a night out with friends, Burgess wakes to find that Nicole never made it home. As the guilt begins to eat at Burgess, the team in Intelligence bands together to make finding Nicole their main priority. The case kicks into high gear when she is found clinging to life in an El station."
      },
      {
        "id": "tvmaze:1098592",
        "title": "Grasping for Salvation",
        "season": 4,
        "episode": 20,
        "released": "2017-04-26",
        "overview": "While investigating the murder of a teenage boy, Voight finds a connection with the murder weapon - linking it to a case that he worked on 17 years ago. While the victim's father, a prominent defense attorney, tries to get the case taken over by Area Central Homicide, Voight digs back into the old case under the watchful eye of his former partner, Lieutenant Denny Woods."
      },
      {
        "id": "tvmaze:1098593",
        "title": "Fagin",
        "season": 4,
        "episode": 21,
        "released": "2017-05-03",
        "overview": "When the team is called to an in-progress bank robbery, they come across Detective Hailey Upton trying to take over the crime scene with her Robbery-Homicide unit - butting heads with Voight in the process. As the robberies continue to be executed around the city, Lindsay is forced to make a decision in the heat of the moment, revealing a surprising suspect behind the mask. While working on the case at the district, Upton is shocked to come across Platt, who has a special connection to her past."
      },
      {
        "id": "tvmaze:1098594",
        "title": "Army of One",
        "season": 4,
        "episode": 22,
        "released": "2017-05-10",
        "overview": "A live video is streamed online showcasing a tortured man being beaten and burned alive. Upon further investigation, the victim's identity is traced back to that of a man who had been previously locked up for statutory rape. When another attack of a similar nature occurs, Intelligence finds a connection between the crimes, suspected pedophiles, and group named the Perv Hunters. Meanwhile, Lindsay runs into a few bumps in the road - both personally and professionally."
      },
      {
        "id": "tvmaze:1098595",
        "title": "Fork in the Road",
        "season": 4,
        "episode": 23,
        "released": "2017-05-17",
        "overview": "When Lindsay receives a panicked call from her mother Bunny whose boyfriend had just been shot, Lindsay must figure out the best way to approach the situation, as her mother is now a murder suspect. The case opens up when a group of high school students OD, and the drugs in question relate back to the situation with Bunny. In addition to her mother's issues, Lindsay finds herself up against the review board dealing with consequences of her actions."
      },
      {
        "id": "tvmaze:1217480",
        "title": "Reform",
        "season": 5,
        "episode": 1,
        "released": "2017-09-27",
        "overview": "The district is in a state of change, Lindsay has moved to New York, and the CPD is under scrutiny about the corrupt nature of its institution. Under the watchful eye of the city, the team attempts to bust a gun deal that quickly turns dicey when innocent civilians and children get involved. Tension erupts when Chief Lugo brings in Denny Woods to review the shootout, and Halstead becomes a key player in the outcome of the case."
      },
      {
        "id": "tvmaze:1231667",
        "title": "The Thing About Heroes",
        "season": 5,
        "episode": 2,
        "released": "2017-10-04",
        "overview": "After a van explodes during a Chicago street festival, a Muslim patrol officer Frank Toma goes missing and evidence quickly piles up pointing to his involvement. Burgess - who helped train Toma - is desperate to prove his innocence, even if that means going against her superiors."
      },
      {
        "id": "tvmaze:1315221",
        "title": "Promise",
        "season": 5,
        "episode": 3,
        "released": "2017-10-11",
        "overview": "When a young Latina woman is brutally murdered, Intelligence suspects she may have been working as a drug mule. With Antonio leading the case, the team's investigation takes them into the grim world of meat processing, and the discovery that there may be a different motive behind her death."
      },
      {
        "id": "tvmaze:1231668",
        "title": "Snitch",
        "season": 5,
        "episode": 4,
        "released": "2017-10-18",
        "overview": "While investigating a drug-related homicide, Intelligence is stonewalled by the 'no-snitch' culture of the neighborhood. And Atwater discovers a personal connection to the case. Meanwhile, the police's own code of silence is put to the test when Upton is asked about Ruzek's rough altercation with a suspect."
      },
      {
        "id": "tvmaze:1231669",
        "title": "Home",
        "season": 5,
        "episode": 5,
        "released": "2017-10-25",
        "overview": "When Intelligence busts a meth lab run by gang leader Marshall Carter, they uncover a re-homing scam in which children adopted from foreign countries are abandoned, then sold online. Meanwhile, Atwater struggles with the difficult decision about whether to move his siblings Jordan and Vinessa to a safer environment outside of Chicago."
      },
      {
        "id": "tvmaze:1284879",
        "title": "Fallen",
        "season": 5,
        "episode": 6,
        "released": "2017-11-08",
        "overview": "A picture perfect family is shot dead in their home and the team goes in search of a drug dealer with a likely connection. Voight asks for the help of Vice Sergeant Sean McGrady who has an old beef with Upton. When McGrady turns up dead during the investigation, the case takes an unlikely turn."
      },
      {
        "id": "tvmaze:1333447",
        "title": "Care Under Fire",
        "season": 5,
        "episode": 7,
        "released": "2017-11-15",
        "overview": "In the wake of several gang-related child abductions, Intelligence must race against time to find a kidnapped boy. Owing to their swiftness and military precision, the team scours the VA records and tracks the suspects to a former Army Ranger. With his previous experience as a Ranger, Halstead convinces Voight to send him undercover to try and get information from inside."
      },
      {
        "id": "tvmaze:1333448",
        "title": "Politics",
        "season": 5,
        "episode": 8,
        "released": "2017-11-29",
        "overview": "One of Voight's friends, Congressman Scott Graynor is found passed out in his hotel room with a dead Ukranian girl. When Intelligence discovers the murder is connected to a sting and Burgess' boyfriend is working with the Feds, Burgess must choose between compromising her case or her boyfriend's case."
      },
      {
        "id": "tvmaze:1352186",
        "title": "Monster",
        "season": 5,
        "episode": 9,
        "released": "2017-12-06",
        "overview": "The death of Judge Tommy Wells' daughter puts Intelligence on the track of a pill mill spreading into the suburbs of Chicago and the doctor enabling it. Meanwhile, Voight discovers who's been leaking information from the 21st."
      },
      {
        "id": "tvmaze:1352589",
        "title": "Rabbit Hole",
        "season": 5,
        "episode": 10,
        "released": "2018-01-03",
        "overview": "Halstead's partying with Camila unintentionally puts him in the middle of a drug-related homicide. He's forced to choose between loyalty to his unit and his girl. Meanwhile, Voight finally discovers the mole in his unit."
      },
      {
        "id": "tvmaze:1352590",
        "title": "Confidential",
        "season": 5,
        "episode": 11,
        "released": "2018-01-10",
        "overview": "While trying to find the pimp, Intelligence stumbles on the women's shelter where he's scouting out girls. And Burgess moves the case forward with a series of confidential tips, but risks putting her informant in harm's way."
      },
      {
        "id": "tvmaze:1352591",
        "title": "Captive",
        "season": 5,
        "episode": 12,
        "released": "2018-01-17",
        "overview": "When Atwater disappears at the house of a convicted felon, the evidence doesn't look promising - with his belongings and his blood left behind. Intelligence rallies to rescue him before it's too late. And Atwater struggles for survival faced with not only his captor but also a difficult connection to his past."
      },
      {
        "id": "tvmaze:1352592",
        "title": "Chasing Monsters",
        "season": 5,
        "episode": 13,
        "released": "2018-01-31",
        "overview": "Antonio finds himself getting close to the Salvadoran Detective, Marcella Gomez, only to learn she has a hidden motive for being in Chicago. Meanwhile, Voight learns that the body of his son's killer has been found."
      },
      {
        "id": "tvmaze:1352593",
        "title": "Anthem",
        "season": 5,
        "episode": 14,
        "released": "2018-02-07",
        "overview": "When a basketball star is found murdered after an anti-police rally, Intelligence navigates a politically charged environment to track down the killer. To complicate matters further, Woods' daughter Brianna is tangled up in the case."
      },
      {
        "id": "tvmaze:1357532",
        "title": "Sisterhood",
        "season": 5,
        "episode": 15,
        "released": "2018-02-28",
        "overview": "Intelligence tracks down a vigilante killing rapists. The investigation hits home for Burgess, who begins to question if the men who attacked her sister truly paid for their actions."
      },
      {
        "id": "tvmaze:1410588",
        "title": "Profiles",
        "season": 5,
        "episode": 16,
        "released": "2018-03-07",
        "overview": "Intelligence investigates a string of bombings targeting members of the media. Racing against a ticking clock, the team enlists Firehouse 51 to help examine the devices and prevent the next attack."
      },
      {
        "id": "tvmaze:1414751",
        "title": "Breaking Point",
        "season": 5,
        "episode": 17,
        "released": "2018-03-14",
        "overview": "When a prominent Alderman known for his urban revitalization efforts is killed, Intelligence looks into the corruption haunting his neighborhood. Meanwhile Olinsky feels pressure after receiving an ultimatum from Woods."
      },
      {
        "id": "tvmaze:1418590",
        "title": "Ghosts",
        "season": 5,
        "episode": 18,
        "released": "2018-03-21",
        "overview": "Upton brings back an old undercover identity to help take down a meth ring spearheaded by a former criminal contact. And with pressure from Woods mounting, Voight calls in a favor for Olinksy."
      },
      {
        "id": "tvmaze:1424025",
        "title": "Payback",
        "season": 5,
        "episode": 19,
        "released": "2018-04-11",
        "overview": "A string of stash house robberies lead back to an unlikely individual. Voight confronts a key witness in the Bingham investigation."
      },
      {
        "id": "tvmaze:1424026",
        "title": "Saved",
        "season": 5,
        "episode": 20,
        "released": "2018-04-18",
        "overview": "After Voight witnesses the kidnapping of a young woman with a mysterious connection to his past, Intelligence works to find a connection between her kidnapping and several bank robberies. Ruzek gets a tip that a grand jury has been summoned, putting Olinsky one step closer to standing trial for Bingham's murder."
      },
      {
        "id": "tvmaze:1435978",
        "title": "Allegiance",
        "season": 5,
        "episode": 21,
        "released": "2018-05-02",
        "overview": "Halstead and Atwater go undercover to prevent military-grade weapons from hitting the street. Meanwhile, Voight calls in a favor as a last-ditch effort to clear Olinsky's name for Bingham's murder."
      },
      {
        "id": "tvmaze:1435979",
        "title": "Homecoming",
        "season": 5,
        "episode": 22,
        "released": "2018-05-09",
        "overview": "Tensions run high as Intelligence seeks justice for Olinsky after he's stabbed in prison. Antonio's loyalty is put to the test and Woods looks to take down Voight once and for all."
      },
      {
        "id": "tvmaze:1482236",
        "title": "New Normal",
        "season": 6,
        "episode": 1,
        "released": "2018-09-26",
        "overview": "Bad heroin is causing overdoses in Chicago, and Intelligence is a man down with Voight suspended. Antonio takes charge, but Ruzek undermines his authority."
      },
      {
        "id": "tvmaze:1505835",
        "title": "Endings",
        "season": 6,
        "episode": 2,
        "released": "2018-10-03",
        "overview": "After discovering the true cause of the high-rise fire, Intelligence races to find the man responsible. And for Halstead it's personal."
      },
      {
        "id": "tvmaze:1505836",
        "title": "Bad Boys",
        "season": 6,
        "episode": 3,
        "released": "2018-10-10",
        "overview": "Politics get in the way as the team tries to rescue a teenage girl kidnapped by a robbery crew. Voight and Platt try to exonerate Olinsky."
      },
      {
        "id": "tvmaze:1519371",
        "title": "Ride Along",
        "season": 6,
        "episode": 4,
        "released": "2018-10-17",
        "overview": "A ride along goes sideways, and Burgess is faced with a difficult choice: follow the advice of Voight, or a potential new ally."
      },
      {
        "id": "tvmaze:1529606",
        "title": "Fathers and Sons",
        "season": 6,
        "episode": 5,
        "released": "2018-10-24",
        "overview": "While undercover, Ruzek discovers his father is working for a suspected drug dealer and is forced to ask the question: is his dad involved?"
      },
      {
        "id": "tvmaze:1543134",
        "title": "True or False",
        "season": 6,
        "episode": 6,
        "released": "2018-10-31",
        "overview": "The wife of an alderman is beaten to death, and Voight is under pressure from First Deputy Superintendent Brennan to close the case. To elicit a confession, Upton tells a dark story about her childhood."
      },
      {
        "id": "tvmaze:1544594",
        "title": "Trigger",
        "season": 6,
        "episode": 7,
        "released": "2018-11-07",
        "overview": "Intelligence suspects the leader of a local mosque is behind the bombing of an Army recruitment station. After a second explosion, Voight urges Halstead to follow the facts and not let his time in the service cloud his judgment."
      },
      {
        "id": "tvmaze:1544595",
        "title": "Black and Blue",
        "season": 6,
        "episode": 8,
        "released": "2018-11-14",
        "overview": "While CPD tries to take down a drug kingpin, Atwater faces a tough choice between doing what's required to solve the murder of a young dealer and what's best for the community."
      },
      {
        "id": "tvmaze:1553941",
        "title": "Descent",
        "season": 6,
        "episode": 9,
        "released": "2018-12-05",
        "overview": "In an attempt to dig himself out of a hole and save someone close to him, Antonio crosses a line that puts the entire team at risk."
      },
      {
        "id": "tvmaze:1575309",
        "title": "Brotherhood",
        "season": 6,
        "episode": 10,
        "released": "2019-01-09",
        "overview": "Voight and Ruzek lock horns over how to handle the aftermath of the Antonio situation. Meanwhile, a series of violent carjackings turns deadly, and Ruzek must rely on a C.I. he grew up with to help solve the case."
      },
      {
        "id": "tvmaze:1583268",
        "title": "Trust",
        "season": 6,
        "episode": 11,
        "released": "2019-01-16",
        "overview": "When a defense attorney is murdered after a fundraiser, Intelligence must confront the world of campaign finance, which makes them reconsider their decision to back the current pro-police mayoral candidate."
      },
      {
        "id": "tvmaze:1583269",
        "title": "Outrage",
        "season": 6,
        "episode": 12,
        "released": "2019-01-23",
        "overview": "While chasing a heroin supplier, CPD crosses paths with a convicted criminal recently released on a technicality. Halstead's history with the man threatens the team's ability to put him back in prison."
      },
      {
        "id": "tvmaze:1595364",
        "title": "Night in Chicago",
        "season": 6,
        "episode": 13,
        "released": "2019-02-06",
        "overview": "Atwater goes undercover to bring down the longtime head of a criminal enterprise and becomes entangled in a situation that tests his allegiances as well as his conscience."
      },
      {
        "id": "tvmaze:1599130",
        "title": "Ties That Bind",
        "season": 6,
        "episode": 14,
        "released": "2019-02-13",
        "overview": "The team travels to a Wisconsin gun show to take down a supplier who's manufacturing \"cop killer\" machine guns. Before going undercover together, Burgess discovers that Upton is dating Ruzek."
      },
      {
        "id": "tvmaze:1604839",
        "title": "Good Men",
        "season": 6,
        "episode": 15,
        "released": "2019-02-20",
        "overview": "Using information from Chicago Fire's Cruz, Intelligence chases down the robbery crew that's been using the lockbox key. Voight is under pressure to bring the crew to justice without tarnishing the reputation of a murdered firefighter who might have been involved."
      },
      {
        "id": "tvmaze:1607977",
        "title": "The Forgotten",
        "season": 6,
        "episode": 16,
        "released": "2019-02-27",
        "overview": "Voight's \"stay out of politics\" stance is challenged as Intelligence uncovers the details surrounding a prolific serial killer."
      },
      {
        "id": "tvmaze:1616054",
        "title": "Pain Killer",
        "season": 6,
        "episode": 17,
        "released": "2019-03-27",
        "overview": "A mayoral candidate is shot by an unidentified sniper, and CPD races to catch the shooter before he can take out his next target."
      },
      {
        "id": "tvmaze:1616055",
        "title": "This City",
        "season": 6,
        "episode": 18,
        "released": "2019-04-03",
        "overview": "With the threat of a gang war looming, Voight and Ray Price must organize a peace summit to end the bloodshed before more innocent people get hurt. Burgess evaluates her future with Blair."
      },
      {
        "id": "tvmaze:1632443",
        "title": "What Could Have Been",
        "season": 6,
        "episode": 19,
        "released": "2019-04-24",
        "overview": "Intelligence's investigation into the murder of Burgess' boyfriend threatens to reveal a dark side she was unaware of, but the real motivation for his murder uncovers a much more unsettling truth."
      },
      {
        "id": "tvmaze:1632444",
        "title": "Sacrifice",
        "season": 6,
        "episode": 20,
        "released": "2019-05-08",
        "overview": "A violent crew is hitting pharmaceutical delivery trucks and stealing drugs, but their motivation is more complicated than just money. The case tests Upton and Ruzek's relationship."
      },
      {
        "id": "tvmaze:1632445",
        "title": "Confession",
        "season": 6,
        "episode": 21,
        "released": "2019-05-15",
        "overview": "Antonio struggles with his guilty conscience as he tries to take down a major drug dealer. In order to protect his team, Voight takes a big shot at Kelton."
      },
      {
        "id": "tvmaze:1632446",
        "title": "Reckoning",
        "season": 6,
        "episode": 22,
        "released": "2019-05-22",
        "overview": "With Kelton's election all but assured, Voight and his team must go off book in a last-ditch effort to save Intelligence from getting axed."
      },
      {
        "id": "tvmaze:1672000",
        "title": "Doubt",
        "season": 7,
        "episode": 1,
        "released": "2019-09-25",
        "overview": "When Kelton is found murdered, Voight's grudge against the mayor-elect puts him under suspicion. Upton and Halstead are eager to prove their sergeant's innocence, but the more evidence they gather, the closer they come to doing the opposite. After making bail, Ruzek searches for a missing Antonio."
      },
      {
        "id": "tvmaze:1683180",
        "title": "Assets",
        "season": 7,
        "episode": 2,
        "released": "2019-10-02",
        "overview": "When Atwater goes undercover in a dangerous South Side drug syndicate, he learns there may be more to its kingpin than meets the eye. Halstead tries to join Atwater undercover, but finds himself at a disadvantage. Voight petitions the brass to show Ruzek leniency in his court case."
      },
      {
        "id": "tvmaze:1683182",
        "title": "Familia",
        "season": 7,
        "episode": 3,
        "released": "2019-10-09",
        "overview": "After a botched carjacking turns out to be something much bigger, Voight's unit goes toe-to-toe with a smart drug kingpin who only works with women. New recruit Vanessa Rojas struggles with the transition from undercover to Intelligence, but the new case gives her a chance to play to her strengths."
      },
      {
        "id": "tvmaze:1683183",
        "title": "Infection, Part III",
        "season": 7,
        "episode": 4,
        "released": "2019-10-16",
        "overview": "After zeroing in on the suspect responsible for the bioterrorism that's gripping Chicago, the PD prepares to undertake their biggest manhunt yet. Upton is torn between helping track down the perp and providing emotional support to the scared young girl that needs her. Voight fears his team is being sent on a wild goose chase."
      },
      {
        "id": "tvmaze:1705935",
        "title": "Brother's Keeper",
        "season": 7,
        "episode": 5,
        "released": "2019-10-23",
        "overview": "A murder in a Bulgarian neighborhood results in a challenging investigation when locals won't talk to police. Ruzek has a clash with a patrol officer."
      },
      {
        "id": "tvmaze:1705936",
        "title": "False Positive",
        "season": 7,
        "episode": 6,
        "released": "2019-10-30",
        "overview": "The shocking murder of young boys affects Halstead. Crawford encourages Intelligence to use a new facial-recognition software to help identify a suspect, but the plan backfires."
      },
      {
        "id": "tvmaze:1705937",
        "title": "Informant",
        "season": 7,
        "episode": 7,
        "released": "2019-11-06",
        "overview": "Voight pulls Darius in after Crawford asks Intelligence to investigate a dangerous drug, but there is little trust in the relationship. When their plan to nail a dealer goes awry and another CI is murdered, the team must make a tough decision about Darius."
      },
      {
        "id": "tvmaze:1705938",
        "title": "No Regrets",
        "season": 7,
        "episode": 8,
        "released": "2019-11-13",
        "overview": "After injuring herself while pursuing a suspect, Burgess receives a shocking diagnosis. A homicide case turns into a missing persons case, with a sinister twist. Voight has to decide between justice and the letter of the law."
      },
      {
        "id": "tvmaze:1745309",
        "title": "Absolution",
        "season": 7,
        "episode": 9,
        "released": "2019-11-20",
        "overview": "Halstead's secret ongoing relationship with a woman connected to another case puts him in jeopardy."
      },
      {
        "id": "tvmaze:1758513",
        "title": "Mercy",
        "season": 7,
        "episode": 10,
        "released": "2020-01-08",
        "overview": "As they await news of Halstead's fate, the team tries to focus on work, turning their attention to an illegal arms dealer. Atwater discovers his brother, Jordan, is back in Chicago and could be tied to the case. Voight faces the tricky task of how to deal with Halstead's shooter. Burgess finally makes her decision."
      },
      {
        "id": "tvmaze:1777538",
        "title": "43rd and Normal",
        "season": 7,
        "episode": 11,
        "released": "2020-01-15",
        "overview": "Ruzek and Burgess's secret begins to have severe implications for their police work. A series of deadly acts of vandalism causes tensions to run high in the insular neighborhood of Canaryville. Atwater tries to reach out to his brother, but only pushes him further away."
      },
      {
        "id": "tvmaze:1777539",
        "title": "The Devil You Know",
        "season": 7,
        "episode": 12,
        "released": "2020-01-22",
        "overview": "Voight makes a deal with Darius Walker to help bring down a rogue group of dirty cops dealing drugs that were supposed to be destroyed. Upton clashes with Voight and enacts her own form of justice."
      },
      {
        "id": "tvmaze:1777540",
        "title": "I Was Here",
        "season": 7,
        "episode": 13,
        "released": "2020-02-05",
        "overview": "After receiving a distressing 911 call, Burgess enlists the team's help to track down a girl caught up in a sex-trafficking ring."
      },
      {
        "id": "tvmaze:1777541",
        "title": "Center Mass",
        "season": 7,
        "episode": 14,
        "released": "2020-02-12",
        "overview": "A homeless man's murder leads Intelligence to a criminal who has evaded capture for years. Rojas has a troubling experience with a young mentally ill man."
      },
      {
        "id": "tvmaze:1777542",
        "title": "Burden of Truth",
        "season": 7,
        "episode": 15,
        "released": "2020-02-26",
        "overview": "Intelligence searches for the dealer who caused multiple overdoses and is connected to Roman's missing sister. The case becomes a homicide investigation when they find the dealer's dead body.Part 2 of Crossover with Chicago Fire."
      },
      {
        "id": "tvmaze:1801982",
        "title": "Intimate Violence",
        "season": 7,
        "episode": 16,
        "released": "2020-03-04",
        "overview": "An armed robbery case quickly turns into a homicide investigation. When one suspect's background suggests domestic violence, Upton is forced to reckon with her childhood. Voight and Halstead butt heads over Halstead's righteous instinct."
      },
      {
        "id": "tvmaze:1801983",
        "title": "Before the Fall",
        "season": 7,
        "episode": 17,
        "released": "2020-03-18",
        "overview": "Voight enlists the help of a reformed gang member to get a key witness' testimony in a murder case. More lives are put on the line as a gang war brews."
      },
      {
        "id": "tvmaze:1813240",
        "title": "Lines",
        "season": 7,
        "episode": 18,
        "released": "2020-03-25",
        "overview": "Intelligence does everything they can to build a case against the elusive leader of a drug ring, but things get complicated when Rojas realizes someone she cares about might be involved."
      },
      {
        "id": "tvmaze:1822323",
        "title": "Buried Secrets",
        "season": 7,
        "episode": 19,
        "released": "2020-04-08",
        "overview": "The clock is on after Ruzek witnesses a woman's kidnapping and the team races to put the pieces together. Burgess tries to connect with Ruzek outside of work but he mysteriously distances himself from her."
      },
      {
        "id": "tvmaze:1826873",
        "title": "Silence of the Night",
        "season": 7,
        "episode": 20,
        "released": "2020-04-15",
        "overview": "Atwater goes under cover to take down a gun trafficking ring but discovers an officer from his past is under cover in the same organization."
      },
      {
        "id": "tvmaze:1920537",
        "title": "Fighting Ghosts",
        "season": 8,
        "episode": 1,
        "released": "2020-11-11",
        "overview": "The team responds to the shooting of a 5-year-old girl and they must work the case while facing new obstacles that come from the heightened attention on police reform. Atwater is targeted by a group of officers who want to hurt him for standing against the blue wall. Voight questions whether he's cut out for a new form of policing as he manages oversight from the CPD's deputy superintendent."
      },
      {
        "id": "tvmaze:1963556",
        "title": "White Knuckle",
        "season": 8,
        "episode": 2,
        "released": "2020-11-18",
        "overview": "The son of an influential former officer is implicated in a murder and Deputy Miller pressures Voight to charge him quickly so that the CPD isn't accused of preferential treatment. The stakes are raised in Atwater's fight against the blue wall after patrol officers stop responding to his team's calls. Voight wants to help Atwater end this mistreatment but the two can't agree on the right way to handle it."
      },
      {
        "id": "tvmaze:1972303",
        "title": "Tender Age",
        "season": 8,
        "episode": 3,
        "released": "2021-01-13",
        "overview": "Ruzek and Burgess discover a child walking alone in the middle of the street and when they take her home, they discover her entire family has been murdered. Upton is approached with a job offer from the FBI."
      },
      {
        "id": "tvmaze:1992748",
        "title": "Unforgiven",
        "season": 8,
        "episode": 4,
        "released": "2021-01-27",
        "overview": "A cop is murdered, and suspicion falls on someone who has been holding a grudge against the officer. Intelligence works hard to solve the case, but Deputy Superintendent Samantha Miller is hesitant to defend him until she knows the whole story."
      },
      {
        "id": "tvmaze:1995734",
        "title": "In Your Care",
        "season": 8,
        "episode": 5,
        "released": "2021-02-03",
        "overview": "The team investigates a rash of car jackings and finds the truth is more complicated than they realize. Burgess makes a discovery about a previous case that will change her life forever."
      },
      {
        "id": "tvmaze:1995735",
        "title": "Equal Justice",
        "season": 8,
        "episode": 6,
        "released": "2021-02-10",
        "overview": "Halstead and Ruzek try to infiltrate a crime ring and encounter a complicated situation. The team recruits an unlikely ally to help solve a murder."
      },
      {
        "id": "tvmaze:1995736",
        "title": "Instinct",
        "season": 8,
        "episode": 7,
        "released": "2021-02-17",
        "overview": "After a series of deadly ambushes, the team goes undercover to bring down a dangerous new drug dealer who is determined to push out the competition. Ruzek's informant proves to be a loose cannon that could upset the whole operation."
      },
      {
        "id": "tvmaze:1995737",
        "title": "Protect and Serve",
        "season": 8,
        "episode": 8,
        "released": "2021-03-10",
        "overview": "Ruzek and Atwater are tasked with making an arrest after a high-profile shooting. The situation becomes complicated when it's clear someone doesn't want them to make it back to the station."
      },
      {
        "id": "tvmaze:1995738",
        "title": "Impossible Dream",
        "season": 8,
        "episode": 9,
        "released": "2021-03-17",
        "overview": "When a local business owner is gunned down in his shop, it becomes personal for Atwater, who patrolled the neighborhood as a young cop. Dep. Supt. Samantha Miller comes to Voight with a special request about Andre Cooper."
      },
      {
        "id": "tvmaze:1995739",
        "title": "The Radical Truth",
        "season": 8,
        "episode": 10,
        "released": "2021-03-31",
        "overview": "Ruzek's father, Bob, goes missing and the team races to find him before it's too late."
      },
      {
        "id": "tvmaze:1995740",
        "title": "Signs of Violence",
        "season": 8,
        "episode": 11,
        "released": "2021-04-07",
        "overview": "A wellness check on a family reveals signs of foul play, and Detective Upton is determined to find the parents and young daughter. As she delves further into the troubled family dynamics, she reflects on her own childhood trauma."
      },
      {
        "id": "tvmaze:2043650",
        "title": "Due Process",
        "season": 8,
        "episode": 12,
        "released": "2021-04-21",
        "overview": "The team pursues a crafty serial rapist.  Sergeant Voight finds himself resisting some old, familiar tendencies in his quest for justice."
      },
      {
        "id": "tvmaze:2043651",
        "title": "Trouble Dolls",
        "season": 8,
        "episode": 13,
        "released": "2021-05-05",
        "overview": "The shocking murder of a young pregnant woman leads the team on a desperate hunt for the killer, revealing something even darker than expected. Burgess has to make a tough decision about Makayla."
      },
      {
        "id": "tvmaze:2077952",
        "title": "Safe",
        "season": 8,
        "episode": 14,
        "released": "2021-05-12",
        "overview": "After a series of brutal home invasion robberies, Upton immerses herself in the case and finds herself caught between Voight and Halstead."
      },
      {
        "id": "tvmaze:2083352",
        "title": "The Right Thing",
        "season": 8,
        "episode": 15,
        "released": "2021-05-19",
        "overview": "Voight and the team pursue a ruthless crime ring whose business has hit close to home. As they dig deeper, the extent of the danger becomes more apparent. Deputy Superintendent Samantha Miller second-guesses her decisions."
      },
      {
        "id": "tvmaze:2060973",
        "title": "The Other Side",
        "season": 8,
        "episode": 16,
        "released": "2021-05-26",
        "overview": "Voight and the team muster all their expertise to bring down a deadly crime ring. Burgess finds herself in a dangerous situation."
      },
      {
        "id": "tvmaze:2131695",
        "title": "Closure",
        "season": 9,
        "episode": 1,
        "released": "2021-09-22",
        "overview": "Officer Kim Burgess fights for her life as the team scrambles to find her kidnapper. Dep. Supt. Sam Miller is desperate to find her son's killer. Voight and Upton deal with the aftermath of their deadly decision. Ruzek struggles with the pressure of the situation."
      },
      {
        "id": "tvmaze:2160832",
        "title": "Rage",
        "season": 9,
        "episode": 2,
        "released": "2021-09-29",
        "overview": "When a P.D. informant is murdered, the team digs in to track down the perpetrator only to learn a shocking truth. Voight and Ruzek strategize to help Burgess."
      },
      {
        "id": "tvmaze:2160833",
        "title": "The One Next to Me",
        "season": 9,
        "episode": 3,
        "released": "2021-10-06",
        "overview": "Halstead's past resurfaces when a former Army colleague is implicated in a deadly blast. As the FBI launches an investigation into Roy's disappearance, Upton feels the pressure of the secret she and Voight are sharing."
      },
      {
        "id": "tvmaze:2175395",
        "title": "In the Dark",
        "season": 9,
        "episode": 4,
        "released": "2021-10-13",
        "overview": "When Upton and Ruzek answer an emergency call to an abandoned house, their investigation leads them down a dark path."
      },
      {
        "id": "tvmaze:2175396",
        "title": "Burnside",
        "season": 9,
        "episode": 5,
        "released": "2021-10-20",
        "overview": "As the team works to solve a deadly shooting in Burnside, Atwater realizes he has a very personal connection to the case."
      },
      {
        "id": "tvmaze:2175397",
        "title": "End of Watch",
        "season": 9,
        "episode": 6,
        "released": "2021-10-27",
        "overview": "Ruzek reunites with an old colleague to take down a crime ring but when things don't add up, Voight and Burgess do some investigating of their own."
      },
      {
        "id": "tvmaze:2195821",
        "title": "Trust Me",
        "season": 9,
        "episode": 7,
        "released": "2021-11-03",
        "overview": "As the team works to bring down a drug ring, Voight builds trust with a new informant. However, it soon becomes clear she has a plan of her own."
      },
      {
        "id": "tvmaze:2201959",
        "title": "Fractures",
        "season": 9,
        "episode": 8,
        "released": "2021-11-10",
        "overview": "As the team investigates the stabbing of a father with two young daughters, they begin to suspect there is more to the story than meets the eye. The FBI investigation into Roy Walton's death intensifies while Voight, Upton and Halstead feel the heat."
      },
      {
        "id": "tvmaze:2212238",
        "title": "A Way Out",
        "season": 9,
        "episode": 9,
        "released": "2021-12-08",
        "overview": "With the FBI closing in on the Roy Walton investigation, Voight and Halstead strategize on a way out. After a city bus driver is shot by a passenger, the team investigates a possible abduction."
      },
      {
        "id": "tvmaze:2215524",
        "title": "Home Safe",
        "season": 9,
        "episode": 10,
        "released": "2022-01-05",
        "overview": "The team searches for a missing child in what turns out to be a very complicated case. Burgess and Ruzek are in for a shock when someone from Makayla's past comes forward."
      },
      {
        "id": "tvmaze:2243762",
        "title": "Lies",
        "season": 9,
        "episode": 11,
        "released": "2022-01-12",
        "overview": "Voight employs his new informant to help solve a tricky drug trafficking case. Atwater, who once again struggles to reconcile his personal and professional life, reaches a decision."
      },
      {
        "id": "tvmaze:2243763",
        "title": "To Protect",
        "season": 9,
        "episode": 12,
        "released": "2022-01-19",
        "overview": "The team works together to identify the head of the brutal Los Temidos gang. Voight dives deeper into his informant Anna Avalos' past when her undercover role is threatened."
      },
      {
        "id": "tvmaze:2244532",
        "title": "Still Water",
        "season": 9,
        "episode": 13,
        "released": "2022-02-23",
        "overview": "While out for a jog, Upton witnesses a horrible car crash and risks her own life to save the passengers. After learning more about the victims, the team must track down the man responsible for the brutal crash."
      },
      {
        "id": "tvmaze:2244533",
        "title": "Blood Relation",
        "season": 9,
        "episode": 14,
        "released": "2022-03-02",
        "overview": "The team searches for a brutal killer with a signature modus operandi. Burgess and Ruzek double down in their fight to retain custody of Makayla."
      },
      {
        "id": "tvmaze:2244534",
        "title": "Gone",
        "season": 9,
        "episode": 15,
        "released": "2022-03-09",
        "overview": "The unit scrambles to search for one of their own who is in grave danger."
      },
      {
        "id": "tvmaze:2264363",
        "title": "Closer",
        "season": 9,
        "episode": 16,
        "released": "2022-03-16",
        "overview": "When a young man is shot outside the Cárabo Bakery, the team works to connect the shooting to bakery owner Javier Escano, who has been under surveillance. Despite the increasing danger, Voight helps informant Anna Avalos get even closer to their target."
      },
      {
        "id": "tvmaze:2264364",
        "title": "Adrift",
        "season": 9,
        "episode": 17,
        "released": "2022-04-06",
        "overview": "Ruzek's search for the daughter of an old family friend leads the team into a serious drug investigation. Burgess and Ruzek struggle to move on from the emotional aftermath of Makayla's abduction."
      },
      {
        "id": "tvmaze:2264365",
        "title": "New Guard",
        "season": 9,
        "episode": 18,
        "released": "2022-04-13",
        "overview": "Halstead takes a new recruit under his wing during an investigation. The dynamics are challenging, however, and questions arise over the recruit's complicated past."
      },
      {
        "id": "tvmaze:2301241",
        "title": "Fool's Gold",
        "season": 9,
        "episode": 19,
        "released": "2022-04-20",
        "overview": "After the murder of a wealthy Chicago man, Atwater and the team dig in to uncover the truth, suspecting there is more to the story than meets the eye."
      },
      {
        "id": "tvmaze:2301242",
        "title": "Memory",
        "season": 9,
        "episode": 20,
        "released": "2022-05-11",
        "overview": "Voight and the team delve into a cold case in search of clues to solve a shocking new crime. With its focus on buried memories, the case sparks concern for Burgess and Ruzek about Makayla's mental healing."
      },
      {
        "id": "tvmaze:2301243",
        "title": "House of Cards",
        "season": 9,
        "episode": 21,
        "released": "2022-05-18",
        "overview": "As the team closes in on drug kingpin Javier Escano, Voight is forced to lie to his undercover informant Anna to keep her on track. Their deteriorating trust threatens an increasingly tenuous operation."
      },
      {
        "id": "tvmaze:2301244",
        "title": "You and Me",
        "season": 9,
        "episode": 22,
        "released": "2022-05-25",
        "overview": "After an explosion rocks the case, the team scrambles to finally take down Escano as everyone nears their breaking point."
      },
      {
        "id": "tvmaze:2355089",
        "title": "Let It Bleed",
        "season": 10,
        "episode": 1,
        "released": "2022-09-21",
        "overview": "Still reeling from the death of informant Anna, Voight faces a new threat as he tries to keep the neighborhood clean. New wrinkles develop in the Upton, Halstead and Voight dynamic. The team gets a new chief."
      },
      {
        "id": "tvmaze:2373098",
        "title": "The Real You",
        "season": 10,
        "episode": 2,
        "released": "2022-09-28",
        "overview": "When a convicted murderer hijacks a prison van, the team scrambles to find him and the abducted prison guard before it's too late. Burgess questions Ruzek's motives in a case, creating tension between the two."
      },
      {
        "id": "tvmaze:2390655",
        "title": "A Good Man",
        "season": 10,
        "episode": 3,
        "released": "2022-10-05",
        "overview": "The team investigates a string of brutal pharmacy robberies and Halsted connects with one of the victims about their Army careers. Upton suspects there is more to the story and confides in Voight."
      },
      {
        "id": "tvmaze:2390656",
        "title": "Dónde Vives",
        "season": 10,
        "episode": 4,
        "released": "2022-10-12",
        "overview": "A shocking murder pulls rookie officer Dante Torres into his own neighborhood. As Voight and Atwater help him navigate the case and manage tricky personal dynamics with wary neighbors, Torres realizes his life may be forever changed."
      },
      {
        "id": "tvmaze:2390657",
        "title": "Pink Cloud",
        "season": 10,
        "episode": 5,
        "released": "2022-10-19",
        "overview": "Upton's dogged pursuit of a missing teenage girl leads the team into a dark web of human trafficking. Chief O'Neal becomes involved with the unit's investigation when it becomes evident his son, Sean, has a connection to the missing girl."
      },
      {
        "id": "tvmaze:2390658",
        "title": "Sympathetic Reflex",
        "season": 10,
        "episode": 6,
        "released": "2022-11-02",
        "overview": "Atwater's reactions during a tense arrest are called into question. The team must dig in to uncover key evidence that could aid in the ongoing investigation and clear Atwater's name."
      },
      {
        "id": "tvmaze:2420017",
        "title": "Into the Deep",
        "season": 10,
        "episode": 7,
        "released": "2022-11-09",
        "overview": "When actionable evidence finally surfaces against Sean O'Neal, Upton and the team work relentlessly to build a case in secret. They discover Sean is more elusive and dangerous than anticipated."
      },
      {
        "id": "tvmaze:2424858",
        "title": "Under the Skin",
        "season": 10,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "In an attempt to distract Intelligence from the investigation into his son, Chief O'Neal forces Voight and the team to handle a \"dead fish case.\" However, when that dead fish turns into a complicated heater case, Burgess is thrown back into difficult memories from her past."
      },
      {
        "id": "tvmaze:2427584",
        "title": "Proof of Burden",
        "season": 10,
        "episode": 9,
        "released": "2022-12-07",
        "overview": "After a shocking discovery, the team begins closing in on Sean O'Neal with every shred of evidence they can find. Determined to keep his son out of prison, Chief O'Neal hires a lawyer."
      },
      {
        "id": "tvmaze:2427585",
        "title": "This Job",
        "season": 10,
        "episode": 10,
        "released": "2023-01-04",
        "overview": "A series of brutal home invasion robberies finds the team paired with Det. Borkowski, an old friend of Ruzek's, to work the case. Things get complicated for Torres when it becomes clear Borkowski has a vastly different policing style."
      },
      {
        "id": "tvmaze:2448452",
        "title": "Long Lost",
        "season": 10,
        "episode": 11,
        "released": "2023-01-11",
        "overview": "A shocking ambush at a funeral leads the team into a heated investigation to find the shooters. Much to Atwater's surprise, he must rely on someone from his past to help in the investigation, dredging up old memories and revealing new truths."
      },
      {
        "id": "tvmaze:2458951",
        "title": "I Can Let You Go",
        "season": 10,
        "episode": 12,
        "released": "2023-01-18",
        "overview": "Sean O'Neal surprises Det. Upton with a call from prison, revealing sensitive information. While Upton grapples with how to keep O'Neal at a distance, the team quickly mobilizes to stop a crime in progress before it's too late."
      },
      {
        "id": "tvmaze:2470828",
        "title": "The Ghost in You",
        "season": 10,
        "episode": 13,
        "released": "2023-02-15",
        "overview": "Voight and the team help Assistant State's Attorney Nina Chapman pursue a drug runner who dodged prison years ago after Chapman's informant mysteriously disappeared. The investigation takes a turn when Voight uncovers a damaging secret from Chapman's past, threatening the investigation and Chapman's career."
      },
      {
        "id": "tvmaze:2478985",
        "title": "Trapped",
        "season": 10,
        "episode": 14,
        "released": "2023-02-22",
        "overview": "After a brutal shooting, Burgess and Ruzek find themselves trapped aboard the busy \"L\" subway train. As they piece together scant evidence, the team is drawn into a dark family drama. Burgess' proximity to the shooting triggers harsh memories."
      },
      {
        "id": "tvmaze:2488724",
        "title": "Blood and Honor",
        "season": 10,
        "episode": 15,
        "released": "2023-03-01",
        "overview": "When a family is poisoned in their home, the team discovers a connection to the Becks. Ruzek goes undercover to work for their business and as he gets closer to Samantha, chilling information about her father, Richard, comes to light."
      },
      {
        "id": "tvmaze:2495069",
        "title": "Deadlocked",
        "season": 10,
        "episode": 16,
        "released": "2023-03-22",
        "overview": "Voight takes the stand for ASA Chapman in a high-stakes murder trial against notorious drug kingpin Arturo Morales. When it becomes clear that Morales and his henchmen have compromised a juror, Voight and the team work furiously to ensure justice prevails."
      },
      {
        "id": "tvmaze:2505435",
        "title": "Out of the Depths",
        "season": 10,
        "episode": 17,
        "released": "2023-03-29",
        "overview": "As the team investigates a convenience store robbery, the evidence leads them to an unusual pair of suspects, revealing a dark personal drama and another potential victim. Burgess slowly makes strides tackling her past trauma."
      },
      {
        "id": "tvmaze:2509775",
        "title": "You Only Die Twice",
        "season": 10,
        "episode": 18,
        "released": "2023-04-05",
        "overview": "A tragic crime leads the team closer to the Beck family and their deadly ideology. Ruzek makes progress infiltrating the Becks, earning Samantha and Richard's trust with a bold move."
      },
      {
        "id": "tvmaze:2514058",
        "title": "The Bleed Valve",
        "season": 10,
        "episode": 19,
        "released": "2023-05-03",
        "overview": "Atwater's worlds collide when there's a shooting at the building he owns in Burnside, which leaves a child dead. Atwater must confront his relationship with his father, Lew, as the brutal case forces them together."
      },
      {
        "id": "tvmaze:2514059",
        "title": "Fight",
        "season": 10,
        "episode": 20,
        "released": "2023-05-10",
        "overview": "Upton is unwittingly drawn into a deadly betrayal and finds herself in a fight for her life. With minimal leads, Voight and the team scramble to find her before it's too late."
      },
      {
        "id": "tvmaze:2514060",
        "title": "New Life",
        "season": 10,
        "episode": 21,
        "released": "2023-05-17",
        "overview": "Torres finds himself in the midst of a murder case that hits close to home and threatens to expose his troubled past. As he struggles to reconcile his old life with his new one, Voight keeps a watchful eye."
      },
      {
        "id": "tvmaze:2514061",
        "title": "A Better Place",
        "season": 10,
        "episode": 22,
        "released": "2023-05-24",
        "overview": "As Richard Beck's timeline for a deadly attack moves up and Samantha panics, Ruzek and the team scramble to get ahead of unprecedented disaster."
      },
      {
        "id": "tvmaze:2691453",
        "title": "Unpacking",
        "season": 11,
        "episode": 1,
        "released": "2024-01-17",
        "overview": "Tasked with shadowing a crisis prevention team, Upton finds her approach to policing at odds with the team's mental health clinician. The case brings out Upton's personal struggles, Voight stands by her."
      },
      {
        "id": "tvmaze:2696325",
        "title": "Retread",
        "season": 11,
        "episode": 2,
        "released": "2024-01-24",
        "overview": "Despite being on leave, Ruzek gets mixed up in a case after a late-night poker game is raided."
      },
      {
        "id": "tvmaze:2696326",
        "title": "Safe Harbor",
        "season": 11,
        "episode": 3,
        "released": "2024-01-31",
        "overview": "Burgess works an extra shift at the 13th District and gets caught in the middle of a drive-by attack on refugees. The team works together to track down the shooter and uncover the true motive behind the attack."
      },
      {
        "id": "tvmaze:2744827",
        "title": "Escape",
        "season": 11,
        "episode": 4,
        "released": "2024-02-07",
        "overview": "Returning from furlough, Torres goes undercover in a tense and high-stakes drug trafficking case."
      },
      {
        "id": "tvmaze:2749695",
        "title": "Split Second",
        "season": 11,
        "episode": 5,
        "released": "2024-02-21",
        "overview": "Atwater turns to an unlikely source of support when a string of jewelry store robberies shake his confidence."
      },
      {
        "id": "tvmaze:2749696",
        "title": "Survival",
        "season": 11,
        "episode": 6,
        "released": "2024-02-28",
        "overview": "Intelligence teams up with ASA Chapman to take on an abduction case involving a teenager. The case hits close to home for Voight, leading him to take a personal interest in finding justice for the victim."
      },
      {
        "id": "tvmaze:2749780",
        "title": "The Living and the Dead",
        "season": 11,
        "episode": 7,
        "released": "2024-03-20",
        "overview": "An ongoing case hits close to home for Voight as Intelligence teams up with an SVU detective to track down a prolific offender."
      },
      {
        "id": "tvmaze:2773549",
        "title": "On Paper",
        "season": 11,
        "episode": 8,
        "released": "2024-03-27",
        "overview": "Upton brings SVU detective Petrovic back into the fold to help with the investigation of a tender-age kidnapping."
      },
      {
        "id": "tvmaze:2800195",
        "title": "Somos Uno",
        "season": 11,
        "episode": 9,
        "released": "2024-04-03",
        "overview": "Torres's personal involvement with an informant jeopardizes his safety and threatens to expose an undercover operation."
      },
      {
        "id": "tvmaze:2804958",
        "title": "Buried Pieces",
        "season": 11,
        "episode": 10,
        "released": "2024-05-01",
        "overview": "Upton becomes consumed with a decades-old missing person's case linked to Petrovic after a young child shows up at the district seeking help."
      },
      {
        "id": "tvmaze:2828135",
        "title": "The Water Line",
        "season": 11,
        "episode": 11,
        "released": "2024-05-08",
        "overview": "As Atwater finds himself distracted by a past case, a CI from his past resurfaces with a tip on a string of violent armed robberies."
      },
      {
        "id": "tvmaze:2828136",
        "title": "Inventory",
        "season": 11,
        "episode": 12,
        "released": "2024-05-15",
        "overview": "Intelligence chases down a lead in the ongoing serial killer investigation as news of the case reaches the public."
      },
      {
        "id": "tvmaze:2830281",
        "title": "More",
        "season": 11,
        "episode": 13,
        "released": "2024-05-22",
        "overview": "As the months-long investigation into the serial killer reaches its close, Voight must outsmart the offender in a race against the clock. Upton must make a vital decision."
      },
      {
        "id": "tvmaze:2939427",
        "title": "Ten Ninety-Nine",
        "season": 12,
        "episode": 1,
        "released": "2024-09-25",
        "overview": "A month after Voight's close brush with death, Intelligence is overwhelmed with cases as they catch a high-stakes drug bust."
      },
      {
        "id": "tvmaze:3006218",
        "title": "Blood Bleeds Blue",
        "season": 12,
        "episode": 2,
        "released": "2024-10-02",
        "overview": "After tragedy strikes Intelligence, the unit must persevere during an adrenalized manhunt across the city."
      },
      {
        "id": "tvmaze:3013008",
        "title": "Off Switch",
        "season": 12,
        "episode": 3,
        "released": "2024-10-09",
        "overview": "Atwater struggles to find balance as he teams up with a forensic psychologist on an armed robbery case."
      },
      {
        "id": "tvmaze:3015748",
        "title": "The After",
        "season": 12,
        "episode": 4,
        "released": "2024-10-16",
        "overview": "ASA Chapman assists Intelligence with a sensitive investigation that drudges up painful memories for Voight."
      },
      {
        "id": "tvmaze:3024007",
        "title": "Water and Honey",
        "season": 12,
        "episode": 5,
        "released": "2024-10-23",
        "overview": "In the midst of a momentous rainstorm, Intelligence lends support to Officer Cook when she and her partner disagree about an investigation."
      },
      {
        "id": "tvmaze:3031853",
        "title": "Pawns",
        "season": 12,
        "episode": 6,
        "released": "2024-11-06",
        "overview": "Burgess is put to the test as she looks to make an advancement in her career."
      },
      {
        "id": "tvmaze:3032288",
        "title": "Contrition",
        "season": 12,
        "episode": 7,
        "released": "2024-11-13",
        "overview": "Torres is haunted by his previous transgressions as Cook takes on a tense undercover assignment."
      },
      {
        "id": "tvmaze:3044456",
        "title": "Penance",
        "season": 12,
        "episode": 8,
        "released": "2024-11-20",
        "overview": "The unit learns the truth about a secret Torres has been keeping, as Deputy Chief Charlie Reid puts a focus on Intelligence."
      },
      {
        "id": "tvmaze:3060054",
        "title": "Friends and Family",
        "season": 12,
        "episode": 9,
        "released": "2025-01-08",
        "overview": "Cook turns to her family when Intelligence faces administrative roadblocks that threaten a kidnapping investigation."
      },
      {
        "id": "tvmaze:3078394",
        "title": "Zoe",
        "season": 12,
        "episode": 10,
        "released": "2025-01-22",
        "overview": "An unexpected visitor causes disruption for Ruzek and Burgess amidst an emotional investigation involving an unidentified young girl."
      },
      {
        "id": "tvmaze:3078396",
        "title": "In the Trenches: Part III",
        "season": 12,
        "episode": 11,
        "released": "2025-01-29",
        "overview": "With the suspects still at large and conditions worsening underground, first responders race against the clock to reach the trapped victims, while the investigation into the assailants comes into focus."
      },
      {
        "id": "tvmaze:3119242",
        "title": "The Good Shepherd",
        "season": 12,
        "episode": 12,
        "released": "2025-02-05",
        "overview": "A chilling discovery leads Torres to go undercover at the juvenile detention center where he stayed as a teen."
      },
      {
        "id": "tvmaze:3123360",
        "title": "Street Jesus",
        "season": 12,
        "episode": 13,
        "released": "2025-02-19",
        "overview": "Atwater's struggling community project is threatened further by an escalating street war."
      },
      {
        "id": "tvmaze:3136185",
        "title": "Marie",
        "season": 12,
        "episode": 14,
        "released": "2025-02-26",
        "overview": "Ruzek grapples with his father's worsening condition while Intelligence searches for an elusive serial killer."
      },
      {
        "id": "tvmaze:3149682",
        "title": "Greater Good",
        "season": 12,
        "episode": 15,
        "released": "2025-03-05",
        "overview": "Voight questions Deputy Chief Reid's motives in enacting a Violence Reduction Initiative across a neighborhood where numerous gangs are fighting for territory."
      },
      {
        "id": "tvmaze:3157294",
        "title": "Seen and Unseen",
        "season": 12,
        "episode": 16,
        "released": "2025-03-26",
        "overview": "Burgess's memory recall is put to the test following a deadly incident at her local diner."
      },
      {
        "id": "tvmaze:3157295",
        "title": "Transference",
        "season": 12,
        "episode": 17,
        "released": "2025-04-02",
        "overview": "The search for the suspect in a shooting uncovers a surprising personal connection to Atwater and Val, raising questions about their relationship status."
      },
      {
        "id": "tvmaze:3163485",
        "title": "Demons",
        "season": 12,
        "episode": 18,
        "released": "2025-04-16",
        "overview": "Voight and Chapman team up to investigate Deputy Chief Reid's shadow dealings as Reid assigns Intelligence to a carjacking case."
      },
      {
        "id": "tvmaze:3190541",
        "title": "Name Image Likeness",
        "season": 12,
        "episode": 19,
        "released": "2025-04-23",
        "overview": "Cook works her first CI during a vicious robbery-homicide case involving a star college athlete."
      },
      {
        "id": "tvmaze:3190542",
        "title": "Black Ice",
        "season": 12,
        "episode": 20,
        "released": "2025-05-07",
        "overview": "Ruzek witnesses a tragic accident on an icy bridge, leading Intelligence into a dark, sinister case involving sex trafficking."
      },
      {
        "id": "tvmaze:3178000",
        "title": "Open Casket",
        "season": 12,
        "episode": 21,
        "released": "2025-05-14",
        "overview": "The showdown with Deputy Chief Reid intensifies when Intelligence narrows in on Ortero."
      },
      {
        "id": "tvmaze:3190543",
        "title": "Vows",
        "season": 12,
        "episode": 22,
        "released": "2025-05-21",
        "overview": "Forced to cease operations while under investigation by Internal Affairs, Intelligence goes off-book to bring down Reid. Ruzek and Burgess consider delaying their nuptials amid the uncertainty."
      },
      {
        "id": "tvmaze:3316805",
        "title": "Consequences",
        "season": 13,
        "episode": 1,
        "released": "2025-10-01",
        "overview": "Voight teams up with an unlikely ally to take a killer off the streets while fighting to bring his Intelligence unit back together."
      },
      {
        "id": "tvmaze:3366697",
        "title": "Open Wounds",
        "season": 13,
        "episode": 2,
        "released": "2025-10-08",
        "overview": "The Intelligence Unit races against time when a man from Torres's own neighborhood is violently abducted."
      },
      {
        "id": "tvmaze:3366698",
        "title": "Canaryville",
        "season": 13,
        "episode": 3,
        "released": "2025-10-15",
        "overview": "A homicide in the neighborhood where Burgess and Ruzek reside forces the team to investigate complicated relationships within the tight-knit community they call home."
      },
      {
        "id": "tvmaze:3366699",
        "title": "Root Cause",
        "season": 13,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "A string of violent robberies across the city digs up one family's secrets. A surprising detail of Voight's past resurfaces."
      },
      {
        "id": "tvmaze:3372392",
        "title": "Miami",
        "season": 13,
        "episode": 5,
        "released": "2025-10-29",
        "overview": "Atwater reunites with an old friend from his academy days after a bombing rocks downtown Chicago."
      },
      {
        "id": "tvmaze:3372393",
        "title": "Send Me",
        "season": 13,
        "episode": 6,
        "released": "2025-11-05",
        "overview": "Torres is dragged into a deadly conspiracy when a routine errand takes a violent turn."
      },
      {
        "id": "tvmaze:3423074",
        "title": "Impulse Control",
        "season": 13,
        "episode": 7,
        "released": "2025-11-12",
        "overview": "Voight's suspicions ring true when a violent break-in steers the Intelligence Unit back to a chilling figure from a previous case."
      }
    ]
  }
}