{
  "meta": {
    "id": "tvmaze:52353",
    "type": "series",
    "name": "The Proof Is Out There",
    "description": "The Proof Is Out There takes an in-depth look at some of the most incredible and thought provoking videos of unexplained phenomena and mysterious must-see moments of all time. Each half-hour episode explores and analyzes the full story of each irregularity in question from bizarre footage of people seemingly immune to lightning, to a fifty-foot snake, apocalyptic sounds in a man's backyard, enigmatic creatures, and UFOS that split and dive underwater. Through expert examination and the use of the latest technologies, The Proof Is Out There aims to get to the bottom of what's real? What's fake? And everything in between.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492492.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1492492.jpg",
    "videos": [
      {
        "id": "tvmaze:3440459",
        "title": "Classic UFO Case, Ancient Titan Footprints & The Beast at the Bottom of the Lake",
        "season": 5,
        "episode": 20,
        "released": "2025-12-12",
        "overview": "Why has an Italian sighting puzzled UFO experts for decades? Did a Calgary resident record footage of a legendary Canadian lake monster? Tony and his team examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:3440460",
        "title": "The Beast of Seven Chutes, Green Hawaiian Lasers & The Ohio Howls Strike Back",
        "season": 5,
        "episode": 21,
        "released": "2025-12-19",
        "overview": "Are lasers in the Hawaiian sky a secret space weapon? Did a tourist's photo capture a famous Canadian beast? Tony and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3440458",
        "title": "Eclipse UFO, Canadian River Monster, and the Betz Sphere",
        "season": 5,
        "episode": 19,
        "released": "2025-12-05",
        "overview": "Did a UFO in Texas streak across the sky during a solar eclipse? Is a giant creature making waves in a Canadian river? Could a mysterious metal sphere found in the woods actually be alien technology?"
      },
      {
        "id": "tvmaze:1984093",
        "title": "Lost Tribes and Levitating Humans",
        "season": 1,
        "episode": 1,
        "released": "2021-01-05",
        "overview": "Could a small, human-like figure spotted in an Indonesian forest be the mythical Orang Pendek? Is a helicopter spotted floating in mid-air proof that levitation is possible? And can some human beings develop an immunity... to being electrocuted? Tony Harris and his team of experts study the evidence and come to shocking conclusions."
      },
      {
        "id": "tvmaze:1992659",
        "title": "Escape From Monkey Island",
        "season": 1,
        "episode": 2,
        "released": "2021-01-05",
        "overview": "Are several mysterious objects spotted over Miami and in the skies above Mexico evidence that UFOs exist? Could strange remains found on a North Carolina beach be from an escaped mutant monkey? Tony Harris and his team examine the evidence and reveal which of these sightings are truly unexplained."
      },
      {
        "id": "tvmaze:1992660",
        "title": "Alien Orbs and Lightning Balls",
        "season": 1,
        "episode": 3,
        "released": "2021-01-12",
        "overview": "Could strange objects caught on a drone cam over Wisconsin be actual UFOs? Could a strange sound caught recorded in a North Carolina backyard be evidence of a secret government program? And how can several airplanes appear to defy the laws of physics? Tony Harris and his team examine the evidence and look for proof that these unusual occurrences are exactly as they seem."
      },
      {
        "id": "tvmaze:1992661",
        "title": "Giant Serpents and Tiny Goblins",
        "season": 1,
        "episode": 4,
        "released": "2021-01-12",
        "overview": "Could a large serpent captured on video be evidence of a mythical snake creature that inhabits the Amazon? Are several strange rings seen floating in the sky actually alien in origin? And has an infamous lake monster known as the Ogopogo finally been captured on film? Tony Harris and his team examine the videos and render a verdict on these strange happenings."
      },
      {
        "id": "tvmaze:1992662",
        "title": "Deep Sea Sounds and Phantom Ships",
        "season": 1,
        "episode": 5,
        "released": "2021-01-19",
        "overview": "Could a flying object caught on U.S. government cameras finally be evidence of alien technology? Is a strange sound travelling through 5,000 miles of ocean proof that the prehistoric Megaladon is still alive? And what accounts for the sighting of an apparent ghost ship floating in Lake Superior? In this episode, Tony Harris and his team examine the videos and render a verdict on these mysterious happenings."
      },
      {
        "id": "tvmaze:1992663",
        "title": "Weeping Mary and the Montana Alien",
        "season": 1,
        "episode": 6,
        "released": "2021-01-19",
        "overview": "Could a strange figure caught on a security cam be evidence of an unknown lifeform? What accounts for a statue that appears to be crying real tears? And can a smartphone app actually allow people to control reality... with their minds? In this episode, Tony Harris and his team of experts take a deep dive into videos of the unexplained and render surprising verdict on what they might be."
      },
      {
        "id": "tvmaze:2003111",
        "title": "Mystery Hum and Mayans on Mars",
        "season": 1,
        "episode": 7,
        "released": "2021-01-26",
        "overview": "Could a girl whose reflection doesn't match her expression be proof we're living in a simulated reality? Do NASA photographs reveal that Mars was actually colonized centuries ago? And what's causing a mysterious hum... being heard around the world? In this episode, Tony Harris and his team of experts analyze videos, photos and audio recordings and render a verdict on whether these strange happenings are real, fake or something in between?"
      },
      {
        "id": "tvmaze:2003112",
        "title": "Giant Blobs and Backyard Bigfoot",
        "season": 1,
        "episode": 8,
        "released": "2021-01-29",
        "overview": "Is recent video of a large, hairy creature and casts of its footprints finally evidence that Bigfoot isn't just a myth? How did a man dodge rush hour traffic with seemingly superhuman reflexes? And what can account for one woman's escape from her sinking vehicle... without opening the doors or windows? In this episode, Tony Harris and his team of experts examine new evidence and come to surprising conclusions about what these strange phenomena might be."
      },
      {
        "id": "tvmaze:2008545",
        "title": "Flying Orbs and Freakish Fish",
        "season": 1,
        "episode": 9,
        "released": "2021-02-02",
        "overview": "Could centuries-old photos be proof that reincarnation is actually occurring? Is nuclear waste off the coast of Russia creating an army of mutant fish? And, are California wildfires actually the result of secret government space weapons? In this episode, Tony Harris and his team of experts examine new videos and photographs and reach a verdict on what's behind these strange happenings."
      },
      {
        "id": "tvmaze:2008546",
        "title": "Ancient Sounds and Moon Mounds",
        "season": 1,
        "episode": 10,
        "released": "2021-02-05",
        "overview": "Could a strange footprint and foul smell be evidence that a creature known as the Skunk Ape truly exists? Does a mysterious cluster of mounds on the moon suggest colonization by an alien race? And what accounts for a whisper heard in the desert that resembles an ancient pharaoh's curse? In this episode, Tony Harris and his team of experts examine new videos, photos, and audio recordings and weigh in on what could be behind these unusual events."
      },
      {
        "id": "tvmaze:2134747",
        "title": "UFOs Caught on Camera",
        "season": 2,
        "episode": 1,
        "released": "2021-09-17",
        "overview": "A new season kicks off as host Tony Harris separates the real from the fake in some of the top UFOs caught on camera in recent history. Spanning 70 years, videos range from a bizarre shape caught on camera during a 1950s minor league baseball game, to new videos leaked in 2021 of pyramids apparently stalking US warships, to a UFO that seemingly dives into the ocean and disappears. Harris and a collection of top experts, from national security specialists to physicists, evaluate each video or fi."
      },
      {
        "id": "tvmaze:2156212",
        "title": "Strange Frequencies and Water Dragons",
        "season": 2,
        "episode": 2,
        "released": "2021-09-24",
        "overview": "Could a mysterious creature spotted in an infamous Chinese river be the infamous water dragon? Is a strange, pulsing sound to blame for several soldiers' curious physical ailments? And how on earth did a child miraculously survive a terrifying car crash? Tony Harris and his team examine the evidence and look for proof that these unusual occurrences are exactly as they seem"
      },
      {
        "id": "tvmaze:2156213",
        "title": "Dog Headed Man and Summoning Spaceships",
        "season": 2,
        "episode": 3,
        "released": "2021-09-24",
        "overview": "Did a Tennessee man capture footage of the infamous Dogman creature without even realizing it? Is it possible to communicate with extraterrestrials...using just a laser pointer? And could a giant structure at the bottom of a lake be an undersea Stonehenge? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2178635",
        "title": "Malaysian Toilet Monster & The Buzzer",
        "season": 2,
        "episode": 4,
        "released": "2021-10-01",
        "overview": "Could a large black creature emerging from a family's toilet be some kind of mythical creature? Is an eerie radio station secretly part of a Russian military plan? And what exactly did an astronaut see out the window while aboard the International Space Station? Tony Harris and his team of experts crack down on these videos to figure out what's really going on."
      },
      {
        "id": "tvmaze:2178636",
        "title": "Real Excalibur & Texas Teleportation",
        "season": 2,
        "episode": 5,
        "released": "2021-10-01",
        "overview": "Could a sword discovered at the bottom of a river really be the famed Excalibur, wielded by King Arthur himself? Did a doorbell cam capture proof that teleportation is actually possible? And is a family being visited by aliens every Independence Day? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2190399",
        "title": "Solar Spaceship & Invisibility Cloak",
        "season": 2,
        "episode": 6,
        "released": "2021-10-08",
        "overview": "Could a breed of dogs possess the power to completely freeze time? Is invisibility cloaking finally science fact rather than science fiction? And is there evidence that aliens crash landed in Antarctica several millenniums ago? Tony Harris and his team examine the videos and render a verdict on these strange happenings."
      },
      {
        "id": "tvmaze:2190400",
        "title": "Two-Headed Serpent & Mummified Monster",
        "season": 2,
        "episode": 7,
        "released": "2021-10-08",
        "overview": "Could a petrified creature discovered in Russia be the work of the mythical Baba Yaga? Could this two-headed snake be a genetic experiment gone wrong? And can fire have a mind of its own? Tony Harris and his team of experts examine new videos, photos, and audio recordings and weigh in on what could be behind these unusual events."
      },
      {
        "id": "tvmaze:2179324",
        "title": "Apocalyptic Lights & Baby Sharkman",
        "season": 2,
        "episode": 8,
        "released": "2021-10-15",
        "overview": "What could have caused a baby shark to develop an eerie, human-like face? Are blue lights in the sky a sign that the end is coming? And are aliens vacationing over Lake Superior? Tony Harris and his team examine the videos and determine a verdict regarding the unexplained."
      },
      {
        "id": "tvmaze:2179325",
        "title": "Jetpack Man & Alien Ocean Egg",
        "season": 2,
        "episode": 9,
        "released": "2021-10-15",
        "overview": "Could a human flying through the skies of Los Angeles be a real life \"Iron Man\"? Is an amorphous blob in the water the spawn of the fabled Kraken? And have aliens already set up a base at the North Pole? Tony and his team of experts get to the bottom of what's really going on."
      },
      {
        "id": "tvmaze:2188455",
        "title": "Alaskan Sea Monster & Mystery Jungle Jet",
        "season": 2,
        "episode": 10,
        "released": "2021-10-22",
        "overview": "Could aliens actually be human time travelers from the future? Can a trick shot classify a person as superhuman? And has someone finally found the lost Malaysian Airlines Flight 370 hiding in the jungle? Tony Harris and his team of experts study the evidence and come to shocking conclusions."
      },
      {
        "id": "tvmaze:2188454",
        "title": "Sasquatch Sounds & Undersea Alien",
        "season": 2,
        "episode": 11,
        "released": "2021-10-22",
        "overview": "Could mysterious lights under the surface of the deepest lake on Earth be connected to extraterrestrial life? Has Bigfoot's call and chatter finally been captured on tape? Could UFOs possibly be as alive as the aliens piloting them? Tony Harris and his team examine the evidence and reveal which of these sightings are truly unexplained."
      },
      {
        "id": "tvmaze:2198141",
        "title": "Wichita UFO & Booming Sea Sound",
        "season": 2,
        "episode": 12,
        "released": "2021-10-29",
        "overview": "Could a strange silver object seen in the sky seen over Kansas be a real UFO? Is a sound permeating through the ocean a warning that something bigger lies below? And what accounts for a strange purple beam caught on camera in Alaska? Tony Harris and his team examine the evidence and look for proof that these unusual occurrences aren't exactly as they seem."
      },
      {
        "id": "tvmaze:2229013",
        "title": "Bigfoot Revealed",
        "season": 2,
        "episode": 13,
        "released": "2021-12-03",
        "overview": "For fifty-four years, the famed Patterson-Gimlin bigfoot film has been touted as the best proof the creature exists. Now with breakthrough AI technology, a never-before-seen restoration of the film makes the figure known as \"Patty\" clearer than ever before, and our team of experts are breaking it down for the first time ever, frame by frame, and comparing it to other more recent intriguing sightings. Could this change the debate forever? Tony and our panel take on one of cryptozoology's biggest mysteries."
      },
      {
        "id": "tvmaze:2229869",
        "title": "Yeti Sighting / Italian UFO",
        "season": 2,
        "episode": 14,
        "released": "2021-12-10",
        "overview": "Could a bipedal figure crossing a snowy field be the fabled yeti? Is a color-changing orb in the sky another example in a long history of UFOs in Italy? And is a creature peeking around the corner a real life alien encounter? Tony Harris and his team examine the evidence and reveal which of these sightings are truly unexplained."
      },
      {
        "id": "tvmaze:2229870",
        "title": "Snakelike Sea Monster / North Korean Supersoldier",
        "season": 2,
        "episode": 15,
        "released": "2021-12-10",
        "overview": "A sighting of a 30 foot long serpentine sea monster. Is a man from North Korea proving that super soldiers might not be such a cartoonish idea after all? And are recordings of strange howls those of the Wendigo from indigenous American folklore? Tony Harris and his team of experts investigate these claims."
      },
      {
        "id": "tvmaze:2229871",
        "title": "Nessie's Cousin and NYC UFOs",
        "season": 2,
        "episode": 16,
        "released": "2021-12-17",
        "overview": "Boaters claim to have captured footage of a real-life cousin to Nessie. Are glowing orbs floating above NYC cause for concern? And how exactly are faces continually showing up on the floor of a home in Spain? Tony Harris and his panel of experts take on these cases and figure out what's really going on."
      },
      {
        "id": "tvmaze:2238903",
        "title": "Mutant Mummy and Alien Monolith",
        "season": 2,
        "episode": 17,
        "released": "2022-01-07",
        "overview": "Could the remains of a small, human-like creature be the corpse of an alien visitor? Are loud booms plaguing the area of New Jersey actually coming from giants or gods? And what's really behind the deal with those monoliths popping up all over the world in 2020? Tony Harris and his team examine the evidence and reveal which of these sightings are truly unexplained."
      },
      {
        "id": "tvmaze:2229872",
        "title": "Birdzilla and New Montauk Monster",
        "season": 2,
        "episode": 18,
        "released": "2022-01-07",
        "overview": "Could an unidentified creature washed up on the beach be proof of animal testing at a nearby lab? Is an object seen over the skies of inner Mongolia extraterrestrial in origin? And is a site in the woods evidence of a real UFO crash landing? Tony Harris and his team of experts examine new videos and photographs and reach a verdict on what's behind these strange happenings."
      },
      {
        "id": "tvmaze:2245864",
        "title": "The London Serpent and Moon UFOS",
        "season": 2,
        "episode": 19,
        "released": "2022-01-14",
        "overview": "Is a serpentine monster lurking under the water in the London's Thames River? And were UFOs spotted crossing the moon? And, how are some people able to defy the fear of heights? Tony and the team investigate these jaw-dropping videos to separate fact from fiction."
      },
      {
        "id": "tvmaze:2245865",
        "title": "UFO Eruption and Alien Spheres",
        "season": 2,
        "episode": 20,
        "released": "2022-01-14",
        "overview": "What's the truth behind a pattern of UFO sightings near volcanoes. Who--or what--made the strange stone spheres of Costa Rica? And what is the secret of an unidentified man living alone in the jungle? Tony and his team investigated these inexplicable photos and videos"
      },
      {
        "id": "tvmaze:2245866",
        "title": "Mysterious Sky Moans and Dragon Sighting",
        "season": 2,
        "episode": 21,
        "released": "2022-01-21",
        "overview": "Could a UFO seen by multiple residents of a Florida town be the real deal? What is causing a ghoulish moaning sound to come from the sky? And could a dragon have been responsible for a bizarre incident in China? Tony Harris and his team of experts dive into these claims to find the truth"
      },
      {
        "id": "tvmaze:2245867",
        "title": "Land UFO and Superhuman Strength",
        "season": 2,
        "episode": 22,
        "released": "2022-01-21",
        "overview": "A UFO spotted over one of the world's holiest sites. And could a mysterious floating \"spaceman\" in a famous photograph be an elaborate, decades-long hoax? Plus, \"superhumans\" who can stop cars barehanded. Tony and his team of experts explore these mysterious photos and videos."
      },
      {
        "id": "tvmaze:2254435",
        "title": "UFO on Fire and Dinosaur on the Beach",
        "season": 2,
        "episode": 23,
        "released": "2022-01-28",
        "overview": "Could a prehistoric-looking creature washed ashore in Georgia be something new to local scientists? Is a death-defying experience for a toddler proof of guardian angels? And did a UFO spotted in Canada burn up in the atmosphere? Tony and his team of experts the bottom of these far-fetched claims."
      },
      {
        "id": "tvmaze:2254436",
        "title": "UFO Window Seat and Lost Underwater City",
        "season": 2,
        "episode": 24,
        "released": "2022-01-28",
        "overview": "Shocking sighting of a UFO outside from the window seat of a passenger jet. A strange underwater discovery is said to be a lost Japanese city. And are giant sloths responsible for a series of tunnels in Brazil? Tony and team investigate some of the world's strangest photos and videos."
      },
      {
        "id": "tvmaze:2257076",
        "title": "Bigfoot's Death Cry and Bird on Mars",
        "season": 2,
        "episode": 25,
        "released": "2022-02-11",
        "overview": "Experts investigate the claims of \"Ohmawing\" -- the theory that bigfoot makes sounds that can make people sick. Plus, did NASA's Perseverance Rover capture an image of birds on Mars? And could a disturbing creature captured on video be a fabled Latin American witch? Tony Harris and his team of experts investigate the truth."
      },
      {
        "id": "tvmaze:2257077",
        "title": "The Nightcrawler and the Beast in the Trees",
        "season": 2,
        "episode": 26,
        "released": "2022-02-18",
        "overview": "The team looks into a new sighting of sasquatch in the trees of California. Are streaks in the night sky in Australia proof of aliens down under? And has a man captured footage of the infamous Fresno Nightcrawlers right in his back yard? Tony and his team of experts investigate these bizarre videos."
      },
      {
        "id": "tvmaze:2257078",
        "title": "The Creeping Horror and Viral Car Jumpers",
        "season": 2,
        "episode": 27,
        "released": "2022-02-25",
        "overview": "What's the truth behind internet videos of acrobats flipping over speeding cars? And is an amorphous and horrifying crawling creature from another planet? Tony and team piece together the clues behind these puzzling photos and videos."
      },
      {
        "id": "tvmaze:2275434",
        "title": "Ancient Alien Carvings and Bigfoot 'Shrooms",
        "season": 2,
        "episode": 28,
        "released": "2022-03-04",
        "overview": "A man believes he recorded bigfoot calls on video while foraging for mushrooms. Are rock paintings discovered in India proof that we've never really ever been alone? And has one of our experts captured a fleet of UFOs on film crossing in front of the sun? Tony and his team of experts are on the case."
      },
      {
        "id": "tvmaze:2399575",
        "title": "Modern Day Dinosaur Sighting, Mysterious Lights Above Norway and Girl Punches Down Tree",
        "season": 3,
        "episode": 1,
        "released": "2022-10-07",
        "overview": "Did a Japanese film crew discover proof of a dinosaur living in the African Congo? Are reports of the strange lights above the Hessdalen Valley in Norway a sign of extraterrestrial activity? Does a 12-year-old girl in Russia possess the superhuman strength needed to knock down a tree with just her fists. And has NASA uncovered proof of an alien structure on an asteroid? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2400160",
        "title": "Rubber Duck UFO, Grim Reaper Ice Sculpture and I Killed Bigfoot",
        "season": 3,
        "episode": 2,
        "released": "2022-10-14",
        "overview": "Is a government leaked video of a UFO shaped like a rubber duck the real deal? How is a man in India able to dip his hands in boiling oil and feel no pain? Is the overnight appearance of the Grim Reaper sculpted in ice a deadly omen? And meet the man who claims to have killed Big Foot? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2409257",
        "title": "Aswang, Crashed on Mars, and Giant Wolves",
        "season": 3,
        "episode": 3,
        "released": "2022-10-21",
        "overview": "What's the truth behind the recent caught on camera sightings of a dreaded Filipino creature known as the Aswang. Is there really a big bad wolf stalking the woods of Saskatchewan? What really happened the night a UFO famously appeared over a hotel in Montreal? And is a saucer like object spotted on the surface of Mars really a UFO crash landing site? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2413543",
        "title": "Bigfoot Photobombs Eagle's Nest, Mexican Blackbirds Dive to Their Death, and Human Faced Fish",
        "season": 3,
        "episode": 4,
        "released": "2022-10-28",
        "overview": "Did a trail camera in Michigan capture footage of the elusive sasquatch? What caused a large flock of blackbirds to plunge to their death in Mexico? Is a ghostly phantom that seemingly appears out of nowhere and literally walks through traffic confirmation of a Filipino ghost legend? And is a human faced fish in China the product of genetic modification? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2417156",
        "title": "Marble Mountain Bigfoot, Waldek Mine Whispers, and UFO Buzzes Jet",
        "season": 3,
        "episode": 5,
        "released": "2022-11-04",
        "overview": "Is footage captured by campers at a known Bigfoot hot spot in Northern California the latest evidence that Sasquatch really exists? Did a man in Australia hear the whispers of the dead in an old abandoned gold mine? A Russian Strong Man sticks his neck out on the line when he bends a steel rod with his trachea. And an alleged UFO buzzes a Jet airliner in the skies above Nevada. Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2417157",
        "title": "ISS UFO Swarm, Yale Lake Leaf Monster, and Rat King",
        "season": 3,
        "episode": 6,
        "released": "2022-11-18",
        "overview": "Are images captured by the International Space Station a sign of an imminent alien invasion? Did kayakers in Washington state encounter a lake monster or something even worse? And are rats joining forces to create Super rat collective? Tony Harris and his team of experts dive into these claims to find the truth.."
      },
      {
        "id": "tvmaze:2449952",
        "title": "Witch's Broomstick, UFOs vs. Volcanoes, and Oakville Blobs",
        "season": 3,
        "episode": 7,
        "released": "2023-01-06",
        "overview": "Is a witch's broomstick floating in midair the real deal or just an elaborate Halloween hoax? Are UFOs using volcanoes as hidden bases of operations? Do fossilized footprints found in Texas prove that dinosaurs and humans walked the earth together? And what caused gelatinous blobs of rain to fall from the sky? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2449953",
        "title": "Hook Island Monster, Skydiver's Plane Stall, and Somalia Freighter Phantom",
        "season": 3,
        "episode": 8,
        "released": "2023-01-13",
        "overview": "Is a photo taken in 1965 evidence of the existence of a prehistoric sea monster? How did skydivers survive a death defying jump as their plane stalled out and nearly collided with them? And is a spectral image recorded on a Freighter ship in Somalia proof of a pirate's ghost? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2449954",
        "title": "Panama UFO Disc, Bloody Red Sea, and the Dyatlov Pass Incident",
        "season": 3,
        "episode": 9,
        "released": "2023-01-20",
        "overview": "Is a flying saucer shaped object spotted near the Panama Canal an alien spacecraft? Does the sudden appearance of a bloody red sea in Egypt signal the end of times? And was a group of hikers brutally killed by a Yeti in the mountains of Russia? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2471159",
        "title": "Crocodile Monster, Tiktok USO, and Ghost Dog Collar Removal",
        "season": 3,
        "episode": 10,
        "released": "2023-02-03",
        "overview": "Is Gustav, the legendary man-eating crocodile, accused of killing hundreds of people in Africa, still alive and well today? Are glowing lights spotted in the waters of Mexico the latest proof that Unidentified Submersible Objects are for real? And striking footage emerges out of Phoenix of a pair of dogs who act like they just saw a ghost. Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2545979",
        "title": "Congressional UFOs, New Nessie and Zombie Fish",
        "season": 3,
        "episode": 11,
        "released": "2023-06-09",
        "overview": "Does a video recently presented to Congress by the U.S. Navy prove once and for all that UFOs really exist? Is the latest alleged Loch Ness Monster footage the most compelling proof of the creature's existence in years? How does a zombie fish head bite its way through a tin can? And marine scientists discover a mysterious \"Yellow Brick Road\" at the bottom of the Pacific Ocean. Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2545980",
        "title": "Monster in the Attic, Houston UFO and Utah Bigfoot",
        "season": 3,
        "episode": 12,
        "released": "2023-06-16",
        "overview": "Is a video showing a strange formation of flickering lights the latest proof that Houston is a UFO hotspot? What is this mysterious humanoid creature caught on camera in an abandoned attic? Was the Government caught transporting Alien technology at a top-secret military base? And why the latest Provo Utah Bigfoot sighting seems to put the \"Big\" in Bigfoot. Tony Harris and his team of experts examine the clues and decide the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2545981",
        "title": "Chupacabra, Greatest UFO Photo Ever and Mars Sounds",
        "season": 3,
        "episode": 13,
        "released": "2023-06-30",
        "overview": "What's the truth behind a recent caught on camera sighting of Chupacabra outside of an Amarillo Zoo? Is an aerial photograph taken over Costa Rica the greatest UFO picture ever taken? Are strange sounds recorded on Mars a message from an alien race? And what are the glowing eyed creatures lurking in a Virginia sewer? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2569837",
        "title": "Alien Pilots, Carolina Lights and Stone Cold Animals",
        "season": 3,
        "episode": 14,
        "released": "2023-07-07",
        "overview": "Did a man in Turkey capture footage of alien pilots in a UFO cockpit? What are the strange lights repeatedly spotted over Brown Mountain in North Carolina since before the Civil War? Did an Australian man stumble upon an alien corpse on the sidewalk? And who or what turned these animals to stone? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2572580",
        "title": "Mystery Sea Beast, the Earth is Alive and Shapeshifting UFO",
        "season": 3,
        "episode": 15,
        "released": "2023-07-14",
        "overview": "What is the mysterious sea beast seen from the shore of a small seaside town in the UK? Are summoners able to commune with UFOs? Were a field of massive mysterious jars made by giants? And the ground seems to be breathing. Is the earth alive? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2572581",
        "title": "Hairy Serpents, South Pole Nazis and the Horrible Blob",
        "season": 3,
        "episode": 16,
        "released": "2023-07-21",
        "overview": "What is this serpent like creature caught on camera and why does it have green hair? Is the discovery of an ancient antenna found beneath the waters of Antarctica proof that the Nazis once colonized the south pole? Are these large boulders in Death Valley able to move by themselves? And did a man find a gelatinous alien life form on his kitchen floor? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2597851",
        "title": "UFO Lead, Bigfoot Films, and Lost City in the Gulf of Mexico",
        "season": 3,
        "episode": 17,
        "released": "2023-08-04",
        "overview": "Is the latest video leak from the Department of Homeland Security more evidence that UFOs really exist? Did one of the world's most respected Bigfoot researchers capture footage that proves Sasquatch is no myth? Are seemingly anachronistic works of art the product of time travelers? And did an amateur archeologist really discover a lost, sunken city off the coast of Louisiana? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2598905",
        "title": "Marfa Lights, Devil Goat and Subway Survivor",
        "season": 3,
        "episode": 18,
        "released": "2023-08-11",
        "overview": "Are the famous glowing lights seen above Marfa, Texas a natural or supernatural phenomenon? What spirit possessed a goat to walk down a street like a human? Are mysterious stone carvings in Japan connected to a legendary close encounter? And how did a woman miraculously survive falling on to the subway track as an oncoming train passes by? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2598906",
        "title": "Militant Mermaid, UFOs vs Nukes and Seamonster Chases a Boat",
        "season": 3,
        "episode": 19,
        "released": "2023-08-18",
        "overview": "Scientists study claims of a dead mermaid discovered and preserved in Japan? Are UFOs attracted to our nuclear facilities and should we be worried? What is the glowing eyed sea creature captured on video chasing a motorboat and what are its intentions if it catches up? And is a man who lived alone in the jungle for over a quarter of a century somehow connected to fabled lost city in the Amazon? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2598907",
        "title": "Alien Sabotage, Ghost Child and Hungry Hungry Sasquatch",
        "season": 3,
        "episode": 20,
        "released": "2023-08-25",
        "overview": "Is this home security video proof that UFOs are messing with our technology? Did a species of carnivorous marsupials thought to be long extinct just get caught on camera? Did a visitor at a historic cemetery in Savannah capture home video of a ghost child? And a metal detectorist claims to have recorded the sound a hungry Bigfoot in the Alaskan wilderness. Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2639937",
        "title": "The Bigfoot Files",
        "season": 4,
        "episode": 1,
        "released": "2023-10-06",
        "overview": "Tony Harris separates the real from the fake in some of the most compelling Bigfoot evidence recently captured. Are footprint casts from Mt. St. Helens proof that a massive, undiscovered primate lives in North America? Have a father and son team captured the most convincing footage of Bigfoot since the famous Patterson-Gimlin film, using a thermal imaging camera? Harris and a collection of top researchers, investigators, academics, and scientists, evaluate the latest and most intriguing sounds, photos and videos, to analyze and pass verdicts on their authenticity."
      },
      {
        "id": "tvmaze:2646525",
        "title": "UFO Over the Andes, the Ohio Grassman, and Ancient Horn Mystery",
        "season": 4,
        "episode": 2,
        "released": "2023-10-13",
        "overview": "Did a Chilean family photograph a real UFO flying above the Andes Mountains? Is footage of a tall, dark-colored, hairy creature walking through the woods proof the legendary Ohio Grassman exists? Does a huge, 5,000-year-old horn discovered on a beach in England belong to a prehistoric creature that still lives? Scientists and citizens attempt to decipher the mysterious inscription of a sword found in River Witham, Lincolnshire. Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2646526",
        "title": "Men in Black Calls, Old Kentucky Aliens, and Mysterious Eclipse",
        "season": 4,
        "episode": 3,
        "released": "2023-10-20",
        "overview": "Did a loyal viewer capture an image of an alien probe? What is the identity of a bizarre creature spotted on a driveway camera? Did the legendary Men in Black call a man and threaten him? How did a family survive a bolt of lightning ripping through a car in a Kansas storm? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2664904",
        "title": "Orb & Crash Debris, KGB UFOs and Aliens, and Superhuman Reflexes",
        "season": 4,
        "episode": 4,
        "released": "2023-11-03",
        "overview": "Are a silver orb in the sky, and alleged crash debris from a UFO? Does a 65-year-old-man have some of the fastest hands in the west, or a taste for danger? Are an infamous spy organizations footage of UFOs and aliens the real deal? And what is the bizarre creature that washed ashore on a beach in Russia?"
      },
      {
        "id": "tvmaze:2664905",
        "title": "Beastly Howls, Holloman Air Force Base UFO and the Cabin that Defies Gravity",
        "season": 4,
        "episode": 5,
        "released": "2023-11-10",
        "overview": "Is a photograph of a UFO hovering over Holloman Air Force Base in New Mexico confirmation that President Eisenhower had a Top-Secret meeting with aliens there? Is a cabin built in a supposedly anomalous spot in the Redwood Forests defying the laws of gravity? What is the origin of frightening howls recorded in Witset, British Columbia? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2664906",
        "title": "Mystery Bird Monster, Ancient Alien Satellite and Behemoth of the Sea Bottom",
        "season": 4,
        "episode": 6,
        "released": "2023-11-17",
        "overview": "What is the strange creature caught on a security camera in Youngstown, OH? Did a Proof viewer manage to film the infamous Black Knight satellite? What is the origin of a sound so loud it could be heard over the entire Equatorial Pacific Ocean? Is an unidentified and giant creature calling out from extreme ocean depths Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2741879",
        "title": "Caddy the Cadborosaurus, the Lubbock Lights, and Living Mummy",
        "season": 4,
        "episode": 7,
        "released": "2024-02-16",
        "overview": "Did a fisherman capture footage of a giant sea serpent known as \"Caddy?\" What's the explanation for the mysterious blue and green flashing lights, witnessed by hundreds of people, in Lubbock, Texas in August of 1951? Is a centenarian monk trying to mummify himself? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2741880",
        "title": "The UFO Files",
        "season": 4,
        "episode": 8,
        "released": "2024-02-23",
        "overview": "In an all-UFO special, Tony Harris breaks down the latest developments and most compelling photographic evidence in a tumultuous year of UFO revelations. Are the most recent UAP incidents presented to the U.S. Congress proof that UAPS are a threat to national security? Are these UAPS misidentified earthly craft, or genuine UFOs? And has the U.S really recovered alien crash debris? Harris and a collection of top researchers, investigators, academics, and scientists, evaluate the latest alleged UFO images and pass verdicts on their authenticity."
      },
      {
        "id": "tvmaze:2768793",
        "title": "Falcon 9 Mystery, Demonic Wall Climber and Leningrad Alien Fetus",
        "season": 4,
        "episode": 9,
        "released": "2024-03-01",
        "overview": "Are reports of a strange swirling vortex with a brilliant white center in the skies over Oklahoma proof of a genuine UFO? Does a video claimed to be discovered sealed in Vatican archives, show a real case of demonic possession? What is the mysterious looking creature discovered by a woman in Russia while wading in the waters in the town of Sosnovy Bor? Do large unidentified footprints found by Alaskan wildlife experts belong to a Yeti? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:2768794",
        "title": "Worm in the Sky, Skeletal Mystery Remains and Thessaloniki Mystery Sounds",
        "season": 4,
        "episode": 10,
        "released": "2024-03-08",
        "overview": "What is the odd, worm-like object seen in the sky in a video Tweeted by a Proof viewer? Did an ROV find the remains of a massive skeleton 2700 ft below the surface of the Mediterranean? Why does a building seen in the distance appear to be shrinking as a family drive closer and closer to it? What is causing the banging noises, described as thunderous and even unearthly, that jolts the residents of Thessaloniki awake every night? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2770130",
        "title": "Spontaneous Human Combustion, the Tell-Tale Hum and UFO Explosion",
        "season": 4,
        "episode": 11,
        "released": "2024-03-15",
        "overview": "Are black and white photos taken in 1951 proof that a woman in St. Petersburg, Florida spontaneously combusted? What is the brain-numbing noise plaguing Brooklyn residents? Did a woman witness something even scarier than a Chinese Spy Balloon being shot down over Billings, Montana? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:2770131",
        "title": "Teen UFO, Flying Dinosaur Over Idaho and Headless Goats",
        "season": 4,
        "episode": 12,
        "released": "2024-03-22",
        "overview": "Did a Swedish teenager photograph some of the most convincing UFO evidence ever? Is a video posted online showing a pterodactyl-like creature flying over Idaho the real deal? Why are headless goats repeatedly being dumped in an Atlanta River? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:2990779",
        "title": "Swamp Beast Sighting, Martian Conspiracy and Transparent Mexican Sea Monster",
        "season": 4,
        "episode": 13,
        "released": "2024-10-04",
        "overview": "Did a canoer capture footage of the legendary Bigfoot-like Skunk Ape walking in gator infested waters? Is NASA lying to us about the success of our Mars probes and presenting the public with footage that was shot in a remote location in Canada? What is the mysterious transparent so-called Sea Monster recently discovered in Mexico? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3002963",
        "title": "Wooly Mammoth Sighting, Ohio Bigfoot Howl and Killer Robot",
        "season": 4,
        "episode": 14,
        "released": "2024-10-11",
        "overview": "Did a filmmaker capture footage of a wooly mammoth crossing a river in Siberia? Is a recording of a long moaning howl proof that Bigfoot lives in Ohio? Is Sophia the talking robot really out to destroy humanity? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3002964",
        "title": "Classic UFO, Headless Zombie Fish and Crying Virgin Mary",
        "season": 4,
        "episode": 15,
        "released": "2024-10-18",
        "overview": "Did an Italian reconnaissance pilot capture genuine UFO photos in 1979? Is a wooden statue of the Virgin Mary that allegedly cries and bleeds from the palms of its hands proof of a miracle? How and why is a decapitated fish able to continue to swim and is it some kind of zombie? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:3002965",
        "title": "Honey Island Swamp Monster, Sphere Sightings and Abominable Shark Killer",
        "season": 4,
        "episode": 16,
        "released": "2024-10-25",
        "overview": "Is this newly found footage from the 1970's proof that sasquatch is living in the swamps of Louisiana? What's up with the recent trend in flying sphere sightings and should we be concerned? What is the seemingly giant, and horrifying creature captured on video, seen attacking and devouring a shark? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3025842",
        "title": "UFO Over Pakistan, Antarctic Dino-whale and Dead Bird Floating",
        "season": 4,
        "episode": 17,
        "released": "2024-11-01",
        "overview": "What is the mysterious object filmed by airline pilots flying 35,000 feet over Pakistan? Did a Japanese research vessel capture footage of the legendary aquatic humanoid whale-like creature known as the Ningen? How and why is a dead bird caught on camera suspended in mid-air? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3025843",
        "title": "Chupacabra Carcass, Alien Minerals, & Spawn of Nessie",
        "season": 4,
        "episode": 18,
        "released": "2024-11-08",
        "overview": "Did a rancher find a Chupacabra carcass in the San Antonio, Texas area? Did scientists studying a 15-ton meteorite discover new minerals that are proof of an alien civilization? Is a video of a dozen dinosaur-like creatures running out of the waterproof of miniature Loch Ness Monsters? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3216320",
        "title": "Alien Golden Orb, Yeti Caught on Tape, Las Vegas Close Encounter",
        "season": 5,
        "episode": 1,
        "released": "2025-06-13",
        "overview": "Did ocean scientists discover an unknown life form? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3241635",
        "title": "Infrared UFO Attack, Human Bear, & Underwater Crop Circles",
        "season": 5,
        "episode": 2,
        "released": "2025-06-20",
        "overview": "Did a UFO follow two researchers home from an investigation? How did a bear learn to act like a human? Tony Harris and his team examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3241636",
        "title": "Bigfoot Train Sighting, Jesus and Aliens, and Iceland's Loch Ness Monster",
        "season": 5,
        "episode": 3,
        "released": "2025-06-27",
        "overview": "Did a couple in Colorado spot Bigfoot from the window of a moving train? Tony Harris and his team of experts look to find the truth."
      },
      {
        "id": "tvmaze:3275190",
        "title": "Mississippi Bigfoot, UFO Shot Down Over Great Lakes, & Mexico's Alien Corpses",
        "season": 5,
        "episode": 4,
        "released": "2025-07-11",
        "overview": "Is famous footage of the Mississippi Bigfoot the real deal? Why did the White House order a UFO to be shot down over Lake Huron? What will forensic testing reveal about the alleged alien corpses presented to the Mexican government? Are the strange waves rippling in the clouds over war-torn Aleppo the work of extraterrestrials? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3275191",
        "title": "The Satan Files",
        "season": 5,
        "episode": 5,
        "released": "2025-07-18",
        "overview": "Does the Devil really exist? Tony Harris separates fact from fiction as he investigates photos, videos and sounds that allegedly have a link to Satan."
      },
      {
        "id": "tvmaze:3275193",
        "title": "UFO vs Fighter Jet, Cosmic Question Mark, Highway 97 Bigfoot Howls",
        "season": 5,
        "episode": 6,
        "released": "2025-07-25",
        "overview": "Was a UFO tracking an American fighter plane? What is the creature recorded undulating in waters off southeastern North Carolina? Tony and his team of experts examine the evidence to find the truth."
      },
      {
        "id": "tvmaze:3301749",
        "title": "First Bigfoot Photo, Howl of the Beast, and UFO at Coronation",
        "season": 5,
        "episode": 7,
        "released": "2025-08-01",
        "overview": "Is a picture taken in the 1890's the first Bigfoot photo ever? Is a recording captured in Pennsylvania a genuine Bigfoot howl? Tony Harris and his team dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3301750",
        "title": "McMinnville UFO Photos, Paranormal Office, and Australian River Beast",
        "season": 5,
        "episode": 8,
        "released": "2025-08-08",
        "overview": "Why are the historic McMinnville photos, captured nearly 75 years ago, still considered by many to be among the most credible and compelling proof for the existence of UFOs?"
      },
      {
        "id": "tvmaze:3301751",
        "title": "Aliens on the Sun, Megalodon in Japan, and the Extraterrestrial Cave",
        "season": 5,
        "episode": 9,
        "released": "2025-08-15",
        "overview": "Did a retired Army aviation officer uncover evidence of intelligent anomalies or technosignatures, in NASA archived solar satellite photos?"
      },
      {
        "id": "tvmaze:3301753",
        "title": "UFO in Disguise, Sasquatch in the Mail, The Watcher in the Bedroom",
        "season": 5,
        "episode": 10,
        "released": "2025-08-22",
        "overview": "Is a mysterious object moving through the sky a UFO disguised as a cloud? Is Lake Superior home to a massive water creature? Is a ghost haunting a young couple's bedroom? Who sent the police an anonymous letter with a terrifying bigfoot photo? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3363685",
        "title": "Charlotte Backyard UFO, Abducted Cow, and Sixteen Day Mummy",
        "season": 5,
        "episode": 11,
        "released": "2025-10-03",
        "overview": "Could the shimmering lights witnessed from a backyard be a fleet of UFOs? Was a cow that smashed through the roof of a barn abducted by aliens? How did a man turn into a mummy in record time?"
      },
      {
        "id": "tvmaze:3365404",
        "title": "Bigfoot Car Chase, Airport UFO, and High School Football Ghost",
        "season": 5,
        "episode": 12,
        "released": "2025-10-10",
        "overview": "Was a family driving in their car chased by an angry Bigfoot? Did a UFO nearly hit a plane flying over New York City? Is the spirit of a deceased student haunting a high school football game?"
      },
      {
        "id": "tvmaze:3365405",
        "title": "Jellyfish UFO, Alabama's Loch Ness Monster, and Miami Mall Alien",
        "season": 5,
        "episode": 13,
        "released": "2025-10-17",
        "overview": "A mysterious object flies over a military basecould it actually be alive? Is there a giant sea creature lurking off the coast of Alabama? Did an alien trigger a massive police response at a Miami shopping mall?"
      },
      {
        "id": "tvmaze:3365406",
        "title": "Siberian Yeti, Amazonian Alien Researcher, and Japanese Wolves Resurrected",
        "season": 5,
        "episode": 14,
        "released": "2025-10-31",
        "overview": "A group of children find footprints in the Siberian snow - do they belong to a Yeti? Did a researcher capture evidence of UFOs flying over the Amazon rainforest? Is it possible the long extinct Japanese Wolf has come back to life?"
      },
      {
        "id": "tvmaze:3394710",
        "title": "Hikers and the Alien, Mojave UFO, Zombie Crawler",
        "season": 5,
        "episode": 15,
        "released": "2025-11-07",
        "overview": "Do the chemicals found on two fishermen's clothes prove they were abducted by aliens? Are UFOs monitoring our military? Tony Harris and his team of experts dive into these claims to find the truth."
      },
      {
        "id": "tvmaze:3394711",
        "title": "Mummified Finger of a Giant, Independence Day Bigfoot, & UFO Wave",
        "season": 5,
        "episode": 16,
        "released": "2025-11-14",
        "overview": "What set off a historic wave of UFO sightings in Belgium? Tony Harris and his team of experts examine the clues and make a determination about the validity of what we're seeing."
      },
      {
        "id": "tvmaze:3394712",
        "title": "UFO Scorch Marks, Turkey's Loch Ness Monster, and Torch-Eater",
        "season": 5,
        "episode": 17,
        "released": "2025-11-21",
        "overview": "Are UFOs behind bizarre scorch marks found in a farmer's field? Could a massive creature be lurking in a Turkish lake? Is there a superhuman that can withstand heat of nearly six thousand degrees?"
      },
      {
        "id": "tvmaze:3394713",
        "title": "Apollo 16 UFO, Radiation Burn Mystery, and Bosnian Spheres",
        "season": 5,
        "episode": 18,
        "released": "2025-11-28",
        "overview": "Is it possible Apollo 16 astronauts witnessed a UFO during a trip to the Moon? Did an alien craft leave a pattern of burns on a man's body? Are perfectly carved stone spheres discovered in Bosnia proof of extraterrestrials?"
      }
    ]
  }
}