{
  "meta": {
    "id": "tvmaze:2212",
    "type": "series",
    "name": "Celebrity Family Feud",
    "description": "Teams of celebrities and their families face off to name the top responses to questions posed to 100 people.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/577/1442527.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/577/1442527.jpg",
    "videos": [
      {
        "id": "tvmaze:3433237",
        "title": "The Housemaid vs The Housewives All-Stars Holiday Special",
        "season": 11,
        "episode": 10,
        "released": "2025-12-04",
        "overview": "Hosted by Steve Harvey, it's an all-star holiday special as the cast of \"The Housemaid\" faces off against fan favorites from \"The Real Housewives\" for their selected charities."
      },
      {
        "id": "tvmaze:181500",
        "title": "Anthony Anderson vs Toni Braxton and Monica Potter vs Curtis Stone",
        "season": 1,
        "episode": 1,
        "released": "2015-06-21",
        "overview": "Actor Anthony Anderson's (black-ish) family vs 7-time Grammy Award-winning artist Toni Braxton and her sisters; and in a separate game, family members from Australian celebrity chef Curtis Stone and actress Monica Potter spar off against each other to win money for a charity of their choice."
      },
      {
        "id": "tvmaze:181501",
        "title": "NFL AFC vs NFC and Dancing with the Stars vs The Bachelor",
        "season": 1,
        "episode": 2,
        "released": "2015-06-28",
        "overview": "\"Celebrity Family Feud\" will feature players from the National Football League Players Association (NFLPA), and in a separate game, professional dancers from \"Dancing With the Stars\" and popular participants from the romantic reality shows \"The Bachelor\" and \"The Bachelorette\" will spar off against each other to win money for a charity of their choice. Hosted by Steve Harvey, the highly popular multi-hyphenate standup comedian, actor, author, deejay and Emmy Award-winning talk show and game show host."
      },
      {
        "id": "tvmaze:184053",
        "title": "Dr. Phil McGraw vs Garry & Penny Marshall and Kevin McHale vs Fred Willard",
        "season": 1,
        "episode": 3,
        "released": "2015-07-05",
        "overview": "Celebrity competitors include Dr. Phil McGraw vs. directors Garry and Penny Marshall and actor Kevin McHale vs. actor Fred Willard."
      },
      {
        "id": "tvmaze:181503",
        "title": "Cheryl Hines vs Niecy Nash and Duck Dynasty vs Katy Mixon",
        "season": 1,
        "episode": 4,
        "released": "2015-07-12",
        "overview": "Celebrity competitors include actress Cheryl Hines vs. actress Niecy Nash and \"Duck Dynasty\" cast members vs. actress Katy Mixon."
      },
      {
        "id": "tvmaze:181504",
        "title": "Rob Gronkowski vs Holly Robinson Peete and Bill Engvall vs Keke Palmer",
        "season": 1,
        "episode": 5,
        "released": "2015-07-19",
        "overview": "Celebrity competitors include professional football player Rob Gronkowski vs. actress Holly Robinson Peete and comic Bill Engvall vs. actress Keke Palmer."
      },
      {
        "id": "tvmaze:181505",
        "title": "Joey Lawrence vs Mario Lopez and Ed Asner vs Vicki Lawrence",
        "season": 1,
        "episode": 6,
        "released": "2015-07-26",
        "overview": "Celebrity competitors on tonight's episode include Joey Lawrence vs Mario Lopez and Ed Asner vs Vicki Lawrence."
      },
      {
        "id": "tvmaze:730990",
        "title": "Lance Bass vs Kellie Pickler and Ernie Hudson vs Nene Leakes",
        "season": 2,
        "episode": 1,
        "released": "2016-06-26",
        "overview": "The celebrity families competing to win cash for their charities feature the families from award-winning country music recording artist Kellie Pickler; and Lance Bass, member of the multi-platinum pop boy band *NSYNC. In a separate game, family members from NeNe Leakes, star of ABC's \"To Tell the Truth,\" will compete against the family of actor Ernie Hudson."
      },
      {
        "id": "tvmaze:832690",
        "title": "AFC Defense vs NFC Offense and AFC Offense vs NFC Defense",
        "season": 2,
        "episode": 2,
        "released": "2016-07-03",
        "overview": "Celebrity contestants include football players from the AFC and NFC offense and defense teams."
      },
      {
        "id": "tvmaze:843087",
        "title": "Snoop Dogg vs Sugar Ray Leonard and Laila Ali vs George Hamilton",
        "season": 2,
        "episode": 3,
        "released": "2016-07-10",
        "overview": "The celebrity families competing to win cash for their charities feature the families from rapper and actor Snoop Dogg and legendary sports icon Sugar Ray Leonard. In a separate game, family members from world champion boxer Laila Ali will compete against the family of actress and producer Alana Stewart and actor George Hamilton."
      },
      {
        "id": "tvmaze:848103",
        "title": "Professional Boxers Showdown and Joely Fisher vs Tony Hawk",
        "season": 2,
        "episode": 4,
        "released": "2016-07-17",
        "overview": "The celebrity families competing to win cash for their charities feature the families of celebrity chef and cooking show TV host Paula Deen and Emmy-winning TV star and celebrity stylist Carson Kressley. In a separate game, family members of \"Modern Family\" star Rico Rodriguez will compete against the family of actor Jaleel White."
      },
      {
        "id": "tvmaze:846452",
        "title": "The Band Perry vs Giuliana Rancic and Melissa Joan Hart vs Paul Sorvino",
        "season": 2,
        "episode": 5,
        "released": "2016-07-24",
        "overview": ""
      },
      {
        "id": "tvmaze:846453",
        "title": "Bachelors vs Bachelorettes and Indy Car Drivers vs Sports Illustrated Models",
        "season": 2,
        "episode": 6,
        "released": "2016-07-31",
        "overview": ""
      },
      {
        "id": "tvmaze:846456",
        "title": "Paula Deen vs Carson Kressley and Rico Rodriguez vs Jaleel White",
        "season": 2,
        "episode": 7,
        "released": "2016-08-14",
        "overview": "Celebrity battles include chef Paula Deen versus stylist Carson Kressley and actor Rico Rodriguez versus actor Jaleel White."
      },
      {
        "id": "tvmaze:895170",
        "title": "Tommy Davidson vs Kristi Yamaguchi and Dave Foley vs Jalen Rose",
        "season": 2,
        "episode": 8,
        "released": "2016-08-21",
        "overview": "Celebrity contestants include Tommy Davidson, Kristi Yamaguchi, Dave Foley and Jalen Rose."
      },
      {
        "id": "tvmaze:846457",
        "title": "Gus Kenworthy vs Sheryl Underwood and David Chokachi vs Alan Thicke",
        "season": 2,
        "episode": 9,
        "released": "2016-08-28",
        "overview": "The celebrity teams competing to win cash for their charities feature the family of Olympic silver medalist and freeskiing champion Gus Kenworthy, facing off against the family of \"The Talk\" co-host and contributor to the \"Steve Harvey Morning Show\" Sheryl Underwood. In a separate game, the family of actor David Chokachi, known for his role as Cody Madison on \"Baywatch,\" will take on the family of Alan Thicke, best known as the father from the classic sitcom \"Growing Pains.\""
      },
      {
        "id": "tvmaze:846458",
        "title": "Garrett Morris vs Alfonso Ribeiro and Todd Chrisley vs Sara Evans",
        "season": 2,
        "episode": 10,
        "released": "2016-09-11",
        "overview": "Celebrity competitors include actor Garrett Morris vs. actor Alfonso Ribeiro and reality TV star Todd Chrisley vs. singer Sara Evans."
      },
      {
        "id": "tvmaze:1136611",
        "title": "Kelly Clarkson vs. Amy Schumer and Bindi Irwin vs. Chrissy Metz",
        "season": 3,
        "episode": 1,
        "released": "2017-06-11",
        "overview": "Celebrity battles include singer Kelly Clarkson vs. comic Amy Schumer and conservationist Bindi Irwin vs. actress Chrissy Metz."
      },
      {
        "id": "tvmaze:1212772",
        "title": "Eva Longoria vs George Lopez and Yvette Nicole Brown vs Ashley Graham",
        "season": 3,
        "episode": 2,
        "released": "2017-06-18",
        "overview": "The celebrity teams competing to win cash for their charities features friends of actress/director/producer Eva Longoria and actor/comedian George Lopez; and family members from the internationally known model, designer and body activist Ashley Graham will take on the family of film and television actress Yvette Nicole Brown."
      },
      {
        "id": "tvmaze:1201722",
        "title": "Harvey Family Men Vs Harvey Family Women And Kareem Abdul-jabbar Vs Ralph Sampson",
        "season": 3,
        "episode": 3,
        "released": "2017-06-25",
        "overview": "The men of Steve Harvey's family face off against the women; Kareem Abdul-Jabbar faces off with Ralph Sampson."
      },
      {
        "id": "tvmaze:1218190",
        "title": "MLB Legends vs NBA Legends and NFL All-Stars vs NFL Legends",
        "season": 3,
        "episode": 4,
        "released": "2017-07-09",
        "overview": "Celebrities competing to win cash for charity include former professional baseball player Ozzie Smith, former NBA player James Worthy, and former professional football players Le'Veon Bell and Marshall Faulk."
      },
      {
        "id": "tvmaze:1224503",
        "title": "Neil deGrasse Tyson vs Rick Fox and Boy Band vs Girl Group",
        "season": 3,
        "episode": 5,
        "released": "2017-07-16",
        "overview": "The celebrity teams competing to win cash for their charities features the families of cosmologist, author and astrophysicist Neil deGrasse Tyson and NBA Champion, actor and businessman Rick Fox. In a separate game, a boy-band team will take on girl-group members."
      },
      {
        "id": "tvmaze:1235663",
        "title": "Funny Gals vs Funny Guys and Louie Anderson vs Christina Milian",
        "season": 3,
        "episode": 6,
        "released": "2017-07-23",
        "overview": "The celebrity teams competing to win cash for their charities feature comedians/actors from popular shows like \"Grace &amp; Frankie,\" \"Fresh Off the Boat\" and \"Saturday Night Live.\" In a separate game, family members from the multi-talented actress/singer/businesswoman Christina Milian will take on iconic comedian Louie Anderson and his family."
      },
      {
        "id": "tvmaze:1250209",
        "title": "Bachelors vs Bachelorettes and Sandra Lee vs Lea Thompson",
        "season": 3,
        "episode": 7,
        "released": "2017-08-06",
        "overview": "The celebrity teams competing against each other to win cash for their charities feature participants from ABC's hit reality television shows, \"The Bachelor\" and \"The Bachelorette.\" In a separate game, the families rivaling each other are from multiple Emmy Award-winning lifestyle expert Sandra Lee, and director, producer and actress Lea Thompson."
      },
      {
        "id": "tvmaze:1267029",
        "title": "Jennie Garth vs Kyle Massey and Lee Brice vs Jerrod Niemann",
        "season": 3,
        "episode": 8,
        "released": "2017-08-27",
        "overview": "Celebrity battles include actress Jennie Garth vs. actor Kyle Massey and singer-songwriters Lee Brice vs. Jerrod Niemann."
      },
      {
        "id": "tvmaze:1267030",
        "title": "Faith Evans vs Ross Mathews and USA Gymnastics vs USA Swimming",
        "season": 3,
        "episode": 9,
        "released": "2017-09-24",
        "overview": "Faith Evans and her family battle Ross Matthews and his family; and legendary Olympians from the U.S. gymnastics team square off against celebrated athletes from the U.S. Olympic swim team."
      },
      {
        "id": "tvmaze:1285726",
        "title": "Dancing with the Stars vs Shark Tank and Cynthia Bailey vs Kandi Burruss-Tucker",
        "season": 3,
        "episode": 10,
        "released": "2017-09-26",
        "overview": "The celebrity teams competing to win cash for their charities feature professional dancers from the iconic \"Dancing with the Stars\" and from the multi-Emmy Award-winning \"Shark Tank,\" the Sharks and one of the show's successful entrepreneurs. In a separate game, family members headed up by \"The Real Housewives of Atlanta\" celebrity team captains Kandi Burruss and Cynthia Bailey will take on each other."
      },
      {
        "id": "tvmaze:1451266",
        "title": "The Kardashians vs The West Family",
        "season": 4,
        "episode": 1,
        "released": "2018-06-10",
        "overview": "The hour-long episode will feature the family that everyone has been waiting to see battle it out on \"Celebrity Family Feud,\" the Kardashian family vs. the West family!"
      },
      {
        "id": "tvmaze:1478645",
        "title": "Inside the NBA vs MLB All-Stars and Rashad Jennings vs Team Eve",
        "season": 4,
        "episode": 2,
        "released": "2018-06-17",
        "overview": "The celebrity teams competing to win cash for their charities feature iconic NBA analysts from \"Inside the NBA\" on TNT verses baseball and softball all-stars from Team MLB. In a separate game, family members headed up by celebrity team captains, rapper Eve and retired running back Rashad Jennings."
      },
      {
        "id": "tvmaze:1477831",
        "title": "Steph Curry vs Chris Paul and Laurie Hernandez vs Shawn Johnson East",
        "season": 4,
        "episode": 3,
        "released": "2018-06-24",
        "overview": "The celebrity teams competing to win cash for their charities feature NBA All-Star Chris Paul and NBA Champion Steph Curry. In a separate game, family members headed up by Olympic gymnasts Laurie Hernandez and Shawn Johnson East."
      },
      {
        "id": "tvmaze:1479573",
        "title": "Jeff Dunham vs Ming-Na Wen and Taye Diggs vs Caroline Rhea",
        "season": 4,
        "episode": 4,
        "released": "2018-07-08",
        "overview": "The celebrity teams competing to win cash for their charities feature comedian and ventriloquist Jeff Dunham and actress Ming-Na Wen (\"Marvel's Agents of S.H.I.E.L.D.\" and \"Mulan\"). In a separate game, family members of actor Taye Diggs and actress Caroline Rhea (\"Caroline and Friends\") will compete."
      },
      {
        "id": "tvmaze:1479767",
        "title": "Sherri Shepherd vs Ian Ziering and Tommy Chong vs Derek Fisher & Gloria Govan",
        "season": 4,
        "episode": 5,
        "released": "2018-07-15",
        "overview": "The celebrity teams competing to win cash for their charities feature former co-host ofThe ViewSherri Shepherd and actor Ian Ziering. In a separate game, family members of actor-comedian Tommy Chong compete against five-time NBA Champion Derek Fisher and his fiancee, television host Gloria Govan."
      },
      {
        "id": "tvmaze:1481384",
        "title": "Grey's Anatomy vs. Station 19 and Aly & AJ vs. Adrienne Houghton",
        "season": 4,
        "episode": 6,
        "released": "2018-07-22",
        "overview": "The celebrity teams competing to win cash for their charities feature an all-star lineup from ABC's long-running hit series, Grey's Anatomy versus a stellar roster of stars from ABC's new hit Station 19. In a separate game, family members of American pop-rock duo Aly &amp; AJ and Adrienne Houghton, co-host of The Real, compete."
      },
      {
        "id": "tvmaze:1483340",
        "title": "Scotty McCreery vs Chris Kattan and Amber Riley vs Tori Spelling & Dean McDermott",
        "season": 4,
        "episode": 7,
        "released": "2018-08-05",
        "overview": "The celebrity teams competing to win cash for their charities feature country music artist Scotty McCreery and actor-comedian Chris Kattan. In a separate game, family members of actress Amber Riley and actress Tori Spelling alongside her husband, actor-host Dean McDermott, compete."
      },
      {
        "id": "tvmaze:1500249",
        "title": "Emmitt Smith vs Todd Gurley II and Craig Robinson vs Casey Wilson",
        "season": 4,
        "episode": 8,
        "released": "2018-08-12",
        "overview": "The celebrity teams competing to win cash for their charities feature NFL Hall of Fame running back Emmitt Smith and Los Angeles Rams All-Pro running back Todd Gurley II. In a separate game, family members of comedian/actor Craig Robinson (\"The Office\") and actress Casey Wilson (\"Saturday Night Live\") will compete."
      },
      {
        "id": "tvmaze:1507967",
        "title": "Team Vanilla Ice vs Kim Fields and Team Ice-T & Coco vs Vivica A. Fox",
        "season": 4,
        "episode": 9,
        "released": "2018-08-26",
        "overview": "The celebrity teams competing to win cash for their charities feature Vanilla Ice (\"The Vanilla Ice Project\") and actress/director Kim Fields. In a separate game, rapper Ice-T &amp; his wife, Coco, compete against actress Vivica A. Fox (\"Empire\") along with their families."
      },
      {
        "id": "tvmaze:1517381",
        "title": "NFLPA Veterans vs. NFLPA Rookies and Wanda Sykes vs. Nia Vardalos",
        "season": 4,
        "episode": 10,
        "released": "2018-09-16",
        "overview": "The celebrity teams competing to win cash for their charities feature the NFLPA Veterans led by the Tampa Bay Buccaneers' Gerald McCoy and the NFLPA Rookies led by the Chicago Bears' Mitch Trubisky. In a separate game, family members of comedian and actress Wanda Sykes (\"black-ish\") and actress Nia Vardalos (\"My Big Fat Greek Wedding\") will compete."
      },
      {
        "id": "tvmaze:1521722",
        "title": "The Kardashians vs. The West Family and Jana Kramer vs. Gary Busey",
        "season": 4,
        "episode": 11,
        "released": "2018-09-23",
        "overview": "One of this season's favorite games of \"Celebrity Family Feud,\" the Kardashian family vs. the West family, will be featured. Then in a new, separate game, actress and country music star Jana Kramer competes against Academy Award(R) nominee and author Gary Busey, along with their families."
      },
      {
        "id": "tvmaze:1638358",
        "title": "Chrissy Teigen & John Legend vs Vanderpump Rules and Terry & Rebecca Crews vs Karamo Brown",
        "season": 5,
        "episode": 1,
        "released": "2019-06-09",
        "overview": ""
      },
      {
        "id": "tvmaze:1666098",
        "title": "The Chainsmokers vs 5 Seconds of Summer and Boris Kodjoe & Nicole Ari Parker vs Roselyn Sanchez & Eric Winter",
        "season": 5,
        "episode": 2,
        "released": "2019-06-30",
        "overview": ""
      },
      {
        "id": "tvmaze:1668656",
        "title": "Victoria's Secret Angels vs. Bachelor Men and Gaten Matarazzo vs. Maddie & Mackenzie Ziegler",
        "season": 5,
        "episode": 3,
        "released": "2019-07-07",
        "overview": "Victoria's Secret's legendary Angels will take on a team of some of Bachelor Nation's most popular bachelors, as they compete to win cash for their charities. The next game of the night features \"Stranger Things\" star Gaten Matarazzo facing off against teen dance sensation Maddie Ziegler and her sister, pop star Mackenzie, along with members of their respective families."
      },
      {
        "id": "tvmaze:1668655",
        "title": "Maria Menounos vs. Jeannie Mai and NFL Legends vs. NFL All-Stars",
        "season": 5,
        "episode": 4,
        "released": "2019-07-14",
        "overview": ""
      },
      {
        "id": "tvmaze:1638426",
        "title": "Brooklyn Decker & Andy Roddick vs. Bobby Bones and Tara Lipinski vs. Johnny Weir",
        "season": 5,
        "episode": 5,
        "released": "2019-07-21",
        "overview": ""
      },
      {
        "id": "tvmaze:1672840",
        "title": "Maulers vs. Brawlers and 'Descendants 3' vs. 'American Housewife'",
        "season": 5,
        "episode": 6,
        "released": "2019-07-28",
        "overview": "Professional boxers compete against each other; the cast of \"Descendants 3\" compete against the cast of \"American Housewife.\""
      },
      {
        "id": "tvmaze:1687412",
        "title": "Milo & Camryn Manheim vs. Marissa-Jaret Winokur and Bella Twins vs. MMA Fighters",
        "season": 5,
        "episode": 7,
        "released": "2019-08-18",
        "overview": ""
      },
      {
        "id": "tvmaze:1690386",
        "title": "Ninja vs. Juju and Jerry Springer vs. Doug Flutie",
        "season": 5,
        "episode": 8,
        "released": "2019-08-25",
        "overview": ""
      },
      {
        "id": "tvmaze:1697030",
        "title": "Terry Bradshaw vs. Adam Rippon and Skai Jackson vs. Hudson Yang",
        "season": 5,
        "episode": 9,
        "released": "2019-09-15",
        "overview": "Terry Bradshaw vs. Adam Rippon and Skai Jackson vs. Hudson Yang"
      },
      {
        "id": "tvmaze:1697791",
        "title": "John Legend & Chrissy Teigen vs. The Cast of Vanderpump Rules and Ryan Lochte vs. Kevin Eubanks",
        "season": 5,
        "episode": 10,
        "released": "2019-09-22",
        "overview": "John Legend &amp; Chrissy Teigen vs. The Cast of Vanderpump Rules and Ryan Lochte vs. Kevin Eubanks"
      },
      {
        "id": "tvmaze:1711417",
        "title": "black-ish vs. The Goldbergs",
        "season": 5,
        "episode": 11,
        "released": "2019-09-29",
        "overview": "Anthony Anderson, Tracee Ellis Ross, Jeff Garlin and members of their respective ABC television families challenge each other in a hilarious contest of barbs and banter as they compete to win cash for their charities on the season finale of \"Celebrity Family Feud. \""
      },
      {
        "id": "tvmaze:1839461",
        "title": "Queer Eye: OG vs. Queer Eye: The New Class",
        "season": 6,
        "episode": 1,
        "released": "2020-05-31",
        "overview": "Original \"Queer Eye\" cast members Carson Kressley, Ted Allen, Kyan Douglas, Thom Filicia and Jai Rodriguez face off against Bobby Berk, Jonathan Van Ness, Antoni Porowski, Tan France and Wesley Hamilton of the new series."
      },
      {
        "id": "tvmaze:1865597",
        "title": "Andy Cohen vs. Real Housewives of Beverly Hills and Kevin Nealon vs. Drew Carey",
        "season": 6,
        "episode": 2,
        "released": "2020-06-07",
        "overview": "Celebrity contestants Andy Cohen, Kyle Richards, Lisa Rinna, Dorit Kemsley, Garcelle Beauvais, Teddi Mellencamp, Drew Carey and Kevin Nealon."
      },
      {
        "id": "tvmaze:1869066",
        "title": "The Bold Type vs. RuPaul's Drag Race",
        "season": 6,
        "episode": 3,
        "released": "2020-06-14",
        "overview": "Katie Stevens and cast members from \"The Bold Type\" take on RuPaul and the team from \"RuPaul's Drag Race.\""
      },
      {
        "id": "tvmaze:1871450",
        "title": "Cedric The Entertainer vs. Wayne Brady and The Hills: New Beginnings vs. Jersey Shore: Family Vacation",
        "season": 6,
        "episode": 4,
        "released": "2020-06-28",
        "overview": "Comic Wayne Brady competes with actor Cedric The Entertainer and the cast of \"The Neighborhood\"; cast members from \"The Hills: New Beginnings\" and \"Jersey Shore: Family Vacation\" compete."
      },
      {
        "id": "tvmaze:1871451",
        "title": "NFLPA Hall of Famers vs. NFLPA Rising Stars",
        "season": 6,
        "episode": 5,
        "released": "2020-07-12",
        "overview": "NFL Players Association Hall of Famers and rising stars compete."
      },
      {
        "id": "tvmaze:1923137",
        "title": "Ray Romano vs. Brad Garrett and Fall Out Boy vs. Weezer",
        "season": 6,
        "episode": 6,
        "released": "2020-09-20",
        "overview": "Ray Romano and his family go up against Brad Garrett, Sam Fedele, Deb Gutierrez, Paul Ogata and Ralph Harris; Fall Out Boy faces off with Weezer and Suzy Shinn."
      },
      {
        "id": "tvmaze:1902175",
        "title": "Kathie Lee Gifford vs. Ricki Lake and 2 Chainz vs. Big Boi",
        "season": 6,
        "episode": 7,
        "released": "2020-09-24",
        "overview": "Kathie Lee Gifford, Ricki Lake, 2 Chainz and Big Boi compete."
      },
      {
        "id": "tvmaze:1924539",
        "title": "Joel McHale vs. Ben Feldman and Jesse Palmer vs. Ceelo Green",
        "season": 6,
        "episode": 8,
        "released": "2020-10-01",
        "overview": "Joel McHale goes up against Ben Feldman; Jesse Palmer goes up against Ceelo Green."
      },
      {
        "id": "tvmaze:1931368",
        "title": "NFLPA Legends vs. NFLPA Pro-Bowlers and Macklemore vs. Lil Yachty",
        "season": 6,
        "episode": 9,
        "released": "2020-10-08",
        "overview": "NFLPA Legends compete against NFLPA Pro-Bowlers; rappers Macklemore and Lil Yachty compete."
      },
      {
        "id": "tvmaze:1941242",
        "title": "Jenna Fisher vs. Scott Foley and ‘mixed-ish' vs. Disney Channel Moms",
        "season": 6,
        "episode": 10,
        "released": "2020-10-13",
        "overview": "Actress Jenna Fischer competes with actor Scott Foley; cast members of \"mixed-ish\" face off with Disney Channel moms."
      },
      {
        "id": "tvmaze:1946261",
        "title": "Boxers (WBC) vs. UFC and Team Sebastian vs. Jenifer Lewis",
        "season": 6,
        "episode": 11,
        "released": "2020-10-29",
        "overview": "Boxers face off against mixed martial artists; a team led by Sebastian Maniscalco competes against a team led by Jenifer Lewis."
      },
      {
        "id": "tvmaze:2064892",
        "title": "Rob Lowe vs. Terrence Howard",
        "season": 7,
        "episode": 1,
        "released": "2021-06-06",
        "overview": "Actor Rob Lowe plays against actor Terrence Howard."
      },
      {
        "id": "tvmaze:2096822",
        "title": "Zach Braff & Donald Faison vs. Neil Flynn and Wendi McLendon-Covey vs. Patrick Warburton",
        "season": 7,
        "episode": 2,
        "released": "2021-06-13",
        "overview": "It's an epic \"family\" reunion when the cast of \"Scrubs,\" led by Zach Braff and Donald Faison, face off against Neil Flynn and his \"Beer Shark Mice\" improv crew as they test their skills and compete for charity. In the next game, actor Wendi McClendon-Covey, along with her family and \"Generation Ripe\" podcast partner, go head-to-head against actor Patrick Warburton and his family."
      },
      {
        "id": "tvmaze:2104980",
        "title": "Dee Snider vs. Terry Bradshaw and One Republic vs. Mayans M.C. Cast",
        "season": 7,
        "episode": 3,
        "released": "2021-06-20",
        "overview": "Terry Bradshaw faces off against Dee Snider; members of OneRepublic face off with the cast of \"Mayans M.C.\""
      },
      {
        "id": "tvmaze:2104981",
        "title": "Jojo Siwa vs. The D'Amelio Family and Ross Mathews vs. Loni Love",
        "season": 7,
        "episode": 4,
        "released": "2021-06-27",
        "overview": "JoJo Siwa, the D'Amelio family, Loni Love and Ross Matthews compete for their respective charities."
      },
      {
        "id": "tvmaze:2126107",
        "title": "Good Trouble vs. grown-ish and Million Dollar Listing LA vs. Million Dollar Listing NY",
        "season": 7,
        "episode": 5,
        "released": "2021-07-18",
        "overview": "The casts from Freeform's \"Good Trouble\" and \"grown-ish\" compete to win money for their charity. It's a West Coast vs. East Coast battle in the next game, when the real estate agents from \"Million Dollar Listing Los Angeles\" take on the real estate agents from \"Million Dollar Listing New York\" to see who will reign supreme."
      },
      {
        "id": "tvmaze:2126108",
        "title": "Nev Schulman vs. Jimmie Allen and Paul Reubens vs. David Arquette",
        "season": 7,
        "episode": 6,
        "released": "2021-07-25",
        "overview": "Celebrities Nev Schulman, Jimmie Allen, Paul Reubens and David Arquette compete for charity."
      },
      {
        "id": "tvmaze:2135288",
        "title": "Deon Cole vs. Tisha Campbell-Martin and Kevin Smith & Jason Mewes vs. Justin Long",
        "season": 7,
        "episode": 7,
        "released": "2021-08-15",
        "overview": "Comedian Deon Cole takes on actress Tisha Campbell in a funny faceoff when they compete to win money for their respective charities. In the next game, dynamic duo Kevin Smith and Jason Mewes go head-to-head and test their skills against actor Justin Long and his family."
      },
      {
        "id": "tvmaze:2138292",
        "title": "Vivica A. Fox vs. Bill Bellamy and MLB Alums vs. MLB Wives",
        "season": 7,
        "episode": 8,
        "released": "2021-08-22",
        "overview": "Actress Vivica A. Fox faces off against actor Bill Bellamy; Major League Baseball alums encounter their toughest competition when they go head-to-head against their wives."
      },
      {
        "id": "tvmaze:2151106",
        "title": "NFLPA All-Stars vs. NFLPA Legends and Oliver Hudson vs. Joe Buck",
        "season": 7,
        "episode": 9,
        "released": "2021-08-29",
        "overview": "It's the ultimate showdown when rosters of NFLPA legends and All-Stars face off to see which team scores victory and wins money for their respective charities. In the next game, actor and podcaster Oliver Hudson takes on his \"Daddy Issues\" co-host and sportscaster Joe Buck on this all-star episode."
      },
      {
        "id": "tvmaze:2151107",
        "title": "Fran Drescher vs. Charles Shaughnessy and Jessie James Decker & Eric Decker vs. Chris Bosh",
        "season": 7,
        "episode": 10,
        "released": "2021-09-12",
        "overview": "Actors Fran Drescher and Charles Shaughnessy from the beloved \"The Nanny\" series reunite and battle it out for their chosen charities. In the next game, country music star Jessie James Decker, her husband, Eric Decker, and their family take on NBA basketball star Chris Bosh and his family."
      },
      {
        "id": "tvmaze:2156203",
        "title": "Selling Sunset vs. Bling Empire and Pentatonix vs. Wilson Philips",
        "season": 7,
        "episode": 11,
        "released": "2021-09-19",
        "overview": "Reality stars from Netflix's \"Selling Sunset\" and \"Bling Empire\" go head-to-head and compete to win money for their chosen charities. Then, the Wilson Phillips family takes on GRAMMY® Award-winning a cappella group Pentatonix."
      },
      {
        "id": "tvmaze:2309048",
        "title": "Abbott Elementary vs. Hacks and Kal Penn vs. Erika Christensen",
        "season": 8,
        "episode": 1,
        "released": "2022-07-10",
        "overview": "The cast of \"Abbott Elementary\" plays against the cast of \"Hacks\"; Kal Penn goes head-to-head with Erika Christensen."
      },
      {
        "id": "tvmaze:2318223",
        "title": "Salt N-Pepa vs. The Proud Family and Bel-Air vs. Saved by the Bell",
        "season": 8,
        "episode": 2,
        "released": "2022-07-17",
        "overview": "Hip-hop group Salt-N-Pepa competes against the cast of the \"The Proud Family\"; the casts of \"Bel Air\" and \"Saved by the Bell\" compete."
      },
      {
        "id": "tvmaze:2347202",
        "title": "High School Musical: The Musical: The Series vs. Never Have I Ever and Ron Funches vs. Meagan Good",
        "season": 8,
        "episode": 3,
        "released": "2022-07-24",
        "overview": "The cast of \"High School Musical: The Musical: The Series\" compete against the cast of \"Never Have I Ever\"; Ron Funches competes against Meagan Good."
      },
      {
        "id": "tvmaze:2358461",
        "title": "Boyz II Men vs. Amber Ruffin and Joe Lo Truglio vs. Thomas Lennon",
        "season": 8,
        "episode": 4,
        "released": "2022-07-31",
        "overview": "Hosted by Steve Harvey, the first game has GRAMMY Award-winning R&amp;B a cappella group Boyz II Men taking on comedian Amber Ruffin and her family to win money for their chosen charities. In the next game, funny men Joe Lo Truglio and Thomas Lennon face off to see who comes out on top."
      },
      {
        "id": "tvmaze:2361277",
        "title": "Rhys Darby vs. Jay Pharoah and Bachelor Nation vs. Bachelor Squad",
        "season": 8,
        "episode": 5,
        "released": "2022-08-07",
        "overview": "Hosted by Steve Harvey, the first game has comedians Rhys Darby and Jay Pharoah facing off to see who will win the most money for their respective charities. In the next game, it's all in the family when Bachelor Nation goes head-to-head against each other to see who will reign supreme."
      },
      {
        "id": "tvmaze:2365597",
        "title": "Kristin Chenoweth vs. Kathy Najimy and My Unorthodox Life vs. Summer House",
        "season": 8,
        "episode": 6,
        "released": "2022-08-14",
        "overview": "Hosted by Steve Harvey, the first game is a hilarious faceoff between two actresses when Kristin Chenoweth competes against Kathy Najimy to see who will win the grand prize for their selected charities. In the next game, casts from reality shows \"My Unorthodox Life\" and \"Summer House\" battle it out to see who will come out on top."
      },
      {
        "id": "tvmaze:2372610",
        "title": "Simu Liu vs. Nathan Chen and Monica vs. So So Def",
        "season": 8,
        "episode": 7,
        "released": "2022-08-21",
        "overview": "Hosted by Steve Harvey, the first game features actor Simu Liu who goes head-to-head against figure skater Nathan Chen and his family to see who will win the grand prize for their selected charities. In the next game, GRAMMY Award®-winning R&amp;B singer Monica faces off against So So Def founder Jermaine Dupri."
      },
      {
        "id": "tvmaze:2373270",
        "title": "Mysterios vs. The Miz and Kurt Warner vs. Orel Hershiser",
        "season": 8,
        "episode": 8,
        "released": "2022-08-28",
        "overview": "Professional wrestlers Rey Mysterio and The Miz face off; former professional football player Kurt Warner goes head-to-head against former professional baseball player Orel Hershiser."
      },
      {
        "id": "tvmaze:2367400",
        "title": "The Sharks vs. The Talk and Natasha Leggero vs. Lauren Ash",
        "season": 8,
        "episode": 9,
        "released": "2022-09-11",
        "overview": "Hosted by Steve Harvey, the first game has the Sharks from ABC's \"Shark Tank\" face off against the hosts from CBS's \"The Talk\" to see who will come out on top and win the grand prize for their selected charities. In the next game, comedians Natasha Leggero and Lauren Ash go head-to-head."
      },
      {
        "id": "tvmaze:2381204",
        "title": "NFLPA Moms vs. NFLPA Players and Holey Moley vs. Kimberly Williams-Paisley",
        "season": 8,
        "episode": 10,
        "released": "2022-09-18",
        "overview": "Hosted by Steve Harvey, it's a showdown between NFLPA moms and their NFLPA player sons in the first game, when they try to show each other who's boss and win the grand prize for their selected charities. In the next game, Joe Tessitore and Rob Riggle from ABC's \"Holey Moley\" go up against actress Kimberly Williams-Paisley and her family."
      },
      {
        "id": "tvmaze:2383533",
        "title": "The Cast of Jackass",
        "season": 8,
        "episode": 11,
        "released": "2022-09-22",
        "overview": "Hosted by Steve Harvey, the cast of \"Jackass\" led by Johnny Knoxville and Jeff Tremaine, battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2510921",
        "title": "The Cast of Yellowjackets and Gayle King vs. Sophia Bush Hughes",
        "season": 9,
        "episode": 1,
        "released": "2023-07-09",
        "overview": "Hosted by Steve Harvey, the cast of \"Yellowjackets\" led by Christina Ricci and Samantha Hanratty, and Gayle King and Sophia Bush Hughes battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2575346",
        "title": "Neil Patrick Harris vs. David Burtka & The Cast of Drag Me to Dinner and Nikki Glaser vs. Bebe Rexha",
        "season": 9,
        "episode": 2,
        "released": "2023-07-16",
        "overview": "Hosted by Steve Harvey, the cast of \"Drag Me to Dinner,\" including Neil Patrick Harris and David Burtka and later, teams Nikki Glaser and Bebe Rexha battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2580675",
        "title": "The Haunted Mansion Cast: Tiffany Haddish vs. Justin Simien and Cruel Summer vs. The Wonder Years",
        "season": 9,
        "episode": 3,
        "released": "2023-07-23",
        "overview": "Hosted by Steve Harvey, the cast of \"Haunted Mansion,\" including Tiffany Haddish and Justin Simien, and later the casts of \"Cruel Summer\" and \"The Wonder Years\" battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2588808",
        "title": "WWE Women vs. WWE Men and Marcus Lemonis vs. Bert Kreischer",
        "season": 9,
        "episode": 4,
        "released": "2023-07-30",
        "overview": "The men and women of WWE go head-to-head; Marcus Lemonis and Bert Kreischer battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2595790",
        "title": "NFLPA All Stars vs. NFLPA Hall of Fame and Adam Devine vs. Anders Holm",
        "season": 9,
        "episode": 5,
        "released": "2023-08-06",
        "overview": "Hosted by Steve Harvey, NFLPA All Stars and Hall of Famers and later, Adam Devine and Anders Holm battle it out to win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2600331",
        "title": "Pete Holmes vs. Jared Padalecki and Real Housewives of OC vs. Real Housewives of ATL",
        "season": 9,
        "episode": 6,
        "released": "2023-08-13",
        "overview": "Pete Holmes faces Jared and Genevieve Padalecki; the casts of \"The Real Housewives of Orange County\" and \"The Real Housewives of Atlanta\" battle it out to win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2610167",
        "title": "Chris Redd vs. Fortune Feimster and Stephen A. Smith vs. Tamron Hall",
        "season": 9,
        "episode": 7,
        "released": "2023-08-20",
        "overview": "Hosted by Steve Harvey, Chris Redd and Fortune Feimster and later Stephen A. Smith and Tamron Hall battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2617235",
        "title": "The Rookie vs. The Rookie Feds and Lauren Lapkus vs. June Diane Raphael",
        "season": 9,
        "episode": 8,
        "released": "2023-08-27",
        "overview": "Hosted by Steve Harvey, the casts of \"The Rookie\" and \"The Rookie: Feds\" and later Lauren Lapkus and June Diane Raphael battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2643630",
        "title": "Dancing with the Stars vs. Grand Crew and Ben Schwartz vs. Sam Richardson",
        "season": 9,
        "episode": 9,
        "released": "2023-09-19",
        "overview": "The casts of \"Dancing With the Stars\" and \"Grand Crew\" face off; Ben Schwartz goes up against Sam Richardson."
      },
      {
        "id": "tvmaze:2679534",
        "title": "Rosie O'Donnell vs. Billy Porter",
        "season": 9,
        "episode": 10,
        "released": "2023-12-13",
        "overview": "Hosted by Steve Harvey, this special holiday episode filled with surprises and cheer, features teams led by Rosie O'Donnell and Billy Porter as they battle it out to see who will win the grand prize for their selected charities."
      },
      {
        "id": "tvmaze:2848312",
        "title": "Family Feud: Decades of Laughs",
        "season": 10,
        "episode": 1,
        "released": "2024-07-09",
        "overview": "Steve Harvey hosts a look back at the past few decades of \"Family Feud,\" highlighting fan-favorite moments from the iconic series."
      },
      {
        "id": "tvmaze:2848388",
        "title": "Megan Thee Stallion vs. Ne-Yo and NFL vs. Olympians",
        "season": 10,
        "episode": 2,
        "released": "2024-07-09",
        "overview": "Megan Thee Stallion goes head-to-head with Ne-Yo; NFL athletes battle it out with Olympians for their selected charities."
      },
      {
        "id": "tvmaze:2931040",
        "title": "Meghan Trainor vs. Tori Kelly and Golden Bachelor vs. Bachelor Nation",
        "season": 10,
        "episode": 3,
        "released": "2024-07-16",
        "overview": "Celebrity contestants Meghan Trainor and Tori Kelly."
      },
      {
        "id": "tvmaze:2936324",
        "title": "Robin Thicke vs. Anthony Anderson and Walker Hayes vs. Rachel Bilson",
        "season": 10,
        "episode": 4,
        "released": "2024-07-23",
        "overview": "Celebrity contestants Robin Thicke, Anthony Anderson, Walker Hayes and Rachel Bilson."
      },
      {
        "id": "tvmaze:2939975",
        "title": "Daughtry vs. Papa Roach and Earth, Wind & Fire vs. The War & Treaty",
        "season": 10,
        "episode": 5,
        "released": "2024-07-30",
        "overview": "Celebrity contestants Daughtry, Papa Roach, Earth, Wind &amp; Fire and The War &amp; Treaty."
      },
      {
        "id": "tvmaze:2946574",
        "title": "Fat Joe vs. Gabriel \"Fluffy\" Iglesias and David Foster & Katharine McPhee vs. Clay Aiken",
        "season": 10,
        "episode": 6,
        "released": "2024-08-06",
        "overview": "Celebrity contestants Fat Joe, Gabriel \"Fluffy\" Iglesias, David Foster, Katharine McPhee and Clay Aiken."
      },
      {
        "id": "tvmaze:2955285",
        "title": "Flavor Flav vs. Bobby Lee and Donny Osmond vs. Ken Marino",
        "season": 10,
        "episode": 7,
        "released": "2024-08-13",
        "overview": "Celebrity contestants Flavor Flav, Bobby Lee, Donny Osmond and Ken Marino."
      },
      {
        "id": "tvmaze:2960926",
        "title": "Men of WWE vs. Women of WWE and Candace Parker vs. Lisa Leslie",
        "season": 10,
        "episode": 8,
        "released": "2024-08-20",
        "overview": "The men and women of WWE face off; Candace Parker and Lisa Leslie go head-to-head."
      },
      {
        "id": "tvmaze:2984332",
        "title": "Fantasy Sweets vs. Golden Five and 9-1-1 vs. Jury Duty",
        "season": 10,
        "episode": 9,
        "released": "2024-09-16",
        "overview": "The Golden Bachelor fan-favorites face off; the casts of \"9-1-1\" and \"Jury Duty\" compete."
      },
      {
        "id": "tvmaze:2984333",
        "title": "Chrissy Teigen & John Legend vs. David Chang and Deadliest Catch vs. Star Trek Universe",
        "season": 10,
        "episode": 10,
        "released": "2024-09-16",
        "overview": "Celebrity contestants Chrissy Teigen, John Legend and David Chang."
      },
      {
        "id": "tvmaze:2989081",
        "title": "Family Feud: The Best of Steve Harvey",
        "season": 10,
        "episode": 11,
        "released": "2024-09-16",
        "overview": "A special looking back at the last few decades of \"Family Feud,\" highlighting iconic moments and Steve's funniest jokes from the series."
      },
      {
        "id": "tvmaze:3041900",
        "title": "Shaq vs. Sherri Shepherd",
        "season": 10,
        "episode": 12,
        "released": "2024-12-04",
        "overview": "Celebrity contestants Shaq and Sherri Shepherd."
      },
      {
        "id": "tvmaze:3223090",
        "title": "Taraji P. Henson vs. Jennifer Hudson and The Dan Patrick Show vs. The Rich Eisen Show",
        "season": 11,
        "episode": 1,
        "released": "2025-07-10",
        "overview": "Actress Taraji P. Henson goes head-to-head with actress Jennifer Hudson; \"The Dan Patrick Show\" faces off against \"The Rich Eisen Show\" for their selected charities."
      },
      {
        "id": "tvmaze:3288837",
        "title": "Matt Rife vs. Lil Jon and Kat Graham vs. Francia Raisa",
        "season": 11,
        "episode": 2,
        "released": "2025-07-17",
        "overview": "Celebrity contestants Matt Rife, Lil Jon, Kat Graham and Francia Raisa."
      },
      {
        "id": "tvmaze:3293407",
        "title": "The Arquettes vs. Martina McBride and Patti LaBelle vs. Fantasia",
        "season": 11,
        "episode": 3,
        "released": "2025-07-24",
        "overview": "Celebrity contestants the Arquettes, Martina McBride, Patti LaBelle and Fantasia."
      },
      {
        "id": "tvmaze:3300327",
        "title": "Diplo vs. Laverne Cox and General Hospital vs. The Young and the Restless",
        "season": 11,
        "episode": 4,
        "released": "2025-07-31",
        "overview": "Celebrity contestants Diplo, Laverne Cox, and cast members from \"General Hospital\" and \"The Young and the Restless.\""
      },
      {
        "id": "tvmaze:3304891",
        "title": "Kyle Richards vs. Kandi Burruss-Tucker and NFLPA Offense vs. NFLPA Defense",
        "season": 11,
        "episode": 5,
        "released": "2025-08-07",
        "overview": "Actress and TV personality Kyle Richards goes up against singer-songwriter and actress Kandi Burruss-Tucker; members of the NFLPA Offense and NFLPA Defense battle it out for the grand prize."
      },
      {
        "id": "tvmaze:3313353",
        "title": "The Harlem Globetrotters vs. The Dallas Cowboys Cheerleaders and Bridget Everett vs. Vanessa Bayer",
        "season": 11,
        "episode": 6,
        "released": "2025-08-14",
        "overview": "The Harlem Globetrotters face off against the Dallas Cowboys Cheerleaders; actresses Bridget Everett and Vanessa Bayer compete for their selected charities."
      },
      {
        "id": "tvmaze:3318316",
        "title": "Normani vs. Michelle Buteau and Andy Richter vs. Jason Ritter",
        "season": 11,
        "episode": 7,
        "released": "2025-08-21",
        "overview": "Celebrity contestants Normani, Michelle Buteau, Andy Richter and Jason Ritter."
      },
      {
        "id": "tvmaze:3338281",
        "title": "Lainey Wilson vs. Leanne Morgan and Jordan Chiles vs. Stephen Nedoroscik",
        "season": 11,
        "episode": 8,
        "released": "2025-09-11",
        "overview": "Celebrity contestants Lainey Wilson, Leanne Morgan, Jordan Chiles and Stephen Nedoroscik."
      },
      {
        "id": "tvmaze:3342094",
        "title": "George Wallace vs. Lil Rel Howery and Bobby Flay vs. Carla Hall",
        "season": 11,
        "episode": 9,
        "released": "2025-09-18",
        "overview": "Celebrity contestants George Wallace, Lil Rel Howery, Bobby Flay and Carla Hall."
      }
    ]
  }
}