{
  "meta": {
    "id": "tvmaze:52833",
    "type": "series",
    "name": "90 Day Diaries",
    "description": "In 90 Day Diaries, the cast members film themselves in their day-to-day lives as they navigate new challenges in their relationships and experience major life milestones.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/589/1473713.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/589/1473713.jpg",
    "videos": [
      {
        "id": "tvmaze:3379719",
        "title": "Dear Diary, I've Had Enough",
        "season": 7,
        "episode": 4,
        "released": "2025-12-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3379718",
        "title": "Dear Diary, Something Needs to Change",
        "season": 7,
        "episode": 3,
        "released": "2025-12-08",
        "overview": ""
      },
      {
        "id": "tvmaze:2000993",
        "title": "Life Goes On",
        "season": 1,
        "episode": 1,
        "released": "2021-01-04",
        "overview": "Loren and Alexei are new parents to a baby boy. Mohamed reaches out to Danielle, Cortney leaves Andy to go home and David and Annie go on a fishing trip."
      },
      {
        "id": "tvmaze:2005833",
        "title": "In with the New",
        "season": 1,
        "episode": 2,
        "released": "2021-01-04",
        "overview": "Molly lands on the cover of a magazine. Meanwhile, Tom spends time with his sister in London and Anna and Mursel prepare to open their honey store."
      },
      {
        "id": "tvmaze:2008256",
        "title": "The Unexpected",
        "season": 1,
        "episode": 3,
        "released": "2021-01-11",
        "overview": "Colt studies for a real estate license with Vanessa, and Debbie looks for a delivery job. Retirement sends David down memory lane. Corey and Evelin get help for their relationship. Fernanda is single and modeling. Syngin helps Tania recover from surgery."
      },
      {
        "id": "tvmaze:2008257",
        "title": "First and Foes",
        "season": 1,
        "episode": 4,
        "released": "2021-01-18",
        "overview": "Elizabeth and Andrei struggle with financial stability, as Kalani and Asuelu look for a new home. And, Matt and Alla introduce their new baby daughter."
      },
      {
        "id": "tvmaze:2012075",
        "title": "Ready, Set, Go",
        "season": 1,
        "episode": 5,
        "released": "2021-01-25",
        "overview": "Larissa and Eric fight about plastic surgery, while Big Ed starts getting in shape. Plus, Laura leaves Ecuador and Larry teaches Jenny how to drive."
      },
      {
        "id": "tvmaze:2012076",
        "title": "Quarantine Baby",
        "season": 1,
        "episode": 6,
        "released": "2021-02-01",
        "overview": "Robert and Anny welcome their baby girl, and Jess and Brian make a move."
      },
      {
        "id": "tvmaze:2111800",
        "title": "Nama-Stay Here",
        "season": 2,
        "episode": 1,
        "released": "2021-06-13",
        "overview": "Tom spends a romantic evening with his American girlfriend. Molly goes house hunting with Kelly and on a spiritual journey with a shaman. Dean and Rigin prepare for their baby's arrival. Steven and Olga consider life on the road in a converted van."
      },
      {
        "id": "tvmaze:2111801",
        "title": "Getting Back on Your Feet",
        "season": 2,
        "episode": 2,
        "released": "2021-06-20",
        "overview": "Danielle takes a spin at pole dancing. Anna and Mursel make a big step in their IVF journey. Cortney does some \"sole\" searching after taking on a new job. Rebecca is anxious about meeting Zied's new friends."
      },
      {
        "id": "tvmaze:2111802",
        "title": "Home Is Where the Heart Is",
        "season": 2,
        "episode": 3,
        "released": "2021-06-27",
        "overview": "Loren and Alexei have a big announcement, Amira falls hard for her new American man, and Larry and Jenny prepare to leave the trailer park."
      },
      {
        "id": "tvmaze:2111804",
        "title": "Wait For It",
        "season": 2,
        "episode": 4,
        "released": "2021-07-04",
        "overview": "Stephanie is over being celibate. Akinyi leaves Kenya for life in America with Ben. Emily and Sasha talk to his ex about bringing his son to the US."
      },
      {
        "id": "tvmaze:2111805",
        "title": "My Way or the Highway",
        "season": 2,
        "episode": 5,
        "released": "2021-07-11",
        "overview": "Yolanda has a new, younger boyfriend. Tim and Melyza are engaged. Tania and Syngin explore living off the grid. Kyle teaches Noon to snowboard."
      },
      {
        "id": "tvmaze:2111806",
        "title": "The Start of Something New",
        "season": 2,
        "episode": 6,
        "released": "2021-07-18",
        "overview": "Colt and Vanessa start their married life. Tim gets to know Veronica's boyfriend. Ash hopes to redeem himself. Benjamin and Akinyi tie the knot."
      },
      {
        "id": "tvmaze:2295835",
        "title": "Indecent Proposal",
        "season": 3,
        "episode": 1,
        "released": "2022-03-21",
        "overview": "Kalani and Asuelu face marital problems while trying to move from Utah; Ron offers Brandon and Julia a big solution to their small apartment woes; Cortney has an awkward first date at an animal safari."
      },
      {
        "id": "tvmaze:2295836",
        "title": "The Perfect Storm",
        "season": 3,
        "episode": 2,
        "released": "2022-03-28",
        "overview": "Jovi and Yara flee to Dallas as a hurricane threatens their hometown; Emily and Sasha begin their move to Russia; Tim and Veronica celebrate Chloe's quinceanera; Amber and Daniel walk down the aisle."
      },
      {
        "id": "tvmaze:2295837",
        "title": "Dream a Little Dream",
        "season": 3,
        "episode": 3,
        "released": "2022-04-04",
        "overview": "Elizabeth and Andrei have a new house and a new business venture; Steve and Olga plan their move to NYC in just two weeks; Ben and Akinyi get fertility results; Laura moves in with her son."
      },
      {
        "id": "tvmaze:2295838",
        "title": "The Future's So Bright",
        "season": 3,
        "episode": 4,
        "released": "2022-04-11",
        "overview": "Angela heads to California in search of a new smile. Martine and Steven party hard at Miami Carnival. David hits the open road and isn't giving up on love."
      },
      {
        "id": "tvmaze:2295839",
        "title": "Baby Steps",
        "season": 3,
        "episode": 5,
        "released": "2022-04-25",
        "overview": "Kenny attends his grandson's birth, heightening Armando's baby fever; Chuck gets vulnerable while discussing his health and dating life; Steven and Olga move to NYC; Jessica travels to Brazil for a second medical opinion; Yolanda visits John."
      },
      {
        "id": "tvmaze:2295840",
        "title": "Mother of All Moms",
        "season": 3,
        "episode": 6,
        "released": "2022-05-02",
        "overview": "Mike is living large after separating from Natalie; Tarik and Hazel work to bring her son to the U.S.; Kenny and Armando disagree on major life decisions; Anna and Mursel have baby news; Alla asks Matt to bring in an au pair."
      },
      {
        "id": "tvmaze:2322730",
        "title": "Luck Be a Lady Part Tonight",
        "season": 3,
        "episode": 7,
        "released": "2022-05-09",
        "overview": "Molly gets a hysterectomy. Tania wants to start her own jewellery line. Colt and Vanessa work on their marriage. Dean and Rigin learn to compromise."
      },
      {
        "id": "tvmaze:2325978",
        "title": "It Takes Two to Tango",
        "season": 3,
        "episode": 8,
        "released": "2022-05-16",
        "overview": "Tom isn't giving up on his marriage plans; Danielle reveals big news to her kids; Anny tries to convince Robert of a more permanent solution to birth control; Caesar turns 50; Kyle and Noon have baby-making on their minds."
      },
      {
        "id": "tvmaze:2341906",
        "title": "The Final Countdown",
        "season": 4,
        "episode": 1,
        "released": "2022-06-06",
        "overview": "Brandon and Julia ready themselves to leave the nest. Rebecca mentally prepares for Zied's visit to Tunisia. Corey asks Evelin to move back to the US."
      },
      {
        "id": "tvmaze:2341907",
        "title": "Wrecking Ball",
        "season": 4,
        "episode": 2,
        "released": "2022-06-13",
        "overview": "Tim teaches Chloe how to drive. Tom and Mariah visit his home away from home. Jess makes her own lipstick line. Danielle celebrates her 49th birthday."
      },
      {
        "id": "tvmaze:2346209",
        "title": "Not My First Rodeo",
        "season": 4,
        "episode": 3,
        "released": "2022-06-20",
        "overview": "Brandon and Julia are scared to tell his parents they're moving. Ella prepares for Johnny's arrival. Larry attempts to connect with his estranged son."
      },
      {
        "id": "tvmaze:2346210",
        "title": "Don't Be a Drag",
        "season": 4,
        "episode": 4,
        "released": "2022-06-27",
        "overview": "Laura gets an empowering makeover."
      },
      {
        "id": "tvmaze:2346211",
        "title": "Where Is the Love?",
        "season": 4,
        "episode": 5,
        "released": "2022-07-04",
        "overview": "Russ and Paola hit a low point and consider divorce."
      },
      {
        "id": "tvmaze:2346212",
        "title": "Just Keep Swimming",
        "season": 4,
        "episode": 6,
        "released": "2022-07-11",
        "overview": "Ben and Akinyi visit a fertility specialist."
      },
      {
        "id": "tvmaze:2362030",
        "title": "Take It to the Max",
        "season": 4,
        "episode": 7,
        "released": "2022-07-18",
        "overview": "Caleb steps back into the dating game."
      },
      {
        "id": "tvmaze:2362031",
        "title": "Life Is a Highway",
        "season": 4,
        "episode": 8,
        "released": "2022-07-25",
        "overview": "Brandon and Julia change their moving plans; Ron and Betty start to think about life without the farm; Rebecca makes a big decision about following Zied to Tunisia; Angela finally gets the smile she's been waiting for."
      },
      {
        "id": "tvmaze:2705087",
        "title": "Mamma Mia!",
        "season": 5,
        "episode": 1,
        "released": "2024-01-08",
        "overview": "Kim and her friends hit the town to help her move on from Usman; Patrick and Thais prepare for the new baby; Ari and Bini's relationship hits its breaking point; Emily's struggles with weight loss end up with a visit to her doctor."
      },
      {
        "id": "tvmaze:2736315",
        "title": "Lay All Your Love On Me",
        "season": 5,
        "episode": 2,
        "released": "2024-01-15",
        "overview": "Julia pressures Brandon for more boundaries with his parents. Kara and Guillermo discuss their unique birth plan before welcoming their baby. Jenny and Sumit make huge progress during a sit-down with Sumit's parents. Tom celebrates his big life update with Mariah by getting new teeth."
      },
      {
        "id": "tvmaze:2736385",
        "title": "Knowing Me, Knowing You",
        "season": 5,
        "episode": 3,
        "released": "2024-01-22",
        "overview": "Bilal and Shaeeda try to rebuild after a devastating loss. Emily and Kobe spice things up, then they look to make a move out of her parents' house. Cortney hosts a dating open house. Ari and Bini take time apart and assess their relationship."
      },
      {
        "id": "tvmaze:2736386",
        "title": "Take a Chance",
        "season": 5,
        "episode": 4,
        "released": "2024-01-29",
        "overview": "Jenny and Sumit spend time in Thailand with David and Annie, who hope they stay permanently. Jess reveals to Brian that she wants to have kids back home in Brazil. Amber makes a financial decision behind Daniel's back. Aryanna's first time back in the dating world has a disappointing end."
      },
      {
        "id": "tvmaze:2736387",
        "title": "S.O.S.",
        "season": 5,
        "episode": 5,
        "released": "2024-02-05",
        "overview": "Jovi and Yara struggle in therapy before breaking big news to Jovi's mom. Cortney travels to Malaysia to find love but ends up in tears. Ben and Mahogany struggle with money issues. Fernanda reconsiders her relationship with Noel."
      },
      {
        "id": "tvmaze:2757374",
        "title": "Dancing Queen",
        "season": 5,
        "episode": 6,
        "released": "2024-02-12",
        "overview": "David and Annie prepare for Annie's citizenship test. Julia has a risqué idea to solve her and Brandon's financial problems. Debbie and Tony adjust to living together. Caesar gets discouraging results about his ability to have children. Steven and Olga hope to solve a family secret."
      },
      {
        "id": "tvmaze:2764935",
        "title": "I Have a Dream",
        "season": 5,
        "episode": 7,
        "released": "2024-02-19",
        "overview": "Liz worries about Ed's commitment as they plan for their wedding. Yolanda confronts John in St. Louis. Jen and Rishi discuss having a baby. Laura tries to get her groove back. Syngin and girlfriend Shayna look to open their relationship to a third."
      },
      {
        "id": "tvmaze:2764936",
        "title": "The Name of the Game",
        "season": 5,
        "episode": 8,
        "released": "2024-02-26",
        "overview": "Libby and Andrei discuss moving to Naples, Florida. Angela helps Michael prepare for his visa interview. Gabe reconnects with his sister Monica. Chuck goes on a date for the first time in seven years. Rebecca and Zied explore having a child together."
      },
      {
        "id": "tvmaze:3187308",
        "title": "Dear Diary, Today Was Hard",
        "season": 6,
        "episode": 1,
        "released": "2025-04-07",
        "overview": "Chantel undergoes surgery to remove a birthmark that has caused her emotional pain and is thrilled with the results. Robert and Anny reveal they are pregnant again and celebrate at a gender reveal party. Jenny and Sumit face financial struggles after Sumit loses his job, leading Jenny to consider returning to work."
      },
      {
        "id": "tvmaze:3187309",
        "title": "Dear Diary, I'm Stressing Out",
        "season": 6,
        "episode": 2,
        "released": "2025-04-14",
        "overview": "David and Annie begin their IVF journey. Kara and Guillermo face tension over Guillermo's career change. Emily and Kobe celebrate their new house and the birth of their child with a party."
      },
      {
        "id": "tvmaze:3201355",
        "title": "Dear Diary, I'm Insecure",
        "season": 6,
        "episode": 3,
        "released": "2025-04-21",
        "overview": "Cleo travels to the US to undergo gender affirming surgery. Ella reveals that she was left devastated after finally meeting Johnny. Thais urges Patrick to take steps to boost his self-image. Cortney takes interest in her brother's single friend."
      },
      {
        "id": "tvmaze:3202540",
        "title": "Dear Diary, Things Are Changing",
        "season": 6,
        "episode": 4,
        "released": "2025-04-21",
        "overview": "Rebecca follows Zied after she suspects he may be cheating. Andrei tries to convince Elizabeth to move to Moldova. Sam and Citra head to the hospital to welcome their first baby. Tyray contemplates weight loss surgery."
      },
      {
        "id": "tvmaze:3202541",
        "title": "Dear Diary, Something's Not Right",
        "season": 6,
        "episode": 5,
        "released": "2025-04-28",
        "overview": "Rebecca confronts Zied and his female friend about their suspicious meet up; Elizabeth tells her family they're moving to Moldova; Loren and Alex consider having another baby; Veronica and Chloe bond before she heads to college."
      },
      {
        "id": "tvmaze:3202542",
        "title": "Dear Diary, Love Hurts",
        "season": 6,
        "episode": 6,
        "released": "2025-04-28",
        "overview": "Rob moves on from Sophie in Vegas with Jamal and Josh. Colt takes stock of his life after his divorce. Ben and Akinyi get news about her Green Card. Fernanda is conflicted about her modeling career. Ashley and Manuel disagree about a trip to Ecuador."
      },
      {
        "id": "tvmaze:3214775",
        "title": "Dear Diary, It's Decision Time",
        "season": 6,
        "episode": 7,
        "released": "2025-05-05",
        "overview": "Colt arrives in Canada to reveal the status of his marriage to Debbie. Jeniffer catches up with her old flame, Cacua. Tim embraces a new look. Matthew and Ana make a spontaneous decision to get married."
      },
      {
        "id": "tvmaze:3214776",
        "title": "Dear Diary, Let This Be The One",
        "season": 6,
        "episode": 8,
        "released": "2025-05-05",
        "overview": "David and Annie contemplate having their baby in Thailand. Sophie is ready to move on from Rob. Brian wants to make things official with a new woman in his life. Luke and Madelein celebrate another year - apart."
      },
      {
        "id": "tvmaze:3219610",
        "title": "Dear Diary, Where Is My Dream Girl?",
        "season": 6,
        "episode": 9,
        "released": "2025-05-12",
        "overview": "Amid financial troubles, Sumit wants he and Jenny to move in with his parents. Steven and Olga consider splitting up for good. Jamal meets up with Rob and Josh in Vegas before breaking news to Kim. Usman records a new hit song."
      },
      {
        "id": "tvmaze:3219611",
        "title": "Dear Diary, It's All About Me",
        "season": 6,
        "episode": 10,
        "released": "2025-05-12",
        "overview": "Manuel's comments on women's bodies upset Ashley on the day of her bodybuilding competition. Jenny and Sumit renew their vows. Tiffany is ready to put herself back out there. Caesar goes on a blind date."
      },
      {
        "id": "tvmaze:3234267",
        "title": "Dear Diary, Where Do We Go From Here?",
        "season": 6,
        "episode": 11,
        "released": "2025-05-19",
        "overview": "Ed takes his blind date to a haunted house. With John's hesitancy to get married, Meghan gives him an ultimatum. Ashley and Manuel struggle to make their relationship work. Clayton and Anali head to Ohio for his stand-up debut."
      },
      {
        "id": "tvmaze:3234268",
        "title": "Dear Diary, I Think I'm Ready",
        "season": 6,
        "episode": 12,
        "released": "2025-05-19",
        "overview": "Tyray meets up with Kim and Liz and gets the courage to reach out to his love interest, Shannon. Liz donates her wedding dress and considers a big move with Jayson. Kim goes on a flirty date with an old flame."
      },
      {
        "id": "tvmaze:3378584",
        "title": "Dear Diary, I'm Praying for a Miracle",
        "season": 7,
        "episode": 1,
        "released": "2025-09-26",
        "overview": "Cortney and Colt take the next step and move into her parents' house, despite Cortney's concerns about Colt's loyalty. Jovi helps Yara study as her citizenship is on the line. Robert and Anny have heavy emotions as they welcome their new baby."
      },
      {
        "id": "tvmaze:3379717",
        "title": "Dear Diary, I'm Ready to Move On",
        "season": 7,
        "episode": 2,
        "released": "2025-10-03",
        "overview": ""
      }
    ]
  }
}