{
  "meta": {
    "id": "tvmaze:59989",
    "type": "series",
    "name": "Killer Relationship with Faith Jenkins",
    "description": "Killer Relationship with Faith Jenkins investigates burgeoning romances from their sweet beginnings, and follows what happened all the way through to their bitter endings. With her background as a criminal prosecutor in the Manhattan District Attorney's Office, and with her expertise in matters of the heart, Faith Jenkins gives her professional POV of the nightmarish cases. With first-hand accounts from victims' family, friends and law enforcement, each hour-long episode reveals the inner workings of intimate attachments that seemed fated to last forever and ended in murder.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499133.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/599/1499133.jpg",
    "videos": [
      {
        "id": "tvmaze:3461515",
        "title": "Seduced And Swindled",
        "season": 4,
        "episode": 6,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3456141",
        "title": "Trust Me Not",
        "season": 4,
        "episode": 5,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2258528",
        "title": "Unholy Terror",
        "season": 1,
        "episode": 1,
        "released": "2022-01-16",
        "overview": "To prevent the exposure of a twisted secret, a seemingly solid marriage between two deeply religious people is destroyed and two lives are lost forever in the cold-blooded and desperate killings of a beautiful mother and daughter."
      },
      {
        "id": "tvmaze:2258529",
        "title": "Love + Death in the Time of COVID",
        "season": 1,
        "episode": 2,
        "released": "2022-01-23",
        "overview": "To prevent the exposure of a twisted secret, a seemingly solid marriage between two deeply religious people is destroyed and two lives are lost forever in the cold-blooded and desperate killings of a beautiful mother and daughter."
      },
      {
        "id": "tvmaze:2258530",
        "title": "Monster-In-Law",
        "season": 1,
        "episode": 3,
        "released": "2022-01-30",
        "overview": "Two young people are set up by their parents, leading quickly to love and marriage which is then destroyed by a deranged mother-in-law who orders the killing of a beautiful young woman in broad daylight."
      },
      {
        "id": "tvmaze:2258532",
        "title": "Shattered Dreams",
        "season": 1,
        "episode": 4,
        "released": "2022-02-06",
        "overview": "An aspiring military officer disappears suspiciously from her Virginia home, and two years later her husband vanishes when he comes under suspicion. A trail of lies and false identities is uncovered that reveals the truth about a diabolical murderer."
      },
      {
        "id": "tvmaze:2272725",
        "title": "Forbidden Love, Brutal Death",
        "season": 1,
        "episode": 5,
        "released": "2022-02-20",
        "overview": "Two unlikely lovers form a secret bond held together by faith, but the polygamous marriage festers until a manipulative and deceitful charlatan kills the woman he once loved, a beautiful young mother of two sons."
      },
      {
        "id": "tvmaze:2286413",
        "title": "Killer Secrets",
        "season": 1,
        "episode": 6,
        "released": "2022-02-27",
        "overview": "As a loving Oklahoma family embarks on a journey to understand the romantic relationship that led to a horrific murder, the relationship's secrets also reveal the killer responsible for two other murders from a years-old cold case."
      },
      {
        "id": "tvmaze:2286414",
        "title": "If I Can't Have You",
        "season": 1,
        "episode": 7,
        "released": "2022-03-06",
        "overview": "A charismatic young woman meets a dynamic and handsome man at an Orlando nightclub and it seems like a perfect match – but a secret marriage and a lover who just can't let go spells doom for two innocent victims."
      },
      {
        "id": "tvmaze:2286415",
        "title": "A Family Affair",
        "season": 1,
        "episode": 8,
        "released": "2022-03-13",
        "overview": "After 25 years of a mostly beautiful marriage, a woman loses her husband in a brutal killing right inside their own home. What at first seems to be a robbery-gone-bad is revealed to be a vicious and carefully plotted murder."
      },
      {
        "id": "tvmaze:2545775",
        "title": "Dream Killer",
        "season": 2,
        "episode": 1,
        "released": "2023-05-28",
        "overview": "The execution of successful businesswoman and mother Makeva Jenkins sparks an intense investigation, but unveiling the masked gunman will require unmasking a litany of suspects in the hopes of exposing this killer relationship."
      },
      {
        "id": "tvmaze:2545798",
        "title": "Forbidden Love",
        "season": 2,
        "episode": 2,
        "released": "2023-06-04",
        "overview": "The shooting death of Brad McGarry, a gay coal miner in Bellaire, Ohio, has detectives wondering if it's a hate crime, but when a shocking secret comes to light, it reveals an unexpected motive for murder."
      },
      {
        "id": "tvmaze:2569408",
        "title": "Sin City Killer",
        "season": 2,
        "episode": 3,
        "released": "2023-06-11",
        "overview": "Married for 33 years, a respected high school math teacher and his wife head to Las Vegas to celebrate her 50th birthday; when Evie Watson disappears, however, police from two states join forces and play a game of cat and mouse to catch her killer."
      },
      {
        "id": "tvmaze:2573453",
        "title": "Bitter Betrayal",
        "season": 2,
        "episode": 4,
        "released": "2023-06-18",
        "overview": "A loving grandfather and the life of the party, Harvey Huber's vanishing forces his small-town into an anguished search to find him. A late-night hunch from a member of the vaunted Texas Rangers reveals a shocking betrayal of love and friendship."
      },
      {
        "id": "tvmaze:2578707",
        "title": "Deadly Desire",
        "season": 2,
        "episode": 5,
        "released": "2023-06-25",
        "overview": "When 21-year-old Julie Gonzalez disappears in Austin, Texas, her Chicano family is determined to find her and never gives up. After a slow start, law enforcement uses a national television appearance and a gaming device to expose the deadly truth."
      },
      {
        "id": "tvmaze:2578708",
        "title": "Murdered By Morning",
        "season": 2,
        "episode": 6,
        "released": "2023-07-02",
        "overview": "Dawn Sandoval is hoping to start over after a recent divorce, but as soon as she dives into the dating world she vanishes into thin air, leaving behind a mystery in the New Mexico desert that ends with a horrifying discovery."
      },
      {
        "id": "tvmaze:2593507",
        "title": "Lethal Love Triangle",
        "season": 2,
        "episode": 7,
        "released": "2023-07-09",
        "overview": "Keiona Braxton excitedly awaits the birth of her first child, but when detectives are called to her burning apartment, they uncover a scene of unparalleled violence and use the clues on Keiona's own body to point them to the killer."
      },
      {
        "id": "tvmaze:2598351",
        "title": "Fatal Attraction",
        "season": 2,
        "episode": 8,
        "released": "2023-07-16",
        "overview": "Nicole Halpin, a vivacious single mother, is brutally murdered in her own home while her two children witness the attack. Justice will prevail when detectives sift through a list of Nicole's admirers to find her killer."
      },
      {
        "id": "tvmaze:2602187",
        "title": "Murdered Matriarch",
        "season": 2,
        "episode": 9,
        "released": "2023-07-23",
        "overview": "When 78-year-old Ina Gross is viciously murdered, suspicion falls on one of her own children; the siblings stand together until the truth is revealed."
      },
      {
        "id": "tvmaze:2602188",
        "title": "Canine Clues",
        "season": 2,
        "episode": 10,
        "released": "2023-07-30",
        "overview": "Soon after Cathy and Jeff Lamb rekindle their marriage, Cathy is found savagely beaten to death in their home; with the couple's three dogs as their only witnesses, detectives untangle a number of complex relationships to find her killer."
      },
      {
        "id": "tvmaze:2615592",
        "title": "Family Feud",
        "season": 2,
        "episode": 11,
        "released": "2023-08-06",
        "overview": "When 24-year-old Terry Rouse disappears near a southern Georgia swamp, his devastated mother relentlessly pursues a one-woman investigation that runs parallel to law enforcement; what she and the detectives ultimately uncover shocks everyone."
      },
      {
        "id": "tvmaze:2615593",
        "title": "Killer Obsession",
        "season": 2,
        "episode": 12,
        "released": "2023-08-13",
        "overview": "The last precious moments of rising star Maple Batalia are captured on a security camera before she's gunned down at her college campus in British Columbia. A community grieves as a mother's anguished pleas for justice capture national attention."
      },
      {
        "id": "tvmaze:2617887",
        "title": "Deadly Business",
        "season": 2,
        "episode": 13,
        "released": "2023-08-20",
        "overview": "Dino and Clara Pantazes run a successful bail bonds business and their 20-year marriage is seemingly perfect. When Clara is gunned down at home, however, detectives wonder if an angry client is to blame or if there is more to their fairytale story."
      },
      {
        "id": "tvmaze:2955997",
        "title": "The Missing Mother",
        "season": 3,
        "episode": 1,
        "released": "2024-08-17",
        "overview": "The sudden disappearance of Manjit Panghali sparks a massive search for the pregnant mother. What investigators uncover has a tight-knit immigrant community in shock, a family in mourning and a killer relationship exposed."
      },
      {
        "id": "tvmaze:2955998",
        "title": "Highway Horror",
        "season": 3,
        "episode": 2,
        "released": "2024-08-24",
        "overview": "Newly single Michele Davis is killed when her car careens off an Iowa highway. What looks like an accident is anything but, however, as investigators peel back the layers of her life and discover a motive for murder."
      },
      {
        "id": "tvmaze:2955999",
        "title": "Unlucky in Love",
        "season": 3,
        "episode": 3,
        "released": "2024-08-31",
        "overview": "Firefighter Ben Amato is callously murdered, but the case goes cold. A jailhouse snitch, critical clue and seemingly unrelated homicide expose a sinister plot as investigators stay on the trail of a heartless killer."
      },
      {
        "id": "tvmaze:2956000",
        "title": "Body in the Bayou",
        "season": 3,
        "episode": 4,
        "released": "2024-09-07",
        "overview": "Young mother Elizabeth Ferrell goes missing in Texas as a body is found in Louisiana. As detectives connect the dots between the two cases, secrets rise to the surface and reveal a shocking tale of love, betrayal and revenge."
      },
      {
        "id": "tvmaze:2993620",
        "title": "One-Way Street",
        "season": 3,
        "episode": 5,
        "released": "2024-09-14",
        "overview": "A mother of two, Jacquelyn Smith is stabbed to death in Baltimore in what appears to be a random act of violence. As detectives dig deeper, however, they uncover a diabolical plan, vicious lies and a killer relationship."
      },
      {
        "id": "tvmaze:3001554",
        "title": "Beneath the Surface",
        "season": 3,
        "episode": 6,
        "released": "2024-09-21",
        "overview": "Ed Bozarth lives life on the sea, but paradise turns deadly when the dashing adventurer is found dead on his boat in Key Largo, Fla. Just below the surface, investigators discover a secret past, a life full of intrigue and enemies within."
      },
      {
        "id": "tvmaze:3006234",
        "title": "The Price of Love",
        "season": 3,
        "episode": 7,
        "released": "2024-09-28",
        "overview": "When beloved ER nurse and mother Becky Bliefnick is found shot to death in her bathroom in Quincy, Ill., residents fear a killer has come to town. Detectives soon discover this seemingly perfect Midwestern community has monsters of its own."
      },
      {
        "id": "tvmaze:3007644",
        "title": "Buried Secrets",
        "season": 3,
        "episode": 8,
        "released": "2024-10-05",
        "overview": "Popular high school senior Chris Daigle mysteriously disappears from Missouri City, Texas; for nearly a decade, his mother will stop at nothing to get answers while keeping friends close but enemies closer."
      },
      {
        "id": "tvmaze:3007647",
        "title": "Medical Mystery",
        "season": 3,
        "episode": 9,
        "released": "2024-10-12",
        "overview": "When Melissa Henderson is found dead in her bed, a perplexing mystery ensues. Her husband and family believe her death is from natural causes, but the clues lead investigators to a secret life of spying and jealousy, and, ultimately, to a killer."
      },
      {
        "id": "tvmaze:3013245",
        "title": "Moonshine and Murder",
        "season": 3,
        "episode": 10,
        "released": "2024-10-19",
        "overview": "Jack Rains, an 83-year-old veteran and retired State Trooper, is gunned down at his kitchen table, shot five times in the back of the head. His family and the community are stunned as detectives uncover a tangled web of secrets, misdeeds and deceit."
      },
      {
        "id": "tvmaze:3018214",
        "title": "Into Thin Air",
        "season": 3,
        "episode": 11,
        "released": "2024-10-26",
        "overview": "Popular teacher and single mom Bianca Tanner is embarking on an exciting new chapter in her life with multiple admirers when she up and vanishes. To uncover her fate, detectives investigate each suitor to determine who is genuine and who is a killer."
      },
      {
        "id": "tvmaze:3024591",
        "title": "Lying in Plain Sight",
        "season": 3,
        "episode": 12,
        "released": "2024-11-02",
        "overview": "Popular TV anchor Diane King is a local celebrity, passionate advocate, and a loving wife and mother. When this rising star is murdered in her driveway, however, the investigation reveals a twisted tale of sex, lies and stalking."
      },
      {
        "id": "tvmaze:3029867",
        "title": "Ice Cold Killer",
        "season": 3,
        "episode": 13,
        "released": "2024-11-09",
        "overview": "Family man and all-around nice guy, Trent Mallory is murdered in his sleep in rural upper Michigan; sorting through multiple suspects and motives, the police set a trap to catch his cold-hearted killer."
      },
      {
        "id": "tvmaze:3427596",
        "title": "The Ultimate Betrayal",
        "season": 4,
        "episode": 1,
        "released": "2025-11-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3434127",
        "title": "Risky Business",
        "season": 4,
        "episode": 2,
        "released": "2025-11-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3440593",
        "title": "Fighting For Her Life",
        "season": 4,
        "episode": 3,
        "released": "2025-11-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3440594",
        "title": "Small Town, Big Lies",
        "season": 4,
        "episode": 4,
        "released": "2025-11-30",
        "overview": ""
      }
    ]
  }
}