{
  "meta": {
    "id": "tvmaze:82705",
    "type": "series",
    "name": "Boston Blue",
    "description": "In Boston Blue, NYPD Detective Danny Reagan takes a position with Boston PD. Once in Boston, he is paired with Detective Lena Peters, the eldest daughter of a prominent law enforcement family.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/593/1482511.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/593/1482511.jpg",
    "videos": [
      {
        "id": "tvmaze:3437291",
        "title": "In the Name of the Father, And of the Son …",
        "season": 1,
        "episode": 8,
        "released": "2025-12-12",
        "overview": "Danny and Lena's investigation into a robbery gone wrong quickly turns personal; Sean and Jonah face rising tensions with Boston's firefighters; Sarah clashes with boyfriend Seth over family discipline."
      },
      {
        "id": "tvmaze:3437292",
        "title": "Collateral Damage",
        "season": 1,
        "episode": 9,
        "released": "2025-12-19",
        "overview": "Mae faces public and family backlash over the consequences of her past decisions; Sarah struggles with guilt that pushes her to take risks in pursuit of justice; Lena and Danny dive into a tense homicide case."
      },
      {
        "id": "tvmaze:3443615",
        "title": "TBA",
        "season": 1,
        "episode": 10,
        "released": "2026-02-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3449416",
        "title": "TBA",
        "season": 1,
        "episode": 11,
        "released": "2026-03-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3449417",
        "title": "TBA",
        "season": 1,
        "episode": 12,
        "released": "2026-03-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3429747",
        "title": "Baggage Claim",
        "season": 1,
        "episode": 7,
        "released": "2025-12-05",
        "overview": "Lena's pursuit of justice forces Danny into an unexpected role reversal; Sarah faces a personal dilemma that tests her resolve; Mae contends with political pressure; Sean and Jonah uncover more than they anticipated during a routine case."
      },
      {
        "id": "tvmaze:3301108",
        "title": "Faith and Family",
        "season": 1,
        "episode": 1,
        "released": "2025-10-17",
        "overview": "NYPD detective Danny Reagan teams up with Boston detective Lena Silver to investigate a deadly fire at a tech company; as they dig deeper, they uncover a complex web of secrets involving facial recognition technology."
      },
      {
        "id": "tvmaze:3301121",
        "title": "Teammates",
        "season": 1,
        "episode": 2,
        "released": "2025-10-24",
        "overview": "Lena and Danny are pulled into a high-stakes murder investigation when a whistleblower tied to one of Mae's court cases is found dead; Jonah and Sean prepare for their first official day on the job."
      },
      {
        "id": "tvmaze:3382070",
        "title": "History",
        "season": 1,
        "episode": 3,
        "released": "2025-10-31",
        "overview": "A body found on the Boston wharf pulls Lena and Danny into a tense drug investigation; Jonah and Sean chase down a missing man tied to a scavenger hunt; Sarah and Mae navigate emotional challenges at home and in court."
      },
      {
        "id": "tvmaze:3393035",
        "title": "Rites of Passage",
        "season": 1,
        "episode": 4,
        "released": "2025-11-07",
        "overview": "The Silver family observes Yahrzeit to honor patriarch Ben Silver on the one-year anniversary of his death; Lena and Danny investigate the murder of a beloved shop owner; Sarah responds to a hostage crisis; Mae faces a difficult legal decision."
      },
      {
        "id": "tvmaze:3400608",
        "title": "Suffer the Children",
        "season": 1,
        "episode": 5,
        "released": "2025-11-14",
        "overview": "Danny and Lena take on a high-stakes murder case that leads to one of Boston's most infamous unsolved crimes; tensions rise within the Silver family as a complex shooting case sparks debate over accountability and parenting."
      },
      {
        "id": "tvmaze:3424217",
        "title": "Code of Ethics",
        "season": 1,
        "episode": 6,
        "released": "2025-11-21",
        "overview": "With an assist from NYPD's Maria Baez, Danny and Lena hunt down a serial home invader; Sean's budding romance faces unexpected complications; Mae and Sarah uncover a troubling leak that could upend the justice system."
      }
    ]
  }
}