{
  "meta": {
    "id": "tvmaze:35054",
    "type": "series",
    "name": "Street Outlaws: No Prep Kings",
    "description": "Each week, Outlaws veteran \"Chuck\" will serve as race master in a new city and on a new \"no prep\" track, where 32 of the biggest names in no prep racing – including Street Outlaws favorites, as well as newcomers – will duke it out to become the ultimate \"no prep winner\" and receive a $40,000 first place purse. With more than $320,000 up for grabs across eight episodes, the stakes are high and the risks are even higher, as local crowds flock to each race to see which all-star Street Outlaws will show up, and who will win it all.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/437/1093744.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/437/1093744.jpg",
    "videos": [
      {
        "id": "tvmaze:3457167",
        "title": "Return of the Champ",
        "season": 5,
        "episode": 27,
        "released": "2025-12-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3468860",
        "title": "Paying the Way",
        "season": 5,
        "episode": 28,
        "released": "2025-12-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3456148",
        "title": "Murder Nova Killing Spree",
        "season": 5,
        "episode": 26,
        "released": "2025-12-08",
        "overview": ""
      },
      {
        "id": "tvmaze:1415246",
        "title": "Making It in Memphis",
        "season": 1,
        "episode": 1,
        "released": "2018-02-27",
        "overview": "Thirty-two of the best racers from around the country meet in Memphis to compete for $50,000 and the chance to earn points in the first No Prep Kings points series. But, rainy weather and a tricky track threaten to derail the racer's plans."
      },
      {
        "id": "tvmaze:1415247",
        "title": "Memphis Money",
        "season": 1,
        "episode": 2,
        "released": "2018-03-07",
        "overview": "Sixteen racers remain in the first ever No Prep Kings Invitational, and as the racers move into round two, it's time to turn it up to try to win. With a little more data on the track, racers are able to push their cars further for a chance at the $50,000."
      },
      {
        "id": "tvmaze:1415248",
        "title": "Ready, Set, Re-Do",
        "season": 1,
        "episode": 3,
        "released": "2018-03-14",
        "overview": "Thirty-two of the fastest racers around meet at Beech Bend Park in Bowling Green, Kentucky for the 2nd No Prep Kings invitational race. There's $40,000 &amp; more points up for grabs, but trouble forces some of the racers to re-run their 1st round race"
      },
      {
        "id": "tvmaze:1440908",
        "title": "Bluegrass and Cash",
        "season": 1,
        "episode": 4,
        "released": "2018-03-14",
        "overview": "Sixteen racers move into round two of the No Prep Kings invitational race in Bowling Green, Kentucky. The track is slicker and more challenging, so the fastest racers from around the country do what they can to take home the $40,000 prize."
      },
      {
        "id": "tvmaze:1430613",
        "title": "Texas Takedown",
        "season": 1,
        "episode": 5,
        "released": "2018-03-21",
        "overview": "Thirty-two of the fastest racers descend on Edinburgh, Texas for the next race and for a chance to win $40,000 plus more points. However, it's been raining in Texas and the track is probably the trickiest the racers will see all season."
      },
      {
        "id": "tvmaze:1435974",
        "title": "When the Dust Settles",
        "season": 1,
        "episode": 6,
        "released": "2018-03-28",
        "overview": "The Street Outlaws are in Tucson, Arizona for the next No Prep Kings invitational race, and the dusty desert brings its own challenges. Birdman is out for blood, while Kye Kelley hopes to prove that he is really a contender in this series."
      },
      {
        "id": "tvmaze:1437271",
        "title": "San Antonio Jumpstart",
        "season": 1,
        "episode": 7,
        "released": "2018-04-04",
        "overview": "Thirty-two racers head to San Antonio, Texas, for the fifth No Prep Kings invitational race where damp track conditions make it a little trickier, and a new design for the starting tree causes Kye Kelley to see red."
      },
      {
        "id": "tvmaze:1440911",
        "title": "Lone Star Raincheck",
        "season": 1,
        "episode": 8,
        "released": "2018-04-04",
        "overview": "The fifth No Prep Kings invitational race continues in San Antonio, Texas, with 16 racers kicking off round two as they face off for a $40,000 prize. Weather causes a change of venue for rest of the race, and heavy hitters strive to become number one."
      },
      {
        "id": "tvmaze:1440247",
        "title": "Carolina Callouts",
        "season": 1,
        "episode": 9,
        "released": "2018-04-11",
        "overview": "Ryan Martin, Chuck, and Birdman fight for the lead in points. This week, the racers are in Orangeburg, South Carolina, and with so much on the line, they use callouts and strategy to try to get ahead."
      },
      {
        "id": "tvmaze:1440909",
        "title": "South Carolina Two Step",
        "season": 1,
        "episode": 10,
        "released": "2018-04-11",
        "overview": "The racers move into round two of the sixth No Prep race in South Carolina and as the track gets better, the racers turn it up to try to win. As eliminations continue, racers will have to fight to survive the fastest semi-finals and finals we've seen."
      },
      {
        "id": "tvmaze:1448309",
        "title": "Tar Heelin' and Dealin'",
        "season": 1,
        "episode": 11,
        "released": "2018-04-18",
        "overview": "Racers arrive in Dunn, North Carolina for the seventh race in the No Prep Kings series. After weeks and weeks of racing, many of the racers are struggling to keep their cars running, and in a points series, consistency can be just as important as speed."
      },
      {
        "id": "tvmaze:1448310",
        "title": "$40,000 and Dunn",
        "season": 1,
        "episode": 12,
        "released": "2018-04-18",
        "overview": "As the racers move into the later rounds of the second to last points race, all eyes are on Chuck, Birdman, and Ryan Martin. A win in North Carolina could put Ryan one step closer to winning but one slip up, and the others could make moves to overtake him."
      },
      {
        "id": "tvmaze:1458331",
        "title": "Ok, Let's Do This",
        "season": 1,
        "episode": 13,
        "released": "2018-04-25",
        "overview": "It's the final race of the No Prep Kings series, and that means that all eyes are on Birdman and Ryan Martin. If either of them can win the race in Tulsa, they'll walk away with the $40,000 prize plus $50,000 for the points championship."
      },
      {
        "id": "tvmaze:1592158",
        "title": "Kick Off in Kansas",
        "season": 2,
        "episode": 1,
        "released": "2019-01-14",
        "overview": "The new season kicks off in Topeka, Kansas with the largest field of racers that No Prep Kings has ever seen. With a tricky track surface, and the fastest racers competing everyone has their work cut out for them to take home the $40,000."
      },
      {
        "id": "tvmaze:2143212",
        "title": "Too Fast for Topeka",
        "season": 2,
        "episode": 2,
        "released": "2019-01-14",
        "overview": "Racers move into round two of the first No Prep Kings race of the season and with so much on the line, they push themselves and their cars to the limits. At the end of the night it's going to take a little luck and a lot of hard work to get the win."
      },
      {
        "id": "tvmaze:2143213",
        "title": "Mo' Money Mo' Memphis",
        "season": 2,
        "episode": 3,
        "released": "2019-01-21",
        "overview": "The No Prep Kings Points Championship continues in Memphis Tennessee, where racers compete for $40,000 and points in the championship. Starting at the next event, the race is capped at 32 racers, and points determine who gets a spot in the next race."
      },
      {
        "id": "tvmaze:2143214",
        "title": "Sweet Tunes in Memphis",
        "season": 2,
        "episode": 4,
        "released": "2019-01-21",
        "overview": "As racers move into round 2 in Memphis, the heat and humidity become more challenging as the track gets greasy and slicker. With $40,000 and valuable points on the line these drivers are willing to do anything to get from A to B to get the win."
      },
      {
        "id": "tvmaze:1604964",
        "title": "Pennsylvania Thunder",
        "season": 2,
        "episode": 5,
        "released": "2019-01-28",
        "overview": "Racers arrive at Maple Grove Raceway for the 3rd event in the No Prep Kings series, but rain delays the start of the race. When it's time to start round 1, racers learn the hard way that the rainy weather has made this track especially challenging."
      },
      {
        "id": "tvmaze:1604965",
        "title": "Pouring It On in PA",
        "season": 2,
        "episode": 6,
        "released": "2019-01-28",
        "overview": "Racers move into round 2 at Maple Grove Raceway, and leader Ryan Martin hopes to continue his winning streak. Meanwhile, heavy hitters like Mike Murillo, Chuck, Larry Larson, and Jeff Lutz try to take him out."
      },
      {
        "id": "tvmaze:1606280",
        "title": "Crashing Chi-town",
        "season": 2,
        "episode": 7,
        "released": "2019-02-04",
        "overview": "Racers arrive at Route 66 Raceway outside of Chicago for the fourth race in the No Prep Kings series. When cold weather and rainy conditions make the track extra sketchy, the racers have to be on their game if they want to make it to the finish line."
      },
      {
        "id": "tvmaze:1606281",
        "title": "Runnin' Route 66",
        "season": 2,
        "episode": 8,
        "released": "2019-02-04",
        "overview": "Racers enter round two of the fourth event in the No Prep Kings series. After a challenging round one, the track is starting to come around. Racers have to turn their cars up without blowing tires off as they all chase points and the $40,000 prize."
      },
      {
        "id": "tvmaze:2143215",
        "title": "Mile High Mayhem",
        "season": 2,
        "episode": 9,
        "released": "2019-02-11",
        "overview": "Racers arrive in Morrison, Colorado for the next event in the No Prep Kings series, however, the high altitude means thin air and big problems for the racers who run turbos. It'll be a struggle just to get to the finish line."
      },
      {
        "id": "tvmaze:2143216",
        "title": "Driving High",
        "season": 2,
        "episode": 10,
        "released": "2019-02-11",
        "overview": "It's time for the finals rounds in the race for points and $40,000 at Bandimere Speedway, but challenging conditions and a lengthy schedule are knocking out cars left and right. However, the top racers won't let the high altitude get them down."
      },
      {
        "id": "tvmaze:2143217",
        "title": "Tricky Tucson Track",
        "season": 2,
        "episode": 11,
        "released": "2019-02-18",
        "overview": "Racers are in Tucson, AZ for the sixth race in the No Prep Kings points series, but the desert dust and heat mean a seriously sketchy surface. As the move into the final races of the season, the pressure has never been higher."
      },
      {
        "id": "tvmaze:2143218",
        "title": "Desert Dollars",
        "season": 2,
        "episode": 12,
        "released": "2019-02-25",
        "overview": "It's day two of the sixth race in the No Prep Kings points series and when the sun comes out, the Tucson track gets even sketchier. And, with a rare chance to make up some serious ground, Mike Murillo is hoping to go rounds and earn some valuable points."
      },
      {
        "id": "tvmaze:2143219",
        "title": "The Heart of It All",
        "season": 2,
        "episode": 13,
        "released": "2019-02-25",
        "overview": "Racers arrive in Norwalk, Ohio for the seventh race in the No Prep Kings series and with only a few races left, the points race for the Championship is on. But, with a deceptively tricky track, the racers must find the right tune or risk going home."
      },
      {
        "id": "tvmaze:2143220",
        "title": "Buckeye Battles",
        "season": 2,
        "episode": 14,
        "released": "2019-02-25",
        "overview": "Racers move into the second half of the seventh race in the No Prep Kings series, and with most of the top points leaders still in the race, the pressure is on for them to go all the way."
      },
      {
        "id": "tvmaze:2143221",
        "title": "Carolina On My Mind",
        "season": 2,
        "episode": 15,
        "released": "2019-03-04",
        "overview": "Racers arrive in Benson, North Carolina for the second to last No Prep Kings race of the season, but the track is trickier than normal. It's the last race before the double points finale, so for anyone with their eyes on the prize, it's now or never."
      },
      {
        "id": "tvmaze:2143222",
        "title": "Coastin' in Carolina",
        "season": 2,
        "episode": 16,
        "released": "2019-03-04",
        "overview": "Racers are at GALOT Motorsports Park, and with most of the points leaders moving into the second half of the race, the pressure is on. It's the last race before the double points finale, so for anyone with their eyes on the prize, it's now or never."
      },
      {
        "id": "tvmaze:2143223",
        "title": "Finally in Texas",
        "season": 2,
        "episode": 17,
        "released": "2019-03-11",
        "overview": "It's time for the final event of the No Prep Kings season, and the stakes have never been higher. This race is for double points, which means every round counts as Ryan Martin, Mike Murillo, and Larry Larson scramble to take home the $250,000."
      },
      {
        "id": "tvmaze:2143224",
        "title": "Crowning the King",
        "season": 2,
        "episode": 18,
        "released": "2019-03-11",
        "overview": "After a dramatic round one, the race to the Points Championship is wide open. And, with everything on the line, the top racers are prepared to give everything they've got in order to earn the coveted title of No Prep King Points Champion."
      },
      {
        "id": "tvmaze:1730781",
        "title": "Win One for the Team",
        "season": 3,
        "episode": 1,
        "released": "2019-10-07",
        "overview": "The top No Prep racers gather at Maryland International Raceway for the first event of the season. Alliances form amongst veterans and newcomers alike, and tensions rise as each new faction plots its course to the top of the standings."
      },
      {
        "id": "tvmaze:1730782",
        "title": "NOLA Rising",
        "season": 3,
        "episode": 2,
        "released": "2019-10-14",
        "overview": "Team OKC arrives in New Hampshire fired up after an explosive start at Maryland International Raceway the week prior. With Texas keen to strike back, Kye realizes the only way NOLA can compete is if they also band together."
      },
      {
        "id": "tvmaze:1732287",
        "title": "The Crow Also Rises",
        "season": 3,
        "episode": 3,
        "released": "2019-10-21",
        "overview": "Big Chief is ready to make his No Prep debut as the racers roll into St. Louis for the third race of the season. NOLA is determined to deliver back-to-back upsets after the last race but the OKC and Texas aren't going down without a fight."
      },
      {
        "id": "tvmaze:1743786",
        "title": "Lock It Up",
        "season": 3,
        "episode": 4,
        "released": "2019-10-28",
        "overview": "Racers arrive in Idaho for the season's fourth race, everyone is focused on chasing down Lizzy. Ryan Martin tries a tricky new setup that could make or break his chances. As OKC, Texas, and NOLA band together, a new faction of misfits forms."
      },
      {
        "id": "tvmaze:1747983",
        "title": "Route 66 Showdown",
        "season": 3,
        "episode": 5,
        "released": "2019-11-04",
        "overview": "With the season half over and racers jockeying for points, the horseplay gets crazier than ever at Route 66 Raceway in Illinois. Lizzy and Team NOLA have been an unstoppable force so the competition is prepared to do anything to get ahead."
      },
      {
        "id": "tvmaze:1751991",
        "title": "Mile-High Mischief",
        "season": 3,
        "episode": 6,
        "released": "2019-11-11",
        "overview": "A hostile points battle becomes even more intense as drivers struggle to adjust to the altitude at Colorado's Bandimere Speedway. With turbos and pro-chargers gasping for air, the season's most combative staging war has everyone scrambling."
      },
      {
        "id": "tvmaze:1755125",
        "title": "Texas Tumblers",
        "season": 3,
        "episode": 7,
        "released": "2019-11-18",
        "overview": "Heading into the seventh race at Summit Motorsports Park in Ohio, Ryan Martin, Kye Kelley and Lizzy Musi are all in contention for the No Prep Kings championship and $100,000 prize. Meanwhile, Team Texas is on the verge of a major collapse."
      },
      {
        "id": "tvmaze:1758935",
        "title": "Fireball Flameout",
        "season": 3,
        "episode": 8,
        "released": "2019-11-25",
        "overview": "With two races left in the season, drivers are hustling to rack up points. On the brink of another championship, Ryan feels the pressure. Team NOLA forms an unexpected alliance in an attempt to increase their chances of winning an NPK trophy."
      },
      {
        "id": "tvmaze:1767864",
        "title": "Don't Choke",
        "season": 3,
        "episode": 9,
        "released": "2019-12-02",
        "overview": "Ryan rolls into the final event at the top of the leaderboard and with each round worth double points, the pressure is on to not let the elusive NPK trophy slip away for a third time. Kye, Lizzy and Scott do everything in their power to derail him."
      },
      {
        "id": "tvmaze:2177055",
        "title": "Welcome Back No Prep Kings",
        "season": 4,
        "episode": 1,
        "released": "2021-10-11",
        "overview": "No Prep Kings is back and it's bigger than ever. New drivers, new teams, new cars and stiffer competition. Racers travel to Hebron, OH, to kickoff the season."
      },
      {
        "id": "tvmaze:2196739",
        "title": "It Ain't Easy Being Greasy",
        "season": 4,
        "episode": 2,
        "released": "2021-10-12",
        "overview": "It's the first points race of the No Prep season and getting a win in Florida is no easy feat. Heat and humidity add to the competition, and everyone's hungry for the $40,000 prize."
      },
      {
        "id": "tvmaze:2196740",
        "title": "Not So Peachy State",
        "season": 4,
        "episode": 3,
        "released": "2021-10-18",
        "overview": "In the 2nd points race, Ryan Martin and Murder Nova look to continue their strong starts. After a storm, racers struggle to adjust to an already dangerous track and a disagreement threatens to pull Team X apart."
      },
      {
        "id": "tvmaze:2196741",
        "title": "Battle for the Crown",
        "season": 4,
        "episode": 4,
        "released": "2021-10-19",
        "overview": "No Prep Kings arrives in New England. Ryan Martin is still the racer to beat but a parts failure might just open the door for someone new to walk away with $40,000 and a major points grab."
      },
      {
        "id": "tvmaze:2198371",
        "title": "Slow Burn",
        "season": 4,
        "episode": 5,
        "released": "2021-10-25",
        "overview": "At Maple Grove Raceway, Ryan Martin, Cody Baker and Eric Kvilhaug are in a three-way tie for first place. Murder Nova tries to figure out a way to help his team with a broken car and Chuck slow plays Justin Swanstrom."
      },
      {
        "id": "tvmaze:2198372",
        "title": "Hot Mess",
        "season": 4,
        "episode": 6,
        "released": "2021-11-01",
        "overview": "Several weeks into the season, racers are struggling to keep their cars running at peak performance, working long days and long nights just to get race ready. Factor in extreme heat and a greasy surface, and someone's bound to hit a wall."
      },
      {
        "id": "tvmaze:2207492",
        "title": "Breaking Point",
        "season": 4,
        "episode": 7,
        "released": "2021-11-08",
        "overview": "Halfway through the season, competition heats up and strategy becomes more important than ever. Eric Bain pushes his car to its breaking point. Ryan Martin is back in first place, but another racer may find a way to close the gap quickly."
      },
      {
        "id": "tvmaze:2216877",
        "title": "A Little Help From My Friends",
        "season": 4,
        "episode": 8,
        "released": "2021-11-15",
        "overview": "In the back half of the season, Ryan Martin, Eric K and Robin Roberts lead the field in points. With a couple of good passes and support from a fellow teammate, Kye Kelley hopes to push his way into the top three."
      },
      {
        "id": "tvmaze:2220201",
        "title": "Two-for-One Special",
        "season": 4,
        "episode": 9,
        "released": "2021-11-22",
        "overview": "Coming off a Team Attack win, Ryan Martin goes for two victories in one weekend. Bobby Ducote gives Jerry Bird a push into the second round, and Murder Nova suffers a catastrophic failure."
      },
      {
        "id": "tvmaze:2227738",
        "title": "Rule Breakers",
        "season": 4,
        "episode": 10,
        "released": "2021-11-29",
        "overview": "In Tucson, the 405 finds out that Texas may have broken the rules before the race even starts and the group must decide whether Texas should be disqualified. One dispute leads to another and two racers emerge as the front-runners amidst all the drama."
      },
      {
        "id": "tvmaze:2232867",
        "title": "And the Fire Raged On",
        "season": 4,
        "episode": 11,
        "released": "2021-12-06",
        "overview": "After a slew of disagreements at the last event, some racers aren't ready to set aside their grudges. Ryan Martin remains the points leader with Kye Kelley right on his heels. To get to first, Kye will have to go through his girlfriend Lizzy first."
      },
      {
        "id": "tvmaze:2237052",
        "title": "X Gonna Give It To Ya",
        "season": 4,
        "episode": 12,
        "released": "2021-12-13",
        "overview": "Racers are in the home stretch of the Points Competition. Ryan Martin is determined to claim the top spot in his home state, but Team X and Team NOLA are hot on his heels and ready to do whatever it takes to knock him down."
      },
      {
        "id": "tvmaze:2240864",
        "title": "Texas Tussle",
        "season": 4,
        "episode": 13,
        "released": "2021-12-20",
        "overview": "Racers arrive in Texas for one of the final three races left in the points championship. Ryan Martin sits in first place, but with a small margin for error, one misstep could be his undoing."
      },
      {
        "id": "tvmaze:2244245",
        "title": "Family Fists",
        "season": 4,
        "episode": 14,
        "released": "2021-12-27",
        "overview": "Racers arrive at No Problem Raceway for the second-to-last event of the season with Ryan Martin barely edging out his competition. Team OKC bands together to help him solidify his lead and tensions boil over when two NOLA teammates face off in the semis."
      },
      {
        "id": "tvmaze:2247740",
        "title": "Don't Let Up",
        "season": 4,
        "episode": 15,
        "released": "2022-01-03",
        "overview": "Outlaws veteran Chuck serves as race master as the biggest names in no-prep racing compete for a large cash prize."
      },
      {
        "id": "tvmaze:2383735",
        "title": "Let the No Prepping Begin",
        "season": 5,
        "episode": 1,
        "released": "2022-09-19",
        "overview": "Racers kick off a new season of No Prep Kings with a qualifier event and everyone is out to get two-time Points Champion Ryan Martin."
      },
      {
        "id": "tvmaze:2401624",
        "title": "Watch Your Back",
        "season": 5,
        "episode": 2,
        "released": "2022-09-26",
        "overview": "Points competition officially begins and two-time champion Ryan Martin has a target on his back. And when his car gives him trouble, Team NOLA calls upon their heavy hitters to capitalize on his bad luck."
      },
      {
        "id": "tvmaze:2409248",
        "title": "Break Up That Foursome",
        "season": 5,
        "episode": 3,
        "released": "2022-10-03",
        "overview": "The points race heats up at Maple Grove Raceway as Kye, Jerry Bird, Ryan Martin and Daddy Dave all try to break out of their four-way tie for first. But when they don't all make it out of the first round, it gives one of them a chance to steal the lead."
      },
      {
        "id": "tvmaze:2413097",
        "title": "Luck of the Draw",
        "season": 5,
        "episode": 4,
        "released": "2022-10-10",
        "overview": "At New England Dragway, NOLA keeps getting in their own way when they can't keep from drawing each other and Ryan Martin makes a push to win his first race."
      },
      {
        "id": "tvmaze:2416514",
        "title": "Little Bit of Contact",
        "season": 5,
        "episode": 5,
        "released": "2022-10-17",
        "overview": "Ryan Martin looks to take back the points lead, but others are doing what they can to knock him out and racers begrudgingly leave Team Texas."
      },
      {
        "id": "tvmaze:2420028",
        "title": "New Racer on the Block",
        "season": 5,
        "episode": 6,
        "released": "2022-10-24",
        "overview": "Ryan is looking to extend his lead but Team NOLA is right on his heels. Plus, a new face goes rounds."
      },
      {
        "id": "tvmaze:2423997",
        "title": "Weather or Not",
        "season": 5,
        "episode": 7,
        "released": "2022-10-31",
        "overview": "Racers struggle with unusual weather in Minnesota. Justin Swanstrom breaks away from Team X."
      },
      {
        "id": "tvmaze:2428269",
        "title": "Hot Mess",
        "season": 5,
        "episode": 8,
        "released": "2022-11-07",
        "overview": "With Ryan in sole possession of the lead, NOLA tries to make some big moves to catch up."
      },
      {
        "id": "tvmaze:2431786",
        "title": "What a Shocker!",
        "season": 5,
        "episode": 9,
        "released": "2022-11-14",
        "overview": "In Idaho, Kye Kelley reveals his new secret weapon and Team California makes a strong showing."
      },
      {
        "id": "tvmaze:2435981",
        "title": "Upset in the Desert",
        "season": 5,
        "episode": 10,
        "released": "2022-11-21",
        "overview": "In Tucson, where the desert surface is tricky, there are plenty of upsets."
      },
      {
        "id": "tvmaze:2439534",
        "title": "The Mile High Club",
        "season": 5,
        "episode": 11,
        "released": "2022-11-28",
        "overview": "The 32-car invitational is filled with upsets as many of the top racers struggle with the high elevation and thin air at Bandimere Speedway in Colorado."
      },
      {
        "id": "tvmaze:2443366",
        "title": "Chasing Ryan",
        "season": 5,
        "episode": 12,
        "released": "2022-12-05",
        "overview": "Kye is chasing Ryan for the the points lead, but ends up dealing with car troubles."
      },
      {
        "id": "tvmaze:2447664",
        "title": "Go for Broke",
        "season": 5,
        "episode": 13,
        "released": "2022-12-12",
        "overview": "Ryan changes motors right before the North Carolina Invitational."
      },
      {
        "id": "tvmaze:2452371",
        "title": "Vow to Destroy",
        "season": 5,
        "episode": 14,
        "released": "2022-12-19",
        "overview": "Kye's ambition to win may cost him his relationship with Lizzy."
      },
      {
        "id": "tvmaze:2456664",
        "title": "Defeat or Three-Peat",
        "season": 5,
        "episode": 15,
        "released": "2022-12-26",
        "overview": "In the final event, the championship is within reach for both Ryan and Kye."
      },
      {
        "id": "tvmaze:3374967",
        "title": "Call Me Captain",
        "season": 5,
        "episode": 16,
        "released": "2025-10-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3379753",
        "title": "Prove Your Worth",
        "season": 5,
        "episode": 17,
        "released": "2025-10-06",
        "overview": ""
      },
      {
        "id": "tvmaze:3383329",
        "title": "Early Lead on the Track",
        "season": 5,
        "episode": 18,
        "released": "2025-10-13",
        "overview": ""
      },
      {
        "id": "tvmaze:3390065",
        "title": "Big Moves in Brainerd",
        "season": 5,
        "episode": 19,
        "released": "2025-10-20",
        "overview": ""
      },
      {
        "id": "tvmaze:3397071",
        "title": "Baking in Bowling Green",
        "season": 5,
        "episode": 20,
        "released": "2025-10-27",
        "overview": ""
      },
      {
        "id": "tvmaze:3402871",
        "title": "Don't Doubt Damon",
        "season": 5,
        "episode": 21,
        "released": "2025-11-03",
        "overview": ""
      },
      {
        "id": "tvmaze:3424496",
        "title": "Trading in Tulsa",
        "season": 5,
        "episode": 22,
        "released": "2025-11-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3431512",
        "title": "What It Takes to Win",
        "season": 5,
        "episode": 23,
        "released": "2025-11-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3456146",
        "title": "Bad Luck at Bandimere",
        "season": 5,
        "episode": 24,
        "released": "2025-11-24",
        "overview": ""
      },
      {
        "id": "tvmaze:3456147",
        "title": "What Happens in Vegas",
        "season": 5,
        "episode": 25,
        "released": "2025-12-01",
        "overview": ""
      }
    ]
  }
}