{
  "meta": {
    "id": "tvmaze:1345",
    "type": "series",
    "name": "7 Little Johnstons",
    "description": "Amber and Trent Johnston are living the American dream. They have been happily married for 14 years and have five children ranging from 6 to 13 years old. On paper, they might seem like your average family...yet in person, they attract a lot of attention.... because all seven members of the Johnston family – Amber, Trent, their two biological children, Jonah and Elizabeth, as well as their three adopted children, Anna, Emma and Alex – happen to have Achondroplasia Dwarfism. Together, these spunky seven make up the largest known family of Achondroplastic dwarfs in the world, and even describe themselves as \"the real life seven dwarfs\".",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505680.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/602/1505680.jpg",
    "videos": [
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3449243",
        "title": "Away in a Manger",
        "season": 16,
        "episode": 9,
        "released": "2025-12-09",
        "overview": "The Johnstons put together a live nativity set for their annual Christmas card. Anna does her own Christmas photos with her dogs and struggles with being distant from her family during the holidays. Trent and Amber come up with a plan to meet Anna."
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:151383",
        "title": "Birds and Bees Make Babies",
        "season": 1,
        "episode": 1,
        "released": "2015-03-31",
        "overview": "In the premiere of a series profiling a family in which all seven members have achondroplasia dwarfism, Anna and Elizabeth get ready for their first formal dance, but the Johnstons are surprised by a shocking call from school."
      },
      {
        "id": "tvmaze:151793",
        "title": "The Chicken Race",
        "season": 1,
        "episode": 2,
        "released": "2015-04-07",
        "overview": "Trent builds a chicken coop when the family decide to raise poultry; Amber takes Alex and Emma to their first karate class."
      },
      {
        "id": "tvmaze:151794",
        "title": "What Big Daddy Wants",
        "season": 1,
        "episode": 3,
        "released": "2015-04-07",
        "overview": "A decision to purchase a TV or living-room furniture becomes a dilemma in the middle of a renovation. Meanwhile, Jonah tries out for the high-school soccer team."
      },
      {
        "id": "tvmaze:153545",
        "title": "Reno-cation",
        "season": 1,
        "episode": 4,
        "released": "2015-04-14",
        "overview": "The family take a break from their fixer-upper to go on a ski trip, but when Trent is diagnosed with pneumonia it is up to Amber to keep the vacation on track."
      },
      {
        "id": "tvmaze:153546",
        "title": "Hot Mama",
        "season": 1,
        "episode": 5,
        "released": "2015-04-21",
        "overview": "Trent and Amber go out for dinner and dancing on Valentine's Day, but Trent also has a surprise waiting for his wife at home."
      },
      {
        "id": "tvmaze:153547",
        "title": "Run, Big Daddy, Run!",
        "season": 1,
        "episode": 6,
        "released": "2015-04-21",
        "overview": "Trent trains for a Fun Run; Amber's frustrated up with the kitchen layout; and the kids plan a surprise birthday dinner for their parents."
      },
      {
        "id": "tvmaze:154191",
        "title": "Call Off Easter?",
        "season": 1,
        "episode": 7,
        "released": "2015-04-28",
        "overview": "Easter is coming but the Johnstons' kitchen renovation isn't complete; Amber finds herself in a dangerous situation."
      },
      {
        "id": "tvmaze:393917",
        "title": "Girl Lookin' Rough",
        "season": 2,
        "episode": 1,
        "released": "2015-11-10",
        "overview": "In the Season 2 premiere, Amber gets a makeover from a professional after Trent tries to highlight her hair. Meanwhile, Alex's back pain prompts a meeting with doctors to determine if he needs surgery."
      },
      {
        "id": "tvmaze:393918",
        "title": "Alex Has a Little Crush",
        "season": 2,
        "episode": 2,
        "released": "2015-11-17",
        "overview": "The last day of school has everyone excited except Alex, who has a crush on his teacher. Later, Trent and Amber take the kids on vacation, but Jonah's unruly behavior could bring it to a premature end."
      },
      {
        "id": "tvmaze:393919",
        "title": "Life's Too Short to Be Angry",
        "season": 2,
        "episode": 3,
        "released": "2015-11-24",
        "overview": "The Johnstons bathroom renovation leads to extra stress on Trent and Amber's relationship; Emma signs up for cheerleading camp."
      },
      {
        "id": "tvmaze:486049",
        "title": "\"Drownding\" in the Deep End",
        "season": 2,
        "episode": 4,
        "released": "2015-12-01",
        "overview": "An invitation to a pool party prompts Alex and Emma to take swimming lessons, but Trent insists he knows how to swim even though Amber doesn't believe him."
      },
      {
        "id": "tvmaze:486050",
        "title": "Couple's Skate",
        "season": 2,
        "episode": 5,
        "released": "2015-12-01",
        "overview": "Emma celebrates her 10th birthday with a roller-skating party. Meanwhile, the family is ready to get rid of their van, which has 300,000 miles on it and no air-conditioning."
      },
      {
        "id": "tvmaze:518135",
        "title": "#GoatPoop",
        "season": 2,
        "episode": 6,
        "released": "2015-12-08",
        "overview": "Alex's routine MRI on his back turns serious when he stops breathing while under sedation, which terrifies Amber. Meanwhile, the family disagrees on whether or not they should adopt goats."
      },
      {
        "id": "tvmaze:518136",
        "title": "There's No 'I' in Trent",
        "season": 2,
        "episode": 7,
        "released": "2015-12-08",
        "overview": "Amber's biological dad plans to visit for the first time in five years, and Amber is nervous. The family plans on having a yard sale, but Trent is too nostalgic and doesn't want to sell anything."
      },
      {
        "id": "tvmaze:518137",
        "title": "My Two Dads",
        "season": 2,
        "episode": 8,
        "released": "2015-12-15",
        "overview": "Amber heads to the beach with her adopted dad, Trent and the kids, but questions are raised about what her biological dad really thinks of her."
      },
      {
        "id": "tvmaze:518138",
        "title": "Big Daddy Eagle Scout",
        "season": 2,
        "episode": 9,
        "released": "2015-12-22",
        "overview": "Trent plans a camping trip for the whole family at the end of summer before school starts, but Amber doesn't think it's a good idea to be outdoors in Georgia's August heat."
      },
      {
        "id": "tvmaze:518139",
        "title": "Alex's Surgery",
        "season": 2,
        "episode": 10,
        "released": "2015-12-29",
        "overview": "Alex's upcoming tonsillectomy makes the whole family nervous, especially after what happened during his recent MRI when he stopped breathing while under anesthesia."
      },
      {
        "id": "tvmaze:1132691",
        "title": "License to Drive",
        "season": 3,
        "episode": 1,
        "released": "2017-05-02",
        "overview": "Jonah and Anna are both put to the test- Jonah with his driver's license and Anna with her learner's permit; Alex is diagnosed with central apnea and undergoes an MRI to find out whether he needs brain surgery."
      },
      {
        "id": "tvmaze:1159007",
        "title": "Brain Surgery for Alex",
        "season": 3,
        "episode": 2,
        "released": "2017-05-09",
        "overview": "Alex is getting ready to undergo brain surgery, and Amber decides to give him a new haircut, which has disastrous results; while Alex is in the hospital, Trent takes the other Johnston children to see the Harlem Globetrotters."
      },
      {
        "id": "tvmaze:1159008",
        "title": "Loose Lips Sink Surprises",
        "season": 3,
        "episode": 3,
        "released": "2017-05-16",
        "overview": "In preparation for his 40th birthday, Trent decides to shed some weight, but the process isn't as much fun as he expected; Amber plans a surprise birthday party for Trent that he will never forget."
      },
      {
        "id": "tvmaze:1159009",
        "title": "I Just Tinkled",
        "season": 3,
        "episode": 4,
        "released": "2017-05-23",
        "overview": "Jonah's grades are slipping and Anna would rather do hair and makeup than go to college, so Amber and Trent arrange a college tour to motivate Jonah, and encourage Anna to find a job at a salon to learn the issues facing a little person in the workplace."
      },
      {
        "id": "tvmaze:1160404",
        "title": "A Little Girl in a Pageant World",
        "season": 3,
        "episode": 5,
        "released": "2017-05-30",
        "overview": "Elizabeth navigates uncharted territory when she enters a local beauty pageant. Meanwhile, Trent and Amber takes steps to finalize Emma's and Anna's adoptions."
      },
      {
        "id": "tvmaze:1160405",
        "title": "A Family Emergency",
        "season": 3,
        "episode": 6,
        "released": "2017-06-06",
        "overview": "A busy family week is interrupted when one of the Johnstons is rushed to the hospital in the middle of the night."
      },
      {
        "id": "tvmaze:1195507",
        "title": "Party Pooper",
        "season": 3,
        "episode": 7,
        "released": "2017-06-13",
        "overview": "Amber is discharged from the hospital in time to help the family throw Anna a sweet 16 party she'll never forget."
      },
      {
        "id": "tvmaze:1195508",
        "title": "8 Little Johnstons?",
        "season": 3,
        "episode": 8,
        "released": "2017-06-20",
        "overview": "The Johnstons need a break, so the family takes off for a tropical vacation in Puerto Rico. Meanwhile, Amber and Trent deliberate on whether they should add another member to the family."
      },
      {
        "id": "tvmaze:1285243",
        "title": "A Little Teen Romance",
        "season": 4,
        "episode": 1,
        "released": "2017-09-19",
        "overview": "The Johnston family throws a big bash to celebrate Jonah and Liz's birthdays, and Liz's friend James comes; the party acts as Liz's last hurrah before she gets leg surgery."
      },
      {
        "id": "tvmaze:1290070",
        "title": "Little Mama Sells Big Houses!",
        "season": 4,
        "episode": 2,
        "released": "2017-09-26",
        "overview": "Liz begins the tough road to recovery from her leg surgery; Amber tries to improve her real estate game with some help from Anna and Alex."
      },
      {
        "id": "tvmaze:1290071",
        "title": "Dad's Wearing Mom's Pants",
        "season": 4,
        "episode": 3,
        "released": "2017-10-03",
        "overview": "After yoga fails to inspire the family to get active, Amber &amp; Trent get bikes for everyone but Emma and Alex struggle without training wheels. Meanwhile, Trent and Amber surprise the family with matching tattoos but Jonah's not feeling them!"
      },
      {
        "id": "tvmaze:1290072",
        "title": "Tour de Johnston",
        "season": 4,
        "episode": 4,
        "released": "2017-10-10",
        "overview": "Amber signs the family up for a charity bike ride. Liz takes her first steps out of her wheelchair, but pushes herself to the limit trying to ride her new bike too soon. Alex and Emma head to the dreaded orthodontist for braces!"
      },
      {
        "id": "tvmaze:1290073",
        "title": "A Life-changing Decision",
        "season": 4,
        "episode": 5,
        "released": "2017-10-17",
        "overview": "Trent teaches Anna how to drive in preparation for her license test, but her behavior leaves Trent and Amber unsure of whether to trust her with the responsibility of driving. Then Trent and Amber shock the kids with a big announcement!"
      },
      {
        "id": "tvmaze:1290074",
        "title": "The M Word",
        "season": 4,
        "episode": 6,
        "released": "2017-10-24",
        "overview": "As their home is shown at an open house, the family heads to an amusement park where they're harassed and called the \"M\" word. Upon return, they discover that their dream home has fallen through, leaving them unsure of where they will end up living."
      },
      {
        "id": "tvmaze:1540343",
        "title": "Mo' House, Mo' Problems",
        "season": 5,
        "episode": 1,
        "released": "2018-10-30",
        "overview": "After weeks of hotel living, the Johnstons finally move into their new house, but a home repair leads to a dangerous discovery that may have the family packing their bags before they can even settle in to their dream home."
      },
      {
        "id": "tvmaze:1557019",
        "title": "Love Stings",
        "season": 5,
        "episode": 2,
        "released": "2018-11-06",
        "overview": "Trent sets up a family beehive while Liz deals with the social media fallout from her recent breakup."
      },
      {
        "id": "tvmaze:1557020",
        "title": "How Elizabeth Got Her Groove Back",
        "season": 5,
        "episode": 3,
        "released": "2018-11-13",
        "overview": "Liz tries to get over her first heartbreak by putting on her own art show, but how will she feel if noone shows up?"
      },
      {
        "id": "tvmaze:1561864",
        "title": "Jonah's Grad-itude",
        "season": 5,
        "episode": 4,
        "released": "2018-11-20",
        "overview": "As Jonas becomes the first Johnson kid to graduate high school. Trent and Amber confront him about his disrespectful attitude. And with torrential rain forecast, will the graduation be a wash out?"
      },
      {
        "id": "tvmaze:1565410",
        "title": "Fish Balls",
        "season": 5,
        "episode": 5,
        "released": "2018-11-27",
        "overview": "Emma is turning 13 and the family decides to celebrate with a day exploring her Chinese heritage."
      },
      {
        "id": "tvmaze:1569108",
        "title": "A Tale of Two Rivers",
        "season": 5,
        "episode": 6,
        "released": "2018-12-04",
        "overview": "The Johnstons take a family canoe trip and it's all fun and games until Trent is in danger of getting wet. Trent brings home a new kitten. The family suffers an unexpected tragedy."
      },
      {
        "id": "tvmaze:1574411",
        "title": "20 Years of Trent & Amber",
        "season": 5,
        "episode": 7,
        "released": "2018-12-11",
        "overview": "Trent and Amber are celebrating 20 years of marriage. They decide to spend the night at an bed &amp; breakfast in Atlanta, and leave Anna in charge of the kids back home. Trent and Amber enjoy candle lit meals and a drive down memory lane while back at home Anna keeps her siblings busy with water guns and mud fights. What sort of surprises are Trent and Amber in store for when they get home?"
      },
      {
        "id": "tvmaze:1580448",
        "title": "Love in Lederhosen",
        "season": 5,
        "episode": 8,
        "released": "2018-12-11",
        "overview": "The Johnstons go to a Bavarian-style village in the Georgia mountains for a fun family weekend. There\\'s something for everyone: candy, outdoor adventure and tchotchkes galore. The family tries to recreate the adventure at home by building a zipline."
      },
      {
        "id": "tvmaze:1577300",
        "title": "Trent's Terrible, Horrible, No Good, Very Bad Week",
        "season": 5,
        "episode": 9,
        "released": "2018-12-18",
        "overview": "Despite being given just two rules to abide at their annual Little People conference, Anna gets in trouble and faces severe consequences; once back home, Liz and Trent butt heads over driving lessons."
      },
      {
        "id": "tvmaze:1580200",
        "title": "Yo Shawty!",
        "season": 5,
        "episode": 10,
        "released": "2018-12-18",
        "overview": "As a new school year begins, Jonah has an LP lady friend come visit to see if romance will bloom. Trent is feeling unsatisfied with his current job and wants to be his own boss. He and Amber discuss opening a refurbished furniture shop and look at commercial real estate options around town. When the kids hear of this bold move, they worry about the risk of failure and how it will affect their futures. Surprised by the kids' resistance, will Trent &amp; Amber move forward with their plans for a family-run business?"
      },
      {
        "id": "tvmaze:1629005",
        "title": "We're Off to See the Wizard!",
        "season": 6,
        "episode": 1,
        "released": "2019-04-02",
        "overview": "The Johnstons throw a Halloween party, but can they agree on a costume theme for all 7 of them? A trip to a haunted house winds up being more frightening than some of the kids bargained for. Stress takes a toll on Trent's health, scaring the family."
      },
      {
        "id": "tvmaze:1630955",
        "title": "The Nightmare Before Christmas",
        "season": 6,
        "episode": 2,
        "released": "2019-04-09",
        "overview": "The Johnstons go big for Christmas with a giant tree and an even bigger party for hundreds of little people! Can they pull everything together in time or will it all come toppling down?"
      },
      {
        "id": "tvmaze:1637689",
        "title": "Little Johnstons, Big Apple",
        "season": 6,
        "episode": 3,
        "released": "2019-04-16",
        "overview": "The Johnstons hit the Big Apple for vacation, seeing the sights and making a special trip to Coney Island to learn the history of sideshows. The family has strong feelings about the history and are shocked when they are invited to see a performance."
      },
      {
        "id": "tvmaze:1640678",
        "title": "That Was a Race?",
        "season": 6,
        "episode": 4,
        "released": "2019-04-23",
        "overview": "Liz is feeling great after the end of her relationship last year; she's exercising, painting and has even signed up to race in a 5K with Emma and Anna; she also has a new love interest but is concerned about Trent and Amber's feelings."
      },
      {
        "id": "tvmaze:1641440",
        "title": "Valentines or Broken Hearts?",
        "season": 6,
        "episode": 5,
        "released": "2019-04-30",
        "overview": "Alex and Emma are both excited to attend their school's Valentine's Day dance; Anna has finally earned the privilege to drive alone; after months of tension, Amber's at her wit's end, so she and Trent make an appointment to see a therapist."
      },
      {
        "id": "tvmaze:1645401",
        "title": "Picture Them Naked",
        "season": 6,
        "episode": 6,
        "released": "2019-05-07",
        "overview": "Family therapy reveals that Emma has been relying on her parents and siblings to speak for her; the Johnstons vow that they will no longer come to Emma's rescue, so it's sink or swim when she has to give a speech in front of a huge crowd."
      },
      {
        "id": "tvmaze:1652881",
        "title": "The Promposal",
        "season": 6,
        "episode": 7,
        "released": "2019-05-14",
        "overview": "Liz is excited for her junior prom; Trent and Amber test the waters on their own business with a booth at the local festival."
      },
      {
        "id": "tvmaze:1655831",
        "title": "A Prom Kiss & a Prom Diss",
        "season": 6,
        "episode": 8,
        "released": "2019-05-21",
        "overview": "It's prom season and Liz and Anna are ready to party, with dresses bought and dates lined up; Amber's turning the big 4-0 and the family devises a surprise trip to Hilton Head, S.C., to celebrate."
      },
      {
        "id": "tvmaze:1822463",
        "title": "Summer Lovin'",
        "season": 7,
        "episode": 1,
        "released": "2020-03-31",
        "overview": "The Johnstons are back with some big life events on the horizon. Trent seeks answers for his ongoing health issues, Liz re-enters the dating scene with Emma not too far behind and Anna is unsure about leaving home after graduation."
      },
      {
        "id": "tvmaze:1824392",
        "title": "Anna Ate My Homework",
        "season": 7,
        "episode": 2,
        "released": "2020-04-07",
        "overview": "The Johnstons pamper themselves with mud masks before getting down and dirty at a princess themed mud run. Jonah gives Trent and Amber some devastating news and Trent receives the results from his gallbladder scan."
      },
      {
        "id": "tvmaze:1835372",
        "title": "We Came from Uranus",
        "season": 7,
        "episode": 3,
        "released": "2020-04-14",
        "overview": "The Johnstons pursue their family history with the help of a genealogist and get some unexpected results. Jonah deals with the fallout from being kicked out of college, while Trent and Amber turn to a professional for help."
      },
      {
        "id": "tvmaze:1837013",
        "title": "It's a Boy!",
        "season": 7,
        "episode": 4,
        "released": "2020-04-21",
        "overview": "Emma is diagnosed with a speech disorder which she must overcome in order to lead summer camp activities. Worried about her ability to lead a group, Trent &amp; Amber take the family to an improv class to help Emma think on her feet."
      },
      {
        "id": "tvmaze:1844407",
        "title": "Naked and Annoyed",
        "season": 7,
        "episode": 5,
        "released": "2020-04-28",
        "overview": "The Johnstons camp out in the backyard while renovations are underway, and Amber decides to make the family go tech-free by locking everyone's phone away for the weekend. Can five teenagers survive without technology or is someone going to crack?"
      },
      {
        "id": "tvmaze:1852999",
        "title": "If This RV's 'A-Rockin",
        "season": 7,
        "episode": 6,
        "released": "2020-05-05",
        "overview": "Before the Johnstons attend their annual little people's conference in San Francisco, Trent and Amber decide to start the trip in San Diego drive up in an RV. Everyone is excited for the destination, but can they survive a week in an RV together?"
      },
      {
        "id": "tvmaze:1856083",
        "title": "It's a Small World",
        "season": 7,
        "episode": 7,
        "released": "2020-05-12",
        "overview": "The Johnston kids enjoy a week in San Francisco for their annual little people's conference where Emma reunites with her bff Lucca and Anna finds herself a date, but trouble arises when the family is heckled in public."
      },
      {
        "id": "tvmaze:1856084",
        "title": "That's Cringey!",
        "season": 7,
        "episode": 8,
        "released": "2020-05-19",
        "overview": "The family is back home from their two week California vacation and the start of the school year is approaching fast. Anna breaks down as she prepares to start college, and Trent &amp; Amber worry Liz is getting too hot and heavy with her new boyfriend."
      },
      {
        "id": "tvmaze:1856085",
        "title": "School Rules",
        "season": 7,
        "episode": 9,
        "released": "2020-05-26",
        "overview": "School is back in session, with mixed feelings from the kids. Alex and Emma dress up as historical characters for a social studies project while Jonah's new college schedule worries Trent."
      },
      {
        "id": "tvmaze:1869680",
        "title": "I'm Not Dying!",
        "season": 7,
        "episode": 10,
        "released": "2020-06-02",
        "overview": "Anna is finally ready to leave for college, and the excitement sets in as she and her sisters do some back to school shopping. A family dinner gets tense as Trent upsets Emma. Move-in day finally comes and the small size of the dorm is a big shock."
      },
      {
        "id": "tvmaze:1974907",
        "title": "Love in the Time of Corona",
        "season": 8,
        "episode": 1,
        "released": "2020-12-29",
        "overview": "The family attempt viral video challenges to stave off quarantine boredom. Plus, Trent and Amber spice up their bedroom life with a pole dancing class."
      },
      {
        "id": "tvmaze:1995410",
        "title": "What's Cooking, Good Looking?",
        "season": 8,
        "episode": 2,
        "released": "2021-01-05",
        "overview": "Trent and Amber meet with an intimacy coach to spice things up. Meanwhile, a cooking competition inspires Alex to improve his culinary skills."
      },
      {
        "id": "tvmaze:1996409",
        "title": "Did Somebody Shrink You?",
        "season": 8,
        "episode": 3,
        "released": "2021-01-12",
        "overview": "Emma and Alex are given a go-kart to practice their driving skills. But Elizabeth isn't pleased to see her younger siblings behind the wheel."
      },
      {
        "id": "tvmaze:1996410",
        "title": "Are You Gonna Marry Liz?",
        "season": 8,
        "episode": 4,
        "released": "2021-01-19",
        "overview": "Liz's best little people friends come to visit – with questions for her boyfriend. And, Trent tries to join in on the success of his kids' online shops."
      },
      {
        "id": "tvmaze:2012415",
        "title": "Chasing Waterfalls",
        "season": 8,
        "episode": 5,
        "released": "2021-01-26",
        "overview": "The Johnstons spend time with Jonah's girlfriend and her family. The parents push for them to consider their future, but is it too much too fast?"
      },
      {
        "id": "tvmaze:2017255",
        "title": "Who Is Thyself?",
        "season": 8,
        "episode": 6,
        "released": "2021-02-02",
        "overview": "Alex and Emma are excited to finally start attending high school classes in person. But being a freshman comes with its challenges."
      },
      {
        "id": "tvmaze:2022274",
        "title": "Slumdog Pavillionaire",
        "season": 8,
        "episode": 7,
        "released": "2021-02-09",
        "overview": "After a day of disc golf, the Johnstons are inspired to build a pavilion in their backyard. Then, the family gives Anna a test run as a substitute teacher."
      },
      {
        "id": "tvmaze:2028997",
        "title": "A Thanksgiving Ultimatum",
        "season": 8,
        "episode": 8,
        "released": "2021-02-16",
        "overview": "The family competes in their annual Turkey Bowl at Thanksgiving. And, sick of his attitude and lack of motivation, Trent and Amber give Jonah an ultimatum."
      },
      {
        "id": "tvmaze:2071504",
        "title": "Holiday Hangover",
        "season": 9,
        "episode": 1,
        "released": "2021-05-25",
        "overview": "Jonah is the first Johnston to turn 21, and it's Christmas time in the household. While Trent and Amber try to make the holiday merry, the adult kids living at home is causing tension in the family."
      },
      {
        "id": "tvmaze:2095283",
        "title": "Any Place But Home",
        "season": 9,
        "episode": 2,
        "released": "2021-06-01",
        "overview": "Amber and Trent push their children to take on more responsibilities around the house. Later, things explode when Amber presses Anna on her plans to move out."
      },
      {
        "id": "tvmaze:2101023",
        "title": "A New Year, A New Us?",
        "season": 9,
        "episode": 3,
        "released": "2021-06-08",
        "overview": "Despite tension in the family, everyone comes together to celebrate the Lunar New Year. And, Jonah starts a sports podcast to prove himself to his parents."
      },
      {
        "id": "tvmaze:2105248",
        "title": "My Farty Valentine",
        "season": 9,
        "episode": 4,
        "released": "2021-06-15",
        "overview": "Trent plans a special Valentine's Day present for Amber. Emma and Alex set up a dating profile for Anna, and Liz and Brice are quizzed on their relationship."
      },
      {
        "id": "tvmaze:2109713",
        "title": "A Kick in the Head",
        "season": 9,
        "episode": 5,
        "released": "2021-06-22",
        "overview": "Ashley visits Jonah, and they discuss his parents' ultimatum for him to find a full time job and move out of the house. He's got a promising interview lined up, but Trent and Amber may not approve of his new career choice."
      },
      {
        "id": "tvmaze:2115611",
        "title": "I Only Poop Twice a Week",
        "season": 9,
        "episode": 6,
        "released": "2021-06-29",
        "overview": "Tensions are coming to a head at the Johnston home as Anna, Jonah and Liz plan to move out of the house, while Trent and Amber try to teach them the skills they need to succeed on their own. Meanwhile Trent gets a visit from a childhood friend."
      },
      {
        "id": "tvmaze:2118883",
        "title": "I'm a Huge Wimp",
        "season": 9,
        "episode": 7,
        "released": "2021-07-06",
        "overview": "Trent and Amber are both celebrating birthdays, and the kids plan a big surprise for them. Meanwhile, despite their recent arguments, Jonah approaches Trent for help with his new job."
      },
      {
        "id": "tvmaze:2122702",
        "title": "Liz Leaves the Nest",
        "season": 9,
        "episode": 8,
        "released": "2021-07-13",
        "overview": "Elizabeth is the first Johnston child to move out into her own house. Anna hopes to be close behind, but she may not have convinced her parents that she's responsible enough."
      },
      {
        "id": "tvmaze:2206060",
        "title": "Sayonara, Sister!",
        "season": 10,
        "episode": 1,
        "released": "2021-11-16",
        "overview": "The Johnstons have a lot to celebrate between Mother's Day, Liz and Brice's second anniversary and Anna finally moving out on her own."
      },
      {
        "id": "tvmaze:2214717",
        "title": "Anna's in the Dog House",
        "season": 10,
        "episode": 2,
        "released": "2021-11-23",
        "overview": "After settling into their new homes, Anna and Elizabeth host competing dinner parties. Jonah struggles to find a suitable apartment to rent."
      },
      {
        "id": "tvmaze:2217721",
        "title": "From Croquet to Crochet",
        "season": 10,
        "episode": 3,
        "released": "2021-11-30",
        "overview": "When Trent's dad's declining health causes him to miss their annual Father's Day gathering, Trent rethinks his priorities. Anna is hit with the realities of living on her own, and Emma settles into her new solo room."
      },
      {
        "id": "tvmaze:2222035",
        "title": "Buggin' Out",
        "season": 10,
        "episode": 4,
        "released": "2021-12-07",
        "overview": "The Johnstons take their prank war to the next level, including bringing live bugs to the mix. Now on their own, Liz and Anna attend a self defense class to ease safety concerns. Then, the family learns how to make pizza from scratch."
      },
      {
        "id": "tvmaze:2229016",
        "title": "Take This Job and Shove It!",
        "season": 10,
        "episode": 5,
        "released": "2021-12-14",
        "overview": "Emma and Alex celebrate their birthdays with a luau-themed party. Now that they are 16, the teens will be allowed to date. Meanwhile, a frustrated Trent makes a sudden decision at work."
      },
      {
        "id": "tvmaze:2234189",
        "title": "Choppy Waters",
        "season": 10,
        "episode": 6,
        "released": "2021-12-21",
        "overview": "The Johnstons hit the beach for a vacation in Florida with family and friends, including the kids' significant others. Jonah breaks the news that he's moving out to his girlfriend, Ashley."
      },
      {
        "id": "tvmaze:2238234",
        "title": "Trent's Funemployment",
        "season": 10,
        "episode": 7,
        "released": "2021-12-28",
        "overview": "Trent begins searching for a new job while Amber decides whether or not to enroll in college to continue her career as a teacher. Anna, Emma and Alex set up Emma's new photo booth and take snapshots for their online shops."
      },
      {
        "id": "tvmaze:2248338",
        "title": "How Do You Say Joose?",
        "season": 10,
        "episode": 8,
        "released": "2022-01-04",
        "overview": "Trent starts his new career, and Alex, Emma and Amber are back in school. Things may be busy, but Trent and Amber still consider a new addition to the household. They aren't sure of how the kids will react, though."
      },
      {
        "id": "tvmaze:2288714",
        "title": "The Finnish Are Coming!",
        "season": 11,
        "episode": 1,
        "released": "2022-03-15",
        "overview": "The Johnstons prepare for the arrival of Joose, a Finnish exchange student. While Liz, Anna and Jonah enjoy living on their own, the younger kids help Trent up his social media game for his new job."
      },
      {
        "id": "tvmaze:2294022",
        "title": "Friday Night Heights",
        "season": 11,
        "episode": 2,
        "released": "2022-03-22",
        "overview": "The Johnstons introduce Joose to American traditions, including pumpkin carving at Halloween and a Friday night at the high school football game. Meanwhile, Alex is struggling in school."
      },
      {
        "id": "tvmaze:2300539",
        "title": "Wife Carrying",
        "season": 11,
        "episode": 3,
        "released": "2022-03-29",
        "overview": "The Johnstons share their competitive side to their Finnish foreign exchange student during the Johnston Backyard Games; Amber and Trent are celebrating their wedding anniversary with plaster, plumbing and pyjamas."
      },
      {
        "id": "tvmaze:2308055",
        "title": "The Cranberry Massacre",
        "season": 11,
        "episode": 4,
        "released": "2022-04-05",
        "overview": "The Johnstons introduce their foreign exchange student, Joose, to some common Thanksgiving traditions -- as well as a few traditions of their own. Liz and Anna look into becoming homeowners, and Liz thinks she and Brice are ready for the next step."
      },
      {
        "id": "tvmaze:2305467",
        "title": "Mr. Joose Goes to Washington",
        "season": 11,
        "episode": 5,
        "released": "2022-04-12",
        "overview": "After celebrating Finnish Independence Day, the Johnstons head to Washington, D.C. to show Joose America's capital. Back in Georgia, Anna and Liz give Jonah's bachelor pad a makeover."
      },
      {
        "id": "tvmaze:2309486",
        "title": "Are You Kissing?",
        "season": 11,
        "episode": 6,
        "released": "2022-04-19",
        "overview": "It's Christmas in Georgia, and the Johnstons and Joose share traditions. Anna is seeing a new guy, but she's reluctant to have him meet the family. Meanwhile, Liz decorates her own place and talks about a future home with Brice."
      },
      {
        "id": "tvmaze:2312930",
        "title": "Coming Clean",
        "season": 11,
        "episode": 7,
        "released": "2022-04-26",
        "overview": "The Johnstons celebrate the New Year with their exchange student, Joose, but an unexpected call from Jonah leaves Amber and Trent reeling."
      },
      {
        "id": "tvmaze:2317795",
        "title": "The Finn-ale",
        "season": 11,
        "episode": 8,
        "released": "2022-05-03",
        "overview": "The Johnstons say goodbye to their Finnish exchange student, Joose. Then, Elizabeth drops a bomb on her parents about her future plans with Brice."
      },
      {
        "id": "tvmaze:2334511",
        "title": "Eyebrows and Anxiety",
        "season": 12,
        "episode": 1,
        "released": "2022-08-16",
        "overview": "After the family celebrates Amber's birthday, she and Anna decide to upgrade their looks. Brice and Liz are ready to take the next step in their relationship, and Trent and Amber have a heart-to-heart with Jonah about his recent behavioural issues."
      },
      {
        "id": "tvmaze:2355237",
        "title": "When Death Does Us Apart",
        "season": 12,
        "episode": 2,
        "released": "2022-08-23",
        "overview": "Jonah moves back home and starts a new routine; Alex and Emma join forces to help Amber at home; Anna, Liz and Emma make vision boards and discuss their goals in love and life; the family video chats with a familiar face."
      },
      {
        "id": "tvmaze:2355238",
        "title": "Sleepless in Forsyth",
        "season": 12,
        "episode": 3,
        "released": "2022-08-30",
        "overview": "Trent's snoring keeps Amber up at night and puts his health in danger; Liz heads to Nashville for a girls' weekend, but three little women out on the town draws unwanted attention; Alex gets an exciting opportunity."
      },
      {
        "id": "tvmaze:2355239",
        "title": "Adventures in PR",
        "season": 12,
        "episode": 4,
        "released": "2022-09-06",
        "overview": "After the family enjoys a local strawberry festival, Elizabeth and Brice begin to move his things into her home. Emma starts an internship, and Jonah's girlfriend, Ashley, visits, but Trent and Amber have questions for the couple."
      },
      {
        "id": "tvmaze:2355240",
        "title": "Dating and Skating",
        "season": 12,
        "episode": 5,
        "released": "2022-09-13",
        "overview": "Anna and Emma look for love at a singles event. Elizabeth meets with Brice's parents to talk to them about the couple moving in together. When Jonah's girlfriend, Ashley, visits for the weekend, Trent and Amber voice their opinions."
      },
      {
        "id": "tvmaze:2355241",
        "title": "Lettuce Get It On",
        "season": 12,
        "episode": 6,
        "released": "2022-09-20",
        "overview": "Emma discovers the wild side of animal care during a new internship, and Jonah gets serious about his mental health. Anna and Amber make strides in their relationship while pursuing changes in their professional lives."
      },
      {
        "id": "tvmaze:2355242",
        "title": "Bomp Chicka Bow Wow Bench",
        "season": 12,
        "episode": 7,
        "released": "2022-09-27",
        "overview": "Alex and Emma look at potential cars, but some driving lesson mishaps may set them back. Liz and Brice's plans to move in together hit another obstacle. Then, Trent and Amber have ideas for a sleek and sexy bathroom renovation."
      },
      {
        "id": "tvmaze:2355243",
        "title": "Big Daddy's Lil Premiere",
        "season": 12,
        "episode": 8,
        "released": "2022-10-04",
        "overview": "Brice surprises Liz with a special date to take their minds off the complications of moving in together; the Johnston girls catch up over lunch, where they are treated to sushi and a show; Alex offers to shoot a commercial for Trent's business."
      },
      {
        "id": "tvmaze:2404440",
        "title": "Pickleball and Perms",
        "season": 12,
        "episode": 9,
        "released": "2022-10-11",
        "overview": "Jonah prepares for the family's upcoming trip to the annual little people's conference with a bold new look. Meanwhile, Emma and Anna speculate on the real reason Brice can't move in with Elizabeth yet."
      },
      {
        "id": "tvmaze:2411031",
        "title": "Lotsa Little Lovin'",
        "season": 12,
        "episode": 10,
        "released": "2022-10-18",
        "overview": "The Johnstons head to Spokane for the annual Little People of America convention to meet up with friends, including Joose. Then while Anna, Alex and Emma give updates on their dating lives, Jonah and Ashley reunite to discuss rekindling."
      },
      {
        "id": "tvmaze:2496922",
        "title": "Love on the Brain",
        "season": 13,
        "episode": 1,
        "released": "2023-04-18",
        "overview": "The Johnston family takes a line dancing class to prepare for Liz's upcoming 21st birthday; Liz makes plans to move in with Brice; the sisters have a sleepover; Trent and Amber debut their new bathroom."
      },
      {
        "id": "tvmaze:2526354",
        "title": "Om Sweet Home",
        "season": 13,
        "episode": 2,
        "released": "2023-04-25",
        "overview": "Trent and Amber prepare Alex for his first solo trip to visit his girlfriend, Allie; Elizabeth and Brice look at a rental home; Jonah tries to help Anna deal with stress using meditation; Trent begins a journey to get in shape."
      },
      {
        "id": "tvmaze:2526355",
        "title": "Oh Lover Boy",
        "season": 13,
        "episode": 3,
        "released": "2023-05-02",
        "overview": "Homecoming dance prep is underway for Alex and Emma; Trent and Amber have second thoughts about Liz and Brice's house search; Alex visits his girlfriend, Allie, at her home in Ohio for her birthday."
      },
      {
        "id": "tvmaze:2534808",
        "title": "Homecoming and Going",
        "season": 13,
        "episode": 4,
        "released": "2023-05-09",
        "overview": "Alex's girlfriend, Allie, arrives in town for the homecoming dance; Trent sets up a gym in the garage; Liz and Brice hear hard truths about their house search; Trent and Amber reveal an exciting upcoming trip."
      },
      {
        "id": "tvmaze:2534809",
        "title": "Reindeer Games",
        "season": 13,
        "episode": 5,
        "released": "2023-05-16",
        "overview": "Trent and Amber take Alex and Emma on a trip to Finland to visit their former exchange student, Joose, and his family. Back at home, Liz and Brice are packing up to move in together, and Jonah throws a party as he has the house to himself."
      },
      {
        "id": "tvmaze:2545517",
        "title": "Desperately Seeking Santa",
        "season": 13,
        "episode": 6,
        "released": "2023-05-23",
        "overview": "The adventure continues in Finland for Trent, Amber, Alex and Emma, who enjoy a traditional game of welly throwing. Elizabeth plans her 21st birthday."
      },
      {
        "id": "tvmaze:2545518",
        "title": "Little House of Horrors",
        "season": 13,
        "episode": 7,
        "released": "2023-05-30",
        "overview": "Trent receives some alarming news from a nutritionist. Alex and Allie celebrate their four-month anniversary, and later the family hold a haunted house for Halloween."
      },
      {
        "id": "tvmaze:2557177",
        "title": "Let's Get Physical",
        "season": 13,
        "episode": 8,
        "released": "2023-06-06",
        "overview": "While Trent continues his health and fitness journey, Emma hosts a pop-up shop for her business. Now that Liz and Brice are living together, Trent checks in on how things are going. Then, the family celebrates Thanksgiving with gratitude."
      },
      {
        "id": "tvmaze:2557178",
        "title": "Trent's Yule Log",
        "season": 13,
        "episode": 9,
        "released": "2023-06-13",
        "overview": "It's Liz's 21st birthday, and the family throws her a hoedown. After surprising news from the nutritionist, Trent must take a poop test. Anna gives an update on her therapy journey. Then, the Johnstons celebrate Christmas."
      },
      {
        "id": "tvmaze:2565286",
        "title": "Romance or Roommates?",
        "season": 13,
        "episode": 10,
        "released": "2023-06-20",
        "overview": "The Johnstons come together on the court for a game of basketball. Trent and Amber celebrate Trent's weight loss with a boudoir photo shoot. Elizabeth has a heart-to-heart with Amber about her relationship with Brice."
      },
      {
        "id": "tvmaze:2705036",
        "title": "The Rest Is Still Unwritten",
        "season": 14,
        "episode": 1,
        "released": "2024-03-12",
        "overview": "Elizabeth makes a big decision about her relationship with Brice; Amber and Trent try out body painting; Anna buys a new home and starts the process of moving in; Jonah and Alex write love letters to their girlfriends."
      },
      {
        "id": "tvmaze:2787271",
        "title": "Breakup, Alt, Delete",
        "season": 14,
        "episode": 2,
        "released": "2024-03-19",
        "overview": "Trent celebrates his birthday with a competitive go-kart race; Liz deletes her relationship from social media; Alex gets an answer to his promposal; the older siblings get together to catch up, and Jonah finds a new challenge to his hobby."
      },
      {
        "id": "tvmaze:2796619",
        "title": "Pimp-A-Trent",
        "season": 14,
        "episode": 3,
        "released": "2024-03-26",
        "overview": "The family takes a trampoline exercise class; after several kitchen mishaps, Anna learns to cook; Emma opens up to Liz about struggling to make friends, while Alex hangs out with twins from his robotics team."
      },
      {
        "id": "tvmaze:2796620",
        "title": "The Cupid Shuffle",
        "season": 14,
        "episode": 4,
        "released": "2024-04-02",
        "overview": "The family visits a farm and meets dwarf cows; Alex and Emma attend prom; Trent and Amber relive their high school romance; when Ashley visits, the girls take her out on the town for brunch and try to get the scoop on her relationship with Jonah."
      },
      {
        "id": "tvmaze:2803308",
        "title": "Cool for the Summer",
        "season": 14,
        "episode": 5,
        "released": "2024-04-09",
        "overview": "Anna hosts a summer party at her new home, complete with an ice cream competition; Emma and Alex surprise Amber with a twist on a fancy Mother's Day meal; Trent and Amber show off their new salsa costumes and their unconventional moves."
      },
      {
        "id": "tvmaze:2813691",
        "title": "Emma in Charge",
        "season": 14,
        "episode": 6,
        "released": "2024-04-16",
        "overview": "Trent and Amber take their first vacation ever without the kids; Anna uses her new cooking skills to make dinner for the family; Emma looks for a summer job at a local boutique; then, Jonah enlists his siblings to taste test his barbecue sauce."
      },
      {
        "id": "tvmaze:2831738",
        "title": "Truth or Dare",
        "season": 14,
        "episode": 7,
        "released": "2024-04-23",
        "overview": "Alex confides in Jonah about his relationship struggles; Trent and Amber's next date night involves a game of truth or dare; then, Jonah feels the heat as he enters his first BBQ competition."
      },
      {
        "id": "tvmaze:2832208",
        "title": "I Almost Patio Drowned!",
        "season": 14,
        "episode": 8,
        "released": "2024-04-30",
        "overview": "The Johnstons cool off with an ice water bucket challenge; Liz and Emma give Anna fashion advice for the upcoming LPA conference; the family practices their workshop and realize they have a lot of work to do, and quickly."
      },
      {
        "id": "tvmaze:2837687",
        "title": "Keep the Johnstons Weird",
        "season": 14,
        "episode": 9,
        "released": "2024-05-07",
        "overview": "The Johnstons head to Austin, Texas for the LPA conference; the family holds a workshop, Alex is reunited with Allie, and Trent and Amber compete in the talent show; back home, Liz and Brice need to share big news with their parents."
      },
      {
        "id": "tvmaze:2837688",
        "title": "One More Little Johnston?",
        "season": 14,
        "episode": 10,
        "released": "2024-05-14",
        "overview": "Liz has a big announcement that shocks the entire family; the siblings react to Liz keeping such a big secret from them, while Trent and Amber process the news of the changing Johnston family dynamic."
      },
      {
        "id": "tvmaze:2855915",
        "title": "The Icing on the Cake",
        "season": 14,
        "episode": 11,
        "released": "2024-05-21",
        "overview": "With Emma and Alex starting senior year of high school, Trent and Amber prepare to enter into the empty nester phase of their lives; Anna becomes a homeowner and Jonah dives into a new passion; Liz navigates her complicated relationship with Brice."
      },
      {
        "id": "tvmaze:2855920",
        "title": "The Measure of a Life",
        "season": 14,
        "episode": 12,
        "released": "2024-05-28",
        "overview": "The family hosts over 100 people at their house for Poppy's 90th birthday, where Liz and Brice share their exciting news; Liz and Brice go for an ultrasound to find out if the baby will be a little person or average sized."
      },
      {
        "id": "tvmaze:2880538",
        "title": "Tall or Small",
        "season": 14,
        "episode": 13,
        "released": "2024-06-04",
        "overview": "Elizabeth and Brice reveal if their baby is average sized or a little person. Anna and Emma struggle to create the perfect diaper cake as the family hosts a baby shower for Liz. Trent plans a romantic and stress-free date with Amber."
      },
      {
        "id": "tvmaze:2880539",
        "title": "Burpees and Burp Clothes",
        "season": 14,
        "episode": 14,
        "released": "2024-06-11",
        "overview": "Liz and Brice head to Florida for a babymoon and discuss their fears about the upcoming birth. Anna opens up to a friend about the struggles LP women have in the dating world. Emma wants a pink palette as the family starts bathroom renovations."
      },
      {
        "id": "tvmaze:2906356",
        "title": "The Diapers They Are a Changin'",
        "season": 14,
        "episode": 15,
        "released": "2024-06-18",
        "overview": "The kids have strong reactions when learning how to change a dirty diaper; Trent and Jonah throw Brice a dad-chelor party; Liz moves back home, needing some extra support."
      },
      {
        "id": "tvmaze:2916275",
        "title": "Birthday Maneuvers",
        "season": 14,
        "episode": 16,
        "released": "2024-06-25",
        "overview": "With Liz's c-section date just around the corner, the family does a trial run in case she goes into labor beforehand. The youngest Johnston turns 18, and Alex has an epic birthday party. Liz and Brice put finishing touches on the nursery."
      },
      {
        "id": "tvmaze:2932385",
        "title": "Big Baby, Little World",
        "season": 14,
        "episode": 17,
        "released": "2024-07-02",
        "overview": "The Johnsons finish their final preparations to welcome a new addition to the family; Anna celebrates Halloween at her new home, and the siblings make freezer meals for Liz and Brice."
      },
      {
        "id": "tvmaze:3064187",
        "title": "Party in My Crib",
        "season": 15,
        "episode": 1,
        "released": "2025-01-07",
        "overview": "The Johnstons are back and now with a new addition! Leighton comes home from the hospital and with a newborn in the house, this rowdy bunch has to get used to a new normal. The kids put together a big surprise for Trent and Amber's 25th anniversary."
      },
      {
        "id": "tvmaze:3084777",
        "title": "A White-ish Christmas",
        "season": 15,
        "episode": 2,
        "released": "2025-01-14",
        "overview": "It's baby Leighton's first Christmas, and the Johnstons are going all out to make it special. Anna and her friend Autumn contemplate going on a double date, and Trent and Amber discuss a plan for his aging parents."
      },
      {
        "id": "tvmaze:3095663",
        "title": "Skating on Thin Ice",
        "season": 15,
        "episode": 3,
        "released": "2025-01-21",
        "overview": "The family adjusts to their hectic life while living with eight under one roof, including a newborn. Liz struggles with heading back to work. Trent's health concerns rise as he gets his MRI."
      },
      {
        "id": "tvmaze:3114034",
        "title": "The Red Flags of Dating",
        "season": 15,
        "episode": 4,
        "released": "2025-01-28",
        "overview": "Trent and Amber tell the family about Trent's MRI results. Anna and Emma babysit Leighton for the first time and catch up about their dating lives. Alex prepares for his final high school robotics competition."
      },
      {
        "id": "tvmaze:3114035",
        "title": "Forget Boys, Get Money",
        "season": 15,
        "episode": 5,
        "released": "2025-02-04",
        "overview": "The Johnstons celebrate Valentine's Day, but with a baby in the house, things are looking a little different this year. Trent has his eyes checked as a potential cause of his vertigo. Then, Trent and Amber have a serious talk with Jonah and Ashley."
      },
      {
        "id": "tvmaze:3128108",
        "title": "Parents Just Don't Understand",
        "season": 15,
        "episode": 6,
        "released": "2025-02-11",
        "overview": "Amber reaches a breaking point and goes to therapy. Liz and Brice head to a double date night out with friends. Trent thinks it's time to talk to his parents about their living arrangement."
      },
      {
        "id": "tvmaze:3128109",
        "title": "A Sudden Loss",
        "season": 15,
        "episode": 7,
        "released": "2025-02-18",
        "overview": "Trent has a sexy surprise for Amber's birthday. Emma shops for her perfect senior prom dress. Then, Trent receives a shocking phone call and the Johnstons deal with the loss of a loved one."
      },
      {
        "id": "tvmaze:3145668",
        "title": "Green, Eggs and Glam",
        "season": 15,
        "episode": 8,
        "released": "2025-02-25",
        "overview": "With bonus scenes -- Trent takes Amber golfing to release some stress. Alex and his friends shop for prom outfits. The family celebrates Easter and Leighton gets a special visitor."
      },
      {
        "id": "tvmaze:3145669",
        "title": "Dancing On My Own",
        "season": 15,
        "episode": 9,
        "released": "2025-03-04",
        "overview": "With bonus scenes -- Anna opens up to a friend about her frustrations with the family. Amber confronts Liz about their issues with Brice. Emma and Alex attend their senior prom. Amber opens up in therapy as she fears things are reaching a breaking point with Anna."
      },
      {
        "id": "tvmaze:3160355",
        "title": "Roots of Resentment",
        "season": 15,
        "episode": 10,
        "released": "2025-03-11",
        "overview": "Four members of the Johnston family are graduating! But amidst the celebrations, tension with Anna come to a head. Trent finally meets with a neurologist to get answers about his health."
      },
      {
        "id": "tvmaze:3354223",
        "title": "Since You've Been Gone",
        "season": 16,
        "episode": 1,
        "released": "2025-10-14",
        "overview": "Anna opens up about why she's distanced herself from the family; Trent reveals his new health diagnosis to the family; Leighton starts swimming lessons; the boys hold a CPAP mask fashion show; Trent confronts Anna face-to-face about their issues."
      },
      {
        "id": "tvmaze:3392661",
        "title": "Too Little Too Late",
        "season": 16,
        "episode": 2,
        "released": "2025-10-21",
        "overview": "Trent and Anna butt heads when he confronts her on her withdrawal from the family; back home the family begins to babyproof the house as Leighton grows up and Liz and Brice look for land for a house of their own.Content expanded."
      },
      {
        "id": "tvmaze:3423760",
        "title": "An Empty Seat at the Table",
        "season": 16,
        "episode": 3,
        "released": "2025-10-28",
        "overview": "Brice hosts a fish fry for the family; Anna visits Nana to catch up; Emma bonds with Jonah's girlfriend, Ashley; Alex and Emma reach out to Anna."
      },
      {
        "id": "tvmaze:3423761",
        "title": "Little Cheaters",
        "season": 16,
        "episode": 4,
        "released": "2025-11-04",
        "overview": "The family races through town competing in a scavenger hunt; finally, after months of tension, Emma and Alex meet Anna for dinner."
      },
      {
        "id": "tvmaze:3423762",
        "title": "A Bitter Reunion",
        "season": 16,
        "episode": 5,
        "released": "2025-11-11",
        "overview": "Alex and Emma confront Anna about her absence and their hurt feelings; the family holds a Fall Festival for their friends and family."
      },
      {
        "id": "tvmaze:3436574",
        "title": "Falling For You",
        "season": 16,
        "episode": 6,
        "released": "2025-11-18",
        "overview": "Trent and Amber have offered land to Liz and Brice; Alex visits his girlfriend, Allie, in Ohio and helps out on her family farm; Trent and Amber make a plan to address the situation with Anna."
      },
      {
        "id": "tvmaze:3436575",
        "title": "The Big One, Minus One",
        "season": 16,
        "episode": 7,
        "released": "2025-11-25",
        "overview": "The family preps for Leighton's first birthday and looks back on this past year with her; Liz reunites with her friends for a girls night out; the family celebrates Leighton but emotions are bittersweet as one family member is obviously missing."
      },
      {
        "id": "tvmaze:3449242",
        "title": "What the Duck?",
        "season": 16,
        "episode": 8,
        "released": "2025-12-02",
        "overview": "The family embarks on cooking an Asian style Thanksgiving meal. Emma and Liz discuss the recent drama with Anna that happened over social media. Trent puts pressure on the boys. Amidst ongoing tension with her family Anna spends Thanksgiving alone."
      },
      {
        "id": "tvmaze:3449243",
        "title": "Away in a Manger",
        "season": 16,
        "episode": 9,
        "released": "2025-12-09",
        "overview": "The Johnstons put together a live nativity set for their annual Christmas card. Anna does her own Christmas photos with her dogs and struggles with being distant from her family during the holidays. Trent and Amber come up with a plan to meet Anna."
      },
      {
        "id": "tvmaze:3459059",
        "title": "Ring in the New Year?",
        "season": 16,
        "episode": 10,
        "released": "2025-12-16",
        "overview": ""
      }
    ]
  }
}