{
  "meta": {
    "id": "tvmaze:329",
    "type": "series",
    "name": "Shark Tank",
    "description": "Shark Tank is an American reality television series where entrepreneurs pitch their business ideas to a panel of wealthy investors, known as \"Sharks,\" who risk their own money to invest in promising ventures in exchange for equity. The show follows aspiring entrepreneurs as they present their products or services to the Sharks, who critically evaluate the businesses and can either make a deal or pass, leading to either success or a potentially rejected venture.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/587/1469155.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/587/1469155.jpg",
    "videos": [
      {
        "id": "tvmaze:3433442",
        "title": "Cash or Coal?: The Sharks Get Into the Holiday Spirit with Festive Pitches & Products",
        "season": 17,
        "episode": 7,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:31878",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2009-08-09",
        "overview": "\"Shark Tank,\" an exciting new reality show that, in these trying economic times, gives budding entrepreneurs a chance to make their dreams come true and become successful - and possibly wealthy - business people."
      },
      {
        "id": "tvmaze:31879",
        "title": "Classroom Jams",
        "season": 1,
        "episode": 2,
        "released": "2009-08-16",
        "overview": "The Sharks hear a pitch from an inner-city schoolteacher (Mark Furigay from Chicago, Illinois) who has a unique way to get kids to learn. Sensing that a gourmet food business is about to make it big, the owner (Susan Knapp from Napa Valley, California) watches as the Sharks fight it out for a piece of her business. Also, the Sharks are so impressed with a life-saving idea that an astonishing one million dollar offer is made. Will this headstrong entrepreneur accept the offer or will his ego stand in the way?"
      },
      {
        "id": "tvmaze:31880",
        "title": "Turbobaster",
        "season": 1,
        "episode": 3,
        "released": "2009-08-23",
        "overview": "An entrepreneurial newbie comes to the Shark Tank with high hopes for her kitchen accessory, but her presentation is less than stellar. Will the Sharks shred her vision to pieces or will there be a Shark fight to get a piece of the idea? A passionate stay-at-home mom (Lori Lite from Marietta, Georgia) with her own line of self-published children's books seeks much-needed funds to grow her business. Also, a father and son business team impress the Sharks with a revolutionary new musical product, but their need to control could derail the opportunity to make a fortune."
      },
      {
        "id": "tvmaze:31881",
        "title": "Gift Card Rescue",
        "season": 1,
        "episode": 4,
        "released": "2009-08-30",
        "overview": "An entrepreneur originally from Ghana (now living in Maryland) comes to the Shark Tank seeking an investment for an internet business which is his shot at the American Dream. Other entrepreneurs who hope their business ideas will sharpen the Sharks' appetites include a man from northern California who wants to franchise his successful graffiti removal service -- but he fights back when the Sharks want to control his business and make him their employee -- and two women from Studio City, California who work the Sharks into a frenzy over their lucrative childcare product -- but a last-minute wrinkle in the offer may blow the entire deal."
      },
      {
        "id": "tvmaze:31882",
        "title": "Body Jac",
        "season": 1,
        "episode": 5,
        "released": "2009-09-06",
        "overview": "Three of the Sharks go in on a deal together for an innovative internet company with two brothers from Brazil (Rodolfo and Alexis Saccoman, who now live in Palm Beach, Florida and San Francisco, California, respectively). But just before the deal is sealed, a battle ensues and one of the Sharks is ousted. An eccentric, life-long entrepreneur named Cactus Jack (aka Jack Barringer from Ames, Iowa), who has never had a regular job in his life, comes to the Shark Tank in order to get an investment for his latest fitness device, but he must make a huge, personal sacrifice if he wants to do business."
      },
      {
        "id": "tvmaze:31883",
        "title": "Element Bars",
        "season": 1,
        "episode": 6,
        "released": "2009-09-13",
        "overview": "Two Washington DC lobbyists come to the Shark Tank for bail-out money to fund their fledging BBQ sauce business; and the Sharks may have met their match when a young entrepreneur from Chicago with an innovative internet business plays hardball."
      },
      {
        "id": "tvmaze:31884",
        "title": "Grill Charms",
        "season": 1,
        "episode": 7,
        "released": "2009-09-29",
        "overview": "When her first opportunity at pitching the Sharks couldn't happen because of devastating news right before her appearance, this charming housewife from Charleston, South Carolina gets another chance and hopes to secure a deal this time around. She sends the Sharks into a feeding frenzy, but Barbara Corcoran -- the only female Shark - thinks her colleagues are behaving like smitten teenage boys rather than savvy business investors. Also, Kevin O'Leary is determined to seal a deal with a college student from Bloomington, Indiana who pitches a product made from soy that he concocts in his mom's kitchen. But the young entrepreneur's idealism and naiveté may get in the way of a deal."
      },
      {
        "id": "tvmaze:31885",
        "title": "Notehall",
        "season": 1,
        "episode": 8,
        "released": "2009-10-06",
        "overview": "A confident young entrepreneur impresses the sharks with a lucrative line of trendy celebrity fashion accessories. But the Sharks feel he is valuing his company highly and his obnoxious over-confidence could blow a deal. Also, Kevin O'Leary shows just how much he doesn't like to lose: He is so distraught at being outbid by another Shark on a deal, he follows the entrepreneurs out of the Shark Tank in an attempt to get the last word."
      },
      {
        "id": "tvmaze:31886",
        "title": "Chill Soda",
        "season": 1,
        "episode": 9,
        "released": "2009-10-13",
        "overview": "Kevin O'Leary takes a dare from his fellow Sharks and bites into a veterinarian's product that claims to prevent cancer in pets. Later on, the Sharks enter a huge sphere to experience first-hand the entrepreneurs' virtual arcade; and four of the five Sharks hope to talk Barbara out of making what they think is a bad deal. Other business pitches include an outspoken designer from Houston, Texas who challenges the Sharks to invest in her line of fashionable clothing for women."
      },
      {
        "id": "tvmaze:236958",
        "title": "The Bobble Place",
        "season": 1,
        "episode": 10,
        "released": "2009-10-20",
        "overview": "A man wants an investment from the sharks to create an extension of his already successful business; a urologist has an unusual business proposal."
      },
      {
        "id": "tvmaze:236957",
        "title": "Romp N' Roll",
        "season": 1,
        "episode": 11,
        "released": "2010-01-08",
        "overview": "Things get heated when the sharks ask a husband-and-wife team to clarify the actual value of a child-care business; a chef's salad dressing mix is removed from store shelves because of offensive packaging; a golf ball cleaner."
      },
      {
        "id": "tvmaze:236956",
        "title": "The Factionist",
        "season": 1,
        "episode": 12,
        "released": "2010-01-15",
        "overview": "Two Texas bicyclists have an idea for a hand degreaser; a college student is passionate about his environmentally friendly clothing line; the sharks find out if lifelong entrepreneur Cactus Jack lost at least 35 pounds to seal a deal."
      },
      {
        "id": "tvmaze:31887",
        "title": "Lipstix Remix",
        "season": 1,
        "episode": 13,
        "released": "2010-01-29",
        "overview": "A California entrepreneur wants to bring back old-fashioned ice cream men; a couple's pitch is about providing legal services at a coffee house; an update on the sharks' venture with an Arizona woman and her unique plush toys."
      },
      {
        "id": "tvmaze:236955",
        "title": "Send a Ball",
        "season": 1,
        "episode": 14,
        "released": "2010-02-05",
        "overview": "A woman begins her presentation with shoe fashions; sisters from Chicago present a hilarious pitch; a man from Florida reinvents the umbrella."
      },
      {
        "id": "tvmaze:31893",
        "title": "Wurkin Stiffs",
        "season": 2,
        "episode": 1,
        "released": "2011-03-20",
        "overview": "The exploits of two sisters with a children's dance company shock the sharks; a chef creates tasty seafood products; a winemaker has a game-changing product; an entrepreneur has a line of men's magnetic collar-stays."
      },
      {
        "id": "tvmaze:31894",
        "title": "Toygaroo",
        "season": 2,
        "episode": 2,
        "released": "2011-03-25",
        "overview": "A shark wants to invest $4 million in a business; a toy-rental business; a bacon-scented wake-up call; an update on a deal from last season."
      },
      {
        "id": "tvmaze:31895",
        "title": "Mod Mom Furniture",
        "season": 2,
        "episode": 3,
        "released": "2011-04-01",
        "overview": "Children seek a backer for an idea spawned during a family trip; the sharks fight for a piece of a mother's furniture business; a personal trainer thinks he has the next trend in fitness equipment."
      },
      {
        "id": "tvmaze:31896",
        "title": "Ride-On Carry-On",
        "season": 2,
        "episode": 4,
        "released": "2011-04-08",
        "overview": "Comic Jeff Foxworthy makes his debut as a guest Shark investor; actor Vincent Pastore pitches a business proposition; a flight attendant and her husband present their unique portable child's seat."
      },
      {
        "id": "tvmaze:236954",
        "title": "Fridge Fronts",
        "season": 2,
        "episode": 5,
        "released": "2011-04-15",
        "overview": "An entrepreneur from Chicago hopes the sharks can dig him out of a financial hole; a single mother believes her aromatic lip gloss can help women. Fridge Fronts, a magnetic skin with a decorative finish that can be applied to any appliance. New Era Brands, Clip 'n' Go cases for mints, gum and contact lenses. Thin Gloss, an aromatic lip gloss that helps curb your appetite. Lightfilm, a light-up decal for car windows."
      },
      {
        "id": "tvmaze:31897",
        "title": "Hot Mama Gowns",
        "season": 2,
        "episode": 6,
        "released": "2011-04-22",
        "overview": "An entrepreneur presents a line of luxury maternity gowns; a woman tries to impress the sharks with her homemade cakes; the sharks fight over a stay-at-home dad's product."
      },
      {
        "id": "tvmaze:31898",
        "title": "Carsik Bib",
        "season": 2,
        "episode": 7,
        "released": "2011-04-29",
        "overview": "A former athlete believes his product can save lives; environmental lawn-mowers; solution to car sickness; kids birthday party franchise."
      },
      {
        "id": "tvmaze:31899",
        "title": "Orig Audio",
        "season": 2,
        "episode": 8,
        "released": "2011-05-06",
        "overview": "Tensions rise when Mark Cuban urges entrepreneurs to ignore the other sharks and negotiate only with him."
      },
      {
        "id": "tvmaze:31900",
        "title": "CitiKitty",
        "season": 2,
        "episode": 9,
        "released": "2011-05-13",
        "overview": "A woman seeks an investment for a toilet training kit for cats; the sharks fight for a piece of a million-dollar company owned by a pharmacist."
      },
      {
        "id": "tvmaze:31901",
        "title": "The Clean Bottle",
        "season": 3,
        "episode": 1,
        "released": "2012-01-20",
        "overview": "NBA champion Bill Walton helps a triathlete pitch his idea for a unique water bottle; a ghostwriter from California seeks a business investment; two women from Minnesota present their online business that helps people plan their own funerals."
      },
      {
        "id": "tvmaze:31902",
        "title": "I Want to Draw a Cat for You",
        "season": 3,
        "episode": 2,
        "released": "2012-01-27",
        "overview": "An artistic man from Chicago hopes the sharks are interested in his cat drawing service; a man from Connecticut pitches a system intended to improve a salesperson's skills; a man seeks an investment for his innovative cargo truck management system."
      },
      {
        "id": "tvmaze:31903",
        "title": "Liquid Money",
        "season": 3,
        "episode": 3,
        "released": "2012-02-03",
        "overview": "A fragrance that smells like money; luxury soap with a twist; a unique guitar learning system; a blinking accessory for jeans; a follow-up on the creator of the shrimp burger."
      },
      {
        "id": "tvmaze:31904",
        "title": "Show No",
        "season": 3,
        "episode": 4,
        "released": "2012-02-10",
        "overview": "A towel that provides coverage to change out of a swimsuit in public; a sweater and quilt invention; a way to maximize a wine's life; healthy cake mix for dogs; the creators of of Notehall talk about the sale of their company."
      },
      {
        "id": "tvmaze:31905",
        "title": "The Last Lid",
        "season": 3,
        "episode": 5,
        "released": "2012-02-17",
        "overview": "A Texas family asks for an investment in a jewelry line designed by one of the daughters when she was 10 years old; a single mother pitches her wedge-type pillow for women; two men reinvent the tea experience."
      },
      {
        "id": "tvmaze:31906",
        "title": "Five Minute Furniture",
        "season": 3,
        "episode": 6,
        "released": "2012-02-24",
        "overview": "The sharks tear into a man who claims to have created a watch with health benefits; a mother tries to save her gourmet pretzel business; a man has a small but powerful idea that could make a lot of money.."
      },
      {
        "id": "tvmaze:31907",
        "title": "Kisstixx",
        "season": 3,
        "episode": 7,
        "released": "2012-03-02",
        "overview": "Flavored mix-and-match lip balm; a revolutionary clothing item; innovative kitchen products; a heat-recycling device; a follow-up on the creator of Daisy Cakes."
      },
      {
        "id": "tvmaze:31908",
        "title": "The Original Profender",
        "season": 3,
        "episode": 8,
        "released": "2012-03-09",
        "overview": "Body jewelry; movable basketball training apparatus; organic skin care; a rent-a-grandma business; Pork Barrel BBQ follow-up."
      },
      {
        "id": "tvmaze:31909",
        "title": "Tower Paddle Boards",
        "season": 3,
        "episode": 9,
        "released": "2012-03-16",
        "overview": "Singer-songwriter Ingrid Michaelson helps an entrepreneur from California pitch his music software product; a couple seek an investment for a solution to cellulite; a wine server presents an aerating device that could change the way wine is sold."
      },
      {
        "id": "tvmaze:31910",
        "title": "The AVE Venice",
        "season": 3,
        "episode": 10,
        "released": "2012-03-23",
        "overview": "Beer-infused ice cream; pre-packaged meals for pets; safety wear for motorcycle enthusiasts; a clothing business that allows people to digitally add images to any garment; a follow-up with the creators of Ride On Carry On luggage."
      },
      {
        "id": "tvmaze:31911",
        "title": "Blondies Cookies",
        "season": 3,
        "episode": 11,
        "released": "2012-04-13",
        "overview": "An entrepreneur returns for a second chance at a deal an inventor must prove that his creation can turn waste products into gold; a woman wants to expand her handcrafted cookie company."
      },
      {
        "id": "tvmaze:31912",
        "title": "Nail Pak",
        "season": 3,
        "episode": 12,
        "released": "2012-04-27",
        "overview": "The sharks fight over a three-in-one nail polish invented by a mother of six; a feisty couple from New York present what they think is the next trend in women's accessories; two hockey moms pitch their idea for tank tops with interchangeable straps."
      },
      {
        "id": "tvmaze:31913",
        "title": "AirBedz",
        "season": 3,
        "episode": 13,
        "released": "2012-05-04",
        "overview": "The man who created Rollerblades seeks an investment for his latest invention; a businesswoman from Rochester, N.Y., wants to make a deal for an accessory that turns any show into a boot."
      },
      {
        "id": "tvmaze:31914",
        "title": "Wild Squirrel Nut Butter",
        "season": 3,
        "episode": 14,
        "released": "2012-05-11",
        "overview": "Billy Blanks Jr. asks the sharks to invest in a dance fitness program; a music producer seeks an investment in a rock band; two college students pitch their flavored peanut butter business."
      },
      {
        "id": "tvmaze:31915",
        "title": "Cougar Energy",
        "season": 3,
        "episode": 15,
        "released": "2012-05-18",
        "overview": "The sharks fight for a chance to go into business with an inventor; two fitness trainers pitch their idea for a unique home gym; a young man seeks an investment in his age-defying products; rapper Pitbull endorses a business."
      },
      {
        "id": "tvmaze:31916",
        "title": "Coat Chex",
        "season": 4,
        "episode": 1,
        "released": "2012-09-14",
        "overview": "All five sharks consider business propositions that include a ticket-free coat check system, a belt buckle that doubles as a beverage holder, and what two woman say is the solution to bedbugs."
      },
      {
        "id": "tvmaze:31917",
        "title": "SurfSet Fitness",
        "season": 4,
        "episode": 2,
        "released": "2012-09-21",
        "overview": "The sharks question the morality of a potential investment; two business partners have professional surfer Lakey Peterson demonstrate how their exercise equipment works; a man presents a personal style system."
      },
      {
        "id": "tvmaze:31918",
        "title": "Liz Lovely",
        "season": 4,
        "episode": 3,
        "released": "2012-09-28",
        "overview": "Professional dancers Jonathan Roberts and Anna Trebunskaya demonstrate their posture correction device; entertainment reporter Robin Leach and a designer from Florida present stone-studded leather jewelry; a gluten-free cookie business."
      },
      {
        "id": "tvmaze:31919",
        "title": "Back 9 Dips",
        "season": 4,
        "episode": 4,
        "released": "2012-10-05",
        "overview": "An unemployed man and his pregnant wife pitch a party-favorite chicken dip; a professional football player's spring-loaded laundry hamper, a technophobe presents his wireless gadget that helps people keep track of their keys or cell phone."
      },
      {
        "id": "tvmaze:31920",
        "title": "Cozy Bugs",
        "season": 4,
        "episode": 5,
        "released": "2012-10-12",
        "overview": "A line of dresses made of pillowcases; a unique spatula; vitamin oral sprays; energy-boosting waffles."
      },
      {
        "id": "tvmaze:31921",
        "title": "Cousins Maine Lobster",
        "season": 4,
        "episode": 6,
        "released": "2012-10-19",
        "overview": "Professional football player Brandon Jacobs hopes to help a woman find success with her protein-infused energy drink; a lobster roll food truck; eco-friendly cleaning products; colorful drink insulators; follow-up on a lip balm idea."
      },
      {
        "id": "tvmaze:31922",
        "title": "The Shemie",
        "season": 4,
        "episode": 7,
        "released": "2012-10-26",
        "overview": "A modern-day slip business; a scrubbing tool; dog-friendly frozen yogurt; an electric unicycle; an update on the \"Lollacup.\""
      },
      {
        "id": "tvmaze:31923",
        "title": "Cool Wazoo",
        "season": 4,
        "episode": 8,
        "released": "2012-11-02",
        "overview": "Seth MacFarlane shows his support for a man who designed a new fly trap; multi-functional child cover; food storage container; follow-up on a manicure system."
      },
      {
        "id": "tvmaze:31924",
        "title": "Drive Suits",
        "season": 4,
        "episode": 9,
        "released": "2012-11-09",
        "overview": "A motorized vehicle suit; comedy writer Bruce Vilanch presents a computer instruction project; sugar-free candy chips; an update on a foldable guitar."
      },
      {
        "id": "tvmaze:31925",
        "title": "Nearly Newlywed",
        "season": 4,
        "episode": 10,
        "released": "2012-11-16",
        "overview": "An energy and nutritional supplement designed and tested by active members of the military; a new way to shop for bridal wear; a wine tasting cruise."
      },
      {
        "id": "tvmaze:31926",
        "title": "The Coop",
        "season": 4,
        "episode": 11,
        "released": "2012-12-04",
        "overview": "A rent-a-live Christmas tree service; gluten-free fudge; cell phone accessory; indoor/outdoor play space; singer John Rich surprises an entrepreneur."
      },
      {
        "id": "tvmaze:31927",
        "title": "The Gameface Company",
        "season": 4,
        "episode": 12,
        "released": "2013-01-04",
        "overview": "Mark and Lori offer an entrepreneur $1 million; enclosed tabletop food screen; a beer and arcade game cabinet; peel-off face paint transfer; hair care products for children; update on Squirrel Nut Butter."
      },
      {
        "id": "tvmaze:31928",
        "title": "Coffee Joulies",
        "season": 4,
        "episode": 13,
        "released": "2013-01-11",
        "overview": "A capsule that keeps beverages hot for an extended period; a new way to clean stuffed toys; reinventing the ice cream experience."
      },
      {
        "id": "tvmaze:31929",
        "title": "Bibbitec",
        "season": 4,
        "episode": 14,
        "released": "2013-02-01",
        "overview": "Sandals for barefoot runners; a magnetic sound enhancer that doesn't need power; a website that creates personalized soundtracks for children; an update on \"Cousins Lobster.\""
      },
      {
        "id": "tvmaze:31930",
        "title": "The Green Garmento",
        "season": 4,
        "episode": 15,
        "released": "2013-02-08",
        "overview": "A successful entrepreneur returns with a new business idea; hand-held cooler; environmentally friendly dry cleaning bag; chewing tobacco alternative."
      },
      {
        "id": "tvmaze:31931",
        "title": "Gotta Have S'More",
        "season": 4,
        "episode": 16,
        "released": "2013-02-15",
        "overview": "Kevin O'Leary makes a $1 million offer; six young inventors aged 12 to 18 present their unsafe-driving detector; a mini-muffin that is a twist on s'mores; an online chat therapy business."
      },
      {
        "id": "tvmaze:31932",
        "title": "Addison's Wonderland",
        "season": 4,
        "episode": 17,
        "released": "2013-02-22",
        "overview": "Unique eyewear made of sustainable wood; a camouflage clothing line for duck hunters; a premium denim line; high-end bedding for girls."
      },
      {
        "id": "tvmaze:31933",
        "title": "Nuts ‘N More",
        "season": 4,
        "episode": 18,
        "released": "2013-03-01",
        "overview": "Fortified, sugar-free nut butters; an acupressure wrist band; an at-home tattoo removal device; an update on inventors who created surf-inspired fitness equipment."
      },
      {
        "id": "tvmaze:31934",
        "title": "Baby Loves Disco",
        "season": 4,
        "episode": 19,
        "released": "2013-03-08",
        "overview": "A workout program that teaches people how to exercise in their heart rate zone; throwing dance parties for kids with a traveling disco van; a damage-proof cell phone case; an update on The Painted Pretzel."
      },
      {
        "id": "tvmaze:31935",
        "title": "Drop Stop",
        "season": 4,
        "episode": 20,
        "released": "2013-03-29",
        "overview": "Two entrepreneurs try to solve the \"carmuter triangle\"; an 18-year-old seeks an investment in her natural skincare line of sugar scrubs; shrink-wrap gift bags."
      },
      {
        "id": "tvmaze:31936",
        "title": "Liddup",
        "season": 4,
        "episode": 21,
        "released": "2013-04-05",
        "overview": "Gourmet meat business; a cooler with interior LED lighting; full-body spandex suit; an advance filter water bottle; follow up on a play and party space for kids from season 4."
      },
      {
        "id": "tvmaze:31937",
        "title": "Shell Bobbers",
        "season": 4,
        "episode": 22,
        "released": "2013-04-26",
        "overview": "A fishing bobber made from a shotgun shell; homemade cupcakes in a jar; generating electricity through walking; a belt with no holes; a fitness-based dance program."
      },
      {
        "id": "tvmaze:31938",
        "title": "Misto Box",
        "season": 4,
        "episode": 23,
        "released": "2013-05-03",
        "overview": "Frozen concentrated gumbo brick; a bird feeder that shocks squirrels; artisan coffee subscription business; wooden home and kitchen items; ECreamery update."
      },
      {
        "id": "tvmaze:31939",
        "title": "Baby's Badass Burgers",
        "season": 4,
        "episode": 24,
        "released": "2013-05-10",
        "overview": "Teaching kids how to ride a bike that doesn't have pedals; a movie about motorcycle racing; a hot-pink food truck run by beautiful women; fun photo booths."
      },
      {
        "id": "tvmaze:31940",
        "title": "Three-Day Rule",
        "season": 4,
        "episode": 25,
        "released": "2013-05-17",
        "overview": "Two women pitch their military-inspired jewelry line; traditional British scone; custom furniture; door-to-door luggage pickup service; update on the Scrub Daddy cleaning tool."
      },
      {
        "id": "tvmaze:31941",
        "title": "Jones Scones",
        "season": 4,
        "episode": 26,
        "released": "2013-05-17",
        "overview": "An app that provides international travelers with access to live translators; all-natural dog treats; a dating website designed to attract quality singles; gourmet grilled cheese and tomato sandwiches; Dr. Heinz Doofenshmirtz (\"Phineas and Ferb\")."
      },
      {
        "id": "tvmaze:31942",
        "title": "Lynnae's Gourmet, Pickles, Postcard on the Run, Rolodoc, Sweet Ballz",
        "season": 5,
        "episode": 1,
        "released": "2013-09-20",
        "overview": "Savory cake balls; upgrading communication between patients and medical professionals; gourmet pickles; a mobile app for sending postcard."
      },
      {
        "id": "tvmaze:31943",
        "title": "Breathometer, Man Medals, Mango Mango,",
        "season": 5,
        "episode": 2,
        "released": "2013-09-27",
        "overview": "Chic fashion accessories for dogs; a breathalyzer app; gourmet mango preserves; an update on the creator of spa-quality body scrubs."
      },
      {
        "id": "tvmaze:31944",
        "title": "Fairytale Wishes, Freeloader, Kook'n Kap, Rapid Ramen",
        "season": 5,
        "episode": 3,
        "released": "2013-10-04",
        "overview": "Aromatherapy sprays to help kids afraid of the dark; a carrier for toddlers; protecting hair from cooking fumes; a cooking tray for ramen noodles."
      },
      {
        "id": "tvmaze:31945",
        "title": "Hamboards, Scan, ScreenMend, Sunday Night Slow Jams",
        "season": 5,
        "episode": 4,
        "released": "2013-10-11",
        "overview": "A self-described \"Beach Family\" hope they don't run into rough waters when pitching their skateboards that glide as though catching a wave and recording artist Brian McKnight joins a Deejay pitching."
      },
      {
        "id": "tvmaze:31946",
        "title": "BareEase, Rent-a-Goat, RuffleButts, Veggie Mama",
        "season": 5,
        "episode": 5,
        "released": "2013-10-18",
        "overview": "Two men offer goat rentals for grazing services; a couple pitch their line of children's accessories; a woman introduces bikini waxing products; healthy frozen treats; organic skin care."
      },
      {
        "id": "tvmaze:31947",
        "title": "Elephant Chat, FiberFix, Ten Thirty One Productions, Total Merchant Resources",
        "season": 5,
        "episode": 6,
        "released": "2013-10-25",
        "overview": "One entrepreneur breaks a Shark Tank record and accepts an unprecedented amount for a deal; a Halloween attraction; a product to help people communicate their feelings."
      },
      {
        "id": "tvmaze:31948",
        "title": "180CUP, Better Life, Kymera, Tree T Pee",
        "season": 5,
        "episode": 7,
        "released": "2013-11-01",
        "overview": "Safe and natural cleaning products; a party cup with a hidden shot glass; a lightweight, electric bodyboard; a root cover for recently planted trees."
      },
      {
        "id": "tvmaze:31949",
        "title": "Paparazzi Proposals, Bellybuds, Schulzies Bread Pudding, PetPaint",
        "season": 5,
        "episode": 8,
        "released": "2013-11-08",
        "overview": "A paparazzo offers his unique skill to help guys with their marriage proposals, and an animal lover pitches a pet-safe color furspray for dogs."
      },
      {
        "id": "tvmaze:31950",
        "title": "DoorBot, Magic Moments, SLAWSA, Surprise Ride",
        "season": 5,
        "episode": 9,
        "released": "2013-11-15",
        "overview": "An entrepreneur is brought to tears in recounting how she got to the tank debt-free, and during another pitch, Shark Robert Herjavec loses his cool."
      },
      {
        "id": "tvmaze:31951",
        "title": "YUBO, Pursecase, Chocomize, Grace and Lace",
        "season": 5,
        "episode": 10,
        "released": "2013-11-22",
        "overview": "The Sharks are shocked — yes, shocked — with a couple's extremely lucrative online sales for knee-high boot socks."
      },
      {
        "id": "tvmaze:31952",
        "title": "Virtuix, SpiritHoods, Fohawx, Bubba's Q BBQ",
        "season": 5,
        "episode": 11,
        "released": "2013-12-06",
        "overview": "A former pro football player makes no bones about his delicious, boneless baby back ribs — but will the sharks bite?"
      },
      {
        "id": "tvmaze:31953",
        "title": "Cashmere Hair, The Hanukah Tree Topper, Tipsy Elves, Line-Netics",
        "season": 5,
        "episode": 12,
        "released": "2013-12-13",
        "overview": "Solving a holiday headache with colorful, magnetic strands; an item to bridge the gap for interfaith families; a fun, new take on traditional Christmas sweaters; luxurious clip-in hair extensions."
      },
      {
        "id": "tvmaze:31954",
        "title": "Bounce Boot Camp, Wall Rx, Eyebloc, GrooveBook",
        "season": 5,
        "episode": 13,
        "released": "2014-01-10",
        "overview": "Mobile fitness company for kids; a way for fixing holes in walls; a solution for photos stacking up on smartphones; webcam privacy shield; Nuts N More update."
      },
      {
        "id": "tvmaze:31955",
        "title": "Alaska Glacial Mud Co., invisiPlug, LockerBones, Balloon Distractions",
        "season": 5,
        "episode": 14,
        "released": "2014-01-17",
        "overview": "A mask made of Alaskan glacial mud; powerstrips and surge protectors that blend in with hardwood floors; fanciful balloon designs; gourmet grilled cheese business update."
      },
      {
        "id": "tvmaze:31956",
        "title": "SwimZip, FitDeck, LifeCaps, Freshly Picked",
        "season": 5,
        "episode": 15,
        "released": "2014-01-24",
        "overview": "Stylish baby shoes; emergency food-replacement pill; children's swimwear with sun protection; custom playing cards for exercise; Daisy Cakes follow-up."
      },
      {
        "id": "tvmaze:31957",
        "title": "Cow Wow, Nexersys, Cycloramic, The Cookie Dough Cafe",
        "season": 5,
        "episode": 16,
        "released": "2014-01-31",
        "overview": "Guest judge Steve Tisch; one product has all the Sharks interested; gourmet edible cookie dough; organic flavored milk; an app that produces hands-free panoramic picture taking; interactive workout technology; Pro-NRG follow-up."
      },
      {
        "id": "tvmaze:31958",
        "title": "Moberi, Spy Escape and Evasion, DDP YOGA, Southern Culture Artisan Foods",
        "season": 5,
        "episode": 17,
        "released": "2014-02-21",
        "overview": "A juice and smoothie cart powered by a vintage bicycle; classes that teach people how to pick locks, escape from handcuffs and disappear; a high-energy, zero-impact fitness program based on yoga; a breakfast brand featuring Southern specialties."
      },
      {
        "id": "tvmaze:31959",
        "title": "Cheek'd, Zipit, Bambooee, Buzzy",
        "season": 5,
        "episode": 18,
        "released": "2014-02-28",
        "overview": "A unique dating service; eco-friendly bamboo cleaning cloths; a fitted sheet and sleeping bag combo for making beds quickly; a buzzing medical device."
      },
      {
        "id": "tvmaze:31960",
        "title": "Revolights, Squeeky Knees, Buffer Bit, U-lace",
        "season": 5,
        "episode": 19,
        "released": "2014-03-07",
        "overview": "A bike lighting system; clothing with reinforced knees and built-in squeakers for crawling babies; a shoe buffing pad that attaches to a power drill; modular shoelaces."
      },
      {
        "id": "tvmaze:31961",
        "title": "Define Bottle, iReTron, Boo Boo Goo, Henry's Humdingers",
        "season": 5,
        "episode": 20,
        "released": "2014-03-14",
        "overview": "Kids and teenagers present ideas that include a way to make drinking water more appealing, a business that tackles electronic waste and spicy-flavored raw honey; an update on Ryan's Barkery."
      },
      {
        "id": "tvmaze:31962",
        "title": "Chapul, Garage Door Lock, Morninghead, Packback",
        "season": 5,
        "episode": 21,
        "released": "2014-03-21",
        "overview": "Energy bars that include protein from crickets; a garage lock to prevent break-ins; a shower cap that fixes ``bedhead''; digital textbook rentals; an update on Fiber Fix."
      },
      {
        "id": "tvmaze:31963",
        "title": "Kodiak Cakes, Monkey Mat, Plated, The Paint Brush Cover",
        "season": 5,
        "episode": 22,
        "released": "2014-04-04",
        "overview": "Wet paintbrush storage; a portable mat that fits into an ultra-compact pouch; home meal delivery; whole-grain flapjack and waffle mix."
      },
      {
        "id": "tvmaze:31964",
        "title": "Happy Feet, Lord Nut Levington, Velocity Signs, Hold Your Haunches",
        "season": 5,
        "episode": 23,
        "released": "2014-04-10",
        "overview": "Barbara and Lori team up against Robert, Mark and Kevin over an enticing product; whimsical plush slippers; dynamic signage; trousers and leggings that lift the butt; bold-flavored nuts."
      },
      {
        "id": "tvmaze:31965",
        "title": "Taylor Robinson Music, Funtime Express, Power Pot, Quickstop Fire Sprinkler Tools",
        "season": 5,
        "episode": 24,
        "released": "2014-04-11",
        "overview": "A service that helps people find and hire music instructors; a way to stop accidental fire sprinkler activations; a battery charger made using fire and water; all-inclusive project kits; an update on a past investment."
      },
      {
        "id": "tvmaze:31966",
        "title": "ilumi, Zoobean, Intelli-Stopper, Fort Magic",
        "season": 5,
        "episode": 25,
        "released": "2014-04-18",
        "overview": "Smart light bulb; high-tech cork replacement; subscription service for children's books; fort-building construction kits for kids; a follow-up on the Breathometer."
      },
      {
        "id": "tvmaze:31967",
        "title": "Crio Bru, Rugged Races, Cerebral Success, Mo's Bows",
        "season": 5,
        "episode": 26,
        "released": "2014-04-25",
        "overview": "An 11-year-old who handcrafts bow ties; a hot beverage made from roasted cocoa beans; nutritional supplements; a 5K obstacle course race."
      },
      {
        "id": "tvmaze:31968",
        "title": "The Bouqs Company, Angellift, HangEase, Susty Party",
        "season": 5,
        "episode": 27,
        "released": "2014-05-02",
        "overview": "A commerce flower business; anti-aging lifting strips; a breakaway hanger; tablewear made from renewable plant materials; a follow up of Groovebook."
      },
      {
        "id": "tvmaze:31969",
        "title": "Oru Kayak, Bon Affair, Hargitt Marine Services, Cinnaholic",
        "season": 5,
        "episode": 28,
        "released": "2014-05-09",
        "overview": "Lighter, healthier wine alternative; deep-sea treasure hunting business; collapsible kayak; decadent cinnamon rolls with a twist; an update on a lobster roll food truck business."
      },
      {
        "id": "tvmaze:31970",
        "title": "Baker's Edge, Foot Fairy, Tie-Not, BZBOX",
        "season": 5,
        "episode": 29,
        "released": "2014-05-16",
        "overview": "Reusable storage box; reinvented cookware; an iPad app that measures foot sizes; a solution to tying water balloons; follow-ups on past entrepreneurs."
      },
      {
        "id": "tvmaze:31971",
        "title": "Season 6 Premiere: Sleeping Baby, Hammer & Nails, Amber, Bombas",
        "season": 6,
        "episode": 1,
        "released": "2014-09-26",
        "overview": "A couple from Fort Worth hope to interest the Sharks in their unique way to swaddle a baby. Other pitches include: a nail salon just for men, a better version of the athletic sock, and a free charging station for mobile phones. Also: Mark and Barbara take entrepreneurs to see their products on display at Target stores."
      },
      {
        "id": "tvmaze:31972",
        "title": "Toys to Inspire Female Engineers; Porcelain Coffee Mug; Better Golf Putter",
        "season": 6,
        "episode": 2,
        "released": "2014-09-26",
        "overview": "Barbara and Kevin take part in a demonstration for an innovative way to tie the knot, and a Pittsburgh native gives an update on her prospering business of sugar scrubs. Also: Two young women pitch toys designed to empower the next generation of female engineers and innovators, a family man tries to sell his design for a porcelain coffee mug that is both elegant and functional, and a finer, more precise golf putter is presented to the Sharks."
      },
      {
        "id": "tvmaze:31973",
        "title": "Week 2: SoapSox, Heart Pup, Ninja Cards, DrumPants",
        "season": 6,
        "episode": 3,
        "released": "2014-10-03",
        "overview": "Two men try to sell the Sharks on their stuffed animals for the bathtub, a dog lover from Los Angeles shows off a wearable pet carrier, and ninja entrepreneurs demonstrate a darts-like card game. Also: a follow-up on a custom bike company based in Dallas, which was invested in by Mark and Barbara during Season 3."
      },
      {
        "id": "tvmaze:31974",
        "title": "Week 3: FunCakes Rental, Paper Box Pilots, Tablejacks USA, Reviver",
        "season": 6,
        "episode": 4,
        "released": "2014-10-10",
        "overview": "The Sharks consider a business idea for affordable wedding cakes brought to them by a mother and son from Grand Rapids, Mich. Also: a Houston restaurateur with a solution to a common problem encountered while dining out, and an update on a screen repair fix-it kit that Lori invested in during Season 5."
      },
      {
        "id": "tvmaze:31975",
        "title": "Week 4: Jungle Jumparoo, The Caddy Girls, Red Dress Boutique, Sun-Staches",
        "season": 6,
        "episode": 5,
        "released": "2014-10-17",
        "overview": "Entrepreneurs include the owner of an all-female golf caddy company, a couple who believe they have come up with a better, safer way for kids to bounce, and a trio who pitch to the Sharks their fun spin on a classic faceware accessory. Also: an update on Mark Cuban's $2 million investment in the Los Angeles Haunted Hayride during Season 4."
      },
      {
        "id": "tvmaze:31976",
        "title": "Week 5: Oilerie USA, Honeyfund, EmergenSee, Beatbox Beverages, Jimmy Kimmel",
        "season": 6,
        "episode": 6,
        "released": "2014-10-24",
        "overview": "An olive oil bar where one can sample oils before purchasing; unique wedding registry idea; a product that can turn a smartphone into a personal security device; boxed wine geared toward millenials; a follow-up on Breathometer."
      },
      {
        "id": "tvmaze:31977",
        "title": "Week 6: Titin, Beardbrand, Singtrix, Myself Belts",
        "season": 6,
        "episode": 7,
        "released": "2014-10-31",
        "overview": "The Sharks hear a pitch for hypergravity-exercise clothing, as well as a line of products that appeal to fans of facial hair, and a karaoke machine that adds jaw-dropping vocal harmonies to help users sound like their favorite singing stars. Also: belts that are easy for kids to use, and a follow-up on Barbara's Season 5 investment in a company specializing in hand-knitted socks and leg warmers."
      },
      {
        "id": "tvmaze:39637",
        "title": "Week 7: The Natural Grip, Priority One Canine, Man-PACK, Bottle Breacher",
        "season": 6,
        "episode": 8,
        "released": "2014-11-07",
        "overview": "Entrepreneurs with military backgrounds have the opportunity to pitch their products. Included: a nonslip-protective glove for CrossFit; an elite canine-training program; a carrying case for men; a bottle opener made from recycled .50 caliber shells."
      },
      {
        "id": "tvmaze:39639",
        "title": "Week 8, The 100th Episode: Storm Stoppers, Pipsnacks, Squatty Potty, Heidi Ho",
        "season": 6,
        "episode": 9,
        "released": "2014-11-14",
        "overview": "The Sharks celebrate 100 episodes with a look back at their favorite memories, plus they reveal why they participate on the show, as well as take part in a cake-cutting ceremony and a champagne toast. Also: a mother and son who are concerned with healthy bowels; a plywood alternative for storm protection; organic mini-popcorn created by siblings from Brooklyn; a dairy-free line of plant-based cheeses; and an update on the Living Christmas Company invested in by Mark Cuban during Season 5."
      },
      {
        "id": "tvmaze:45817",
        "title": "Week 9: Kitchen Safe, Off the Cob, Magic Cook, Earth-Log",
        "season": 6,
        "episode": 10,
        "released": "2014-11-21",
        "overview": "GoPro CEO Nick Woodman is a guest on the panel. Pitches include a farmer's healthier tortilla chip made from fresh-picked sweet corn, and the manufacturer of scented fire logs. Also: an update on Robert Herjavec's Season 5 investment in a company that sells ugly Christmas sweaters."
      },
      {
        "id": "tvmaze:57125",
        "title": "Week 10: Biaggi, S.W.A.G Essentials, Gameday Couture, Zipz",
        "season": 6,
        "episode": 11,
        "released": "2014-12-05",
        "overview": "A Brooklyn man pitches his business of foldable, wheeled luggage; a Texas woman makes soaps, washes and grooming products; a fashionable line of sports apparel for women; a single-serve wine product; an update on some of Lori Grenier's investments."
      },
      {
        "id": "tvmaze:57126",
        "title": "Week 11: Mensch on a Bench, Eve Drop, Q Flex, Hoppy Paws",
        "season": 6,
        "episode": 12,
        "released": "2014-12-12",
        "overview": "Products for the holidays are featured, including a stamping kit that proves Santa made a visit. Also: a book and plush toy designed to become a Jewish tradition; an easier way to handle the storage and display of Christmas lights; a 13-year-old girl's device to ease muscle pain; and an update on a Hanukkah tree topper invested in by Daymond John during Season 5."
      },
      {
        "id": "tvmaze:57519",
        "title": "Week 12: Coffee Meets Bagel, SkinnyShirt, Doorman, Bantam Bagel",
        "season": 6,
        "episode": 13,
        "released": "2015-01-09",
        "overview": "Three sisters make a pitch for their dating app; an entrepreneur claims to have a solution to a common problem for online shoppers; a former publisher shares her design for a shirt that makes people look skinny; and a pair of Wall Street brokers demonstrate a compact way to eat a bagel. Also: an update on Hamboards, which Robert invested in during Season 5."
      },
      {
        "id": "tvmaze:117745",
        "title": "Week 13: Scratch and Grain, Bottle Bright, Vestpakz, EvRewares",
        "season": 6,
        "episode": 14,
        "released": "2015-01-13",
        "overview": "Two mountain bikers pitch their cleaning solution for drinking containers; sisters try to add fun to any event with their wearable fabric stickers; a dad from Live Oak. Fla., explains how his vest was inspired by his daughter's winning science project; and a pair of moms claim to have a healthier way to make cookies from scratch. Also: an update on Jason Hanson's Spy Escape and Evasion course, which Daymond John invested in during Season 5."
      },
      {
        "id": "tvmaze:117574",
        "title": "Week 14: Lumio, Napwell, TurboPup, Bello Verde",
        "season": 6,
        "episode": 15,
        "released": "2015-01-16",
        "overview": "A San Francisco man brings the Sharks a unique and elegant lighting solution; a duo from Menlo Park, Cal., show up in pajamas to make their pitch for a wearable technology; actor Dean Cain and UFC fighter Urijah Faber endorse an entrepreneur's custom-tailored suits. Also: a complete food bar for canines; and an update on Hold Your Haunches shapewear from Season 5."
      },
      {
        "id": "tvmaze:128847",
        "title": "Week 15: Victoria's Kitchen, Green Box, Tycoon Real Estate, PhoneSoap",
        "season": 6,
        "episode": 16,
        "released": "2015-01-30",
        "overview": "Transplanted Parisians offer the Sharks a taste of their grandmother's almond-water recipe; a NYC city duo look for an investment in their eco-friendly pizza box; a San Francisco entrepreneur claims to have come up with a \"game changer in real-estate investing\"; and cousins from Utah pitch their idea for sanitizing germ-ridden cell phones. Also: an update on GrooveBook, which Kevin O'Leary invested in during Season 5."
      },
      {
        "id": "tvmaze:129021",
        "title": "Week 16: Fresh Patch, Balm Chicky, Drain Strain, BedJet",
        "season": 6,
        "episode": 17,
        "released": "2015-02-03",
        "overview": "A man from Davenport, Fla., seeks an investment in his grass delivery service for pet owners. Also: a device to eliminate clogged sinks; a worry-free way to share lip balm without sharing germs; a climate-control system for beds; and an update on Barbara Corcoran's investment in Tom+Chee from Season 4."
      },
      {
        "id": "tvmaze:128848",
        "title": "Week 17: Himalayan Dog Chew, Lip Bar, BevBoy, FunBites",
        "season": 6,
        "episode": 18,
        "released": "2015-02-06",
        "overview": "Dog chews made from yak and cow milk are pitched to the Sharks. Other products include colorful lipsticks that are organic; and there's an update on protein-packed nut spreads invested in by Robert and Mark during Season 4."
      },
      {
        "id": "tvmaze:129022",
        "title": "Week 18: Sseko Designs, Gold Rush Nugget Bucket, Boobypack, Lumi",
        "season": 6,
        "episode": 19,
        "released": "2015-02-13",
        "overview": "A Portland, Ore., couple seek financial backing for their customized sandals, which are manufactured in Uganda; a father explains how his daughter inspired him to make a gold-mining bucket; a San Francisco woman pitches a sports bra that she claims is a \"fanny pack for your rack\"; and the Sharks consider investing in a do-it-yourself kit to develop photos. Also: an update on the Paint Brush Cover from Season 5."
      },
      {
        "id": "tvmaze:141532",
        "title": "Week 19: LuminAID, Taaluma Totes, Keen Home, Scholly",
        "season": 6,
        "episode": 20,
        "released": "2015-02-20",
        "overview": "Business ideas and products started by entrepreneurs while they were in college are featured, including a couple who provide microloans to those in need. Also: Interest in a Philadelphia student's scholarship app leads three of the Sharks to walk out of the Tank; and the inventors of Bottle Breacher, which was invested in by Kevin and Mark during Season 6, offer an update."
      },
      {
        "id": "tvmaze:141533",
        "title": "Week 20: Coco Jack, BedRyder, Frill Clothing, Twin Z Pillow",
        "season": 6,
        "episode": 21,
        "released": "2015-03-06",
        "overview": "Everything pitched to the Sharks is made in the U.S. including: custom recruitment clothing for sororities; simple tools which are used to open a Thai coconut and extract the meat; and an invention that can transform a pickup into a \"Truck-U-V.\" Also: an update on a teen who runs a designer bow tie company."
      },
      {
        "id": "tvmaze:143240",
        "title": "Week 21: Echo Valley Meats, EmazingLights, AquaVault, Naja",
        "season": 6,
        "episode": 22,
        "released": "2015-03-13",
        "overview": "A cattleman from Peoria, Ill., returns to show the Sharks what he has learned about the gourmet meat business since he first appeared on the show during Season 4. Also: a lingerie line that's sewn by women in need; and an update on Barbara Corcoran's Season 6 investment in Pipcorn."
      },
      {
        "id": "tvmaze:151381",
        "title": "Week 22: BeeSweet Lemonade, BrandYourself, iCPooch, The Home T",
        "season": 6,
        "episode": 23,
        "released": "2015-03-20",
        "overview": "A 14-year old entrepreneur from Spokane, WA, offers her product which gives pet owners a way to videochat with their animals; a New York-based entrepreneur has a hometown t-shirt that has over $1 million in sales; another New Yorker with proprietary software to manage your online and social reputation; and Barbara Corcoran gathers some of her most successful entrepreneurs for a ski getaway."
      },
      {
        "id": "tvmaze:152613",
        "title": "Week 23: Budsies, Bee Thinking, PullyPalz, Forus Athletics",
        "season": 6,
        "episode": 24,
        "released": "2015-04-10",
        "overview": "A mom from Atlanta, GA has the solution to the lost pacifier problem; a beekeeper from Portland, OR wants the Sharks to invest in his hives; a Palm Beach, FL entrepreneur sells customized stuffed animals; two men from Chicago, IL and Indianapolis, IN tout their super-comfortable lightweight running shoes. In addition, Barbara Corcoran follows up with this season's 13-year-old Andrea Hirzel Cao and her mom, Hong Cao, creators of Q Flex."
      },
      {
        "id": "tvmaze:154036",
        "title": "Week 24: NeatCheeks, Melni Connectors, Beneath the Ink, PittMoss",
        "season": 6,
        "episode": 25,
        "released": "2015-04-17",
        "overview": "A sustainable soil replacement for peat moss; a tasty and tantrum-free way to clean messy kids with sweet-flavored face wipes; a safer way to connect electrical wires; a digital text technology for eBooks. Also: an update on H2W Inc. that makes novelty eyewear, which Daymond invested in during Season 6."
      },
      {
        "id": "tvmaze:154037",
        "title": "Week 25: ZinePak, SnagaStool, Buck Mason, Noene USA",
        "season": 6,
        "episode": 26,
        "released": "2015-04-24",
        "overview": "Collectible products for celebrity superfans; a mobile app for reserving a barstool on busy nights; a men's clothing line that's all made in America; a high-tech insole created by a former NFL player. Also: an update on Barbara's investment in Pork Barrel BBQ from season 1."
      },
      {
        "id": "tvmaze:154722",
        "title": "Week 26: Zero Pollution Motors, The Paleo Diet Foods, World Record Striper Company, Frameri",
        "season": 6,
        "episode": 27,
        "released": "2015-05-01",
        "overview": "Singer Pat Boone helps to pitch an eco-friendly car that runs on compressed air; a fit mother of three touts the benefits of her diet snack bars; a fisherman offers the Sharks the chance to invest in his unique lure, which helped him earn a world record; and two Cincinnati men look for help growing their eyeglasses business. Also: a follow-up on Lori's investment in Heidi Ho Organics."
      },
      {
        "id": "tvmaze:154723",
        "title": "Week 27: Zoom Interiors, Sunscreen Mist, SynDaver Labs, You Kick Ass",
        "season": 6,
        "episode": 28,
        "released": "2015-05-08",
        "overview": "A very life-like, synthetic human for medical testing; personalized super hero action figures; an affordable online service to help you quickly achieve a high-end interior room design; a sunscreen full-body misting device; Also, an update on the Squatty Potty, that Barbara Corcoran invested in during Season 6."
      },
      {
        "id": "tvmaze:156969",
        "title": "Season Finale: Shark Wheel, Gato Cafe, Sway Motorsports, Spikeball",
        "season": 6,
        "episode": 29,
        "released": "2015-05-15",
        "overview": "GoPro founder Nick Woodman returns to the Tank in the Season 6 finale: a cat lover wants patrons to enjoy adorable rescue cats while relaxing at a cafe; a toy designer has a thrilling all-electric compact vehicle; and is it possible that a duo has reinvented the wheel in the shape of a cube? Also: recaps and updates featuring various entrepreneurs that appeared in Season 6."
      },
      {
        "id": "tvmaze:236952",
        "title": "Season 7 Premiere: Guest Shark Ashton Kutcher, The Beebo, ACTON, McClary Bros., SignalVault",
        "season": 7,
        "episode": 1,
        "released": "2015-09-25",
        "overview": "Guest shark Ashton Kutcher; a device to make baby's feeding time easier; wearable transportation; drinking vinegars; protecting consumers from hacking; an update on Pipcorn."
      },
      {
        "id": "tvmaze:236953",
        "title": "O'Dang Hummus, Mikki Bey Eyelash Extensions, LOLIWARE, Splikity",
        "season": 7,
        "episode": 2,
        "released": "2015-10-02",
        "overview": "Hummus with a twist; eyelash extension business; edible cups; a solution for forgotten passwords; update on the Red Dress Boutique."
      },
      {
        "id": "tvmaze:240919",
        "title": "Guest Shark Troy Carter, Foot Cardigan, Two Guys Bow Ties, ValPark, Nerdwax",
        "season": 7,
        "episode": 3,
        "released": "2015-10-09",
        "overview": "Troy Carter enters the Tank as a Guest Shark. A duo from Dallas, Texas pitch their eclectic sock of the month club subscription while standing in their boxer shorts, but will Sharks jump in feet first? Two men from Tulsa, Oklahoma offer the Sharks an investment opportunity in their unique line of wooden bowties, lapel accessories and men's fedoras; an entrepreneur from Springdale, Maryland has a valet and garage parking app that enables users to pay in advance by credit card; and Nashville-based parents tout the benefits of their grippy balm that keeps eyeglasses from slipping."
      },
      {
        "id": "tvmaze:240920",
        "title": "Table 87, EZPeeZ, milk and brookies, DUDE Products",
        "season": 7,
        "episode": 4,
        "released": "2015-10-16",
        "overview": "A device that helps simplify potty-training; a baked-to-order brownies &amp; cookies mashup. Also, an update on the Roominate inspirational toy business, which Mark Cuban invested in during Season 6."
      },
      {
        "id": "tvmaze:240921",
        "title": "Switch Witch, Three Jerks Jerky, The Skinny Mirror, xCraft",
        "season": 7,
        "episode": 5,
        "released": "2015-10-23",
        "overview": "The Sharks start bidding more than the asking price for a product; a pitch prompts a harsh brush-off; managing excess Halloween candy with a children's book and gifts; premium beef jerky; a mirror designed to build self-esteem."
      },
      {
        "id": "tvmaze:240922",
        "title": "Rent Like a Champion, HotShot, Windcatcher, Stem Center USA",
        "season": 7,
        "episode": 6,
        "released": "2015-10-30",
        "overview": "Silicon Valley venture capitalist, Chris Sacca, joins the Tank as a Guest Shark. He finds himself in a heated battle with Lori over a tech education business; two sports fans have a home rental website; an entrepreneur with a unique twist on everyone's favorite hot drink; and an inventor has developed a device that can inflate objects in mere seconds. Also, an update on SWAG Essentials, which did not get a deal in the Tank during season 6."
      },
      {
        "id": "tvmaze:379143",
        "title": "Jimmy Kimmel and Guillermo, Wink Frozen Desserts, Saavy Naturals, Clean Cube, Simply Fit Board",
        "season": 7,
        "episode": 7,
        "released": "2015-11-06",
        "overview": "Jimmy Kimmel and Guillermo Rodriguez are back with some new ideas; a couple discovered ice cream with only 100 calories per pint; professional chefs present soaps and lotions you can eat; two men have solved the problem of missing deliveries at home; and a mother &amp; daughter pitch a way to stay fit with one simple product. Also, an update on Tipsy Elves that Robert Herjavec invested in during Season 5."
      },
      {
        "id": "tvmaze:379144",
        "title": "AfreSHeet, Unshrinkit, Grip Clean, PolarPro, and Sharks at the White House",
        "season": 7,
        "episode": 8,
        "released": "2015-11-13",
        "overview": "This episode features all millennial entrepreneurs. A man has a product he believes is essential in every college dorm room; two Harvard grads transform shrunken sweaters back to their original sizes; and a surfer dude surprises the Sharks with a lucrative proposition. Also, the Sharks are invited to The White house to meet President Barack Obama and Daymond John is honored with a Presidential Ambassadorship."
      },
      {
        "id": "tvmaze:396137",
        "title": "National Association of Bubble Soccer, Umano, Brazi Bites, SockTABS",
        "season": 7,
        "episode": 9,
        "released": "2015-11-20",
        "overview": "When an entrepreneur brings in a new recreational sport to the tank, the sharks get a chance to suit up and ram into each other with reckless abandon; two brothers designed a fashion brand enabling the wearer to do good while looking good; and a couple have a solution to the mystery of the missing sock. Also, an update on Mensch On A Bench that Lori Greiner and Robert Herjavec invested in during Season 6."
      },
      {
        "id": "tvmaze:396138",
        "title": "Leaux Racing Trikes, Glow Recipe, Sarah Oliver Handbags, Trunkster",
        "season": 7,
        "episode": 10,
        "released": "2015-12-04",
        "overview": "An entrepreneur uses an unique labor force to create her product, the sharks go on a crazy ride when a college student brings a grown up version of a favorite childhood toy, and beauty industry experts bring innovations from the secret epicenter of beauty. Also, an update on Happy Feet that Robert Herjavec invested in during Season 5."
      },
      {
        "id": "tvmaze:396139",
        "title": "GeekMyTree, Beard Head, Lovepop, PiperWai",
        "season": 7,
        "episode": 11,
        "released": "2015-12-11",
        "overview": "A Christmas-decorating aficionado has a high-tech way to deck the halls with animated glow balls and synchronized musical trees; an entrepreneur has whimsical knit hats, complete with detachable facemask; two Harvard grads have a line of ornate, pop-up greeting cards for all occasions; and two women demonstrate their all-natural deodorant made from activated charcoal. Plus, Daymond John gives a workshop to the principals of four of his companies — Bombas Socks, Sunstaches, Myself Belts, and Cozy Bugs — and brings out chef Rocco DiSpirito to provide some delicious inspiration."
      },
      {
        "id": "tvmaze:557351",
        "title": "Extreme Sandbox, ABS Pancakes, Total Tie Keep, FireAvert",
        "season": 7,
        "episode": 12,
        "released": "2016-01-05",
        "overview": "Equipment for people who want to run a crane or crush a car; a protein-filled pancake mix; keeping ties looking sharp; checking in with Jim Tselikis and Sabin Lomac of Cousins Maine Lobster."
      },
      {
        "id": "tvmaze:557352",
        "title": "Spretz, ezpz, Hungry Harvest, Controlled Chaos",
        "season": 7,
        "episode": 13,
        "released": "2016-01-08",
        "overview": "A dual-use breath freshener; a functional placemat for children; a subscription service for ugly produce; checking in with the Houston-based founders of LuminAid."
      },
      {
        "id": "tvmaze:557353",
        "title": "Hatch Baby, Village Scholarships, Fixed, Beard King",
        "season": 7,
        "episode": 14,
        "released": "2016-01-15",
        "overview": "Guest judge Chris Sacca returns; a device for babies and their parents; easing the pain of paying for college; a tech solution to parking tickets; checking in with Rugged Races."
      },
      {
        "id": "tvmaze:559390",
        "title": "Shefit, CO.ALITION, IcyBreeze, 2400 Expert",
        "season": 7,
        "episode": 15,
        "released": "2016-01-29",
        "overview": "A college student who earned a perfect score on the SATs wants to help others increase their scores; sports bra; high-tech backpack company; a cooling appliance for outdoor use; an update on Chapul Cricket Bars."
      },
      {
        "id": "tvmaze:578914",
        "title": "R. Riveter, BearTek, Major Mom, Combat Flip Flops",
        "season": 7,
        "episode": 16,
        "released": "2016-02-05",
        "overview": "Military members and veterans present products, including handbags made of upcycled materials."
      },
      {
        "id": "tvmaze:582452",
        "title": "SmartPlate, Bee Free Honee, Float Baby, MTailor",
        "season": 7,
        "episode": 17,
        "released": "2016-02-12",
        "overview": "An entrepreneur pitches a smart plate containing food-recognition technology that could solve all your dieting problems; two energetic women have created a sweetener that tastes like honey, but is not made by bees; the Sharks crack up at the sight of an entrepreneur's unique spa business for babies; and a perhaps too-confident Stanford grad believes he's at the forefront of where high tech meets fashion for men's custom shirts. In a follow-up on Ilumi, the company in which Mark Cuban invested in during Season 5, we see how their wirelessly controlled LED lights have illuminated the business world."
      },
      {
        "id": "tvmaze:585624",
        "title": "Sworkit, Clean Sleep, TUTUblue, Nohbo",
        "season": 7,
        "episode": 18,
        "released": "2016-02-19",
        "overview": "A teenage environmentalist has the answer to plastic bottles; a former soap opera actress seeks a deal for her one-piece swimsuit; exercise playlists; exposing what is lurking inside a mattress; checking in with Signal Vault."
      },
      {
        "id": "tvmaze:585625",
        "title": "Insta-Fire, Custard Stand, PRxPerformance, Rags to Raches",
        "season": 7,
        "episode": 19,
        "released": "2016-02-21",
        "overview": "American entrepreneurs present products that include a fire-starting solution, and space-saving workout equipment; checking in with Three Jerks Jerky."
      },
      {
        "id": "tvmaze:623506",
        "title": "BetterBack, Glacé Cryotherapy, Linka, Teaspressa",
        "season": 7,
        "episode": 20,
        "released": "2016-02-26",
        "overview": "A Las Vegas woman pitches a product that can help relieve back pain; a brother and sister who call themselves the \"Ice Siblings\" talk about a cool way to reduce muscle inflammation; a mechanical engineer from Emeryville, Cal., demonstrates his high-tech bike lock; and the Sharks are served gourmet tea shots. Also: an update on a Philadelphia duo's all-natural deodorant invested in by Barbara during Season 7."
      },
      {
        "id": "tvmaze:632381",
        "title": "MobCraft Beer, Beloved Shirts, IllumiBowl, Innovation Pet",
        "season": 7,
        "episode": 21,
        "released": "2016-03-11",
        "overview": "A motion-activated LED light that attaches to toilet bowls; an alternative to traditional beer; vibrant fashions with unique flair; interactive and innovative pet toys; an update on the Lose 12 Inches workout program."
      },
      {
        "id": "tvmaze:632382",
        "title": "Beer Blizzard, Vengo Labs, The Good Promise, Wondercide",
        "season": 7,
        "episode": 22,
        "released": "2016-03-18",
        "overview": "A product that keeps beer cold longer; a new twist to the vending machine; pet-safe bug repellents; vegetable smoothies; an update on Wombi Rose and LovePop."
      },
      {
        "id": "tvmaze:664728",
        "title": "PrideBites, Trobo, NoPhone, CoolBox,",
        "season": 7,
        "episode": 23,
        "released": "2016-04-08",
        "overview": "Two former advertising guys in New York try to sell the Sharks a cure for cell-phone addiction; emotions rise when entrepreneurs from Orlando, Florida talk about the inspiration behind their wireless cuddly toy that tells science and math stories to children; two pet lovers from Austin, Texas design and customize accessories for the most important member of the family: your one-of-a-kind pet; and two men from Huntington Beach, California hope they can lock up an investment deal with their high-tech \"smart\" tool box. Also, Lori Greiner takes 10 of her entrepreneurs – whose combined sales now total $188 million — to the Orgill Trade Show in Orlando, Florida, on \"Shark Tank,\" FRIDAY, APRIL 8 (9:00–10:00 p.m. EDT) on the ABC Television Network.The Sharks in this episode are Mark Cuban, Kevin O'Leary, Daymond John, Lori Greiner and Robert Herjavec."
      },
      {
        "id": "tvmaze:667656",
        "title": "Petnostics, Frends, popSLATE, Slyde Handboards",
        "season": 7,
        "episode": 24,
        "released": "2016-04-15",
        "overview": "A man has an innovative way to check your pet's health with your phone, but an old-fashioned way to capture the specimen; an engaged couple hope to make a deal for their hand-held surfing boards; two men provide female consumers a stylish way to listen to music on fashionable headphones; and an entrepreneur has an idea that makes the most of the unused space on the backside of your cell phone. Also, Barbara Corcoran invites several entrepreneurs to Cabo San Lucas to discuss topics ranging from opening up an online business to dealing with the \"overnight\" success of being on the show."
      },
      {
        "id": "tvmaze:689599",
        "title": "Drip Drop, Jarrett & Raja, KidRunner, InchBug",
        "season": 7,
        "episode": 25,
        "released": "2016-04-22",
        "overview": "Two high school freshmen pitch a tasty way to improve the ice cream cone; an entrepreneur presents a reinvented kid stroller with an athletic twist; a woman hopes to make the lives of parents easier with her line of child products; and a magician duo performs a music-magic entertainment spectacle, but will the Sharks see through the illusion? Also, an update on Gameday Couture, the fashionable women's gameday apparel, which Mark Cuban invested in during Season 6."
      },
      {
        "id": "tvmaze:695039",
        "title": "FashionTap, brellaBox, My Fruity Faces, Brightwheel",
        "season": 7,
        "episode": 26,
        "released": "2016-04-29",
        "overview": "All-in-one early education solution; fashion networking mobile app; umbrella entrepreneurs; a way to get kids to eat healthier."
      },
      {
        "id": "tvmaze:695040",
        "title": "Dollop Gourmet, CreaProducts, Yourself Expression, The Spooner",
        "season": 7,
        "episode": 27,
        "released": "2016-05-06",
        "overview": "A woman demonstrates her hair products by cutting her own hair; a baker with a healthy frosting creation; a sister and brother duo pitch their jewelry business"
      },
      {
        "id": "tvmaze:695041",
        "title": "Camp No Counselors, Extreme Vehicle Protection, Gladiator Lacrosse, VPCABS",
        "season": 7,
        "episode": 28,
        "released": "2016-05-13",
        "overview": "A former business analyst aims to bring back the nostalgic joy of sleep-away camp to adults; two business partners pitch a product that will protect your car from extreme weather conditions; a 15-year-old entrepreneur hopes to win over the Sharks with her redesigned lacrosse equipment; and a man presents a revamped video game version of the classic pinball machine for the home. Also, an update from Misto Box, a coffee subscription \"experience\" in which Mark Cuban invested in during Season 4."
      },
      {
        "id": "tvmaze:760041",
        "title": "Pete & Pedro, PMS Bites, Felt, PavLok",
        "season": 7,
        "episode": 29,
        "released": "2016-05-20",
        "overview": "A woman from Boston, Massachusetts, hopes the Sharks will make a deal and sink their teeth into her chocolate treats that are perfect for women who want to satisfy cravings; a season four entrepreneur from Aeworth, Georgia, returns for a second chance to pitch the Shark's his new business, a line of men's hair products; a man from Telluride, Colorado, who is desperate for capital, plans to warm the Sharks' hearts with an app that allows users to electronically send handwritten cards; and a man from Boston, Massachusetts, believes he has created a unique way to break bad habits with self-zapping wristbands. Also, recaps and updates featuring the various entrepreneurs that appeared during season seve."
      },
      {
        "id": "tvmaze:848240",
        "title": "ISlide, Re Think, Fizzics, Spoonful of Comfort",
        "season": 8,
        "episode": 1,
        "released": "2016-09-23",
        "overview": "Pittsburgh Steelers wide receiver Antonio Brown touts the benefits of personalized shoe slides by an entrepreneur from Norwood, Massachusetts; a 16-year-old high school junior from Naperville, Illinois, pitches an app that can stop cyberbullying messages before the damage can be done; two men from Howell, New Jersey, designed an ingenious at-home beer dispenser that makes bottled and canned beer taste like draft; a woman from West Valley City, Utah, proposes gifting chicken soup. Also, an update on 2400 Expert, an SAT prep course in which Mark Cuban invested during season 7."
      },
      {
        "id": "tvmaze:919436",
        "title": "GoodHangups, The Lapel Project, Ice Age Meals, TactiBite",
        "season": 8,
        "episode": 2,
        "released": "2016-09-30",
        "overview": "A man from Reno, Nevada pitches a line of heat-and-eat paleo meals; a father and son from Louisiana show off a high-tech device for catching fish; a mother from Seattle, Washington, has designed reusable magnet stickers for hanging art; and an entrepreneur from Miami, Florida sells the Sharks on how he can turn a suit jacket into a tuxedo with customized lapels. Also, an update on the motion-activated toilet-bowl light, IllumiBowl, that Kevin O'Leary invested in during season 7."
      },
      {
        "id": "tvmaze:926905",
        "title": "Raising Wild, The Cookie Kahuna, TekDry, Night Runner, Angels and Tomboys",
        "season": 8,
        "episode": 3,
        "released": "2016-10-07",
        "overview": "Cookie legend Wally Amos hopes his new brand of cookies duplicates his past success; two sisters from St. Cloud, Florida, share an emotional story while pitching their swimsuits for moms; two men from Broomfield, Colorado, drop their own cell phone into a toilet to prove their invention can save damaged tech devices; and a bidding war ensues among the Sharks with a married couple from Orlando, Florida, who stumbled upon the bright idea to put safety light clips on running shoes."
      },
      {
        "id": "tvmaze:936161",
        "title": "Angels and Tomboys, Atlantic Candy Company, The biēm Butter Sprayer, Solemates",
        "season": 8,
        "episode": 4,
        "released": "2016-10-14",
        "overview": "Two sisters from Memphis, Tennessee pitch body sprays and lotions for tween and teen girls; a third-generation chocolatier from St. Augustine, Florida has a family business that manufactures chocolate candy with a toy inside; a veteran food entrepreneur from Austin, Texas has a device that turns a stick of butter into spray; and two entrepreneurs from New York plug their invention that makes high heels more functional and comfortable. Also, an update on Natural Grip, the non-slip protective glove for workouts that Robert Herjavec invested in during season 6."
      },
      {
        "id": "tvmaze:944709",
        "title": "SandiLake Clothing, Parker's Maple, Safe Grabs, SiliDog",
        "season": 8,
        "episode": 5,
        "released": "2016-10-21",
        "overview": "A stay-at-home mom pitches her stylish clothing line for little ones; an 18-year-old hopes the Sharks can help spread his delicious maple syrup products to tables across America; a woman has risked everything for her simple and smart multi-use kitchen accessory; and a young man created a new type of tag for dog lovers. Also, a profile on Kevin O'Leary reveals a lesser-known side of the Shark also known as \"Mr. Wonderful.\""
      },
      {
        "id": "tvmaze:950979",
        "title": "Joyce's LuLu Bang, unPack, Sunscreenr, Potato Parcel",
        "season": 8,
        "episode": 6,
        "released": "2016-10-28",
        "overview": "A young man and his business partner from Carrollton, Texas, pitch an unusual twist to a common vegetable; two sisters from Philadelphia, Pennsylvania, get a Shark to proclaim that their barbeque sauce \"could bring a tear to a glass eye;\" two millennial entrepreneurs have a way to alleviate the hassle of luggage and packing; and a biochemist from Chapel Hill, North Carolina, can make the invisible visible with a device that ensures sun protection. Also, an update on the Grace &amp; Lace accessory line, which Barbara Corcoran invested in during season 5."
      },
      {
        "id": "tvmaze:961152",
        "title": "EcoFlower, The Style Club, Safe Catch, #BeSomebody",
        "season": 8,
        "episode": 7,
        "released": "2016-11-04",
        "overview": "A woman from West Haven, Utah, had to sell off 75% of her faux flower business in order to keep it alive; two men from Sausalito, California, pitch a way to test mercury levels in a single fish; a former corporate executive from Houston, Texas, has a platform to help people pursue their passions; and a millennial from Pittsburgh, Pennsylvania, is looking to finance her fashion brand geared toward the social media generation. Also, an update on Wicked Good Cupcakes, which Kevin O'Leary invested in during season 4."
      },
      {
        "id": "tvmaze:962488",
        "title": "Milk Snob, Jack's Stands, Chi'Lantro BBQ, Toor",
        "season": 8,
        "episode": 8,
        "released": "2016-11-11",
        "overview": "A Dallas, Texas, real-estate broker's pitch leads to a battle of billionaires about his business model for a way to make house hunting more convenient; a 10-year-old kidpreneur from Broomfield, Colorado, created a lemonade-stand business to help other kids start their own businesses; a mother from Allen, Texas, designs Made-in-America multi-functional covers for infant car seats; and a tenacious man from Austin, Texas, pitches the Sharks his Korean BBQ fusion restaurant food-truck business. Also, a follow-up on Rent Like a Champion, a weekend rental-home business, which Mark Cuban and Chris Sacca invested in during season 7."
      },
      {
        "id": "tvmaze:969837",
        "title": "Barbell, PupBox, Line Cutterz, Energybits",
        "season": 8,
        "episode": 9,
        "released": "2016-11-18",
        "overview": "A couple from San Francisco, California, pitch their subscription service for puppy products; a woman from Boston, Massachusetts, hopes to popularize algae as a nutritional health supplement in America; two buddies from Las Vegas, Nevada, design apparel for athletic builds; and an avid fisherman from Hudson, Wisconsin, wants a deal for his fishing line cutting tool. Also, a follow-up with Bantam Bagels, which Lori Greiner invested in during season 6."
      },
      {
        "id": "tvmaze:987556",
        "title": "Chewable Coffee Products, Electronic Skateboard, Simply Fit Board",
        "season": 8,
        "episode": 10,
        "released": "2016-12-02",
        "overview": "The team behind an electronic skateboard returns to the Tank; human-quality pet food business; chewable coffee products; gourmet home-cooking product; a follow-up with the makers of the Simply Fit Board."
      },
      {
        "id": "tvmaze:993989",
        "title": "An Entrepreneur Who Works with Santa to Reply to Children's Letters, 83-Year-Old Ironman Triathlon Competitor, Profile of Billionaire Mark Cuban",
        "season": 8,
        "episode": 11,
        "released": "2016-12-09",
        "overview": "An entrepreneur works with Santa Claus to reply to children's letters to the North Pole; an 83-year-old Ironman triathlon competitor and his business partner present a more functional winter glove; a profile of billionaire Mark Cuban."
      },
      {
        "id": "tvmaze:1013690",
        "title": "Naturally Perfect Dolls, PDX Pet Design, Basic Outfitters, Victory Coffees",
        "season": 8,
        "episode": 12,
        "released": "2017-01-06",
        "overview": "A couple from Homestead, Florida, had their young daughters in mind when they created a line of dolls that look like them: beautiful girls of color; a cat-loving couple from Portland, Oregon, hope the Sharks will paw their way into their innovative cat companion products, which includes a device to intimately groom your cat just like a mama cat; a husband and wife team from New York have a one-stop online shop for replacing men's outworn undergarments with affordable, high-quality new ones; and a former Navy SEAL from Austin, Texas, comes into the Tank hoping to walk out with a deal to take his patriotic coffee business nationwide. Also, a follow-up with Drain Strain, which Robert Herjavec invested in during season 6."
      },
      {
        "id": "tvmaze:1020614",
        "title": "Grease Bags, Pinblock, Mama's MilkBox, Nicepipes Apparel",
        "season": 8,
        "episode": 13,
        "released": "2017-01-13",
        "overview": "A single mom from Allen, Texas, believes her eco-friendly grease disposal method will be enough to cook up a deal; a 21-year-old from Ukraine and now living in Brooklyn, New York, makes the Sharks speechless with his epic display of block toys and his knowledge about the toy industry; a mother from Pittsburgh, Pennsylvania, zealously pitches her stylish nursing apparel for breastfeeding moms; and a yoga enthusiast from New York, New York, admits she has limited fashion or business experience, yet hopes the Sharks will want to invest in her modern take on legwarmers. Also, Daymond John is featured in a \"Shark Profile\" highlighting his road to entrepreneurial success."
      },
      {
        "id": "tvmaze:1023462",
        "title": "Tiny House Rentals; Snack Chips with Cricket Flour; Earplugs That Filter Damaging Sounds; Modernized Childhood Toy",
        "season": 8,
        "episode": 14,
        "released": "2017-01-27",
        "overview": "Entrepreneurs rent tiny houses in the woods; snack chips made with cricket flour; earplugs for listening to music filter out damaging levels of sound; a modern version of a favorite childhood toy; a profile of Barbara Corcoran."
      },
      {
        "id": "tvmaze:1031909",
        "title": "Stylish Baby Mats; Portable Pressurized Shower Kit; Folding Smart-Cart",
        "season": 8,
        "episode": 15,
        "released": "2017-02-03",
        "overview": "A cooler that keeps multiple drinks separated within one cold container; stylish baby mats; portable pressurized shower kit; folding smart-cart; follow-up with the owners of the Tom &amp; Chee grilled cheese business."
      },
      {
        "id": "tvmaze:1048804",
        "title": "A Vibrating Mat That Helps Calm Babies; An Ointment Made From Essential Oils; A Natural Snack Made With Acai",
        "season": 8,
        "episode": 16,
        "released": "2017-02-10",
        "overview": "Durable bags made out of the material that protects on the front lines of firefighting; a vibrating mat that helps calm babies; an ointment made from essential oils; a natural snack made with acai."
      },
      {
        "id": "tvmaze:1048805",
        "title": "An App That Allows Children To Use A Plush Toy To Send And Receive Voicemail; Software That Automates Plant Care",
        "season": 8,
        "episode": 17,
        "released": "2017-02-17",
        "overview": "A subscription service that teaches children to code; an app that allows children to use a plush toy to send and receive voicemail; software that automates plant care; an app and website that allows customers to book a day room at a hotel."
      },
      {
        "id": "tvmaze:1050340",
        "title": "Food Supplements, Drone Pilot Training and Educational Courses, Elephant-Themed Apparel and Stylish Beach Towels",
        "season": 8,
        "episode": 18,
        "released": "2017-02-24",
        "overview": "In a special episode featuring millennial entrepreneurs, one will make the deal that takes the award-winning \"Shark Tank\" across the $100 million threshold of deals made in the Tank."
      },
      {
        "id": "tvmaze:1065352",
        "title": "The Sleep Styler, Blendtique, MealEnders, Rareform",
        "season": 8,
        "episode": 19,
        "released": "2017-03-03",
        "overview": "A product that takes the love of wine to another level; an ophthalmologist creates a special tool to help women; products made from recycled billboards; lozenges that prevent overeating; a profile of Robert Herjavec."
      },
      {
        "id": "tvmaze:1096845",
        "title": "Apollo Peak, Under The Weather, Seedsheet, Cropsticks",
        "season": 8,
        "episode": 20,
        "released": "2017-04-07",
        "overview": "A former pet food company salesman from Denver, Colorado, has a unique addition to the beverage industry with a wine for cats; a soccer dad from Cincinnati, Ohio, shares his gut-wrenching story about how he designed a portable shelter that ensures you're covered wherever you go; an architect and environmentalist from Middlebury, Vermont, used his skills to design a maintenance-free and fun way to make anyone into a gardening guru; and an entrepreneurism teacher from Los Angeles, California, left academia to pursue her own business idea of a reinvented chopstick. Also, a follow-up with Sean Riley, Jeff Klimkowski &amp; Ryan Meegan from Chicago, Illinois, and Dude Products, their manly, durable wipes that Mark Cuban invested in during season 7."
      },
      {
        "id": "tvmaze:1108206",
        "title": "Guard Llama, Flag, Validated, Guardian Bikes",
        "season": 8,
        "episode": 21,
        "released": "2017-04-14",
        "overview": "To show how their smartphone app can improve personal security, two entrepreneurs from Chicago, Illinois, bring a live guard llama into the Tank; two entrepreneurs from Irvine, California, deliver a safer take on the bicycle by innovating the brake system; a trio from Seattle, Washington, have an app that helps shoppers and diners earn free parking in exchange for their business; and business partners from Santa Clarita, California, hope to convince the Sharks to take a shot with their free photo-printing service. Also, a follow-up with former professional football player Al \"Bubba\" Baker from Avon, Ohio, and his de-boned rib steaks known as Bubba's Boneless Ribs, which Daymond John invested in during season 5."
      },
      {
        "id": "tvmaze:1113978",
        "title": "Goverre, See Rescue Streamer, Bootyqueen Apparel, Loctote Industrial Bag Co",
        "season": 8,
        "episode": 22,
        "released": "2017-04-21",
        "overview": "A fitness apparel line that caters to women; no-spill, portable, stem-less wine glasses; rescue signal; slash-proof and water-resistant backpacks; PRX Performance follow-up."
      },
      {
        "id": "tvmaze:1145211",
        "title": "Thompson Tee, Wallet Buckle, Rumi Spice, Peoples Design",
        "season": 8,
        "episode": 23,
        "released": "2017-05-05",
        "overview": "Two entrepreneurs from Placentia, California, pitch their solution to embarrassing underarm sweat marks and stains; brothers and best friends from Walnut Creek, California, believe their belt buckle that doubles as a wallet is the most convenient way to carry your essentials; U.S. Army veterans from Chicago, Illinois, hope to empower farmers in a war-torn country by helping them cultivate and harvest saffron; and a former executive chef from Colorado Springs, Colorado, with an unlikely story, thinks his multi-purpose mixing bowl will become the next go-to kitchen gadget. Also, a follow-up with Robin \"Wombi\" Rose and John Wise from Cambridge, Massachusetts, and their 3D paper pop-up greeting cards, LovePop, that Kevin O'Leary invested in during season 7."
      },
      {
        "id": "tvmaze:1150189",
        "title": "Bridal Buddy, Laid Brand, Rocketbook, Wine and Design, Shark Profiles",
        "season": 8,
        "episode": 24,
        "released": "2017-05-12",
        "overview": "In the season finale, a husband and wife duo from Raleigh, North Carolina, surprise the Sharks when they bring a party atmosphere and a male model into the Tank to show how their franchised art studios work; two men from Melrose, Massachusetts, have a futuristic version of a notebook that sends writing wirelessly, allowing the handwriting to be erased using a microwave oven, a concept the Sharks find both \"wacky\" and \"brilliant\"; two entrepreneurs from Mechanicsburg, Pennsylvania, hope to capitalize on the desire to attract a mate with hair-care products infused with pheromones; and a divorced mom from The Poconos, Pennsylvania, shares her philosophy of how she overcame obstacles and pursued her idea of how brides can bag up their wedding gowns so they can use the bathroom on their own. There will also be a recap of season 8's \"Shark Profiles\" series."
      },
      {
        "id": "tvmaze:1258578",
        "title": "Locker Board, WYP Aviation, Sierra Madre Research, Simple Habit",
        "season": 9,
        "episode": 1,
        "released": "2017-10-01",
        "overview": "Things get fiery in the Tank when Sir Richard Branson vents his frustration with Mark Cuban in a shocking, never-before-seen way. An 11-year-old inventor, skater and surfer from San Clemente, California, solved a problem he had by recycling a skateboard deck to fit inside lockers and backpacks; an entrepreneur from Meridianville, Alabama, is revolutionizing aerial sports with his exhilarating human flight experience; a husband and wife team from Vicksburg, Mississippi, have literally elevated the camping experience with their outdoor camping gear; and an entrepreneur from San Francisco, California, claims her five-minute meditation app will help the world reduce stress, improve focus and sleep better."
      },
      {
        "id": "tvmaze:1258579",
        "title": "The Seventy2, Jackson's Honest, Qball, Trippie",
        "season": 9,
        "episode": 2,
        "released": "2017-10-01",
        "overview": "Entrepreneurs from Park City, Utah, and Burbank, California, have the ultimate survival kits to help get through the first 72 hours of an emergency; parents from Crested Butte, Colorado, were inspired by their son's rare illness to create a thriving business that is disrupting the snack chip industry; an entrepreneur from Cary, North Carolina, has a unique way to engage kids with a wireless microphone that you can throw; and a recent college graduate from Hamilton, New York, designed an app that takes the guesswork and turbulence out of navigating big airports."
      },
      {
        "id": "tvmaze:1328739",
        "title": "Third Wave Water, Fidgetland, Tangle Pets, Enso Rings",
        "season": 9,
        "episode": 3,
        "released": "2017-10-08",
        "overview": "Sharks: Robert, Barbara, Kevin, Lori, Mark\"Fidgetland\" fidget spinners and rings that reduces anxiety and stress (YES); \"Enso\" flexible silicone wedding bands (YES) ; \"Third Wave Water\" a mineral concoction mixed into distilled water for better coffee brewing quality (YES); \"Tangle Pets\" kid-friendly hairbrush. (YES); Update on: The Sleep Styler"
      },
      {
        "id": "tvmaze:1258580",
        "title": "Benjilock, Ice Shaker, Solemender, Delighted by Hummus",
        "season": 9,
        "episode": 4,
        "released": "2017-10-15",
        "overview": "Chris Gronkowski from Colleyville, Texas, his brother Rob Gronkowski from the New England Patriots, and the rest of the Gronk brothers bring an insulated sports bottle to the Tank. Mark Cuban and Alex Rodriguez offer sage advice to a 17-year-old from St. Louis, Missouri, who devised a tool to quickly soothe foot pain; an entrepreneur from Phoenix, Arizona, with a nutrition and culinary background, has a sweeter way to eat a popular snack; and a man from Los Angeles, California, hopes to lock up a deal with his innovative way to keep belongings safe."
      },
      {
        "id": "tvmaze:1258581",
        "title": "Kwikhang, mirmir, Ash & Erie, Human Bobber",
        "season": 9,
        "episode": 5,
        "released": "2017-10-22",
        "overview": "Millennials from Detroit, Michigan, hope to tailor a deal for their line of premium shirts for men 5'8\" and under; two Los Angeles, California, photographers can make anyone look beautiful with the technology behind their high-end photo booth; a police officer and former Marine from Cumberland, Rhode Island, hopes the Sharks won't leave him hanging with his no-drill, no-hole curtain rod brackets; and two men from Coconut Creek, Florida, invented a personal flotation device with multifunctional options. Also, a follow-up with Cyndi Lee from Houston, Texas, and her multi-use kitchen tools, Safe Grabs, which Lori Greiner invested in during season eight."
      },
      {
        "id": "tvmaze:1338941",
        "title": "Brazyn Life, Novel Effect, Drain Wig, Father Figure",
        "season": 9,
        "episode": 6,
        "released": "2017-10-29",
        "overview": "A graphic designer and a patent attorney from Olympia, Washington, have a high-tech way to make children's story time more magical, but the Sharks are skeptical of their business model; a father from Brooklyn, New York, has a brand of functional paternity clothing for new dads; parents from Salem, Utah, bring in their five daughters to showcase a solution to hairy drain problems in the shower and bathtub; and a former pro football player and his business partner pitch a better version of a workout device.Also, a profile on Sara Blakely, the founder and sole owner of the category-defining company, Spanx, and how her brand was born from a simple goal. She is an advocate of empowering women to be whatever they want to be in order to build successful businesses and create economic opportunity in their communities."
      },
      {
        "id": "tvmaze:1342603",
        "title": "Pearachute, Qeepsake, GeoOrbital, WaiveCar",
        "season": 9,
        "episode": 7,
        "released": "2017-10-29",
        "overview": "An entrepreneur from Santa Monica, California, introduces the world's first all-electric, free car-sharing service; a monthly membership that makes it easy for parents and caregivers to discover, book and attend family activities at an affordable rate, from an entrepreneur in Chicago, Illinois; a Cambridge, Massachusetts, entrepreneur invented a product that can turn any regular bicycle into an electric bike in under one minute; and a digital baby journal that captures memories through text message, from an entrepreneur in Auburndale, Massachusetts."
      },
      {
        "id": "tvmaze:1338942",
        "title": "No Mo-stache, Snarky Teas, SnoofyBee, Dreampad",
        "season": 9,
        "episode": 8,
        "released": "2017-11-05",
        "overview": "A woman from Nokomis, Florida, dives into the \"snark\" tank with her brand of teas, which include ingredients laced with attitude; some Sharks are shocked when two ladies from Los Angeles, California, reveal that all women share a common hairy problem; parents from Albany, Oregon, solved the problem of babies touching the mess during diaper changes; and the Sharks think an entrepreneur from Aurora, Colorado, may be overvaluing his technology that can improve sleep and reduce stress.In her Shark profile, Bethenny Frankel shares how she learned a lot about business by spending time with her father at the racetrack and how she always intended to use her reality-show stardom as a platform to become a business phenomenon by creating Skinnygirl, one of the most successful liquor brands in history."
      },
      {
        "id": "tvmaze:1342604",
        "title": "Glovestix, BrilliantPad, BRAVO, Hoopmaps",
        "season": 9,
        "episode": 9,
        "released": "2017-11-05",
        "overview": "An automatic dog potty system that wraps and then seals the waste to maintain a clean and odor-free home from an entrepreneur in Chicago, Illinois; two entrepreneurs from Phoenix, Arizona, designed an app to make tipping easier; twin entrepreneurs from Sacramento, California, hope to make the world of pickup basketball much simpler; and an invention that absorbs moisture and deodorizes sweaty sports gear from an entrepreneur in Ashburn, Virginia."
      },
      {
        "id": "tvmaze:1339546",
        "title": "Robin Auto Pilot, Smartgurlz, DNAsimple, Grypmat",
        "season": 9,
        "episode": 10,
        "released": "2017-11-12",
        "overview": "A U.S. Air Force fighter-jet machine-gun mechanic from Columbus, Ohio, introduces a high-performance problem-solver; an entrepreneur from Queens, New York, hopes the Sharks bite into a DNA test that aims to aid and optimize medical research; a Dallas, Texas, entrepreneur duo hopes to lure the Sharks with their high-tech solution for a common household chore; robots and drones are all the rage with boys, but one Bethesda, Maryland, entrepreneur is hoping to encourage more girls to get into coding and technology."
      },
      {
        "id": "tvmaze:1342605",
        "title": "Reely Hooked, Prontobev, Slumberkins, Cut Buddy",
        "season": 9,
        "episode": 11,
        "released": "2017-11-12",
        "overview": "Two firefighters and entrepreneurs from Pembroke Pines, Florida, introduce their healthy, smoked fish dip; a hair- and beard-cutting template from an entrepreneur in Chapel Hill, North Carolina; two entrepreneurs from Vancouver, Washington, who created a unique hybrid of a stuffed animal and blanket for families on the go; and a device that chills an entire bottle of wine in just 30 seconds from an entrepreneur in San Francisco, California."
      },
      {
        "id": "tvmaze:1342488",
        "title": "Mush, Hater, Everlywell",
        "season": 9,
        "episode": 12,
        "released": "2017-11-26",
        "overview": "In this episode, an entrepreneur with a \"hate connection\" app hopes to match with the Sharks; coconut water is all the rage, and one entrepreneur looks to bank on that with their new invention; one entrepreneur is hoping to help you reduce chronic disease by doing your own lab work; and an entrepreneur duo may have just found your favorite breakfast on the go."
      },
      {
        "id": "tvmaze:1359652",
        "title": "Rokblok, The Original Comfy, The Christmas Tree Hugger, Modern Christmas Tree",
        "season": 9,
        "episode": 13,
        "released": "2017-12-03",
        "overview": "A pair of entrepreneurs hope they have the fix for keeping you completely warm during the holiday season; one entrepreneur has taken the Christmas tree to a whole new level; one entrepreneur is hoping the sharks will like his take on covering a Christmas nuisance; and an entrepreneur duo may have just found your kid's direct connection to jolly old Saint Nick."
      },
      {
        "id": "tvmaze:1372857",
        "title": "FRYWALL, Birddogs, Inirv, Elliptical Stroller",
        "season": 9,
        "episode": 14,
        "released": "2018-01-07",
        "overview": "An entrepreneur from Brooklyn, New York, introduces an ingenious kitchen tool that solves one of the biggest gripes in cooking – the splatter that sprays your kitchen and clothes anytime you cook; an entrepreneur from Miami, Florida, invented a special stroller that allows caregivers to also fit in a workout; and entrepreneurs from New York City believe they have created the best men's garment out there."
      },
      {
        "id": "tvmaze:1372858",
        "title": "recharj, stasher, iFork",
        "season": 9,
        "episode": 15,
        "released": "2018-01-07",
        "overview": "An entrepreneur from New York City presents an innovative line of flatware, cups and plates that makes eating more hands-free and carefree; the only airtight, self-sealing zip-top bag in the world made entirely of pure silicone with all the benefits of glass is introduced by an entrepreneur from California; an Arlington, Virginia, entrepreneur hopes to take nap time to a whole new level; an entrepreneur from Pennsylvania is hoping to sell the Sharks on his non-toxic, super hydrophobic spray that repels stains."
      },
      {
        "id": "tvmaze:1372859",
        "title": "G.O.A.T., The Longhairs, Joe's Gourmet Fish Fry",
        "season": 9,
        "episode": 16,
        "released": "2018-01-14",
        "overview": "Husband and wife entrepreneurs from Atlanta, Georgia, introduce the Sharks to their famous seafood breading mix business; an entrepreneur from Birmingham, Mississippi, provides pets and their owners a way to communicate with one another with her invention; a re-engineered bathrobe for today's man and for those men who wouldn't be caught dead in one is presented to the Sharks by an entrepreneur from Roslyn, New York; entrepreneurs from San Diego, California, inform the Sharks on what every man with long hair needs to know and have in their life."
      },
      {
        "id": "tvmaze:1372860",
        "title": "ZUP, BOOBIE BAR, Pandaloon, Alice's Table",
        "season": 9,
        "episode": 17,
        "released": "2018-01-14",
        "overview": "An entrepreneur from Brookline, Massachusetts, empowers women to create a community that prioritizes living well, working hard and encouraging women to build businesses of their own with her idea; a trio of entrepreneurs from Williamsburg, Virginia, pitch the sharks a fresh, new way to ease people into water sports with their all-in-one invention; a registered nurse turned entrepreneur from Carlsbad, California, helps breastfeeding moms find a healthy and convenient way to increase their milk supply with her delicious food item; a panda-loving entrepreneur from Burbank, California, hopes to make panda lovers out of the Sharks when she presents her animal-themed pet apparel company."
      },
      {
        "id": "tvmaze:1372861",
        "title": "Rounderbum, Brush Hero, Savy, Guzzle Buddy",
        "season": 9,
        "episode": 18,
        "released": "2018-01-21",
        "overview": "A young entrepreneur from Columbus, Ohio introduces the Sharks to a dynamic pricing tool aimed at Millennials and their spending habits; two entrepreneurs from Park City, Utah and Alexandria, Virginia introduce their revolutionary cleaning tool that they expect will be in every home in the world; and a brother and sister-in-law pair from Medford, Oregon prove that pouring is boring by sharing their original wine product that makes drinking even more fun."
      },
      {
        "id": "tvmaze:1372862",
        "title": "Bouquet Bar, Zuvaa, The Wingman, The Pop",
        "season": 9,
        "episode": 19,
        "released": "2018-01-21",
        "overview": "An innovative company that is rapidly redefining the art of gifting with the birth of their online platform makes its way into the \"Tank\" via a trio of entrepreneurs from Orange County, California; two men from Milwaukee, Wisconsin, introduce their coast guard-approved life jacket they feel is easier to use and will save lives; an entrepreneur from Atlanta, Georgia, pitches her online clothing company of products designed and manufactured in Africa; a mom-turned-entrepreneur from Montclair, New Jersey, manages to help create easier lives for parents with her all-in-one, self-protective silicone pacifier."
      },
      {
        "id": "tvmaze:1377307",
        "title": "ChangEd, SnapClips, ShowerPill, The Dough Bar",
        "season": 9,
        "episode": 20,
        "released": "2018-01-28",
        "overview": "Two health conscious entrepreneurs from Redwood City, California, introduce the sharks to their guilt-free sweet treat; three athletes from Berkeley, California, share their magic solution for when a shower isn't possible and you're in the thick of a stinky situation; brothers from Oak Forest and Chicago, Illinois, present their pricing tool that collects spare change to help student loan borrowers; an entrepreneur from Wheeling, Illinois, presents his patented technology geared toward athletes, which helps secure and swap weights quickly and safely"
      },
      {
        "id": "tvmaze:1385295",
        "title": "Petrol / Sap! / Everytable",
        "season": 9,
        "episode": 21,
        "released": "2018-01-28",
        "overview": "A couple of dog-loving entrepreneurs from Cornelius, North Carolina, and New Albany, Ohio, present their healthy, hydrating treat for thirsty dogs; two outdoorsmen from San Diego, California, and Orem, Utah, have designed a convenient portable outdoor fire which is healthy and easy to use; cousins from Tinderhill and Burlington, Vermont, turn their passion for the maple industry into a business and share their tree-made product; entrepreneurs from Los Angeles, California, share their healthy grab-and-go meal concept that creates a new standard to make healthy food affordable and a reality for all"
      },
      {
        "id": "tvmaze:1387110",
        "title": "GUNNAR Optiks / Avocaderia / SolSource / Sunniva",
        "season": 9,
        "episode": 22,
        "released": "2018-02-11",
        "overview": "An entrepreneur from San Clemente, California, familiarizes the Sharks with his eyewear design engineered to eliminate digital eyestrain and block harmful rays; an entrepreneur from New York City introduces the world to the first avocado bar that serves healthy fast food; an entrepreneur from Burlingame, California, shows the sharks that they can cook anywhere under the sun with her portable solar invention; a trio of brothers from Arlington, Virginia, present their all-natural super beverage."
      },
      {
        "id": "tvmaze:1387111",
        "title": "Eggmazing Egg Decorator / Hugo's Amazing Tape / Coolpeds / Coinout",
        "season": 9,
        "episode": 23,
        "released": "2018-02-18",
        "overview": "Entrepreneurs from Amarillo, Texas, introduce their new, fun and exciting way to decorate Easter eggs without all the mess; entrepreneurs from Los Angeles, California, pitch their glue-less, self-clinging, reusable tape invention; an entrepreneur from West Covina, California, shares his line of transportation devices to help people get around efficiently and save money; an entrepreneur from New York City presents his digital tool to turn loose change into effortless money.In a \"Shark Tank\" update, entrepreneur Jason Burns from Woodland Hills, California, updates his investor, Barbara Corcoran, on Fidgetland, where his company designs toys to help stimulate the mind and absorb excess energy."
      },
      {
        "id": "tvmaze:1400993",
        "title": "Bermies / Lace Your Face / Palmini (O.A. Foods) / Thrive+",
        "season": 9,
        "episode": 24,
        "released": "2018-02-25",
        "overview": "An energetic entrepreneur from Key Biscayne, Florida, believes he has the best men's swimwear; entrepreneurs from Alhambra, California, present their \"better\" version of a popular beauty trend; an entrepreneur from Pinecrest, Florida, pitches the Sharks his solution for eating pasta without the guilt; an entrepreneur from Kingwood, Texas, has the cure for the dreaded hangover.In a \"Shark Tank\" update, a recap from successful entrepreneurs throughout the season are highlighted."
      },
      {
        "id": "tvmaze:1501117",
        "title": "BoxLock, Le-Glue, FinalStraw, Bear Minimum",
        "season": 10,
        "episode": 1,
        "released": "2018-10-07",
        "overview": "An entrepreneur from Atlanta, Georgia, introduces a smart device designed specifically to protect your packages from package thieves; an unexpected entrepreneur from Dalton, Georgia, invented a nontoxic and nonpermanent adhesive created for kids, by a kid; entrepreneurs from Santa Fe, New Mexico, and Los Angeles, California, believe they have created the solution to plastic straws and want the Sharks to suck responsibly with their new product; and husband and wife entrepreneurs from Spokane, Washington, believe they have created the next evolution in camping cookware and hope to change the way people eat outdoors."
      },
      {
        "id": "tvmaze:1526405",
        "title": "Shed Defender, LugBug, Ta-Ta Towels, Sanaia Applesauce",
        "season": 10,
        "episode": 2,
        "released": "2018-10-14",
        "overview": "Brothers from Orange County, California, introduce a product that solves the issue of pet shedding; an entrepreneur from Scottsdale, Arizona, believes he has invented a better way to carry a child's car seat; an entrepreneur from Los Angeles, California, presents her solution to a problem some well-endowed women face; an impressive entrepreneur from New York, New York, familiarizes the Sharks with her sophisticated version of a traditional snack."
      },
      {
        "id": "tvmaze:1538179",
        "title": "Soupergirl, Bundil, Beyond Sushi, Cup Board Pro",
        "season": 10,
        "episode": 3,
        "released": "2018-10-21",
        "overview": "A mother-daughter duo from Washington D.C., is passionate about their healthy vegan soups; an entrepreneur from Addison, Texas, pitches his new tool to make it simpler to invest in crypto-currency; a chef from New York, New York, wants to expand his vegan sushi restaurants across the nation; and in an emotional pitch, siblings from Long Island, New York, present the product of their late father, an NYC firefighter whose dream was to pitch on \"Shark Tank\" but passed away before he could."
      },
      {
        "id": "tvmaze:1543493",
        "title": "Manscaped, BoomBoom, Cave Shake, Butter Cloth",
        "season": 10,
        "episode": 4,
        "released": "2018-10-28",
        "overview": "A father-and-son pair from Carlsbad, California, introduce a line of manscaping products for today's refined man; a husband-and-wife duo from Los Angeles, California, present a new way to get refreshed; a duo from Los Angeles, California, enter the tank to pitch their sweet treat that complies with the keto diet craze; an immigrant from Vietnam pitches the Sharks his buttery-soft dress shirts in hopes of realizing his American dream and brings along an unlikely celebrity partner."
      },
      {
        "id": "tvmaze:1548451",
        "title": "The Handbag Raincoat, RewardStock, WISP, The Kombucha Shop",
        "season": 10,
        "episode": 5,
        "released": "2018-11-18",
        "overview": "Sisters from Englewood Cliffs, New Jersey, introduce a way to protect women's handbags with their waterproof cover design; an entrepreneur from Raleigh, North Carolina, presents his automated travel service that will use your reward points to help you plan your next vacation at a fraction of the cost; an entrepreneur from San Marcos, California, pitches his one-handed pull broom and dustpan to help clean easily and effortlessly; an entrepreneur from Madison, Wisconsin, shows the Sharks an affordable way to make a healthy beverage with her at-home kit."
      },
      {
        "id": "tvmaze:1556919",
        "title": "Vade Nutrition, LockStrap, BottleKeeper, Nui Cookies",
        "season": 10,
        "episode": 6,
        "released": "2018-11-25",
        "overview": "First into the Tank is a husband and wife team from Williamston, Michigan, who pitch their dissolvable protein pack product; an entrepreneur from Temecula, California, presents his dual-purpose strap design to keep valuables safe and secure; cousins from El Segundo, California, believe they have the ultimate solution to keeping a beer bottle cold with their neoprene-lined, stainless steel design; entrepreneurs from Anaheim, California, present their healthy alternative treat to sweets that capitalizes on the ketogenic diet trend."
      },
      {
        "id": "tvmaze:1564865",
        "title": "Hire Santa, Ski-Z, Prank-O, Oatmeals",
        "season": 10,
        "episode": 7,
        "released": "2018-12-02",
        "overview": "There's more holiday cheer than ever when an entrepreneurial elf from Southlake, Texas, presents his large database of Santa entertainers to help people hire Santa Claus during the holidays; entrepreneurs from Lafayette, Louisiana, solve the hassle of carrying skis on the slopes; entrepreneurs from Minneapolis, Minnesota, introduce their new twist on gift-giving designed to bring laughter to every occasion; last into the Tank is an entrepreneur from New York City who puts a modern twist on an old-fashioned favorite with her build-your-own oatmeal bar."
      },
      {
        "id": "tvmaze:1567789",
        "title": "Pop It Pal, Yumble, BollyX, Mother Beverage",
        "season": 10,
        "episode": 8,
        "released": "2018-12-09",
        "overview": "First into the Tank is a family of entrepreneurs from Chapin, South Carolina, and Fairhope, Alabama, who present a product that satisfies a unique, and some would say disgusting, obsession; husband and wife duo Joanna and David Parker from Englewood, New Jersey, introduce their convenient subscription service that makes meal time for kids stress-free for parents; an entrepreneur from Yorba Linda, California, pitches his Bollywood-inspired dance fitness program that gets the Sharks dancing; last into the Tank is a husband and wife pair from Dallas, Texas, who give the Sharks a taste of their better-tasting probiotic beverage."
      },
      {
        "id": "tvmaze:1578007",
        "title": "Moki Door Step, Sproing Fitness, Bruw, TushBaby",
        "season": 10,
        "episode": 9,
        "released": "2019-01-06",
        "overview": "First into the Tank is a husband and wife team from Newtown, Connecticut, who pitch their simple and brilliant rooftop assistance design that helps access your vehicle's roof with one easy step; entrepreneurs from Chicago, Illinois, present their fitness workout that offers a softer, lower impact alternative to the treadmill; a teen entrepreneur from West Bloomfield, Michigan, introduces his solution for making the perfect coffee at home with his cold brew kit; a mom from Walnut Creek, California, presents her simple baby seat that sits right on your hip and makes it easier to carry your baby."
      },
      {
        "id": "tvmaze:1580449",
        "title": "Adventure Hunt, Uniform, Pristine Cleansing Sprays, Aquapaw",
        "season": 10,
        "episode": 10,
        "released": "2019-01-13",
        "overview": "First into the tank are brothers from Provo, Utah, who introduce their fun and adventurous treasure hunt game experience for cities across the country; entrepreneurs from Cedarburg, Wisconsin, and New York City present their line of affordable and ethical streetwear that donates a school uniform to a child for every purchase; cousins from Dallas, Texas, present their eco-friendly product that helps wipe away your bum; entrepreneurs from San Jose, California, pitch their hands-free pet tool that makes bath time easier."
      },
      {
        "id": "tvmaze:1584594",
        "title": "Makeup Junkie Bags, Angel Shave Club, Kitty Kasas, Sonnet James",
        "season": 10,
        "episode": 11,
        "released": "2019-01-20",
        "overview": "First into the Tank is an entrepreneur from Willis, Texas, who introduces her lay-flat cosmetic bag design that allows for easy access to materials. Entrepreneurs from San Diego, California, pitch their online boutique subscription shave club exclusively intended for women; while entrepreneurs from Basalt, Colorado, and Newport Coast, California, present their functional cat furniture designs which are durable and easy to clean. Last into the Tank is a mom from Palo Alto, California, who provides comfortable and stylish play dresses for mothers with young children."
      },
      {
        "id": "tvmaze:1587196",
        "title": "ZuGoPet, Obvious Wines, Twist It Up Comb, Monti Kids",
        "season": 10,
        "episode": 12,
        "released": "2019-01-27",
        "overview": "First into the Tank are entrepreneurs from Austin, Texas, and Cour d'Alene, Idaho, who pitch their safety product that specializes in confidently helping people travel with their pets; an entrepreneur from Venice Beach, California, introduces his collection of curated wines with straight-forward labels for a snob-free client; an entrepreneur from North Hollywood, California, presents his twist on an urban centric hair product to help amplify natural curls; last into the Tank is an entrepreneur from Oakland, California, who provides a subscription service that delivers Montessori Method-approved toys to families with young children."
      },
      {
        "id": "tvmaze:1593176",
        "title": "Life Lift Systems, Fresh Bellies, SubSafe, Zorpads",
        "season": 10,
        "episode": 13,
        "released": "2019-01-27",
        "overview": "First into the Tank are entrepreneurs from Oklahoma City, Oklahoma, who introduce their innovative storm shelter/safe house design that can provide people safety in the comfort of their own home. An entrepreneur from White Plains, New York, presents her fresh baby food that trains babies to acquire a more sophisticated palette. Entrepreneurs from Port Orange, Florida, pitch their multi-use sandwich container product that keeps your sandwich safe, never soggy. Last into the Tank are entrepreneurs from New York, New York, and Venice, California, who pitch their space age solution for stinky feet."
      },
      {
        "id": "tvmaze:1593177",
        "title": "Zookies Cookies, CurlMix, GOGA Goat Yoga, Shower Toga",
        "season": 10,
        "episode": 14,
        "released": "2019-03-03",
        "overview": "First into the Tank are entrepreneurs from Raleigh, North Carolina, who introduce their bake-at-home, all-natural treats. Entrepreneurs from Chicago, Illinois, pitch their clean beauty product made specifically for women with curly hair; while entrepreneurs from Austin, Texas, present their unique twist on yoga with the help from a surprising source. Last into the Tank is an entrepreneur from Woodstock, Georgia, who pitches her waterproof product that allows you to shower in public with privacy."
      },
      {
        "id": "tvmaze:1610892",
        "title": "Jolly Roger Telephone Co., Toybox Labs, Goalsetter, Moink",
        "season": 10,
        "episode": 15,
        "released": "2019-03-10",
        "overview": "First into the Tank are entrepreneurs from Arcadia and Folsom, California, who have a solution to fight back against bothersome telemarketers and scammers. Entrepreneurs from Oakland, California, present their easy-to-use 3D printer for kids to design and print their own toys, while an entrepreneur from New York, New York, pitches her savings and gifting online platform to help kids learn to save. Last into the Tank is an entrepreneur from Labelle, Missouri, who familiarizes the Sharks with her ethical and customizable meat box subscription delivery service."
      },
      {
        "id": "tvmaze:1613400",
        "title": "Urban Float, Wild Earth, Kudo Banz, Pooch Selfie",
        "season": 10,
        "episode": 16,
        "released": "2019-03-17",
        "overview": "First into the Tank are entrepreneurs from Seattle, Washington, who introduce their spa design that relies on innovative, alternative therapy to relieve common aches and pains. An entrepreneur from Oakland, California, is at the forefront of the future of food by creating sustainable protein in a lab. When a family from Shelton, Connecticut, present their kid's reward system, the kids take over the pitch; and last into the Tank is an entrepreneur from San Diego, California, who pitches his simple but ingenious device which helps you capture frame-worthy pictures with your best friend."
      },
      {
        "id": "tvmaze:1618638",
        "title": "Press Waffle Co., SilkRoll, Pick-Up Pools, Dare-U-Go",
        "season": 10,
        "episode": 17,
        "released": "2019-03-24",
        "overview": "First into the Tank are brothers from Richardson, Texas, who introduce their decadent breakfast treat, authentic to a European staple; and entrepreneurs from San Francisco, California, pitch their online fashion trading platform with the aim of helping women save money while also easing the environmental impact of clothing manufacturing. Then, an active duty soldier from Leavenworth, Kansas, presents his idea for everyone to conveniently and affordably have a swimming pool; and last into the Tank is a mom from Los Angeles, California, who pitches her clever twist on a traditional children's product that is designed to help mom's on the go."
      },
      {
        "id": "tvmaze:1623511",
        "title": "Nuchas, HavenLock, Kanga, CertifiKID",
        "season": 10,
        "episode": 18,
        "released": "2019-04-07",
        "overview": "First into the Tank is an entrepreneur from North Bergen, New Jersey, who introduces a traditional hand-held food snack from his Argentinian culture. Entrepreneurs from Nashville, Tennessee, pitch their smart security product to help keep intruders out of the home. A trio of entrepreneurs from Clemson, South Carolina, present their convenient beverage carrier product designed to help keep items cold. Last into the Tank are a husband and wife from Potomac, Maryland, who introduce their online tool which helps offer a wide variety of family activities at an incredible discount."
      },
      {
        "id": "tvmaze:1627191",
        "title": "Pricetitution, Hydroviv, Flip-It! Cap, Luma Soda",
        "season": 10,
        "episode": 19,
        "released": "2019-04-14",
        "overview": "First into the Tank is an entrepreneur from Wilmette, Illinois, who introduces his socially interactive, hilarious party game that will reveal much more about your friends than you may want to know. An entrepreneur from Washington, D.C., pitches his customized household product that ensures the safety of your family. An entrepreneur from Tenafly, New Jersey, presents his reusable bottle-emptying device for an easy solution to getting every last drop from your product. Last into the Tank is an entrepreneur from Mountain View, California, who introduces his healthy alternative to soda."
      },
      {
        "id": "tvmaze:1629866",
        "title": "Mavens Creamery, Spare, Swoveralls, Somnifix",
        "season": 10,
        "episode": 20,
        "released": "2019-04-21",
        "overview": "First into the Tank are sisters from San Jose, California, who combine two delectable desserts into one amazing treat. An entrepreneur from West Hollywood, California, pitches his modern alternative to traditional ATM machines. An entrepreneur from New York City presents his clothing design for both men and women that combines two comfortable fashion trends into one. Last into the Tank is an entrepreneur from Mclean, Virginia, who introduces his hypoallergenic sleeping product that helps reduce snoring and dry mouth."
      },
      {
        "id": "tvmaze:1637646",
        "title": "Basepaws, Best Pocket Square Holder, Kymera Body Boards, The Bang Shack",
        "season": 10,
        "episode": 21,
        "released": "2019-04-28",
        "overview": "First into the Tank is an entrepreneur from Redondo Beach, California, who pitches her high-tech product to discover hidden secrets about your cat. An entrepreneur from St. Louis, Missouri, presents his men's fashion accessory that will help every man look extra refined, and a former \"Shark Tank\" entrepreneur from Pleasantville, California, who was shredded by the Sharks during his first visit, returns to the Tank for his shot at redemption with his line of all-electric water sports equipment. Last into the Tank is an entrepreneur from Miami Gardens, Florida, who introduces his delicious, multipurpose dip."
      },
      {
        "id": "tvmaze:1641078",
        "title": "cubicall, Doughp, SauceMoto, DESKVIEW",
        "season": 10,
        "episode": 22,
        "released": "2019-05-05",
        "overview": "First into the Tank are entrepreneurs from Van Nuys, California, who introduce their efficient privacy solution to open-office plan distractions with their modern phone booth design. An entrepreneur from San Francisco, California, shares her unconventional dessert concept that serves a childhood favorite snack. Entrepreneurs from Cleveland, Ohio, present their handy device that helps you easily enjoy all your favorite fast-food condiments on the go. Last into the Tank are entrepreneurs from Chicago, Illinois, who pitch their portable office furniture design to help you escape from your traditional working desk and also help to improve your health."
      },
      {
        "id": "tvmaze:1645304",
        "title": "Quikflip, Coyote Vest, BatBnB, Fat Shack",
        "season": 10,
        "episode": 23,
        "released": "2019-05-12",
        "overview": "First into the Tank are entrepreneurs from Fort Collins, Colorado, who present their fast-casual restaurant focusing on late-night food done right. Entrepreneurs from Lexington, Kentucky, pitch their line of designer bat houses for an effective natural solution to pest control. A husband and wife duo from San Diego, California, introduce their stylish product that keeps your pet safe from predators. Last into the Tank is a world-renowned jiujitsu instructor from Torrance, California, who solves a problem that we never knew we had with his dual fashion design. The Sharks in this episode are Mark Cuban, Kevin O'Leary, Lori Greiner, Robert Herjavec and Daymond John."
      },
      {
        "id": "tvmaze:1677404",
        "title": "Blueland, MinusCal, The Baby Toon, TaDash",
        "season": 11,
        "episode": 1,
        "released": "2019-09-29",
        "overview": "Entrepreneurs from New York City pitch their eco-friendly cleaning supply company which helps reduce plastic waste, while entrepreneurs from Nashville, Tennessee, introduce a science-based snack bar that blocks the absorption of fat when you eat it. An impressive 10-year old \"kidprenuer\" and her a mom from Honolulu, Hawaii, pitch her safe and fun baby spoon design that eliminates the long sharp design of a traditional spoon. And an entrepreneur from Alexandria, Virginia, presents his frozen food brand that delivers authentic, plant-based East Mediterranean cuisine while also helping with social change."
      },
      {
        "id": "tvmaze:1717976",
        "title": "Circadian Optics, Boost Oxygen, Face Yoga, Atlas Monroe",
        "season": 11,
        "episode": 2,
        "released": "2019-10-06",
        "overview": "A Malaysian immigrant living in Minneapolis, Minnesota, fulfills her American dream by starting her light therapy lamp business. Entrepreneurs from Millford, Connecticut, introduce their portable oxygen in a can. An entrepreneur from Japan, living in Spring Valley, California, pitches her unusual solution to maintaining a youthful appearance. Finally, entrepreneurs from San Jose, California, with a plant-based version of a guilty pleasure make a shocking decision."
      },
      {
        "id": "tvmaze:1731797",
        "title": "Aira Wireless Charging Pad, Baobab Polo Shirts, Squid Socks, Eterneva Diamonds",
        "season": 11,
        "episode": 3,
        "released": "2019-10-13",
        "overview": "Entrepreneurs from Austin, Texas, bring a unique solution to remembering passed loved ones by turning their ashes into diamonds. While entrepreneurs from New York City claim they have redesigned the best version of a men's classic fashion staple. Entrepreneurs from San Diego, California, and Phoenix, Arizona, believe they have a game-changing innovation to wireless charging. And finally, a couple from Everett, Washington, claim to have finally solved the mystery of the missing baby sock."
      },
      {
        "id": "tvmaze:1742015",
        "title": "Bug Bite Thing, Snacklins, Knife Aid, Plop Star",
        "season": 11,
        "episode": 4,
        "released": "2019-10-20",
        "overview": "Entrepreneurs from Malibu, California, have modernized an age-old craft by offering knife sharpening by mail. A mother-daughter duo from Jacksonville, Florida, introduces a simple yet ingenious device that offers relief for all who suffer from bug bites. While an entrepreneur from Western Springs, Illinois, pitches a bathroom product to help block odors before they start. Finally, a Muslim American from Rockville, Maryland, invented a vegan alternative to pork rinds."
      },
      {
        "id": "tvmaze:1742904",
        "title": "Tailgate N Go, Nerdit Now, GolfKicks, MyoStorm",
        "season": 11,
        "episode": 5,
        "released": "2019-10-27",
        "overview": "A family from Grand Junction, Colorado, introduce their portable product designed to bring all the conveniences of a kitchen to the great outdoors. Entrepreneurs from Wilmington, Delaware, present their mobile solution to help with gadget repair. Meanwhile, entrepreneurs from Denver, Colorado, pitch their stylish and affordable sports design that transforms sneakers into golf shoes. Finally, entrepreneurs from Provo, Utah, invented a product that helps relieve body pain and improve recovery."
      },
      {
        "id": "tvmaze:1742905",
        "title": "The Measuring Shovel, Pili Hunters, Supply, EZC Pak",
        "season": 11,
        "episode": 6,
        "released": "2019-11-03",
        "overview": "A 13-year-old from Gallatin, Tennessee, presents his ingenious improvement to a household gardening tool. An entrepreneur from Bend, Oregon, introduces the Sharks to the relatively unknown, lowest carb nut on the planet with his food product line. While a husband and wife duo from Fort Worth, Texas, pitch their safe design, engineered to provide a lifetime of perfect shaves. Finally, a surgeon from Los Angeles, California, presents his formulated immune support pack designed to reduce unnecessary antibiotic use."
      },
      {
        "id": "tvmaze:1742906",
        "title": "Baubles + Soles, Dog Threads. Peanut Butter Pump, The Yard Milkshake Bar",
        "season": 11,
        "episode": 7,
        "released": "2019-11-10",
        "overview": "An immigrant who once lived in a refugee camp and her husband, who now live in Huntington Beach, California, present their kid's shoe company that is designed to be fashionable and save money; entrepreneurs from Long Lake, Minnesota, introduce their fashion line for customers who want to be twins with their best friends; an entrepreneur from Burbank, California, pitches his kitchen tool which sparks a lively debate among the Sharks regarding peanut butter. Finally, a family of entrepreneurs from Gulf Shores, Alabama, introduces the Sharks to \"freak shakes.\""
      },
      {
        "id": "tvmaze:1744884",
        "title": "Gallant, Mrs. Goldfarb's Unreal Deli, Terra-Core Fitness, Outer",
        "season": 11,
        "episode": 8,
        "released": "2019-11-17",
        "overview": "An entrepreneur from Philadelphia, Pennsylvania, is banking on his cutting-edge stem cell technology to save pets from diseases in the future. A native New Yorker, who now lives in Los Angeles, California, introduces her healthier alternative to a traditional style deli meat; while an entrepreneur from Santa Monica, California, hopes his innovative and multifunctional exercise device will become the next multimillion-dollar hit in fitness. Finally, entrepreneurs from Santa Monica, California, introduce a genius innovation in outdoor furniture."
      },
      {
        "id": "tvmaze:1755819",
        "title": "Easy Treezy, Beardaments, Kit Lender, Little Elf",
        "season": 11,
        "episode": 9,
        "released": "2019-12-01",
        "overview": "An entrepreneur from Miami Gardens, Florida, presents his patented system that easily helps decorate and set up a Christmas tree in a matter of minutes. Santa and his elves from Murray, Utah, enter the tank with their fun and easy-to-attach body decor, while an entrepreneur from Stowe, Vermont, presents his web rental service that ships outdoor gear and apparel directly to you, wherever and whenever adventure strikes. Finally, an entrepreneur from West Boylston, Massachusetts, introduces his innovative tool to make holiday gift-wrapping easier."
      },
      {
        "id": "tvmaze:1773738",
        "title": "SlumberPod, Fortress Clothing, Zuum Technologies, FlexScreen",
        "season": 11,
        "episode": 10,
        "released": "2020-01-05",
        "overview": "A mother-daughter duo from Atlanta, Georgia, introduce the Sharks to their baby product that makes baby-travel less stressful by helping them sleep more restful. An entrepreneur from Mount Pleasant, Utah, introduces his cold-weather clothing line that keeps you warm, even when wet. While entrepreneurs from Happy Valley, Oregon, hope their portable transportation device will become the next multimillion-dollar hit. Finally, an entrepreneur from South Murrysville, Pennsylvania, pitches his genius innovation in window screens."
      },
      {
        "id": "tvmaze:1787303",
        "title": "Wise Pocket Products, Kreyol Essence, LoveSync, Wanna Date",
        "season": 11,
        "episode": 11,
        "released": "2020-01-12",
        "overview": "A 13-year-old entrepreneur from Bentonville, Arkansas, introduces the Sharks to her stylish and innovative line of socks that help hold important items close all while giving back. A couple from Miami, Florida, present their all-natural and ethical beauty product line, while a husband and wife duo from Cleveland, Ohio, hope the Sharks will invest in their sexy technological device which will help couples turn missed opportunities into more romance. Finally, an entrepreneur from New York City pitches her vegan alternative to nut butters with her sweet and healthy line of spreads."
      },
      {
        "id": "tvmaze:1787304",
        "title": "Genius Juice, Rapid Rope, Ready Set Food!, Ka-Pop",
        "season": 11,
        "episode": 12,
        "released": "2020-01-19",
        "overview": "An entrepreneur from Redondo Beach, California, introduces the Sharks to his healthy coconut beverage this week on Shark Tank. A husband and wife duo from Eagle, Idaho, present their unique twist to a typical household item, while entrepreneurs from Los Angeles, California, hope the Sharks will invest in their food allergy prevention system for babies. Finally, an entrepreneur from Erie, Colorado, pitches his healthy snack product line using an ancient grain."
      },
      {
        "id": "tvmaze:1794665",
        "title": "Bala Bangles, Shake it Pup. Pips & Bounce, Fur",
        "season": 11,
        "episode": 13,
        "released": "2020-02-28",
        "overview": "A husband and wife duo from Los Angeles, California, pitch their stylish weighted design that adds a constant but comfortable resistance to your workout. Entrepreneurs from Sunset Beach, California, try to get the Sharks to bite on their product that eliminates bland dog food and will get dogs excited to eat; while brothers from Portland, Oregon, seek an investment for their event space that features an American family-favorite game. Finally, entrepreneurs from New York City introduce their multipurpose hair and skin-softening product for the nether regions."
      },
      {
        "id": "tvmaze:1809708",
        "title": "Bite Toothpaste Bits, BabyQuip, Coconut Girl, PAIR Eyewear",
        "season": 11,
        "episode": 14,
        "released": "2020-03-06",
        "overview": "Entrepreneurs from Thousand Oaks, California, are reinventing the toothpaste game with their sustainable teeth-cleaning products, while a mother and son duo from San Francisco, California, introduce their convenient and affordable solution to helping families pack light and travel easier with baby gear. An entrepreneur from Los Angeles, California, enters the tank and presents a healthier version of a decadent treat. Finally, a pair of classmates from New York City pitch their customizable eyewear product line for kids."
      },
      {
        "id": "tvmaze:1813831",
        "title": "KidsLuv, Swimply, Space Traveler, Bertello",
        "season": 11,
        "episode": 15,
        "released": "2020-03-13",
        "overview": "Can a mother from Los Angeles, California, recover when the sharks discover the huge amount of money she has spent on her healthier beverage alternative for kids? An entrepreneur from Lakewood, New Jersey, believes he has the next AirBnB, while mothers from San Antonio, Texas, believe they have found the way to maintain peace and calm on car rides with kids. Brothers from Woodbury, Minnesota, present their portable and multifueled outdoor design to help you achieve authentic flavor when cooking a traditional Italian dish."
      },
      {
        "id": "tvmaze:1813832",
        "title": "Boho Camper Vans, Bohana, Grouphug, Safety Nailer",
        "season": 11,
        "episode": 16,
        "released": "2020-03-20",
        "overview": "A stylish and affordable mobile real estate concept; a snack with Indian roots; a portable solution to powering small tech devices; a new way to ensure safety while using tools; an update on apparel company Bombas; Rohan Oza is the guest shark."
      },
      {
        "id": "tvmaze:1815251",
        "title": "Pasta by Hudson, Goumi, Critter Pricker, The Frozen Farmer",
        "season": 11,
        "episode": 17,
        "released": "2020-03-27",
        "overview": "An Italian cuisine business; a fashion line that provides a functional solution to a common problem for babies; a humane pest control solution; a former beauty queen turns one of the biggest issues in farming into a business opportunity."
      },
      {
        "id": "tvmaze:1821138",
        "title": "Muvez, PrepWell, Beddley, Bad Birdie",
        "season": 11,
        "episode": 18,
        "released": "2020-04-03",
        "overview": "A group of entrepreneurs from Belleville, New Jersey, introduce their footwear brand dedicated to reinventing the traditional house slipper into your favorite sneaker. A former \"Shark Tank\" entrepreneur from San Diego, California, returns to the tank, this time pitching his online mentoring program that helps high school students and their parents navigate the college admissions process. An entrepreneur from Los Angeles, California, helps you make your bed in a fraction of the time with her bedding product, while a golfer from Pasadena, California, provides a fresh new twist on sports fashion with his apparel line."
      },
      {
        "id": "tvmaze:1821432",
        "title": "Just The Cheese, Neuro, Seriously Slime, First Saturday Lime",
        "season": 11,
        "episode": 19,
        "released": "2020-04-10",
        "overview": "An entrepreneur from Madison, Wisconsin, goes all in on his state's staple food. Can best friends from Los Angeles, California, convince the Sharks to invest in their energy product which keeps people awake and alert on the go? Moms from Evanston, Illinois, try to sell the Sharks on the business of slime with their play-driven environment for kids. Finally, a family of entrepreneurs from Okarche, Oklahoma, pitch their garden product designed to keep homes pest-free without risking harm to those inside."
      },
      {
        "id": "tvmaze:1835317",
        "title": "Fried Green Tomatoes, Little Burros, Jiggaerobics, Mural Painter",
        "season": 11,
        "episode": 20,
        "released": "2020-05-01",
        "overview": "An entrepreneur from Old Hickory, Tennessee, uses her Southern charm and cooking skills to pitch the Sharks on expanding her fried food empire. A father and daughter duo from Alexandria, Virginia, wheel in their gardening product as they ask the Sharks to help them add to their toolshed of ideas. An entertainer from Baton Rouge, Louisiana, gets the Sharks moving as he showcases his unique approach to exercise classes. Finally, a creative businesswoman from Queens, New York, paints the Sharks a picture of how to grow her service that connects customers with local artists."
      },
      {
        "id": "tvmaze:1860605",
        "title": "UnbuckleMe, Tanoshi, Proven, Van Robotics",
        "season": 11,
        "episode": 21,
        "released": "2020-05-06",
        "overview": "A mother and daughter from Houston, Texas, demonstrate their portable gadget designed as a solution to safely and quickly get children in and out of a car. A tech-savvy trio from San Francisco, California, pitches their lower-cost computer for kids to make technology accessible to more people. Another entrepreneur from San Francisco tries to sell the Sharks on a data-driven approach to personalized skincare with her product line. A computer scientist and engineer from Columbia, South Carolina, shares a device created to bring a robot revolution to children's education."
      },
      {
        "id": "tvmaze:1860601",
        "title": "Tough Tie, Lord von Schmitt, DadWare, Potty Safe",
        "season": 11,
        "episode": 22,
        "released": "2020-05-08",
        "overview": "A pair of entrepreneurs from Mesa, Arizona, hope to sell millennials on a modern version of a fading fashion trend for men. An eccentric crafter from Nevada City, California, pitches the Sharks on investing in his far-out textiles brand. A father from North Hollywood, California, showcases his clothing design which helps to comfortably bring dads and their babies closer together, while a husband and wife from Exeter, Missouri, have a solution to one of childhood's messiest milestones."
      },
      {
        "id": "tvmaze:1860606",
        "title": "mcSquares, Rescue Ready, Slate Milk, Salted",
        "season": 11,
        "episode": 23,
        "released": "2020-05-13",
        "overview": "This week on Shark Tank, an entrepreneur from Denver, Colorado, has an ingenious line of office products that makes working or learning more functional and eco-friendly. Firefighters from Norfolk, Virginia, believe they have a safety product that will save lives. A pair of entrepreneurs from Westwood, Massachusetts, introduce their healthy take on a favorite childhood drink, while a restaurateur from Los Angeles, California, pitches the Sharks what he believes is the future of restaurants."
      },
      {
        "id": "tvmaze:1860607",
        "title": "Dreamland Baby, The Mad Optimist, RollinGreens, Yellow Leaf Hammocks",
        "season": 11,
        "episode": 24,
        "released": "2020-05-15",
        "overview": "A mom from Danville, California, believes she has the solution to help your babies sleep through the night. Entrepreneurs from Bloomington, Indiana, introduce the Sharks to their ethical business model for their personalized body care brand; while a husband and wife from Boulder, Colorado, pitch their healthier plant-based alternative of a favorite comfort food. Entrepreneurs from San Francisco, California, present their stylish and ethically minded version of a comfortable outdoor accessory."
      },
      {
        "id": "tvmaze:1920512",
        "title": "Touch Up Cup, SparkCharge, GarmaGuard, Rumpl Blankets",
        "season": 12,
        "episode": 1,
        "released": "2020-10-16",
        "overview": "A father and his 15-year-old son from Cincinnati, Ohio, help the Sharks get creative while sharing their solution for storing paint efficiently. Two tech-savvy entrepreneurs from Somerville, Massachusetts, put the pedal to the metal when they show off their portable electric vehicle charger. A husband and wife from Milltown, New Jersey, think they can smell success as they pitch their product designed to keep garments safe from bacteria and odor, while an entrepreneur from Portland, Oregon, tries to convince the Sharks he's brought blankets into the 21st century."
      },
      {
        "id": "tvmaze:1950710",
        "title": "BootayBag, GoOats, Pooch Paper, P-Nuff Crunch",
        "season": 12,
        "episode": 2,
        "released": "2020-10-23",
        "overview": "An entrepreneur from San Francisco, California, tries to show the Sharks the upside of investing in her women's undergarment subscription service. A chef from Falls Church, Virginia, thinks he's found the recipe for success when he brings out his effortless approach to a classic breakfast meal. An entrepreneur from New York City shows the Sharks her eco-friendly alternative to collecting dog waste, while a scientist and former competitive body builder from West Orange, New Jersey, asks the Sharks to work it out as he pitches his healthy take on a beloved snack food."
      },
      {
        "id": "tvmaze:1950800",
        "title": "Hug Sleep, Animated Lure, The Cereal Killerz KItchen, Chirp",
        "season": 12,
        "episode": 3,
        "released": "2020-10-30",
        "overview": "A husband and wife from Milwaukee, Wisconsin, try and get in bed with the Sharks as they pitch their adult swaddle design. Entrepreneurs from Plano, Texas, try and reel in the Sharks with their inventive approach to fish luring. A husband and wife from Las Vegas, Nevada, share their killer idea for a retail franchise that serves a variety of cereal-centric treats, while an entrepreneur from Provo, Utah, works to convince the Sharks he isn't stretching the truth about his product designed to relieve back pain."
      },
      {
        "id": "tvmaze:1953737",
        "title": "JADA Spices, Surprise Cake, Mighty Carver, Flipstik",
        "season": 12,
        "episode": 4,
        "released": "2020-11-06",
        "overview": "A healthy alternative to salt; a spring-loaded cake stand; an entertaining approach to the tried-and-true carving knives often used during holidays; a product designed to attach a cellphone to almost any surface."
      },
      {
        "id": "tvmaze:1964647",
        "title": "FitFighter, Liftid, Foam Party Hats, Honeywine",
        "season": 12,
        "episode": 5,
        "released": "2020-11-13",
        "overview": "A unique fitness system; a high-tech headband designed to provide the brain with a boost of energy; festive party hats; a wine made from honey."
      },
      {
        "id": "tvmaze:1964648",
        "title": "Pan's, K9 Mask®, Moment, Prime 6",
        "season": 12,
        "episode": 6,
        "released": "2020-11-20",
        "overview": "A vegan version of a classic grab-and-go snack; pandemic-inspired masks; a stress-reducing beverage; a product designed to make grilling an eco-friendly experience."
      },
      {
        "id": "tvmaze:1972418",
        "title": "Holiball, Katamco, ODR Skis, Buckle Me Baby Coats",
        "season": 12,
        "episode": 7,
        "released": "2020-12-04",
        "overview": "A line of giant, inflatable holiday ornaments; a solution for lingering in the bathroom; a unique way to shred on the slopes; a safety hazard for kids in the winter."
      },
      {
        "id": "tvmaze:1975778",
        "title": "Peekabo, Brake Free Technologies, Click & Carry, Pillar Learning",
        "season": 12,
        "episode": 8,
        "released": "2020-12-11",
        "overview": "An entrepreneur from Surfside, Florida, pitches a classic dessert with a healthy twist. Two safety-oriented engineers from Littleton, Colorado, share their product designed to boost visibility while navigating the streets. An entrepreneur from Los Angeles pitches a hands-free gadget. Three entrepreneurs from Miami pitch an educational robot."
      },
      {
        "id": "tvmaze:1988126",
        "title": "Electra, ALL33, His and Her, Trophy Smack",
        "season": 12,
        "episode": 9,
        "released": "2021-01-08",
        "overview": "A former WNBA player knows what athletes want in a sports drink; an entrepreneur enlists the help of a superstar to show off his work from home necessity; a couple's secret to \"sexy time.\""
      },
      {
        "id": "tvmaze:2001100",
        "title": "Slice of Sauce, Love is Project, Luna Magic, Bubbly Blaster",
        "season": 12,
        "episode": 10,
        "released": "2021-01-15",
        "overview": "A twist on traditional sauces; artisan-made designs inspired by the craftsmanship of each country; a vibrant beauty and lifestyle brand that celebrates the creators' multicultural heritage."
      },
      {
        "id": "tvmaze:2003117",
        "title": "Quevos, Brumachen, Aura Bora, SwipenSnap",
        "season": 12,
        "episode": 11,
        "released": "2021-01-22",
        "overview": "Entrepreneurs from Chicago, Illinois, pitch their take on a traditional snack food. An immigrant from Ghana and a social media star from Indianapolis, Indiana, bring pitch their single-serve all-in-one portable product. A husband-and-wife duo from San Francisco, California, presents their beverage line made from real herbs, fruits and flowers. An entrepreneur from Houston, Texas, makes taking care of newborns a little easier. Season 11's kidpreneur Cassidy Crawley updates us on her Honolulu, Hawaii-based, two-in-one chew toy and baby spoon company, Baby Toon."
      },
      {
        "id": "tvmaze:2010988",
        "title": "Rule Breaker, MountainFlow Eco-Wax, Yono Clip, NightCap",
        "season": 12,
        "episode": 12,
        "released": "2021-02-05",
        "overview": "Entrepreneurs from Atlanta, Georgia, pitch a product to keep belongings germ-free. A brother-and-sister duo from West Palm Beach, Florida, have invented a way to prevent drink spiking. An entrepreneur from Brooklyn, New York, pitches her guilt-free vegan treats. An entrepreneur from Carbondale, Colorado, pitches an eco-friendly way to shred the slopes. Season 2 Kimberly Nelson and season 6 Jeff and Jennifer Martin update us on how their companies Daisy Cake &amp; Pipcorn, are doing."
      },
      {
        "id": "tvmaze:2022294",
        "title": "Jax Sheets, The Pizza Cupcake, IceBeanie, Draft Top",
        "season": 12,
        "episode": 13,
        "released": "2021-02-12",
        "overview": "An entrepreneur from St. Paul, Minnesota, pitches his self-cleaning bedding. A husband and wife from New York City introduce their twist on an Italian food snack. An entrepreneur from Santa Cruz, California, pitches his line of cool headwear designed to eliminate tension headaches. A duo from Longbranch, New Jersey, demonstrates how one can turn any aluminum can of beer into a draft beer experience."
      },
      {
        "id": "tvmaze:2022584",
        "title": "Pashion Footwear, Souper Cubes, Byoot Company, Sienna Sauce",
        "season": 12,
        "episode": 14,
        "released": "2021-02-19",
        "overview": "An entrepreneur from San Luis Obispo, California, pitches high heels that are sexy and comfortable. A husband and wife from Los Angeles pitches a solution for a common food storage issue. Entrepreneurs from Le Claire, Iowa, present their solution to a common frustration with women's bathing suits. A kidpreneur and her mom from Houston, Texas, persevere through hardship to launch a successful sauce company."
      },
      {
        "id": "tvmaze:2026673",
        "title": "Better Bedder, Everything Legendary, Walkee Paws, Hopscotch",
        "season": 12,
        "episode": 15,
        "released": "2021-02-26",
        "overview": "Two friends from Mandeville, Louisiana, introduce their bedding product to make bed-making more convenient. A trio of entrepreneurs from Hyattsville, Maryland, pitch their delicious plant-based take on a classic favorite food. An entrepreneur from New York City shows the Sharks an easy way to walk your dog without tracking dirt and germs. Another entrepreneur from Brooklyn, New York, presents her fun educational app designed to help kids learn coding."
      },
      {
        "id": "tvmaze:2035961",
        "title": "Simply Good Jars, Pinch Me Therapy Dough, Muff Waders, Busy Baby Mat",
        "season": 12,
        "episode": 16,
        "released": "2021-03-05",
        "overview": "A chef from Philadelphia, Pennsylvania, introduces his way to eat healthier meals. An entrepreneur from Lewes, Delaware, pitches her line of stress-relief tools. A pair of entrepreneurs from Holstein, Iowa, pitch their innovative apparel that keeps your drinks cool and your hands free. An entrepreneur from Rochester, Minnesota, shares her solution to keeping babies busy and entertained."
      },
      {
        "id": "tvmaze:2040896",
        "title": "Misfit Foods, Chill Systems, Tandem Boogie, Totes Babies",
        "season": 12,
        "episode": 17,
        "released": "2021-03-12",
        "overview": "An entrepreneur from Brooklyn, New York, pitches his eco-friendly approach to sausage making. Two entrepreneurs from Los Angeles pitch their ultra-portable product designed to keep things cool. A family from San Clemente, California, pitch their unique take on riding the waves. A father and daughter from Naperville, Illinois, pitch a stress-free solution for a common problem parents face while shopping with their newborn."
      },
      {
        "id": "tvmaze:2042890",
        "title": "NuMilk, Hairy Grabster, Mad Rabbit, Bunch Bikes",
        "season": 12,
        "episode": 18,
        "released": "2021-03-26",
        "overview": "Two entrepreneurs from New York City pitch a vegan take on a beloved drink. A husband and wife from Orland Park, Illinois, pitch their product designed to remove hair from your hands in the shower or bath. Entrepreneurs from Cleveland, Ohio, and Accra, Ghana, pitch their product designed to enhance a tattoo. An entrepreneur from Denton, Texas, pitches family biking with his electric bike company."
      },
      {
        "id": "tvmaze:2056904",
        "title": "StepNpull, DynoSafe, Probiotic Maker, Phoozy",
        "season": 12,
        "episode": 19,
        "released": "2021-04-02",
        "overview": "An entrepreneur from Springfield, Missouri, shares his invention that helps prevent the spread of germs like COVID-19. A husband-and-wife duo from Scottsdale, Arizona, introduce their refrigerated safe that makes contactless delivery more secure. An entrepreneur from South Jordan, Utah, hopes his idea for an at-home probiotic maker grows on the Sharks. A pair of entrepreneurs from Charlotte, North Carolina, and Atlanta, Georgia, respectively, is over the moon about their spacesuit-influenced gadget guard."
      },
      {
        "id": "tvmaze:2056905",
        "title": "OpulenceMD Beauty, The Cheese Chopper, The Matte, FurZapper",
        "season": 12,
        "episode": 20,
        "released": "2021-04-09",
        "overview": "An ophthalmologist from Greensboro, North Carolina, pitches her beauty product that combines luxury and glamour with safety and quality. An entrepreneur from Aurora, Oregon, pitches an easy way to cut cheese. An entrepreneur from Acton, Massachusetts, pitches her beauty organizer space saver. Two entrepreneurs from Ocean County, New Jersey, introduces their reusable and effective approach to removing pet hair from clothes."
      },
      {
        "id": "tvmaze:2056906",
        "title": "Truffle Shuffle, Suds2Go, Salad Sling, Larq",
        "season": 12,
        "episode": 21,
        "released": "2021-04-16",
        "overview": "Two chefs make a major pivot when the pandemic nearly derailed their business based on a perishable, rare ingredient; a handwashing device; a quick and easy approach to drying greens; a self-cleaning water bottle; an update on Yellow Leaf Hammocks."
      },
      {
        "id": "tvmaze:2063719",
        "title": "Jiggy Puzzles, The Scrubbie, The Bumbling Bee, XTorch",
        "season": 12,
        "episode": 22,
        "released": "2021-04-23",
        "overview": "A new way to experience art; an innovative cleaning tool; vegan food that isn't boring; a portable and rechargeable solar-powered device; an update on Bug Bite Thing, an insect sting treatment company."
      },
      {
        "id": "tvmaze:2073577",
        "title": "Grind, Creation Nation, Sneakerasers, BEERMKR",
        "season": 12,
        "episode": 23,
        "released": "2021-05-07",
        "overview": "A portable basketball shooting machine; no-bake and nutritious snacks; an instant sneaker cleaner; an all-in-one beer-making device; an update on Boost, a portable oxygen canister company; guest Shark Alex Rodriguez."
      },
      {
        "id": "tvmaze:2077214",
        "title": "Pluto, FlingGolf, FloatNGrill, The Original Stretchlace",
        "season": 12,
        "episode": 24,
        "released": "2021-05-14",
        "overview": "An innovative system which helps create a custom pillow based on sleep profiles; a fun alternative to a traditional sport; a grilling product idea; an idea stretches the boundaries of what it means to wear functional shoes with ease."
      },
      {
        "id": "tvmaze:2092754",
        "title": "Dino Don, Copper Cow Coffee, Lit Handlers, Super Potty Trainer",
        "season": 12,
        "episode": 25,
        "released": "2021-05-21",
        "overview": "A husband and wife from Philadelphia, Pennsylvania, pitch life sized, scientifically accurate, animatronic dinosaurs! An entrepreneur from Los Angeles, California, pitches the virtues of a popular caffeinated Vietnamese beverage. An entrepreneur from Buna, Texas, pitches her beverage coolers. A pair of entrepreneurs from San Andrés, Colombia, and Simpsonville, South Carolina, introduce their tool that helps parents conquer potty training."
      },
      {
        "id": "tvmaze:2165351",
        "title": "Kin Apparel, Uprising Food, Lion Latch, Pashko",
        "season": 13,
        "episode": 1,
        "released": "2021-10-08",
        "overview": "Guest shark Emma Grede; a line of functional apparel and accessories; a healthy superfood product; a way to store jewelry when on the go; a New York fashion designer who wants to transform the way clothes are manufactured in America."
      },
      {
        "id": "tvmaze:2189715",
        "title": "Songlorious, MuteMe, Proper Good, Long Wharf Supply Co.",
        "season": 13,
        "episode": 2,
        "released": "2021-10-15",
        "overview": "Guest shark Peter Jones; a one-of-a-kind custom song service; a work-from-home product that increases productivity; a mail-order meal service; an apparel company focused on helping clean the world's oceans."
      },
      {
        "id": "tvmaze:2189716",
        "title": "Sparketh, Oat Haus, Flasky Flowers, Incredible Eats",
        "season": 13,
        "episode": 3,
        "released": "2021-10-22",
        "overview": "A learning platform to empower students to reach their creative potential through art; an oat-based spread; a boozy spin on a wedding day essential; a fun and edible innovation designed to reduce single-use plastics; guest shark Daniel Lubetzky."
      },
      {
        "id": "tvmaze:2192222",
        "title": "TheMagic5, Tabby, SoaPen, 54 Thrones",
        "season": 13,
        "episode": 4,
        "released": "2021-10-29",
        "overview": "Guest shark Nirav Tolia; a solution to a problem for swimmers; a tool to help cat lovers find their perfect match; a product designed to encourage children to wash their hands; a beauty line inspired by a woman's African heritage."
      },
      {
        "id": "tvmaze:2195824",
        "title": "Wedfuly, Wad-Free, Beulr, Spergo",
        "season": 13,
        "episode": 5,
        "released": "2021-11-05",
        "overview": "An online wedding planning service; a gadget that prevents bedding from tangling, twisting and balling up; an unconventional way to avoid early morning meetings; a trendy clothing brand designed to inspire youth all over the world."
      },
      {
        "id": "tvmaze:2205754",
        "title": "Fish Fixe, Hello Prenup, DEUX, Hidrent",
        "season": 13,
        "episode": 6,
        "released": "2021-11-12",
        "overview": "Nextdoor co-founder Nirav Tolia guest sharks; a healthy food delivery service; an online platform for couples about to tie the knot; a nutritious take on a classic dessert; an online tool to help off-duty firefighters make additional income."
      },
      {
        "id": "tvmaze:2211597",
        "title": "Sheets Laundry Club, Pink Picasso, Love & Pebble, Zach and Zoë Sweet Bee Farm",
        "season": 13,
        "episode": 7,
        "released": "2021-11-19",
        "overview": "Daniel Lubetzky guest sharks; an innovative cleaning alternative for every household; a reinvention of a childhood favorite; a surprising approach to skin care; an update on Dude Wipes."
      },
      {
        "id": "tvmaze:2219082",
        "title": "Wendy's Gnome Shop, Ornament Anchor, The Real Elf, Santa's Enchanted Mailbox",
        "season": 13,
        "episode": 8,
        "released": "2021-12-10",
        "overview": "Four entrepreneurs try to glean some cash and make a deal with the sharks with their slate of seasonally appropriate pitches and products."
      },
      {
        "id": "tvmaze:2219083",
        "title": "MAXPRO, Banana Loca, Liberate, Tenikle",
        "season": 13,
        "episode": 9,
        "released": "2021-12-17",
        "overview": "An innovative fitness system with on-the-go simplicity; a kitchen gadget; an online self-care program for a different type of workout; a sea creature-inspired all-in-one product for hands-free device holding; an update on Legendary Burgers."
      },
      {
        "id": "tvmaze:2237737",
        "title": "Snactiv, The SMART Tire Company, Candi, Black Sands Entertainment",
        "season": 13,
        "episode": 10,
        "released": "2022-01-07",
        "overview": "Guest shark Kevin Hart; a fun tool that takes snacking to the next level; a product made from space-age materials; an online social network that allows fans to have a real connection with their favorite celebrities and influencers."
      },
      {
        "id": "tvmaze:2245384",
        "title": "VaBroom, Must Love, RomperJack, Roq Innovation",
        "season": 13,
        "episode": 11,
        "released": "2022-01-14",
        "overview": "Budding entrepreneurs get the chance to bring their dreams to fruition, presenting their ideas to five titans of industry who succeeded in making their own dreams a reality."
      },
      {
        "id": "tvmaze:2252469",
        "title": "Tania Speaks Organic Skincare, TA3 Swim, HiccAway, Tristen Ikaika",
        "season": 13,
        "episode": 12,
        "released": "2022-01-21",
        "overview": "An easy-to-use organic skin care product line born from a personal need; confidence-boosting swimwear; a convenient tool that helps combat an annoying problem; a jewelry brand made from a unique recycled material; an update on Bunch Bikes."
      },
      {
        "id": "tvmaze:2255021",
        "title": "Kettle Gryp, Calm Strips, The Blowzee, OverEZ Chicken Coops",
        "season": 13,
        "episode": 13,
        "released": "2022-01-28",
        "overview": "A portable tool that instantly turns any standard dumbbell into a dynamic workout; a product to help soothe anxiety; a device that allows for blowing out birthday candles without spreading germs; a chicken coop creation built by Amish craftsmen."
      },
      {
        "id": "tvmaze:2263112",
        "title": "Range Beauty, Diaper Dust, Pinole Blue, Junobie",
        "season": 13,
        "episode": 14,
        "released": "2022-02-25",
        "overview": "Good American CEO Emma Grede guest judges; a line of beauty products formulated for melanin-rich skin; a product to help eliminate diaper odor; a line of products made from an ancient superfood; a way to help new moms during breastfeeding."
      },
      {
        "id": "tvmaze:2277005",
        "title": "Episode 15",
        "season": 13,
        "episode": 15,
        "released": "2022-03-11",
        "overview": "All-natural personal care products; a customizable fashion design for sports fans; support system exclusively for women; Nigerian immigrants celebrate their African heritage with their children's fashion clothing line; an update on Touch Up Cup."
      },
      {
        "id": "tvmaze:2279059",
        "title": "Episode 16",
        "season": 13,
        "episode": 16,
        "released": "2022-03-18",
        "overview": "A product meant for beach hangs."
      },
      {
        "id": "tvmaze:2286096",
        "title": "Episode 17",
        "season": 13,
        "episode": 17,
        "released": "2022-03-25",
        "overview": "A plant-based natural hair care line intentionally crafted for multicultural young men; a solution to help pet parents keep their dogs calm during loud events; a healthy snack made from an ancient superfood; a former athlete combines art and play."
      },
      {
        "id": "tvmaze:2294618",
        "title": "Umaro Foods, FORT, No Limbits, Apolla Performance",
        "season": 13,
        "episode": 18,
        "released": "2022-04-01",
        "overview": "Guest judge Emma Grede; a healthy alternative to bacon; a product designed to aid a favorite childhood activity; an adaptive clothing line with a mission to increase comfort for those struggling due to a disability; a product designed for dancers."
      },
      {
        "id": "tvmaze:2298853",
        "title": "LUCIDArt, SwiftPaws, BusyBox, Dirty Cookie",
        "season": 13,
        "episode": 19,
        "released": "2022-04-08",
        "overview": "A new take on a drawing tool."
      },
      {
        "id": "tvmaze:2302908",
        "title": "Cat Amazing, Lil Advents, HairFin, Browndages",
        "season": 13,
        "episode": 20,
        "released": "2022-04-15",
        "overview": "A product designed to keep your cat stimulated; a product used for potty-training; an entrepreneur presents his measuring tool for cutting hair; an inclusive product line providing aid to minor injuries; Mark Cuban gets an update on \"Trophy Smack.\""
      },
      {
        "id": "tvmaze:2312968",
        "title": "Cupbop, Plunge, Handy Pan, Hampton Adams",
        "season": 13,
        "episode": 21,
        "released": "2022-05-02",
        "overview": "A convenient new style of eating authentic Korean food; a product designed to help with one's wellness routine; a take on a common cooking tool; a version of a sports medicine product specifically designed for athletes; an update on Souper Cubes."
      },
      {
        "id": "tvmaze:2312970",
        "title": "Pulp Pantry, Kawaii Lighting, Pricklee, Ooakshell",
        "season": 13,
        "episode": 22,
        "released": "2022-05-06",
        "overview": "Treats utilizing recycled vegetable waste; a lighting product to help one look their best online; a hydrating beverage filled with antioxidants and made from a common desert plant; a fashion accessory; an update on Dino Don; guest shark Emma Grede."
      },
      {
        "id": "tvmaze:2331986",
        "title": "Stryx, Driftline, Springer, Chill-N-Reel",
        "season": 13,
        "episode": 23,
        "released": "2022-05-13",
        "overview": "Cosmetics to help clear up imperfections; a water sports apparel brand; a product designed to keep dogs hydrated during any excursion; a solution to drinking a beverage while fishing; an update on Doughp."
      },
      {
        "id": "tvmaze:2318237",
        "title": "The Transformation Factory, The Players Trunk, Aqua Boxing Glove, Project Pollo",
        "season": 13,
        "episode": 24,
        "released": "2022-05-20",
        "overview": "A line of health products using nature's most powerful superfood; an online marketplace designed to help athletes cash in on their fame; an all-in-one total body fitness tool; a plant-based approach to a fast food favorite."
      },
      {
        "id": "tvmaze:2375206",
        "title": "Shark Tank LIVE!",
        "season": 14,
        "episode": 1,
        "released": "2022-09-23",
        "overview": "Home viewers have a chance to weigh in on whether the Sharks should take the plunge and make a deal."
      },
      {
        "id": "tvmaze:2395661",
        "title": "The Woobles, Banana Phone, Turbo Trusser, Stealth Bros & Co",
        "season": 14,
        "episode": 2,
        "released": "2022-09-30",
        "overview": "A kit for teaching how to create cuddly animal characters; a trussing device designed to cook the perfect bird; a company that provides convenient personal storage for medical necessities; an update on Beatbox Beverages."
      },
      {
        "id": "tvmaze:2400321",
        "title": "Halloween Moments, Stakt, Mama O's, Create A Castle",
        "season": 14,
        "episode": 3,
        "released": "2022-10-07",
        "overview": "A unique tool for carving pumpkins; a foldable 2-in-1 fitness product; a new version of a traditional Korean dish; a sculpting play set designed for children."
      },
      {
        "id": "tvmaze:2408183",
        "title": "Storage Scholars, GHIA, Expedition Subsahara, Woosh",
        "season": 14,
        "episode": 4,
        "released": "2022-10-14",
        "overview": "A solution to make moving to and from college easier; an African-inspired home-decor line; a natural nonalcoholic beverage; a product for bringing clean air into homes; update on the Mad Rabbit tattoo aftercare line."
      },
      {
        "id": "tvmaze:2408285",
        "title": "Plufl, Bridal Babes, Big Bee Little Bee, Pretty Rugged",
        "season": 14,
        "episode": 5,
        "released": "2022-10-21",
        "overview": "Emma Grede, the CEO of Good American guest sharks; a napping product designed to reduce stress; a product which allows kids to unleash their creativity without the mess; a line of cozy accessories for the great outdoors."
      },
      {
        "id": "tvmaze:2418913",
        "title": "Collars & Co., SquareKeg, Nana Hats, WONDRY",
        "season": 14,
        "episode": 6,
        "released": "2022-11-11",
        "overview": "Guest shark Peter Jones; a luxury apparel line designed to elevate one's office look; a portable way to enjoy beverages on tap; a fruit preservation device; a fruit-infused wine collection; an update on Curie, a natural product line."
      },
      {
        "id": "tvmaze:2427089",
        "title": "Boarderie, Ride FRSH, ActionGlow, Legacy Shave",
        "season": 14,
        "episode": 7,
        "released": "2022-11-18",
        "overview": "An artisan cheese delivery service; a product line designed to keep cars fresh; a stylish lighting kit for sports equipment; a solution designed to refresh and enhance all shaving needs."
      },
      {
        "id": "tvmaze:2427657",
        "title": "HummViewer, Sliimeyhoney, FireFighter1, ShredSkinz",
        "season": 14,
        "episode": 8,
        "released": "2022-12-02",
        "overview": "Daniel Lubetzky guest sharks; a way to attract hummingbirds; easing anxiety with an entertaining product; a fire-defense system; a wearable fitness design makes it easier and faster to sweat; an update on Basepaws, a pet genetic testing company."
      },
      {
        "id": "tvmaze:2430727",
        "title": "ReadyFestive, ZipString, ChessUp, Garage Celebrations",
        "season": 14,
        "episode": 9,
        "released": "2022-12-09",
        "overview": "A customizable home decor delivery service; a hand-held product made for children; a better way to learn how to play a classic game; a reusable home decor design; an update on Ready Set Foods, a system for preventing food allergies in children."
      },
      {
        "id": "tvmaze:2451347",
        "title": "Long Table, VoChill, JicaFoods, Kudos",
        "season": 14,
        "episode": 10,
        "released": "2023-01-06",
        "overview": "Gwyneth Paltrow guest sharks; a healthier version of a favorite breakfast indulgence; a product designed to keep beverages crisp and cool; a low-calorie superfood alternative; an eco-friendly version of a baby product."
      },
      {
        "id": "tvmaze:2451348",
        "title": "Kinfield, Metric Mate, wildwonder, Cabinet",
        "season": 14,
        "episode": 11,
        "released": "2023-01-13",
        "overview": "DoorDash CEO Tony Xu; a clean beauty brand alternative; technology designed to help maximize progress at the gym; a modern twist on a traditional healthy beverage; a sustainable health care product line."
      },
      {
        "id": "tvmaze:2463420",
        "title": "Nopalera, Nutr, Brass Roots, Frescos Naturales",
        "season": 14,
        "episode": 12,
        "released": "2023-01-20",
        "overview": "Guest shark Daniel Lubetzky; a beauty line that uses an ancient symbol of Mexican culture; a product for healthy drinks; an allergen-free snack; an entrepreneur introduces beverages inspired by the flavors of his Latin American culture."
      },
      {
        "id": "tvmaze:2470834",
        "title": "FryAway, Anytongs, Copy Keyboard, Slick Barrier",
        "season": 14,
        "episode": 13,
        "released": "2023-01-27",
        "overview": "A nontoxic product that helps dispose of cooking oils safely; a tool that transforms eating utensils into a common kitchen accessory; a viral device designed to help save time and lessen fatigue; a product designed to keep critters out."
      },
      {
        "id": "tvmaze:2479382",
        "title": "FunkkOFF!, Retold Recycling, The Chub Rub Patch, Kahawa 1893",
        "season": 14,
        "episode": 14,
        "released": "2023-02-17",
        "overview": "Emma Grede guest sharks; a product aimed at keeping smiles fresh and bright; a solution to a growing problem in the apparel industry; an anti-chafing product; a beverage with African roots; an update on Cupboard Pro."
      },
      {
        "id": "tvmaze:2479383",
        "title": "Eat Your Flowers, Surf Band Pro, Youthforia, Big Mouth Toothbrush",
        "season": 14,
        "episode": 15,
        "released": "2023-03-03",
        "overview": "An edible flower company; a way to be active yet protected while under the sun; a clean makeup brand; a modern dental tool used for oral care; an update on Foam Party Hats."
      },
      {
        "id": "tvmaze:2495113",
        "title": "Pluie, FLATED, Woof, Sweetkiwi",
        "season": 14,
        "episode": 16,
        "released": "2023-03-10",
        "overview": "A self-sanitizing baby accessory; a storage solution for road trippers; a pet safety service; a nutrient-dense sweet indulgence."
      },
      {
        "id": "tvmaze:2499930",
        "title": "Crispy Cones, Chubby Buttons, Autio, Tngnt Ski Bikes",
        "season": 14,
        "episode": 17,
        "released": "2023-03-17",
        "overview": "Pitches include a twist on the traditional ice cream cone, a gadget to help control a cellphone safely while on the move, an app for travel enthusiasts and innovative winter equipment; update on Bee Sweet Lemonade."
      },
      {
        "id": "tvmaze:2508614",
        "title": "LavaBox, Bleni Blends, Happi Floss, The Ice Cream Canteen",
        "season": 14,
        "episode": 18,
        "released": "2023-03-31",
        "overview": "A portable product for those who enjoy camping without the dangers of creating a wildfire; a smoothie-making machine; an oral health product; a portable cooler accessory; an update on fashion business No Limbits; guest shark Daniel Lubetzky."
      },
      {
        "id": "tvmaze:2511911",
        "title": "Parting Stone, Cincha, Burlap & Barrel, Milkify",
        "season": 14,
        "episode": 19,
        "released": "2023-04-07",
        "overview": "Guest shark Gwyneth Paltrow; an alternative to cremation services; a stylish travel accessory; organic cooking spices; a convenient service for nursing mothers; an update on Yellow Leaf Hammocks."
      },
      {
        "id": "tvmaze:2517657",
        "title": "Honey Bunchies, Dapper Boi, Play Maysie, Tia Lupita Foods",
        "season": 14,
        "episode": 20,
        "released": "2023-04-14",
        "overview": "A nutrient-rich energy bar; a gender-neutral clothing brand; a portable children's toy; a healthy Mexican snack company."
      },
      {
        "id": "tvmaze:2532277",
        "title": "Nature's Wild Berry, See The Way I See, Noshi, You Go Natural",
        "season": 14,
        "episode": 21,
        "released": "2023-05-05",
        "overview": "Pitches include miracle berries, a clothing brand founded on mental health, edible food paint for children and satin-lined headwraps."
      },
      {
        "id": "tvmaze:2532279",
        "title": "Episode 22",
        "season": 14,
        "episode": 22,
        "released": "2023-05-19",
        "overview": "Pitches include a social media star's board game, HBCU collegiate fashion designs, a wardrobe accessory and an innovative eyewear design"
      },
      {
        "id": "tvmaze:2627483",
        "title": "Gatsby, Pie Wine, See Worthy, Gently Soap",
        "season": 15,
        "episode": 1,
        "released": "2023-09-29",
        "overview": "Products include a low-calorie chocolate, a wine to pair with pizza, a medical eye patch for children and an herbal soap for eczema."
      },
      {
        "id": "tvmaze:2655339",
        "title": "StormBag, Return Home, Matador, Toast-IT",
        "season": 15,
        "episode": 2,
        "released": "2023-10-06",
        "overview": "Guest Shark Daniel Lubetzky; products include a lightweight, reusable sandbag; an earth-friendly alternative to human composting; leggings for men; and toasty, ready-to-eat Latin American foods."
      },
      {
        "id": "tvmaze:2655341",
        "title": "Glove Wrap, Wellingtons, Bot-It, Dating By Blaine",
        "season": 15,
        "episode": 3,
        "released": "2023-10-13",
        "overview": "Guest Shark Michael Rubin; a bot service for consumers; frozen beef Wellingtons; a baseball glove wrapper; a dating advice service."
      },
      {
        "id": "tvmaze:2658112",
        "title": "PaddleSmash, Monosuit, Buena Papa, FairyTail Pet Care",
        "season": 15,
        "episode": 4,
        "released": "2023-10-20",
        "overview": "A portable outdoor game that combines pickleball and Spikeball; a pet-sitting service for weddings and events; a high-fashion bodysuit; gourmet made-to-order French fries."
      },
      {
        "id": "tvmaze:2658113",
        "title": "Thrill Builders, I Love Chamoy, Maniac Pumpkin Carvers, American Ghost Walks",
        "season": 15,
        "episode": 5,
        "released": "2023-10-27",
        "overview": "Entrepreneurs present spellbinding, spine-tingling business opportunities; Blumhouse CEO and founder Jason Blum joins the panel as a guest shark."
      },
      {
        "id": "tvmaze:2658114",
        "title": "Krapp Strapp, Mini Materials, TIK PIK, Supermix Studio",
        "season": 15,
        "episode": 6,
        "released": "2023-11-03",
        "overview": "An accessory for using the bathroom outdoors; a collection of tiny building materials for hobbyists; a stickable guitar pick; a line of customizable children's clothing."
      },
      {
        "id": "tvmaze:2658115",
        "title": "Bunny Eyez, The Fidget Game, REKKIE, Yum Crumbs",
        "season": 15,
        "episode": 7,
        "released": "2023-11-17",
        "overview": "Tilt-able and flippable reading glasses; an exciting educational game for kids; high-tech ski goggles; a line of delicious dessert toppings."
      },
      {
        "id": "tvmaze:2658116",
        "title": "Black Paper Party, Pick-Up Bricks, Snow in Seconds, Tomte Cake",
        "season": 15,
        "episode": 8,
        "released": "2023-12-08",
        "overview": "\"Shark Tank\" rings in the holiday season as the Sharks look to spread festive cheer to four new entrepreneurs. They are presented with business opportunities that are sure to turn anyone's spirit merry and bright."
      },
      {
        "id": "tvmaze:2691028",
        "title": "Rebel Cheese, The Pocket Panty, FlyWithWine, CAKES body",
        "season": 15,
        "episode": 9,
        "released": "2023-12-15",
        "overview": "Good American CEO Emma Grede guest Sharks; an artisanal vegan cheese company; emergency underwear; a suitcase designed for wine bottles; an alternative to the traditional bra."
      },
      {
        "id": "tvmaze:2707041",
        "title": "Fishwife, Dingle Dangle, VibeRide, Heather's Choice",
        "season": 15,
        "episode": 10,
        "released": "2024-01-12",
        "overview": "Sprinkles Cupcakes founder Candace Nelson returns as a guest shark. A modern tinned seafood company. A diaper changing helper. A brake for skateboards. Lightweight packable meals."
      },
      {
        "id": "tvmaze:2724614",
        "title": "The Table Tyke, Poplight, Like Air Puffcorn, The Duo",
        "season": 15,
        "episode": 11,
        "released": "2024-01-19",
        "overview": "A damage-free wall light; an umbrella with two handles; a silicone placemat with an edge; a gluten-free alternative to popcorn."
      },
      {
        "id": "tvmaze:2746073",
        "title": "Meat The Mushroom, BarBees, Jay's Pet Butter, Mama Sing My Song",
        "season": 15,
        "episode": 12,
        "released": "2024-01-26",
        "overview": "Recurring guest Shark and KIND Snacks founder Daniel Lubetzky returns to the Tank as entrepreneurs present vegan mushroom bacon, a mobile bartending class, healthy peanut butter for dogs and huggable plush toys that play custom songs for children."
      },
      {
        "id": "tvmaze:2746074",
        "title": "Genius Litter, Modern Picnic, AU Baby, TORCH",
        "season": 15,
        "episode": 13,
        "released": "2024-02-02",
        "overview": "Kitty litter that signals health issues; a chic lunch box; high-performance baby blankets; bodysuits designed for women in uniform; Good American CEO Emma Grede returns as guest shark."
      },
      {
        "id": "tvmaze:2755620",
        "title": "How to be a Redhead, The Peep Show, Flora, SplashZen",
        "season": 15,
        "episode": 14,
        "released": "2024-02-16",
        "overview": "Beauty products specially formulated for redheads; a stylish bird house equipped with a hidden camera; an app for plant care; a splash guard for bath time."
      },
      {
        "id": "tvmaze:2763797",
        "title": "PSYONIC, Dogue, Cup-a-Bug, Coldest",
        "season": 15,
        "episode": 15,
        "released": "2024-02-23",
        "overview": "A state-of-the-art bionic prosthetic device; artisanal desserts for dogs; a bug-catching device; insulated water bottles guaranteed to keep beverages cold for 36 hours."
      },
      {
        "id": "tvmaze:2769947",
        "title": "Funky Mello, Mella Pet Care, Da Vinci Eye, Fila Manila",
        "season": 15,
        "episode": 16,
        "released": "2024-03-01",
        "overview": "A vegan marshmallow creme; a non-invasive digital pet thermometer; a drawing app that utilizes augmented reality; a line of Filipino American sauces and condiments."
      },
      {
        "id": "tvmaze:2781748",
        "title": "Chefee, Boona, Let Them Eat Candles, Lady Alpha",
        "season": 15,
        "episode": 17,
        "released": "2024-03-08",
        "overview": "A robotic personal chef for the home; an easy-to-install dual showerhead; premium chocolate birthday candles; a nursing cover with a built-in fan."
      },
      {
        "id": "tvmaze:2789484",
        "title": "The Murder Mystery Company, Overplay, Nourish + Bloom Market, Nowhere Bakery",
        "season": 15,
        "episode": 18,
        "released": "2024-03-15",
        "overview": "An immersive murder mystery experience; an app that turns any video into a game; self-service grocery stores; allergen-free baked goods; guest Shark Jason Blum."
      },
      {
        "id": "tvmaze:2794595",
        "title": "Richualist, Hibear, Veba, Splash Place Swim Goggles",
        "season": 15,
        "episode": 19,
        "released": "2024-04-05",
        "overview": "An all-in-one styling device for textured hair; a multiuse water bottle; a baby bottle monitor that signals spoiled milk; swim goggles that will not pull one's hair; Emma Grede returns as guest shark."
      },
      {
        "id": "tvmaze:2802457",
        "title": "VSEAT, Wedy, SORx, blinger",
        "season": 15,
        "episode": 20,
        "released": "2024-04-12",
        "overview": "An ergonomic bike seat; an app that simplifies wedding planning; a post-workout muscle recovery soap; a simple tool to add bling to hair."
      },
      {
        "id": "tvmaze:2822463",
        "title": "RoboBurger, HOOD, The Hype Company, K3 Shooting Band",
        "season": 15,
        "episode": 21,
        "released": "2024-04-19",
        "overview": "A robotic burger vending machine; bespoke hats that display hometown pride; customizable footwear; a resistance band to develop the perfect jump shot; guest shark Michael Rubin."
      },
      {
        "id": "tvmaze:2834023",
        "title": "Mosh, Sip Herbals, Arber, Flaus",
        "season": 15,
        "episode": 22,
        "released": "2024-05-03",
        "overview": "A coffee substitute that does not cause jitters, organic plant-care products, and an easier way to floss. Guest Shark Candace Nelson returns."
      },
      {
        "id": "tvmaze:2939843",
        "title": "Little Saints, TruFIT Customs, 1587 Sneakers, Card.io",
        "season": 16,
        "episode": 1,
        "released": "2024-10-18",
        "overview": "The season 16 premiere features entrepreneurs hoping to score an investment deal with the Sharks. Innovative products include mushroom-based mocktails, custom-fit mouthguards, an Asian American-led sneaker brand and an app to boost your cardio game."
      },
      {
        "id": "tvmaze:3018227",
        "title": "Topsail Steamer, Life Raft Treats, RigStrips, BucketGolf",
        "season": 16,
        "episode": 2,
        "released": "2024-10-25",
        "overview": "Entrepreneurs pitch unique products, including at-home seafood steam pots, fried chicken-shaped ice cream, a magnetic solution to safely secure skis and snowboards, and a portable backyard golf game. Todd Graves makes his Guest Shark debut."
      },
      {
        "id": "tvmaze:3028894",
        "title": "Yardsale, KOBEE'S, Sugardoh, Doatnut",
        "season": 16,
        "episode": 3,
        "released": "2024-11-01",
        "overview": "Entrepreneurs present Sharks with innovative products aimed at living an improved life, including customizable ski poles, all-natural lip balms, at-home sugaring hair removal kits and a line of oat-based donuts. Kendra Scott returns as Guest Shark."
      },
      {
        "id": "tvmaze:3031293",
        "title": "Fysh Foods, Terrashroom, Moonie, NineteenTwenty",
        "season": 16,
        "episode": 4,
        "released": "2024-11-08",
        "overview": "Entrepreneurs take a chance and pitch one-of-a-kind products to the Sharks, including a new plant-based seafood, an intelligent chamber that grows mushrooms, unconventional mens swimwear, and convertible clothing designed to fit your lifestyle."
      },
      {
        "id": "tvmaze:3036030",
        "title": "ChompShop, Chalkless, Creator Camp, Y'all Sweet Tea",
        "season": 16,
        "episode": 5,
        "released": "2024-11-15",
        "overview": "Entrepreneurs pitch innovative products to the Sharks, featuring a kid-friendly cardboard cutter, a way to strengthen your athletic grip, a creative content camp for kids, and a refreshing twist on sweet tea. Rashaun Williams returns as Guest Shark."
      },
      {
        "id": "tvmaze:3041020",
        "title": "Pepper Pong, Taverns-To-Go, Kaans Designs, FOAM",
        "season": 16,
        "episode": 6,
        "released": "2024-11-22",
        "overview": "A portable pingpong game; an at-home bar experience; a T-shirt brand that aims to preserve family memories; a lightweight foam cooler fit for any occasion; Todd Graves returns."
      },
      {
        "id": "tvmaze:3041903",
        "title": "Coordinates, Gnome Advent Calendar, Snow Scholars, Wildcoat",
        "season": 16,
        "episode": 7,
        "released": "2024-12-13",
        "overview": "The Tank is transformed into a winter wonderland, and entrepreneurs present Sharks with business opportunities that celebrate the magic of the holiday season."
      },
      {
        "id": "tvmaze:3094736",
        "title": "Bro Glo, TripleLite, Hiccup, PhoLicious",
        "season": 16,
        "episode": 8,
        "released": "2025-01-17",
        "overview": "A self-tanner geared toward men; a new-and-improved flashlight; a reusable cup service for marathoners; an authentic instant pho."
      },
      {
        "id": "tvmaze:3106194",
        "title": "Petite Keep, Legit Kits, onewith, ToughCutie",
        "season": 16,
        "episode": 9,
        "released": "2025-01-24",
        "overview": "An heirloom keepsake trunk; an easy-to-sew quilt kit; a line of seamless swimsuits and outdoor performance socks created for women; Jamie Kern Lima guest sharks."
      },
      {
        "id": "tvmaze:3107520",
        "title": "CharCharms, Nameberry, Rinseroo, Tabeeze",
        "season": 16,
        "episode": 10,
        "released": "2025-01-31",
        "overview": "Practical water bottle accessories, a baby name database, an easy-to-use tub hose, and hassle-free baby clothes."
      },
      {
        "id": "tvmaze:3116082",
        "title": "FlaminGO, Lectec, Joyebells, Bumpeez",
        "season": 16,
        "episode": 11,
        "released": "2025-02-07",
        "overview": "A portable three-in-one charger; a DIY electric vehicle kit; a take-home sweet potato pie; indoor bumper cars for kids."
      },
      {
        "id": "tvmaze:3145416",
        "title": "Kiid Coffee, GoodLove Foods, Happy Birdwatcher, Remento",
        "season": 16,
        "episode": 12,
        "released": "2025-03-07",
        "overview": "A kid-friendly coffee brand, gluten-free pastries, a personalized bird food mix, and a book that keeps one's family history alive."
      },
      {
        "id": "tvmaze:3158966",
        "title": "Hella Awkward, DomeDock, Riverbend Resources, Dig World",
        "season": 16,
        "episode": 13,
        "released": "2025-03-14",
        "overview": "A one-of-a-kind icebreaker game, a practical hat storage solution, a no-mess chicken feeder, and a construction-themed park for families."
      },
      {
        "id": "tvmaze:3163131",
        "title": "Firefly, Blackdot, BAM, Duzter",
        "season": 16,
        "episode": 14,
        "released": "2025-03-21",
        "overview": "A portable athlete recovery device; an automated tattoo machine; eco-friendly buckwheat milk; compression hockey gear; guest shark Rashaun Williams."
      },
      {
        "id": "tvmaze:3173473",
        "title": "History By Mail, Future Circus, CowPots, Paper Tacos",
        "season": 16,
        "episode": 15,
        "released": "2025-04-04",
        "overview": "A piece of history delivered; a virtual theme park experience; eco-friendly plantable pots; a culturally unique greeting card."
      },
      {
        "id": "tvmaze:3173474",
        "title": "Jane Foodie, AirTulip, Sock Candy, RUFF Liners",
        "season": 16,
        "episode": 16,
        "released": "2025-04-11",
        "overview": "A new twist on frozen food, a state-of-the-art air purifier that works while one sleeps, sheer socks with flair, and a rugged liner to protect car seats from active pets.English"
      },
      {
        "id": "tvmaze:3179665",
        "title": "Go Nutz; Frame Your Feline; Essence Aromatherapy Ring; Mad Mutz Mozzarella Sticks",
        "season": 16,
        "episode": 17,
        "released": "2025-04-18",
        "overview": "Entrepreneurs bring their best ideas to the tank, including a handheld personal groomer, a picturesque alternative to a cat perch, scented nasal diffusers, and gourmet mozzarella sticks one can make at home."
      },
      {
        "id": "tvmaze:3187326",
        "title": "Jaju Pierogi, Permaplug, Fanion, Rocco",
        "season": 16,
        "episode": 18,
        "released": "2025-05-02",
        "overview": "Entrepreneurs pitch their innovative products, including a family-made Eastern European pierogi, a permanent fix for lost phone chargers, a kitchen fan that prevents \"onion eyes,\" and a smart mini fridge designed exclusively for your favorite drinks."
      },
      {
        "id": "tvmaze:3209693",
        "title": "ESAI, Mirai Clinical, Cricket's Candy Creations, Morrison Outdoors",
        "season": 16,
        "episode": 19,
        "released": "2025-05-09",
        "overview": "An AI tool that offers cost-friendly college admissions support; a Japanese persimmon-based soap; edible candy crafts for kids; sleeping bags made exclusively for children."
      },
      {
        "id": "tvmaze:3209694",
        "title": "Big Ass Luxuries, Deviled Egg Co., TiCK MiTT, Stringys",
        "season": 16,
        "episode": 20,
        "released": "2025-05-16",
        "overview": "For the season 16 finale and Mark Cuban's farewell episode, entrepreneurs pitch their one-of-a-kind products to the Sharks, including gourmet deviled eggs, a tick-removal mitten, and seamless, invisible undergarments."
      },
      {
        "id": "tvmaze:3305504",
        "title": "Big Sock Energy: Comedian Pete Davidson Is in the Tank",
        "season": 17,
        "episode": 1,
        "released": "2025-09-24",
        "overview": "Expressive eco-friendly socks; shock-absorbing shoes; a high-tech jet ski; a line of low-alcohol beer."
      },
      {
        "id": "tvmaze:3306343",
        "title": "Michael Strahan Brings His Business Game to the Tank",
        "season": 17,
        "episode": 2,
        "released": "2025-10-01",
        "overview": "An anti-snoring pillow; a chair that converts into a football game; an emotional support doll for dogs; ready-to-eat packaged chicken; Michael Strahan makes his Guest Shark debut."
      },
      {
        "id": "tvmaze:3382067",
        "title": "First Power Couple: Chip and Joanna Gaines Dive-in",
        "season": 17,
        "episode": 3,
        "released": "2025-10-08",
        "overview": "A cleaning device for homegrown eggs; a reusable paint tray; a line of superfood seasoning; customizable fundraising blankets; Chip and Joanna Gaines make their Guest Shark debut."
      },
      {
        "id": "tvmaze:3386995",
        "title": "Startup Legend Alexis Ohanian Makes His Mark",
        "season": 17,
        "episode": 4,
        "released": "2025-10-22",
        "overview": "Gear for female fighters; an at-home sprout grower; high-protein ice cream bars; an airline for pets and their humans; guest shark Alexis Ohanian."
      },
      {
        "id": "tvmaze:3400917",
        "title": "History Is Made: Allison Ellsworth Returns",
        "season": 17,
        "episode": 5,
        "released": "2025-11-05",
        "overview": "On-the-go snacking olives; a line of stylish labor gowns and maternity wear; a first-aid kit for kids; healing teas made from flowers; guest shark Allison Ellsworth."
      },
      {
        "id": "tvmaze:3423079",
        "title": "Revolutionizing Sound: 3D Printed Instruments Shake Up the Music Biz",
        "season": 17,
        "episode": 6,
        "released": "2025-11-12",
        "overview": "A helmet designed for surfing; snackable pasta chips; 3D-printed string instruments; a signature ramen dish one can make from home."
      },
      {
        "id": "tvmaze:3437288",
        "title": "Urine for a Surprise: Would NFL Legend Michael Strahan Use This Personal Product in Public?",
        "season": 17,
        "episode": 8,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3437289",
        "title": "5 Sharks and a Baby: Can This New Invention Provide Sleep for Newborns and Their Parents?",
        "season": 17,
        "episode": 9,
        "released": "2026-01-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3437290",
        "title": "TBA",
        "season": 17,
        "episode": 10,
        "released": "2026-01-21",
        "overview": ""
      }
    ]
  }
}