{
  "meta": {
    "id": "tvmaze:76487",
    "type": "series",
    "name": "Happy's Place",
    "description": "Happy's Place follows Bobbie who inherits her father's restaurant and is less than thrilled to discover that she has a new business partner in the half-sister she never knew she had.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491132.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1491132.jpg",
    "videos": [
      {
        "id": "tvmaze:3334262",
        "title": "Mouse in the House",
        "season": 2,
        "episode": 5,
        "released": "2025-12-12",
        "overview": "After Gabby accidentally lets a mouse loose in the tavern, Bobbie must distract the health inspector by any means necessary as everyone tries to find the mouse and secure their \"A\" rating."
      },
      {
        "id": "tvmaze:3439905",
        "title": "Izzy and the Professor",
        "season": 2,
        "episode": 6,
        "released": "2025-12-19",
        "overview": "When Isabella starts dating again, Bobbie can't wait to meet her new man until she learns Isabella is dating her professor. Gabby and Steve obsess over a lost phone Takoda finds in the men's room."
      },
      {
        "id": "tvmaze:3439906",
        "title": "TBA",
        "season": 2,
        "episode": 7,
        "released": "2026-01-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3334261",
        "title": "Testing Testing",
        "season": 2,
        "episode": 4,
        "released": "2025-12-05",
        "overview": "After Bobbie notices how much Isabella misses school, she signs them both up for an online course unaware of how serious Isabella would take it; Gabby wears Isabella's old Stanford sweatshirt, tricking customers into believing she went there."
      },
      {
        "id": "tvmaze:2939432",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2024-10-18",
        "overview": "When Bobbie inherits her late father's tavern, Happy's Place, she's shocked to learn that she also has a new business partner in the half-sister she never knew existed."
      },
      {
        "id": "tvmaze:3010077",
        "title": "Tapped Out",
        "season": 1,
        "episode": 2,
        "released": "2024-10-25",
        "overview": "When Isabella starts trying to make changes to the tavern, Bobbie worries that this new partnership may not work out; Bobbie offers to take Isabella under her wing so she can learn about the tavern, but Happy's lawyer fumbles Bobbie's plan."
      },
      {
        "id": "tvmaze:3010078",
        "title": "Don't Sweat It",
        "season": 1,
        "episode": 3,
        "released": "2024-11-01",
        "overview": "Bobbie asks Isabella to move in with her, but when Isabella sees that Bobbie likes to address conflict head on, Isabella decides it might not be the best idea."
      },
      {
        "id": "tvmaze:3010079",
        "title": "Fish Fry Monday",
        "season": 1,
        "episode": 4,
        "released": "2024-11-08",
        "overview": "When Emmett sees Bobbie drowning in work, he devises a clever ruse to give her a much-needed day off fishing, all under the guise of reviving the tavern's Fish Fry Mondays; Isabella dives into the world of bartending with Gabby."
      },
      {
        "id": "tvmaze:3037921",
        "title": "Ladies' Night",
        "season": 1,
        "episode": 5,
        "released": "2024-11-15",
        "overview": "After Gabby's latest heartbreak, Bobbie and Isabella throw a Ladies' Night at the tavern to show Gabby she doesn't need a man to be happy, but things don't go as planned; Steve and Takoda tease Emmett about his sudden interest in dating apps."
      },
      {
        "id": "tvmaze:3043863",
        "title": "Happy's House",
        "season": 1,
        "episode": 6,
        "released": "2024-11-22",
        "overview": "Bobbie agrees to take Isabella to Happy's house in search of a connection to their late father, leading Bobbie to worry about what they may find; Gabby hopes to strike it rich by searching through Happy's penny collection looking for a rarity."
      },
      {
        "id": "tvmaze:3043864",
        "title": "Ho-Ho-Howey",
        "season": 1,
        "episode": 7,
        "released": "2024-12-06",
        "overview": "When the tavern's health insurance is threatened to be canceled, Gabby has a plan; she'll persuade her friend Danny to host his company party at Happy's, but the catch is everyone must call Bobbie \"Gabby\" and Gabby \"Bobbie.\""
      },
      {
        "id": "tvmaze:3060041",
        "title": "Dear Jack",
        "season": 1,
        "episode": 8,
        "released": "2024-12-13",
        "overview": "When Bobbie catches Isabella doing a slow-fade breakup with her long-distance boyfriend, she convinces her to send a Dear John letter; Steve brings in a review praising Chef Emmett's cooking and acknowledging the tavern's bartender, \"Abby.\""
      },
      {
        "id": "tvmaze:3064249",
        "title": "Emcee Squared",
        "season": 1,
        "episode": 9,
        "released": "2025-01-03",
        "overview": "When Bobbie tries to claim her rightful role as emcee for the Tavern's anniversary party, she ignites a fierce showdown with Gabby, who's determined to steal the spotlight; Isabella and Steve bet on who will come out on top, adding fuel to the fire."
      },
      {
        "id": "tvmaze:3069359",
        "title": "The MacAllister Girls",
        "season": 1,
        "episode": 10,
        "released": "2025-01-10",
        "overview": "When Bobbie's strong-willed daughter, Gracie, comes to visit from her military base in Qatar, Bobbie worries she and Isabella might not get along; Gabby, Emmett, Steve and Takoda all compete to give Gracie the best homemade gift."
      },
      {
        "id": "tvmaze:3069361",
        "title": "Heart of the Matter",
        "season": 1,
        "episode": 11,
        "released": "2025-01-17",
        "overview": "When Emmett is late to work, Bobbie becomes paranoid at the thought of why and begins to overreact; Gabby and Takoda help Steve pick out a new barstool to prove changing his obsessive-compulsive disorder habits won't negatively impact the world."
      },
      {
        "id": "tvmaze:3069362",
        "title": "Baby Doll",
        "season": 1,
        "episode": 12,
        "released": "2025-01-31",
        "overview": "After Gabby expresses her concerns about parenting, Bobbie reassures her she'd be a great mother, which prompts Gabby to bring in an AI baby doll and turn the tavern into her own personal day care."
      },
      {
        "id": "tvmaze:3069363",
        "title": "Mama Drama",
        "season": 1,
        "episode": 13,
        "released": "2025-02-07",
        "overview": "When Isabella's mom, Maritza, arrives, Bobbie tells the crew she's forgiven her for what happened with Happy, only to realize Maritza holds a grudge against her; Emmett and Takoda try to find out why Steve can't return to his home in Colombia."
      },
      {
        "id": "tvmaze:3115647",
        "title": "Accountability",
        "season": 1,
        "episode": 14,
        "released": "2025-02-14",
        "overview": "When Isabella accidentally implies she doesn't trust Steve's work on the tavern's taxes, Bobbie and Steve decide to have some fun and teach her a lesson. Gabby goes on a health kick enlisting Takoda as her personal trainer."
      },
      {
        "id": "tvmaze:3135545",
        "title": "Sisters Ink",
        "season": 1,
        "episode": 15,
        "released": "2025-02-21",
        "overview": "When Isabella gifts Bobbie matching sister mugs, Bobbie is forced to quickly think of an equally thoughtful gift, resulting in Isabella expecting the sisters to get matching tattoos; Steve and Takoda investigate where Emmett has been sneaking off."
      },
      {
        "id": "tvmaze:3144584",
        "title": "Whiskey Business",
        "season": 1,
        "episode": 16,
        "released": "2025-03-07",
        "overview": "When Steve drops his favorite pen down a crack in the bar, Bobbie decides to pry the bar open to find it, discovering a very valuable bottle of whiskey in the process; Steve is thrown by Emmett's reaction to breaking a knife that Steve gifted him."
      },
      {
        "id": "tvmaze:3144585",
        "title": "The Doctor Is Out",
        "season": 1,
        "episode": 17,
        "released": "2025-03-14",
        "overview": "After Bobbie praises Steve's progress with his OCD, he decides he's finally ready to quit therapy; Gabby embarks on a side hustle enlisting ambassadors to sell bracelets for a third party."
      },
      {
        "id": "tvmaze:3144586",
        "title": "Alarm Bells",
        "season": 1,
        "episode": 18,
        "released": "2025-03-21",
        "overview": "When Isabella requests Emmett's help getting a security system installed, Bobbie claims she can protect her sister better than any alarm or man, leading to Bobbie and Emmett having a competition over who's the better protector."
      },
      {
        "id": "tvmaze:3316801",
        "title": "Promises, Promises",
        "season": 2,
        "episode": 1,
        "released": "2025-11-07",
        "overview": "When Emmett continues his nightly check-ins with Bobbie to ensure her safety, Isabella pays the price as she's kept up by their loud late-night chats, prompting her to tell Bobbie to advance their relationship or at least take it out of the house."
      },
      {
        "id": "tvmaze:3334260",
        "title": "I've Got a Secret",
        "season": 2,
        "episode": 2,
        "released": "2025-11-14",
        "overview": "After Bobbie and Emmett's big moment, Bobbie is still unsure how Emmett truly feels about her, prompting Bobbie to do the unthinkable and give Emmett a birthday gift; Gabby tries to convince Isabella to give her the family discount on Happy's house."
      },
      {
        "id": "tvmaze:3316802",
        "title": "Straw Man",
        "season": 2,
        "episode": 3,
        "released": "2025-11-21",
        "overview": "When Gabby asks Bobbie to help vet men to be her potential donor, Bobbie is happy to participate until she discovers Gabby is considering Emmett for the donation; Isabella is asked to be the guest speaker for Takoda's daughter's class."
      }
    ]
  }
}