{
  "meta": {
    "id": "tvmaze:59809",
    "type": "series",
    "name": "Ugliest House in America",
    "description": "Comedian Retta travels across the country to tour properties nominated by their owners as the ugliest home around. After crowning the worst of the worst, designer Alison Victoria surprises the homeowners with a jaw-dropping $150,000 renovation!",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/571/1427594.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/571/1427594.jpg",
    "videos": [
      {
        "id": "tvmaze:3459731",
        "title": "TBA",
        "season": 7,
        "episode": 1,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:2247940",
        "title": "Getting Ugly in the Midwest",
        "season": 1,
        "episode": 1,
        "released": "2022-01-03",
        "overview": "In the Midwest, Retta tours three truly heinous homes vying for the chance at a $150,000 makeover by Alison Victoria. She'll get an inside look at an underwater sea palace, a 1960s throwback and a former funeral home."
      },
      {
        "id": "tvmaze:2247941",
        "title": "Finding More Ugly in the South",
        "season": 1,
        "episode": 2,
        "released": "2022-01-04",
        "overview": "Retta is off to the Southeast to check out the ugly home competition. She'll explore a sardine can house with more than one snake problem, a property with a questionable past and a home that looks like a vintage bank."
      },
      {
        "id": "tvmaze:2247942",
        "title": "Looking for Ugly in the North",
        "season": 1,
        "episode": 3,
        "released": "2022-01-05",
        "overview": "Retta heads to the Northeast to uncover the region's most-hideous home. She'll question life and design decisions at a former preschool, a house shaped like a pyramid and a pink-carpeted nightmare that looks like a cat condo."
      },
      {
        "id": "tvmaze:2247943",
        "title": "Searching for Ugly Out West",
        "season": 1,
        "episode": 4,
        "released": "2022-01-06",
        "overview": "Retta finds a dark spot on the sunny West Coast as she checks out three homes that are more nightmares than dreams. She'll visit a house that looks like a jungle, a home that used to be a barn and property that feels like living on a boat."
      },
      {
        "id": "tvmaze:2247944",
        "title": "From Ugly to Unbelievable",
        "season": 1,
        "episode": 5,
        "released": "2022-01-07",
        "overview": "After choosing the worst of the worst, Retta announces which ugly home will be getting a $150,000 renovation from designer Alison Victoria! The lucky homeowners will see the amazing transformation that takes their home from grotesque to gorgeous."
      },
      {
        "id": "tvmaze:2366757",
        "title": "Homes on the Rocks",
        "season": 2,
        "episode": 1,
        "released": "2022-07-24",
        "overview": "Among America's majestic mountains, Retta finds three ugly homes ready for a makeover! While traveling the highs and lows, she uncovers a pieced-together cabin, a property balanced on a rock and a house that looks like a church."
      },
      {
        "id": "tvmaze:2366758",
        "title": "Ugly on the Water",
        "season": 2,
        "episode": 2,
        "released": "2022-07-24",
        "overview": "Retta heads to the Sunshine State to check out a property that feels like the Titanic inside and out, an angled mess of a house with no walls and absolutely zero privacy, and a gigantic green box with a nasty backyard."
      },
      {
        "id": "tvmaze:2366759",
        "title": "Ugly Homes of the Pacific",
        "season": 2,
        "episode": 3,
        "released": "2022-07-31",
        "overview": "Retta takes an ugly hunt up and down the Pacific coast as she gets a tour of a linoleum-covered nightmare, a house with a staircase straight to Hell and an oppressively hot home with a huge built-in solarium."
      },
      {
        "id": "tvmaze:2366760",
        "title": "Desert Disasters",
        "season": 2,
        "episode": 4,
        "released": "2022-07-31",
        "overview": "Retta heads out into the desert to visit a broken-down cabin with a cat problem, a dust-filled dome and a home stuck in the '70s. One of these ugly homes will move on to the finals and have a chance to receive a $150,000 makeover by Alison Victoria!"
      },
      {
        "id": "tvmaze:2366761",
        "title": "The Not-So-Great Lakes",
        "season": 2,
        "episode": 5,
        "released": "2022-08-07",
        "overview": "Retta visits the Great Lakes to find a batch of ugly houses that are vying for a $150,000 makeover by designer Alison Victoria. She gets an up-close look at a real-life Victorian dollhouse, a lake house with a funky odor and a former church."
      },
      {
        "id": "tvmaze:2366762",
        "title": "Perfect for Paradise",
        "season": 2,
        "episode": 6,
        "released": "2022-08-14",
        "overview": "After a coast-to-coast search, Retta announces which ugly-in-paradise home receives a $150,000 makeover! Designer Alison Victoria takes over with a full gut renovation to deliver a life-changing improvement that leaves the homeowners stunned."
      },
      {
        "id": "tvmaze:2440358",
        "title": "The Ugliest of the North",
        "season": 3,
        "episode": 1,
        "released": "2023-01-01",
        "overview": "Three ugly homes in the North vie for the chance at a $150,000 makeover from designer Alison Victoria! From a terrifying Mardi Gras-inspired house to an Earth-home fit for a hobbit, only one will move on to the finals!"
      },
      {
        "id": "tvmaze:2440359",
        "title": "Ugly Out West",
        "season": 3,
        "episode": 2,
        "released": "2023-01-02",
        "overview": "Retta tours three ugly homes in the West that are battling it out for the chance at a $150,000 makeover! From a sprawling party pad with funky decor to a tiny triangle-house where the walls feel like they're closing in, only one will make the finals!"
      },
      {
        "id": "tvmaze:2440309",
        "title": "Northeast Nightmares",
        "season": 3,
        "episode": 3,
        "released": "2023-01-03",
        "overview": "Three ugly homes in the Northeast square off for a chance at a $150,000 makeover from HGTV designer Alison Victoria! From a disjointed house built out of cylindrical towers to a home that's buried in angel decor, only one will make the finals!"
      },
      {
        "id": "tvmaze:2440360",
        "title": "Ugly Down South",
        "season": 3,
        "episode": 4,
        "released": "2023-01-04",
        "overview": "Retta tours three ugly homes in the South that are competing for a $150,000 makeover from HGTV's Alison Victoria! From a disco deathtrap that's short on safety features to a musty house embalmed in carpet and wallpaper, only one will make the finals!"
      },
      {
        "id": "tvmaze:2440357",
        "title": "Midwest Monstrosities",
        "season": 3,
        "episode": 5,
        "released": "2023-01-05",
        "overview": "Retta tours three ugly homes in the Midwest that are competing for the chance at a $150,000 makeover! From a ramshackle Victorian built a hundred years too late to a home with hideous hand-painted murals in every room, only one will make the finals!"
      },
      {
        "id": "tvmaze:2452390",
        "title": "Ugly No More",
        "season": 3,
        "episode": 6,
        "released": "2023-01-06",
        "overview": "Retta announces which house is the ugliest and crowns the winner of the Ugliest House in America! Then it's goodbye ugly, as the winning house is transformed with a $150,000 home makeover from HGTV designer Alison Victoria!"
      },
      {
        "id": "tvmaze:2593785",
        "title": "Go West for Ugly",
        "season": 4,
        "episode": 1,
        "released": "2023-08-07",
        "overview": "Three ugly homes in the West vie for the chance at a $150,000 makeover courtesy of HGTV designer Alison Victoria! It's between a creepy and wood-carved world of whimsy, a tile-mad dwelling with views into every bathroom, and a cramped and convoluted hut."
      },
      {
        "id": "tvmaze:2617384",
        "title": "Midwest Hunt for Ugly",
        "season": 4,
        "episode": 2,
        "released": "2023-08-07",
        "overview": "Three ugly homes in the Midwest square off for the chance to win a $150,000 makeover, courtesy of HGTV's design guru Alison Victoria! It's between a bird-themed house, a turtle-shaped dome and a house that's been half updated and half left for dead."
      },
      {
        "id": "tvmaze:2607987",
        "title": "The Ugly Southwest",
        "season": 4,
        "episode": 3,
        "released": "2023-08-14",
        "overview": "Three homes in the Southwest duke it out for a chance at a $150,000 home makeover from HGTV designer Alison Victoria! It's between a shiny dome with a gross past, a former museum with a thing for skeletons and a castle held together with styrofoam."
      },
      {
        "id": "tvmaze:2607988",
        "title": "Northeast of Ugly",
        "season": 4,
        "episode": 4,
        "released": "2023-08-21",
        "overview": "Three ugly homes in the Northeast battle for the chance at a $150,000 makeover by designer Alison Victoria! It's between an eclectic house full of panels, a church-like home with zebras on the walls and a retro red shed that has it out for its owners."
      },
      {
        "id": "tvmaze:2618384",
        "title": "The Sorry Southeast",
        "season": 4,
        "episode": 5,
        "released": "2023-08-28",
        "overview": "Three ugly homes in the Southeast vie for the chance at a $150,000 makeover by designer Alison Victoria! It's between a house that's a series of connected huts, a horrifying home in the middle of the woods, and a dated house with holiday decor year-round."
      },
      {
        "id": "tvmaze:2618385",
        "title": "Summer Road Trip to Stunning",
        "season": 4,
        "episode": 6,
        "released": "2023-09-04",
        "overview": "The summer road trip comes to an end as Retta crowns the Ugliest House in America! Then it's makeover time, with HGTV's Alison Victoria leading the charge to turn a nightmare house into the home its owners have always dreamed of."
      },
      {
        "id": "tvmaze:2800876",
        "title": "The Hideous Midwest",
        "season": 5,
        "episode": 1,
        "released": "2024-04-22",
        "overview": "Three ugly homes in the Midwest vie for the chance at a $150,000 makeover by designer Alison Victoria! It's between a bird-loving house, a house with too many kitchens and a former party pad that once housed reptiles."
      },
      {
        "id": "tvmaze:2804930",
        "title": "The Unpleasant Pacific Northwest",
        "season": 5,
        "episode": 2,
        "released": "2024-04-22",
        "overview": "Three ugly homes in the Pacific Northwest square off for the chance at a $150,000 makeover courtesy of designer Alison Victoria! It's between a house full of mirrors, a giant maze-like octagon and an outdated house full of random decor."
      },
      {
        "id": "tvmaze:2824108",
        "title": "Southwestern Ugly",
        "season": 5,
        "episode": 3,
        "released": "2024-04-29",
        "overview": "Three ugly homes in the Southwest battle for the chance at a $150,000 makeover by designer Alison Victoria! It's between a customized nightmare, a cowboy-themed dome under a mountain and a retro house with too many shag carpets."
      },
      {
        "id": "tvmaze:2824109",
        "title": "A Northern Kind of Ugly",
        "season": 5,
        "episode": 4,
        "released": "2024-05-06",
        "overview": "Three homes in the Northern Region duke it out for a chance at a $150,000 home makeover from HGTV designer Alison Victoria! It's between a realistic stone castle, a colorful house made out of concrete and a '70s throwback with carpets galore."
      },
      {
        "id": "tvmaze:2824110",
        "title": "The Nasty Northeast",
        "season": 5,
        "episode": 5,
        "released": "2024-05-13",
        "overview": "Three ugly homes in the Northeast contend for the chance at a $150,000 makeover by designer Alison Victoria! It's between a house that was once a men's club, a home with an obsession for all things Italian and a crazy place with way too many shelves."
      },
      {
        "id": "tvmaze:2863330",
        "title": "From Ugly to Glamorous",
        "season": 5,
        "episode": 6,
        "released": "2024-05-20",
        "overview": "Retta reveals the winner of Ugliest House in America!"
      },
      {
        "id": "tvmaze:3219686",
        "title": "Hot Mess Midwest",
        "season": 6,
        "episode": 1,
        "released": "2025-06-02",
        "overview": "During the 9 p.m. season premiere, Retta will tour the first three ugly gems in the Midwest, including a concrete cave better suited for children than adults, a former bank with a bathroom built in the safe and an outdated brick house that looks like a pizza place."
      },
      {
        "id": "tvmaze:3219774",
        "title": "Great Lakes, Great Ugly",
        "season": 6,
        "episode": 2,
        "released": "2025-06-02",
        "overview": "At 9:30 p.m., she'll head to the Great Lakes region, offering her unfiltered reactions to a boat that doesn't float, a home with carpet up the walls and a property easily mistaken as a UFO."
      },
      {
        "id": "tvmaze:3244024",
        "title": "Monstrous Mid-Atlantic",
        "season": 6,
        "episode": 3,
        "released": "2025-06-09",
        "overview": ""
      },
      {
        "id": "tvmaze:3244025",
        "title": "New Ugly in New England",
        "season": 6,
        "episode": 4,
        "released": "2025-06-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3244026",
        "title": "Ugly-Fest in the Southwest",
        "season": 6,
        "episode": 5,
        "released": "2025-06-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3266996",
        "title": "An Ugly Glow-Up",
        "season": 6,
        "episode": 6,
        "released": "2025-06-30",
        "overview": ""
      }
    ]
  }
}