{
  "meta": {
    "id": "tvmaze:44634",
    "type": "series",
    "name": "Tyler Perry's Sistas",
    "description": "A group of single black women from different walks of life navigate their complicated love life status, careers and friendship through the ups-and-downs of living in a modern world of social media and unrealistic relationship goals.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/539/1348197.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/539/1348197.jpg",
    "videos": [
      {
        "id": "tvmaze:3466358",
        "title": "The Hangover",
        "season": 9,
        "episode": 22,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3456145",
        "title": "Girls Just Wanna Have Fun",
        "season": 9,
        "episode": 21,
        "released": "2025-12-10",
        "overview": "Karen's going-away party gets wild as the ladies clash with Penelope, confront lingering feuds, size up new love interests, and celebrate the depth and strength of their friendships."
      },
      {
        "id": "tvmaze:3456144",
        "title": "Bon Voyage",
        "season": 9,
        "episode": 20,
        "released": "2025-12-03",
        "overview": "The tension between Andi and Danni hits a boiling point at Karen's goodbye party, Maurice and Pam reveal their plans for the salon, and Andi faces an enemy after a night of confrontations."
      },
      {
        "id": "tvmaze:1743512",
        "title": "The Pilot",
        "season": 1,
        "episode": 1,
        "released": "2019-10-23",
        "overview": "Andi braves the highs and lows of her special day. Karen makes a difficult decision. Sabrina entertains the prospect of new love."
      },
      {
        "id": "tvmaze:1744001",
        "title": "Mixed Signal",
        "season": 1,
        "episode": 2,
        "released": "2019-10-30",
        "overview": "Andi is forced to reconsider who is and isn't in her corner. Karen meets someone new and reconsiders the dating game. Sabrina's new love interest sparks some suspicion. Danni witnesses something that could break Andi's heart."
      },
      {
        "id": "tvmaze:1749327",
        "title": "A Woman with No Soul",
        "season": 1,
        "episode": 3,
        "released": "2019-11-06",
        "overview": "Changes in Andi's situationship leave her reeling. Sabrina's confusion causes her to avoid Calvin altogether. Karen struggles to put the past behind her. Danni discovers more about Zac's struggles without Karen,"
      },
      {
        "id": "tvmaze:1749328",
        "title": "New Stories",
        "season": 1,
        "episode": 4,
        "released": "2019-11-13",
        "overview": "Andi's relationship with Gary takes a definitive turn. New information helps shed light on Sabrina's predicament and her fears. Danni extends an olive branch to Zac. Karen finds there's more to Aaron's story than meets the eye."
      },
      {
        "id": "tvmaze:1752735",
        "title": "One Day at a Time",
        "season": 1,
        "episode": 5,
        "released": "2019-11-20",
        "overview": "Andi realizes getting what she wants isn't all it's cracked up to be. Karen resolves not to make the same mistakes as Andi. Sabrina's next venture with Calvin deepens her fears. Danni is worried by how easily Zac sees through he."
      },
      {
        "id": "tvmaze:1758904",
        "title": "No Judgement",
        "season": 1,
        "episode": 6,
        "released": "2019-11-27",
        "overview": "Andi struggles to keep her personal life and job separate; developments in Karen's love life pose new possibilities; Sabrina provides the voice of wisdom to her friends; Danni mulls over her exchange with Zac."
      },
      {
        "id": "tvmaze:1764531",
        "title": "Boy Bye",
        "season": 1,
        "episode": 7,
        "released": "2019-12-04",
        "overview": "Andi acts quickly to help a fallen friend. A misunderstanding leaves Karen in a precarious and heartbreaking situation. Danni starts to address rumors she's caught wind of."
      },
      {
        "id": "tvmaze:1767863",
        "title": "Old Faithful",
        "season": 1,
        "episode": 8,
        "released": "2019-12-11",
        "overview": "Andi is stuck between a rock and a hard place; Danni sets out to find the truth among her friends; Sabrina starts to open up to Calvin; Karen finds herself repeatedly unlucky in love."
      },
      {
        "id": "tvmaze:1772678",
        "title": "Acceptance",
        "season": 1,
        "episode": 9,
        "released": "2019-12-18",
        "overview": "Danni's relationship with an unlikely person develops in an unexpected twist of events. Aaron recruits Andi's help with reaching out to Karen. Sabrina tries to figure out the shift in Karen's attitude."
      },
      {
        "id": "tvmaze:1787089",
        "title": "Revelations",
        "season": 1,
        "episode": 10,
        "released": "2020-01-08",
        "overview": "Andi's suspicions are raised concerning her lover. Sabrina and Calvin start to make progress. Danni still has a chip on her shoulder, but sets it aside in favour of helping Andi."
      },
      {
        "id": "tvmaze:1787090",
        "title": "The Sister Circle",
        "season": 1,
        "episode": 11,
        "released": "2020-01-15",
        "overview": "Sabrina tries to navigate the waters of friendship despite some clashing personalities. Andi's greatest secret is revealed."
      },
      {
        "id": "tvmaze:1790441",
        "title": "All I Got",
        "season": 1,
        "episode": 12,
        "released": "2020-01-22",
        "overview": "Gary's secrets are revealed, putting him and Andi at odds once more; the shadow of Aaron's past overwhelms Karen; Danni tries to be there for Zac, uncertain if this new revelation is one he won't recover from."
      },
      {
        "id": "tvmaze:1793040",
        "title": "In Front of Me",
        "season": 1,
        "episode": 13,
        "released": "2020-01-29",
        "overview": "Karen's world is rocked when blood is on her hands; Sabrina is in for a big surprise with one of Maurice's scheme's; Danni plays middle-man to some troubling news; trouble in paradise causes Andi to make a hard decision."
      },
      {
        "id": "tvmaze:1793041",
        "title": "To Be Free",
        "season": 1,
        "episode": 14,
        "released": "2020-02-05",
        "overview": "Sabrina learns not to judge a book by its cover; Andi discovers an unlikely ally; Danni is excited about her new boy-toy; Karen feels slighted when she's accused of not being truthful."
      },
      {
        "id": "tvmaze:1798064",
        "title": "Too Much Glass",
        "season": 1,
        "episode": 15,
        "released": "2020-02-12",
        "overview": "An unexpected visitor makes a compelling argument on Calvin's behalf. Andi tries moving on. Karen finds herself between two men. Danni and Preston take things to the next level."
      },
      {
        "id": "tvmaze:1798803",
        "title": "The Firm",
        "season": 1,
        "episode": 16,
        "released": "2020-02-19",
        "overview": "Personal choices threaten to railroad Andi's career forever; Danni helps Zac see a light at the end of the tunnel; Karen learns of Aaron's troubled past."
      },
      {
        "id": "tvmaze:1801162",
        "title": "The Trojan Horse",
        "season": 1,
        "episode": 17,
        "released": "2020-02-26",
        "overview": "Andi discovers the enemies in her personal and professional life are many. Karen is left to clean up Zac's mess. Sabrina tries to reach out to Calvin. Danni continues to be a strong advocate for Zac."
      },
      {
        "id": "tvmaze:1805150",
        "title": "Bugaboo",
        "season": 1,
        "episode": 18,
        "released": "2020-03-04",
        "overview": "Gary swoops in to help Andi in the nick of time. Karen holds firm to her convictions. Sabrina helps Maurice prepare for an exciting event. Danni has to decide her feelings about her new situation."
      },
      {
        "id": "tvmaze:1807909",
        "title": "Give Me the Night",
        "season": 1,
        "episode": 19,
        "released": "2020-03-11",
        "overview": "Sabrina becomes an unlikely hero after stumbling upon a terrible incident. Andifights back. Danni ventures out in an effort to put herself out there again"
      },
      {
        "id": "tvmaze:1812123",
        "title": "A Chance to Love",
        "season": 1,
        "episode": 20,
        "released": "2020-03-18",
        "overview": "Gary's insecurities come to light. Karen and Zac find themselves in a familiar place. Danni finds herself the mediator between friends."
      },
      {
        "id": "tvmaze:1816460",
        "title": "From the Balcony",
        "season": 1,
        "episode": 21,
        "released": "2020-03-25",
        "overview": "The dating game has Danni at a disadvantage when her feelings get the best of her. Andi tries to be strong for Gary. Karen stands strong on her principles. Sabrina opens up in the midst of a tragedy."
      },
      {
        "id": "tvmaze:1818178",
        "title": "The Yellow Dress",
        "season": 1,
        "episode": 22,
        "released": "2020-04-01",
        "overview": "Gary and Jasmine confront each other and the gloves come off. Andi struggles to maintain her career. Karen is confronted by a new enemy. Sabrina grows frustrated. Danni helps Zac work through some personal issues."
      },
      {
        "id": "tvmaze:1822790",
        "title": "Home for a Queen",
        "season": 1,
        "episode": 23,
        "released": "2020-04-08",
        "overview": "The ladies are concerned about Andi and her relationship choice as Andi's patience wears thin. Sabrina stands strong for all of her friends who seem to be under attack."
      },
      {
        "id": "tvmaze:1827106",
        "title": "A Bad Feeling",
        "season": 1,
        "episode": 24,
        "released": "2020-04-15",
        "overview": "The ladies grow worried about Andi and her relationship. Karen tries to figure out what she wants. Sabrina tends to Calvin in his time of need. Danni tries to move on from her hurt feelings."
      },
      {
        "id": "tvmaze:1835351",
        "title": "The Long Road",
        "season": 1,
        "episode": 25,
        "released": "2020-04-29",
        "overview": "Andi's world is turned upside down when new hidden revelations rise to the surface. Karen is in a fight for her life. Danni's love sick feelings come to the surface. Sabrina aims to protect the ones she loves."
      },
      {
        "id": "tvmaze:1923851",
        "title": "The Lonely Road",
        "season": 2,
        "episode": 1,
        "released": "2020-10-14",
        "overview": "Preston presses Danni to let her guard down and be vulnerable with him. Gary believes he is being setup. Andi arrives to her apartment and finds that Gary has possibly wrecked her life."
      },
      {
        "id": "tvmaze:1944635",
        "title": "High Crimes",
        "season": 2,
        "episode": 2,
        "released": "2020-10-14",
        "overview": "Andi is devastated that her privacy has been compromised. Fatima begs a colleague to help Andi with her legal issues. Gary calls Andi and reveals that he believes his ex-wife is framing him."
      },
      {
        "id": "tvmaze:1949015",
        "title": "It's All About Pacing",
        "season": 2,
        "episode": 3,
        "released": "2020-10-21",
        "overview": "Aaron confides in Karen that he has a new plan for his life. Preston surprises Danni with dinner and roses. Sabrina thinks Gary may be telling the truth about his ex-wife setting him up."
      },
      {
        "id": "tvmaze:1953154",
        "title": "Trying to Stay Open",
        "season": 2,
        "episode": 4,
        "released": "2020-10-28",
        "overview": "Fatima and Zac meet each other after an unfortunate accident. Danni gets offended by something Preston says. Andi contemplates a settlement in a legal case."
      },
      {
        "id": "tvmaze:1958172",
        "title": "Up in Flames",
        "season": 2,
        "episode": 5,
        "released": "2020-11-04",
        "overview": "Andi finds success at work, but new problems arise with Gary. Maurice returns to work when he thinks that he is being replaced. Danni wonders if Preston could be racist."
      },
      {
        "id": "tvmaze:1963236",
        "title": "That Look",
        "season": 2,
        "episode": 6,
        "released": "2020-11-11",
        "overview": "Andi tries to move on and consider other men. Calvin needs a place to stay. Danni is angry at Preston. Zac meets someone new."
      },
      {
        "id": "tvmaze:1967784",
        "title": "Complications",
        "season": 2,
        "episode": 7,
        "released": "2020-11-18",
        "overview": "Andi is embarrassed after a night of drinking. Gary is desperate for news about Andi. Danni hears a terrible rumor about Calvin."
      },
      {
        "id": "tvmaze:1971361",
        "title": "Moving On",
        "season": 2,
        "episode": 8,
        "released": "2020-11-25",
        "overview": "Preston is surprised by Danni. Andi wins big after a strategic battle. Zac jeopardizes his new job."
      },
      {
        "id": "tvmaze:1974855",
        "title": "When I Get Home",
        "season": 2,
        "episode": 9,
        "released": "2020-12-02",
        "overview": "Andi is uncomfortable with Gary's latest actions. Sabrina gives Maurice some advice to assist with his new troubles. Zac is confused by aco-worker's advances."
      },
      {
        "id": "tvmaze:1982749",
        "title": "The Encounter",
        "season": 2,
        "episode": 10,
        "released": "2020-12-09",
        "overview": "Olonzo approaches Maurice again. Gary becomes obsessed with reconciling with Andi. Tensions grow as Hayden threatens Zac."
      },
      {
        "id": "tvmaze:1982750",
        "title": "The Hot Stove",
        "season": 2,
        "episode": 11,
        "released": "2020-12-16",
        "overview": "Gary forces a conversation with Andi. Zac is pursued by a new love interest. Later, Gary gets drunk and his anger boils over."
      },
      {
        "id": "tvmaze:1986311",
        "title": "Thinking of You",
        "season": 2,
        "episode": 12,
        "released": "2020-12-23",
        "overview": "Andi believes she is being punished for dating a married man. Calvin and Maurice enter into an agreement. Danni and Sabrina stand infull support of Andi as she attempts to make things right with Gary."
      },
      {
        "id": "tvmaze:2013151",
        "title": "Let It Be",
        "season": 2,
        "episode": 13,
        "released": "2021-01-27",
        "overview": "Sabrina and Danni are fearful as they remember how hard it was to get Andi away from her abusive boyfriend in college. Fatima learns that Hayden has been threatening Zac. Karen confronts Zac while Zac is working at the airport. She causes a scene."
      },
      {
        "id": "tvmaze:2016391",
        "title": "Just for Me",
        "season": 2,
        "episode": 14,
        "released": "2021-02-03",
        "overview": "Zac comes to Danni's defense when she is threatened at work. Fatima and Andi share a heart to heart about their friendship. Karen believes that Zac has betrayed her."
      },
      {
        "id": "tvmaze:2022248",
        "title": "A Tough Decision",
        "season": 2,
        "episode": 15,
        "released": "2021-02-10",
        "overview": "Danni tries to help Preston after his life is threatened. Fatima is ready to pursue a relationship. Karen enacts revenge upon Zac."
      },
      {
        "id": "tvmaze:2028990",
        "title": "Missing What You Never Had",
        "season": 2,
        "episode": 16,
        "released": "2021-02-17",
        "overview": "Zac finds himself in legal trouble. Sabrina considers going on a date with a new guy. Gary puts it all on the line when he expresses his love for Andi."
      },
      {
        "id": "tvmaze:2032606",
        "title": "Addicted",
        "season": 2,
        "episode": 17,
        "released": "2021-02-24",
        "overview": "Zac believes he is being framed. Preston invites a guest to Danni's house without informing her. Andi takes a chance and goes against the wise counsel of her dear friends."
      },
      {
        "id": "tvmaze:2037302",
        "title": "When It's Midnight",
        "season": 2,
        "episode": 18,
        "released": "2021-03-03",
        "overview": "Karen becomes very upset with Andi. Fatima threatens an attorney at the firm. Maurice walks into his home and makes a shocking discovery."
      },
      {
        "id": "tvmaze:2040865",
        "title": "Severing All Ties",
        "season": 2,
        "episode": 19,
        "released": "2021-03-10",
        "overview": "Gary comes to Andi's rescue after she gets herself into a compromising situation. Zac talks seriously to a new woman who values him in away no woman ever has. Sabrina calls Calvin to confront him."
      },
      {
        "id": "tvmaze:2043841",
        "title": "Catch Fade",
        "season": 2,
        "episode": 20,
        "released": "2021-03-17",
        "overview": "Fatima comes to Andi's rescue. Sabrina realizes she made a terrible mistake. Zac confronts Karen about why he could never betray her."
      },
      {
        "id": "tvmaze:2048166",
        "title": "Where the Heart Is",
        "season": 2,
        "episode": 21,
        "released": "2021-03-24",
        "overview": "Karen struggles with her feelings for Zac. Gary reluctantly agrees to get counseling. Fatima senses hidden fears from Zac."
      },
      {
        "id": "tvmaze:2051667",
        "title": "In the Shadows",
        "season": 2,
        "episode": 22,
        "released": "2021-03-31",
        "overview": "Gary and Andi consider taking a big and scary step. Fatima kicks her new love interest out of her house. Sabrina enjoys the company of anew man."
      },
      {
        "id": "tvmaze:2078150",
        "title": "When You're Confused",
        "season": 3,
        "episode": 1,
        "released": "2021-06-09",
        "overview": "The fate of a troubled relationship is at the hands of an ex-partner."
      },
      {
        "id": "tvmaze:2106848",
        "title": "Acting Normal",
        "season": 3,
        "episode": 2,
        "released": "2021-06-16",
        "overview": "Andi finds herself in the middle of Fatima and Karen, who both want Zac."
      },
      {
        "id": "tvmaze:2110839",
        "title": "The Gift of Goodbye",
        "season": 3,
        "episode": 3,
        "released": "2021-06-23",
        "overview": "Zac helps a passenger retrieve an item she left on a plane, and the tip she gives him could be life-changing."
      },
      {
        "id": "tvmaze:2116554",
        "title": "Just a Talk",
        "season": 3,
        "episode": 4,
        "released": "2021-06-30",
        "overview": "Gary decides to surprise Andi in a way to truly show his love for her, but those close to her are filled with doubt."
      },
      {
        "id": "tvmaze:2119736",
        "title": "Being a Boy",
        "season": 3,
        "episode": 5,
        "released": "2021-07-07",
        "overview": "Zac reveals his feelings for Fatima to Karen. Andi and Gary develop a problem in bed."
      },
      {
        "id": "tvmaze:2123991",
        "title": "The Chase",
        "season": 3,
        "episode": 6,
        "released": "2021-07-14",
        "overview": "The men in these relationships are ready for next level commitments, but the ladies are reluctant."
      },
      {
        "id": "tvmaze:2129106",
        "title": "Protecting Myself",
        "season": 3,
        "episode": 7,
        "released": "2021-07-21",
        "overview": "Andi is walking a thin line while trying to keep the peace and stay out of Fatima, Karen, and Zac's love triangle."
      },
      {
        "id": "tvmaze:2132229",
        "title": "Little White Lies",
        "season": 3,
        "episode": 8,
        "released": "2021-07-28",
        "overview": "Fatima believes she's caught Gary in a compromising position and calls Andi to rush home to drop in on him unexpectantly."
      },
      {
        "id": "tvmaze:2137197",
        "title": "Complicated Situations",
        "season": 3,
        "episode": 9,
        "released": "2021-08-04",
        "overview": "Andi and Gary's relationship is put to the ultimate test."
      },
      {
        "id": "tvmaze:2139767",
        "title": "Run Tell That",
        "season": 3,
        "episode": 10,
        "released": "2021-08-11",
        "overview": "Zac's investment pays off in a major way. Danni begins to figure out how to move past her toxic relationship cycles."
      },
      {
        "id": "tvmaze:2143155",
        "title": "Unlock It",
        "season": 3,
        "episode": 11,
        "released": "2021-08-18",
        "overview": "Andi has a sudden change of heart after another one of Gary's antics strikes home."
      },
      {
        "id": "tvmaze:2187637",
        "title": "The Dollar Store",
        "season": 3,
        "episode": 12,
        "released": "2021-10-13",
        "overview": "Robin has plans to travel back to London soon and wants to make his last few days memorable with Andi."
      },
      {
        "id": "tvmaze:2192178",
        "title": "Water Under the Bridge",
        "season": 3,
        "episode": 13,
        "released": "2021-10-20",
        "overview": "Following Sabrina and Maurice's scary encounter at the bank, Calvin delivers a blow Sabrina was not expecting and may not recover from."
      },
      {
        "id": "tvmaze:2196719",
        "title": "One Word Answers",
        "season": 3,
        "episode": 14,
        "released": "2021-10-27",
        "overview": "Preston challenges Danni to dig deeper into her emotions when he questions her about her past."
      },
      {
        "id": "tvmaze:2202268",
        "title": "Unknown Caller",
        "season": 3,
        "episode": 15,
        "released": "2021-11-03",
        "overview": "Karen urgently tries to get in touch with Zac, Maurice drops some pearls of knowledge on Sabrina, Robin keeps making moves on Andi, and Hayden stirs up trouble for Zac and Fatima."
      },
      {
        "id": "tvmaze:2207482",
        "title": "At Seven",
        "season": 3,
        "episode": 16,
        "released": "2021-11-10",
        "overview": "Hayden tries to provoke Zac, Jacobi makes a peace offering to Sabrina, Karen seeks closure, Maurice offers Calvin advice, and Gary's therapist crosses the line."
      },
      {
        "id": "tvmaze:2210974",
        "title": "Burning Taboo",
        "season": 3,
        "episode": 17,
        "released": "2021-11-17",
        "overview": "Gary gets more than he bargained for in therapy, Fatima's tapped phone leads to trouble, Sabrina and Calvin have an honest discussion about sex, and Karen has a tense confrontation with Zac."
      },
      {
        "id": "tvmaze:2216885",
        "title": "From a Woman",
        "season": 3,
        "episode": 18,
        "released": "2021-11-24",
        "overview": "Danni has second thoughts about asking Preston for space when it doesn't look or feel the way she thought it would."
      },
      {
        "id": "tvmaze:2219078",
        "title": "The Wild Card",
        "season": 3,
        "episode": 19,
        "released": "2021-12-01",
        "overview": "Andi has decided she wants to let go and be uninhibited with Robin, but she has no idea just how wild Robin's inhibitions may run."
      },
      {
        "id": "tvmaze:2223639",
        "title": "We Got Time",
        "season": 3,
        "episode": 20,
        "released": "2021-12-08",
        "overview": "Karen confronts Fatima. Maurice agrees to meet Que at the police station as he turns himself in. Zac and Karen finally have a conversation."
      },
      {
        "id": "tvmaze:2230136",
        "title": "Curve Balls",
        "season": 3,
        "episode": 21,
        "released": "2021-12-15",
        "overview": "The aftermath of a slip up causes life altering decisions to be made."
      },
      {
        "id": "tvmaze:2235027",
        "title": "A Woman's Work",
        "season": 3,
        "episode": 22,
        "released": "2021-12-22",
        "overview": "Fatima devises a plan to put a stop to Hayden's games once and for all"
      },
      {
        "id": "tvmaze:2244012",
        "title": "A Brick Wall",
        "season": 4,
        "episode": 1,
        "released": "2022-01-05",
        "overview": "Danni doesn't get the response she expects when she addresses Preston's privilege, Calvin tries to smooth things over between Maurice and Sabrina, and Karen suspects Zac is hiding a secret."
      },
      {
        "id": "tvmaze:2254434",
        "title": "Still Water Runs Deep",
        "season": 4,
        "episode": 2,
        "released": "2022-01-12",
        "overview": "Andi grills Fatima about the attack on Hayden, Sabrina and Calvin set Maurice up on a date to get his mind off Que, and Gary shows up with a major surprise."
      },
      {
        "id": "tvmaze:2261616",
        "title": "Pleasantries",
        "season": 4,
        "episode": 3,
        "released": "2022-01-19",
        "overview": "Danni realizes she's not quite over Preston, Zac comes to Fatima with questions about the parking garage stunt, and an awkward talk during a date leads to problems for Sabrina and Calvin."
      },
      {
        "id": "tvmaze:2257941",
        "title": "The Night Game",
        "season": 4,
        "episode": 4,
        "released": "2022-01-26",
        "overview": "Sabrina rebounds after Calvin's outburst ruins their date, Karen comes across a basketball game that leaves her suspicious, and Danni has an unexpected visitor after a day with El Fuego."
      },
      {
        "id": "tvmaze:2262431",
        "title": "Life, Soul, and Heart",
        "season": 4,
        "episode": 5,
        "released": "2022-02-02",
        "overview": "Danni discovers Logan's secret, Calvin tries to smooth things over with Sabrina, a cellphone mix-up turns into an exercise in trust for Zac and Fatima, and Karen confides in Aaron."
      },
      {
        "id": "tvmaze:2268486",
        "title": "Hard to Get",
        "season": 4,
        "episode": 6,
        "released": "2022-02-09",
        "overview": "Karen asks Aaron for space, Gary introduces Zac to a financial adviser, Andi questions Karen's motives for inviting Fatima to their get-together, and Danni and Preston have a heart-to-heart."
      },
      {
        "id": "tvmaze:2270945",
        "title": "Moving on Up",
        "season": 4,
        "episode": 7,
        "released": "2022-02-16",
        "overview": "Andi rejects Gary's attempt to buy her love, but her friends aren't so sure she should turn down his gifts; Karen extends an invite to Fatima; and Aaron and Zac confront each other."
      },
      {
        "id": "tvmaze:2274810",
        "title": "The Sister",
        "season": 4,
        "episode": 8,
        "released": "2022-02-23",
        "overview": "Andi rejects Gary's attempt to buy her love, but her friends aren't so sure she should turn down his gifts; Karen extends an invite to Fatima; and Aaron and Zac confront each other."
      },
      {
        "id": "tvmaze:2280130",
        "title": "Counter Punch",
        "season": 4,
        "episode": 9,
        "released": "2022-03-02",
        "overview": "The police arrest Zac without telling him the charges, Sabrina looks at Bayo differently after seeing his bank account, Aaron tells Karen how he feels, and Andi stands firm against Gary."
      },
      {
        "id": "tvmaze:2285309",
        "title": "Our Favorite Places",
        "season": 4,
        "episode": 10,
        "released": "2022-03-09",
        "overview": "Zac is stunned to learn about the charges being brought against him, Andi asks Danni for advice, Maurice and Calvin argue over what to do about Que, and Sabrina's date is interrupted."
      },
      {
        "id": "tvmaze:2289591",
        "title": "Fine Wine",
        "season": 4,
        "episode": 11,
        "released": "2022-03-16",
        "overview": "Sabrina struggles with her feelings for Bayo when a jealous Calvin interrupts their date, Karen vents to Andi and Danni about prison-bound Zac, and Maurice reluctantly opens his home to Que."
      },
      {
        "id": "tvmaze:2331345",
        "title": "Goodbye at the Door",
        "season": 4,
        "episode": 12,
        "released": "2022-06-01",
        "overview": "Fatima comes out swinging in defense of Zac, Sabrina and Bayo decide to take things slow on their date, and Maurice rebuffs Que's romantic advances."
      },
      {
        "id": "tvmaze:2335230",
        "title": "Shaking in the Rain",
        "season": 4,
        "episode": 13,
        "released": "2022-06-08",
        "overview": "Andi visits Fatima after her arrest, Sabrina feels pressure to choose a man, and tensions mount as Karen and Aaron wait to find out how far along she is in her pregnancy."
      },
      {
        "id": "tvmaze:2339336",
        "title": "Money Is King",
        "season": 4,
        "episode": 14,
        "released": "2022-06-15",
        "overview": "Karen struggles to process her baby news, Andi puts Hayden in his place when he gloats about sending Fatima to jail, Danni confronts Zac, and Maurice comes home to an unwelcome dinner guest."
      },
      {
        "id": "tvmaze:2343410",
        "title": "We Know Enough",
        "season": 4,
        "episode": 15,
        "released": "2022-06-22",
        "overview": "Zac's temper gets him in trouble, Andi calls in a favor, Maurice sets ground rules for Que, Karen has a heart-to-heart with Aaron, and Sabrina learns a startling fact about Bayo."
      },
      {
        "id": "tvmaze:2348979",
        "title": "Look Closely",
        "season": 4,
        "episode": 16,
        "released": "2022-06-29",
        "overview": "Fatima is desperate to get Zac out of jail, Andi takes steps to protect herself from Gary, Robin tricks Hayden with a convincing fib, and Que surprises Calvin with his views on sexuality."
      },
      {
        "id": "tvmaze:2352968",
        "title": "Some Sort of Woman",
        "season": 4,
        "episode": 17,
        "released": "2022-07-06",
        "overview": "Aaron struggles with Karen's commitment level, Andi and Robin's relationship heats up in and out of the office, and Zac and Fatima receive potentially devastating news about his release."
      },
      {
        "id": "tvmaze:2356448",
        "title": "Enemy of Mine",
        "season": 4,
        "episode": 18,
        "released": "2022-07-13",
        "overview": "Robin uses his connections to help Andi, Sabrina confronts Bayo about his royal heritage, Aaron tries to calm an angry and jealous Gary, and Hayden tries to dig up evidence against Zac."
      },
      {
        "id": "tvmaze:2358658",
        "title": "Benefit of the Doubt",
        "season": 4,
        "episode": 19,
        "released": "2022-07-20",
        "overview": "Fatima and Zac find Jake waiting outside Zac's house with some news, Hayden confronts Andi in her office, and Sabrina gets an unexpected visitor who's desperate for her help."
      },
      {
        "id": "tvmaze:2363412",
        "title": "Inside and Out",
        "season": 4,
        "episode": 20,
        "released": "2022-07-27",
        "overview": "Zac tries to keep a secret from Fatima after receiving a threatening phone call, Danni's date with a detective leads to trouble for Sabrina, and Gary's distrust of Andi backfires on him."
      },
      {
        "id": "tvmaze:2458109",
        "title": "Moving On Up",
        "season": 4,
        "episode": 21,
        "released": "2022-08-03",
        "overview": "The consequences of Zac's infidelity land on his doorstep, Andi and Karen commiserate over their issues with the men in their lives, and Hayden approaches Fatima with a serious threat."
      },
      {
        "id": "tvmaze:2367917",
        "title": "Make Him Great",
        "season": 4,
        "episode": 22,
        "released": "2022-08-10",
        "overview": "Zac weighs his options, Gary enlists Hayden's help to get back at Andi, Karen falls ill, Danni gets an unexpected visitor at the airport, and Sabrina and Maurice's workday is interrupted."
      },
      {
        "id": "tvmaze:2394179",
        "title": "Pain and Suffering",
        "season": 5,
        "episode": 1,
        "released": "2022-10-12",
        "overview": "Fatima and Andi confront Hayden and Gary, Que is informed he needs a job, and Karen anxiously awaits answers after being hospitalized."
      },
      {
        "id": "tvmaze:2412326",
        "title": "My Boyfriend's Back",
        "season": 5,
        "episode": 2,
        "released": "2022-10-19",
        "overview": "Danni deals with two surprise visitors at work, Karen's pregnancy health scare creates a rift between Zac and Fatima, and Andi sits down with Gary for an important conversation."
      },
      {
        "id": "tvmaze:2416513",
        "title": "No Stress",
        "season": 5,
        "episode": 3,
        "released": "2022-10-26",
        "overview": "Andi leaps into lawyer mode and Calvin goes off on Que after finding out about Sabrina and Maurice's arrest, and Fatima grills Zac about his feelings for Karen."
      },
      {
        "id": "tvmaze:2418669",
        "title": "The Letter",
        "season": 5,
        "episode": 4,
        "released": "2022-11-02",
        "overview": "While Zac begs for Fatima's forgiveness, Lisa invites him and Aaron over for dinner to get closure with a less-than-thrilled Karen, and Que starts a new job."
      },
      {
        "id": "tvmaze:2422106",
        "title": "It's All About Who You Know",
        "season": 5,
        "episode": 5,
        "released": "2022-11-09",
        "overview": "Gary confronts Robin about his involvement with Andi, Karen writes letters about her feelings regarding Zac and Aaron, and Andi and Fatima try to clear Sabrina's name."
      },
      {
        "id": "tvmaze:2426251",
        "title": "Keep It One Hundred",
        "season": 5,
        "episode": 6,
        "released": "2022-11-16",
        "overview": "Karen speaks her painful truth to Zac and Aaron, Andi asks Fatima's cousin Marilyn, a.k.a. Madam, for a favor, Danni initiates her Hot Girl Summer phase, and Fatima makes a surprise visit."
      },
      {
        "id": "tvmaze:2430283",
        "title": "Ego Trip",
        "season": 5,
        "episode": 7,
        "released": "2022-11-23",
        "overview": "Gary makes a bet with Hayden about Andi's availability, Calvin calls the cops on Que, Fatima helps Zac see their situation from Karen's perspective, and Danni is physically assaulted."
      },
      {
        "id": "tvmaze:2434766",
        "title": "Pushed to the Limit",
        "season": 5,
        "episode": 8,
        "released": "2022-11-30",
        "overview": "Karen struggles to live normally with Lisa's constant attention, Robin puts Hayden in the hot seat over business dealings, and Danni seeks out Andi's help following a disturbing encounter."
      },
      {
        "id": "tvmaze:2437634",
        "title": "Pursuit for Truth",
        "season": 5,
        "episode": 9,
        "released": "2022-12-07",
        "overview": "Danni's traumatic experience pushes her to a breaking point, Karen tests Aaron's trustworthiness, Fatima is confronted with Zac's past, and Andi's past complicates Sabrina's legal situation."
      },
      {
        "id": "tvmaze:2442544",
        "title": "Discretion Is Key",
        "season": 5,
        "episode": 10,
        "released": "2022-12-14",
        "overview": "Andi and Danni break the news to Karen about Sabrina's arrest, and as Karen awaits her ultrasound results, Aaron and Zac prepare emotionally for their potential paternity.Less"
      },
      {
        "id": "tvmaze:2446505",
        "title": "Dead to Rights",
        "season": 5,
        "episode": 11,
        "released": "2022-12-21",
        "overview": "Sabrina's friends scramble to get her released on bail, Karen learns the identity of her baby's father, and Calvin loses his temper on an unrepentant Que."
      },
      {
        "id": "tvmaze:2454748",
        "title": "Backlash",
        "season": 5,
        "episode": 12,
        "released": "2023-01-04",
        "overview": "Fatima sets a plan in motion to get back at Hayden; Zac and Fatima travel into uncomfortable territory with Karen, putting their relationship to the test."
      },
      {
        "id": "tvmaze:2458847",
        "title": "Feeling the Heat",
        "season": 5,
        "episode": 13,
        "released": "2023-01-11",
        "overview": "Maurice reaches out to Calvin and is reassured that all will be well; Zac plans for a talk with Karen and Fatima when Andi shows up."
      },
      {
        "id": "tvmaze:2464024",
        "title": "Fair Game",
        "season": 5,
        "episode": 14,
        "released": "2023-01-18",
        "overview": "Zac makes Karen an offer that she can definitely refuse; Fatima is finally forced to come clean, and she and Karen face off at the townhouse while Andy and Zac are present."
      },
      {
        "id": "tvmaze:2471153",
        "title": "Two Can Play That Game",
        "season": 5,
        "episode": 15,
        "released": "2023-01-25",
        "overview": "Zac is blindsided when Fatima's friend catches him in a questionable situation; Tamara has Hayden right where she needs him; gathering pertinent information for Fatima."
      },
      {
        "id": "tvmaze:2476285",
        "title": "Picture Perfect",
        "season": 5,
        "episode": 16,
        "released": "2023-02-01",
        "overview": "Fatima confronts Zac with proof of an inappropriate interaction; Maurice must come up with bail in order to get out of jail."
      },
      {
        "id": "tvmaze:2478874",
        "title": "Looks Are Deceiving",
        "season": 5,
        "episode": 17,
        "released": "2023-02-08",
        "overview": "Fatima's accusations push Zac over the edge; Danni settles in her decision with Preston; Andi possibly finds her way into becoming a partner."
      },
      {
        "id": "tvmaze:2479358",
        "title": "Friends Are Lovers",
        "season": 5,
        "episode": 18,
        "released": "2023-02-15",
        "overview": "Karen and Andi deal with a matter of betrayal that threatens the sistahood. Fatima leaves Zac for the night to make hard decisions about what her next move should be."
      },
      {
        "id": "tvmaze:2487616",
        "title": "Truth Hurts",
        "season": 5,
        "episode": 19,
        "released": "2023-02-22",
        "overview": "Sabrina makes a surprising discovery while at Danni's apartment; Fatima puts Zac in his place as they continue to argue over harsh words."
      },
      {
        "id": "tvmaze:2492353",
        "title": "What Goes Around",
        "season": 5,
        "episode": 20,
        "released": "2023-03-01",
        "overview": "When Danni discovers Que's true identity, she is mortified; Andi's chances of becoming a partner are hindered; Zac's unexpected visitor causes trouble for him and Fatima."
      },
      {
        "id": "tvmaze:2496475",
        "title": "A Vicious Cycle",
        "season": 5,
        "episode": 21,
        "released": "2023-03-08",
        "overview": "An unforeseen visit from an old friend sparks up questions Fatima has to address; Karen has her doubts about Aaron after seeing him in a different light."
      },
      {
        "id": "tvmaze:2499212",
        "title": "Too Little, Too Late",
        "season": 5,
        "episode": 22,
        "released": "2023-03-15",
        "overview": "Danni's actions have left her in a vulnerable position, while Karen quickly realizes that Aaron is hiding something, and she pays the ultimate price."
      },
      {
        "id": "tvmaze:2535473",
        "title": "You Can't Hurry Love",
        "season": 6,
        "episode": 1,
        "released": "2023-05-31",
        "overview": "Danni wallows in self-pity until an encounter with Preston threatens to send her off the deep end."
      },
      {
        "id": "tvmaze:2558915",
        "title": "Full Circle Moments",
        "season": 6,
        "episode": 2,
        "released": "2023-06-07",
        "overview": "Preston protects Danni from an unwelcome visitor at her apartment, Sabrina and Calvin try to reason with a vengeful Maurice, Zac makes plans to meet his son, and Aaron tries to reach Karen."
      },
      {
        "id": "tvmaze:2563838",
        "title": "Fanning the Flames",
        "season": 6,
        "episode": 3,
        "released": "2023-06-14",
        "overview": "Aaron and Pam fear the worst after Karen's salon goes up in flames, Zac and Fatima work on a plan to protect Michael, and Maurice confronts Que after learning he and Sabrina have been framed."
      },
      {
        "id": "tvmaze:2567574",
        "title": "Face the Fire",
        "season": 6,
        "episode": 4,
        "released": "2023-06-21",
        "overview": "The group rushes to the scene of the fire at Karen's salon, and Fatima feels abandoned by Zac's emotional reaction to the news."
      },
      {
        "id": "tvmaze:2572574",
        "title": "Better Safe Than Sorry",
        "season": 6,
        "episode": 5,
        "released": "2023-06-28",
        "overview": "Karen keeps her friends in suspense about the identity of her baby's father, Calvin gives Maurice unwelcomed romantic advice, and a disinhibited Andi tells Gary how she really feels."
      },
      {
        "id": "tvmaze:2577104",
        "title": "Mending Fences",
        "season": 6,
        "episode": 6,
        "released": "2023-07-05",
        "overview": "Danni wakes up to a surprise, Hayden confides in Gary about an impulsive act, Sabrina and Maurice learn what's at stake, and Fatima is suspicious about Zac's kindness toward Karen."
      },
      {
        "id": "tvmaze:2580950",
        "title": "Ordinary Pain",
        "season": 6,
        "episode": 7,
        "released": "2023-07-12",
        "overview": "After catching Zac in a compromising position, Fatima doubts their relationship, Hayden debates annulling his marriage, Maurice plots to avoid prison, and Sabrina tries to reason with Que."
      },
      {
        "id": "tvmaze:2591151",
        "title": "Uneven Playing Field",
        "season": 6,
        "episode": 8,
        "released": "2023-07-19",
        "overview": "Andi and Gary don't see eye-to-eye about their encounter, Karen refuses to accept Zac's gentle rejection, Danni and Preston take a step forward, and Fatima reconsiders her decision."
      },
      {
        "id": "tvmaze:2597039",
        "title": "True Colors",
        "season": 6,
        "episode": 9,
        "released": "2023-07-26",
        "overview": "Fatima confronts Karen, Hayden has a hard talk with Tamara, Danni questions Preston's lack of attention, Gary sees a new side of Andi, and Maurice devises a plan to clear Sabrina's name."
      },
      {
        "id": "tvmaze:2601075",
        "title": "The Aftermath",
        "season": 6,
        "episode": 10,
        "released": "2023-08-02",
        "overview": "Maurice protects a friend during a police interrogation, Calvin visits Sabrina, Danni's night with Preston gets derailed by marijuana-induced paranoia, and Andi offers Fatima advice."
      },
      {
        "id": "tvmaze:2607398",
        "title": "No Turning Back",
        "season": 6,
        "episode": 11,
        "released": "2023-08-09",
        "overview": "Sabrina and Calvin call in help for Maurice, who is determined to turn himself in, Andi intercepts troubling news about Zac, and tensions between Karen and Fatima hit a boiling point."
      },
      {
        "id": "tvmaze:2644635",
        "title": "Daydreams",
        "season": 6,
        "episode": 12,
        "released": "2023-10-18",
        "overview": "Gary gives Hayden a stern warning to be careful with Tamara's mysterious motives. Sabrina learns that Bayo's help with her and Maurice's legal situation has strings attached."
      },
      {
        "id": "tvmaze:2664913",
        "title": "Truth Is",
        "season": 6,
        "episode": 13,
        "released": "2023-10-25",
        "overview": "Karen is aware of the paternity outcome, and the women support her; Que's lies catch up to him, as Zac and Fatima make a sad discovery about his son."
      },
      {
        "id": "tvmaze:2669642",
        "title": "Something New",
        "season": 6,
        "episode": 14,
        "released": "2023-11-01",
        "overview": "Andi, Sabrina, and Danni have dream dates that seem almost too good to be true; Fatima and Zac make a quick decision for the safety of Michael."
      },
      {
        "id": "tvmaze:2675433",
        "title": "Too Close To Home",
        "season": 6,
        "episode": 15,
        "released": "2023-11-08",
        "overview": "After spending time with Michael, Zac learns he must do whatever it takes to get custody of his son; Preston and Danni continue to not see eye to eye."
      },
      {
        "id": "tvmaze:2680846",
        "title": "Relentless Pursuit",
        "season": 6,
        "episode": 16,
        "released": "2023-11-15",
        "overview": "As Zac and Fatima struggle with the fallout of custodial care, Sabrina and Maurice discover their fate; Karen realizes that the studio damage may lose her, her livelihood."
      },
      {
        "id": "tvmaze:2685190",
        "title": "Taste of Freedom",
        "season": 6,
        "episode": 17,
        "released": "2023-11-22",
        "overview": "Danni avoids a difficult conversation with Preston; Andi, Danni, and Sabrina's triple date at Jordan's takes an unexpected turn."
      },
      {
        "id": "tvmaze:2689914",
        "title": "From the Blindside",
        "season": 6,
        "episode": 18,
        "released": "2023-11-29",
        "overview": "When Jordan's sister Penelope shows up, Gary and Andi are both put in an uncomfortable situation. With doubts about his son's safety, Zac and Fatima try to track down Heather's whereabouts."
      },
      {
        "id": "tvmaze:2696395",
        "title": "Dear Karma",
        "season": 6,
        "episode": 19,
        "released": "2023-12-06",
        "overview": "Andi dwells on her past with Gary, while Zac and Fatima receive disturbing news about his son; Maurice is drawn to a new, charming man."
      },
      {
        "id": "tvmaze:2699577",
        "title": "The Last Laugh",
        "season": 6,
        "episode": 20,
        "released": "2023-12-13",
        "overview": "Karen reconsiders a new direction for her shop while Zac and Fatima prepare for unfortunate news about his son; Sabrina is determined to reclaim her life."
      },
      {
        "id": "tvmaze:2707098",
        "title": "Lose To Win",
        "season": 6,
        "episode": 21,
        "released": "2023-12-20",
        "overview": "As Gary's misdeeds collide, Sabrina's good news will have a negative effect on Maurice; Hayden confronts Fatima concerning Tamara; Michael's fate is revealed to Zac and Fatima, as Karen makes a life-altering decision."
      },
      {
        "id": "tvmaze:2717504",
        "title": "Beautiful Lies",
        "season": 6,
        "episode": 22,
        "released": "2023-12-27",
        "overview": "After Andi, Fatima and Penelope confront Gary, his true intentions are revealed; Danni deals with Preston's big news; Zac and Fatima try to work things out to get custody of Michael."
      },
      {
        "id": "tvmaze:2720293",
        "title": "New Beginnings",
        "season": 7,
        "episode": 1,
        "released": "2024-01-03",
        "overview": "New romances and old tensions collide as we check in on the lives of Andi, Karen, Danni, Sabrina, and Fatima three months later."
      },
      {
        "id": "tvmaze:2728688",
        "title": "Drunk in Love",
        "season": 7,
        "episode": 2,
        "released": "2024-01-10",
        "overview": "The Sista's first boozy brunch with Fatima opens the door to new perspectives, salacious topics, and everyone's take on Karen's pregnancy; Gary goes from blaming Penelope for his creeplike behavior to dodging the feds."
      },
      {
        "id": "tvmaze:2732565",
        "title": "Grand Openings And Closings",
        "season": 7,
        "episode": 3,
        "released": "2024-01-17",
        "overview": "Karen's grand opening is full of surprises; Andi feels the pressure at work as her dealings with Gary may end her career."
      },
      {
        "id": "tvmaze:2741869",
        "title": "Death Becomes Them",
        "season": 7,
        "episode": 4,
        "released": "2024-01-24",
        "overview": "Andi and Sabrina both find themselves competing with workplace rivals, Danni is torn between her friendships with Karen and Fatima, and Penelope makes a shocking discovery about Gary."
      },
      {
        "id": "tvmaze:2747119",
        "title": "Hanging in the Balance",
        "season": 7,
        "episode": 5,
        "released": "2024-01-31",
        "overview": "Danni is apprehensive about returning to counseling until she reveals past trauma that could be the reason for her present choices."
      },
      {
        "id": "tvmaze:2752564",
        "title": "Pretty Hurts",
        "season": 7,
        "episode": 6,
        "released": "2024-02-07",
        "overview": "The ladies talk about their lives in their 30s; Fatima keeps a secret from Zac; Gary tests the waters with Tamara."
      },
      {
        "id": "tvmaze:2761666",
        "title": "It's Giving Scandal",
        "season": 7,
        "episode": 7,
        "released": "2024-02-14",
        "overview": "Just when things seem to be perfect between Andi and Jordan, a damaging story about Jordan's past surfaces that not only impacts his campaign but his relationship with Andi."
      },
      {
        "id": "tvmaze:2767809",
        "title": "Pens and Needles",
        "season": 7,
        "episode": 8,
        "released": "2024-02-21",
        "overview": "Karen and Zac's DNA test reveals more than they expected; Andi is surprised by a new, big client and learns shocking information about a man in her life; Danni and Sabrina try to turn back the hands of time."
      },
      {
        "id": "tvmaze:2771214",
        "title": "Threes a Crowd",
        "season": 7,
        "episode": 9,
        "released": "2024-02-28",
        "overview": "Karen shares unexpected news that makes Zac happy but causes a totally different reaction from Fatima; one of Gary's plans to sabotage Andi backfires."
      },
      {
        "id": "tvmaze:2779447",
        "title": "The Good Fight",
        "season": 7,
        "episode": 10,
        "released": "2024-03-06",
        "overview": "Sabrina fears for her job after standing up to her boss, Andi's new client drops a bombshell, Maurice's date night goes awry, and Gary explodes when Penelope confronts him about his past."
      },
      {
        "id": "tvmaze:2784195",
        "title": "Gone Girl",
        "season": 7,
        "episode": 11,
        "released": "2024-03-13",
        "overview": "A mocktail party ends in disaster for the Sistas, as paternity results are revealed, and one woman goes missing. Meanwhile Andi is forced to work with her worst nightmare."
      },
      {
        "id": "tvmaze:2876810",
        "title": "Next Level",
        "season": 7,
        "episode": 12,
        "released": "2024-05-29",
        "overview": "Maurice and Grayson have a serious conversation about their future together; Andi delivers devastating news to Jordan, causing him to show another side of himself."
      },
      {
        "id": "tvmaze:2881795",
        "title": "Who Can I Run To",
        "season": 7,
        "episode": 13,
        "released": "2024-06-05",
        "overview": "Andi is presented with an offer to help take Gary down once and for all; Danni and Fatima can't seem to keep Karen's big news to themselves."
      },
      {
        "id": "tvmaze:2896808",
        "title": "All For The D",
        "season": 7,
        "episode": 14,
        "released": "2024-06-12",
        "overview": "Gary's savagery continues as he plants a seed in Jordan's head about Andi, all while screwing Hayden's girl right in their home; when Karen finds out Danni is telling her business, the tension between the women grows."
      },
      {
        "id": "tvmaze:2900907",
        "title": "Love Means Never Having To Say You're Sorry",
        "season": 7,
        "episode": 15,
        "released": "2024-06-19",
        "overview": "Andi and Hayden make a shocking discovery on the Marie-Willis case; Danni seeks advice on how to best apologize to Tony."
      },
      {
        "id": "tvmaze:2900909",
        "title": "Close To You",
        "season": 7,
        "episode": 16,
        "released": "2024-06-26",
        "overview": "Sabrina attempts to plan a baby shower for Karen and Danni struggles to understand the dynamic between Tiffany and Tony; meanwhile, Jordan finds himself in harm's way."
      },
      {
        "id": "tvmaze:2929985",
        "title": "Taste Of Freedom",
        "season": 7,
        "episode": 17,
        "released": "2024-07-03",
        "overview": "Gary reaches his limit with Andi so he charges her up with an ultimatum, either she marries him, or Jordan pays the price; Fatima's intuition about Hayden and Marie Willis is confirmed after seeing them together."
      },
      {
        "id": "tvmaze:2931691",
        "title": "Where Do Broken Hearts Go?",
        "season": 7,
        "episode": 18,
        "released": "2024-07-10",
        "overview": "Gary forces Andi's hand and she makes a heartbreaking decision; Karen finds solace with Danni and with Zac; Danni attempts to defend her behavior around Tony's kids; Sabrina meets someone new who is interested in her personal life."
      },
      {
        "id": "tvmaze:2936329",
        "title": "It Takes A Village",
        "season": 7,
        "episode": 19,
        "released": "2024-07-17",
        "overview": "Karen's baby shower is full of fun and healing until Gary shows up with a shocking announcement; Damany presents Sabrina with a surprising opportunity."
      },
      {
        "id": "tvmaze:2941047",
        "title": "Beautiful Liar",
        "season": 7,
        "episode": 20,
        "released": "2024-07-24",
        "overview": "Gary's presence and announcement at the baby shower shakes up Andi's friends; she now must put on a brave face and lie to everyone about saying yes to Gary's marriage proposal; Hayden's tryst is finally exposed to not only his co-workers."
      },
      {
        "id": "tvmaze:2946603",
        "title": "Penultimate",
        "season": 7,
        "episode": 21,
        "released": "2024-07-31",
        "overview": "Jordan and Fatima engage in ugly battles with Gary on Andi's behalf; Zac and Aaron bond over baby furniture; Karen and Pam make peace; Danni has a therapy session hoping to figure out her love life."
      },
      {
        "id": "tvmaze:2955819",
        "title": "Had It Coming",
        "season": 7,
        "episode": 22,
        "released": "2024-08-07",
        "overview": "Andi's career is completely changed but her life is thrown into turmoil when someone's life is at stake. Meanwhile, Sabrina's true desires come true."
      },
      {
        "id": "tvmaze:3003333",
        "title": "Dead Man Walking",
        "season": 8,
        "episode": 1,
        "released": "2024-10-16",
        "overview": "Andi, along with the rest of her close-knit sister circle and even a few enemies, all have some explaining to do amid the fallout of Gary's brutal stabbing."
      },
      {
        "id": "tvmaze:3027371",
        "title": "Tea Time",
        "season": 8,
        "episode": 2,
        "released": "2024-10-23",
        "overview": "The Sistas deal with the aftermath of the attack on Gary as they try to return to a semblance of normalcy. Zac and Fatima decide to take the investigation into their own hands."
      },
      {
        "id": "tvmaze:3030002",
        "title": "Up Close & Personal",
        "season": 8,
        "episode": 3,
        "released": "2024-10-30",
        "overview": "Andi struggles with the fallout post Gary's stabbing when all her friends are interrogated by the FBI for their possible role in hurting Gary; Andi makes a confession to her friends."
      },
      {
        "id": "tvmaze:3030003",
        "title": "Showin' Out",
        "season": 8,
        "episode": 4,
        "released": "2024-11-06",
        "overview": "Andi's attempt to see Gary is stopped by an indignant Hudson. Tony's surprise for Danni leads to a blow-up between them at work. Robin gives Fatima the worst boss she can imagine. An old rival returns to the bank and accuses Sabrina and Maurice of getting her fired; which brings out a new side of Sabrina. A disgruntled customer threatens Karen's salon."
      },
      {
        "id": "tvmaze:3030005",
        "title": "Wounded Eros",
        "season": 8,
        "episode": 5,
        "released": "2024-11-13",
        "overview": "Andi becomes entangled in intense confrontations surrounding Gary; Karen's business faces potential danger; Sabrina is torn between her loyalty to her man and supporting her friend."
      },
      {
        "id": "tvmaze:3039169",
        "title": "Web of Deceit",
        "season": 8,
        "episode": 6,
        "released": "2024-11-20",
        "overview": "Danni and Tony lay their cards on the table in public as Rich expresses his discontent with Sabrina's half-truths. Marie Willis puts Vanessa in her place and makes demands of Karen and Pam."
      },
      {
        "id": "tvmaze:3044928",
        "title": "Game Recognizes Game",
        "season": 8,
        "episode": 7,
        "released": "2024-11-27",
        "overview": "Andi is forced into an all-familiar situation pertaining to Gary. Robin and Fatima faceoff, putting Fatima in a questionable situation. Meanwhile, Rich and Sabrina hash out their differences."
      },
      {
        "id": "tvmaze:3050551",
        "title": "Appearances",
        "season": 8,
        "episode": 8,
        "released": "2024-12-04",
        "overview": "Andi's loyalty is questioned following Gary's recovery; Karen and Danni confront their views on love and past relationship struggles; Zac and Fatima team up for a covert mission."
      },
      {
        "id": "tvmaze:3052160",
        "title": "Missing Pieces",
        "season": 8,
        "episode": 9,
        "released": "2024-12-11",
        "overview": "Zac learns information that can add a new suspect to the list of those who may have stabbed Gary; Penelope reveals to Jordan a condition she's been dealing with, possibly brought on by the trauma she's endured."
      },
      {
        "id": "tvmaze:3068391",
        "title": "Forget Me Not",
        "season": 8,
        "episode": 10,
        "released": "2024-12-18",
        "overview": "Andi is caught off guard by Gary's unexpected appearance, leading her to reluctantly entertain his delusions; this creates tension among herself, Robin and Hayden."
      },
      {
        "id": "tvmaze:3076853",
        "title": "Breathe",
        "season": 8,
        "episode": 11,
        "released": "2024-12-18",
        "overview": "Andi goes back to work despite Robin's protests and is met by a surprise when the partners put her on leave; they rescind her offer to be the new managing partner; later, she's attacked from behind in the parking lot."
      },
      {
        "id": "tvmaze:3081727",
        "title": "Pull the Trigger",
        "season": 8,
        "episode": 12,
        "released": "2025-01-01",
        "overview": "While Danni and Karen face potentially fatal situations, Andi discovers Robin's hidden obsession and reclaims power; news of Gary's stabber spreads quickly."
      },
      {
        "id": "tvmaze:3106271",
        "title": "Aftershocks",
        "season": 8,
        "episode": 13,
        "released": "2025-01-08",
        "overview": "The ladies reel from the news of an arrest made regarding Gary's stabbing, Sabrina helps Danni with her issues, and Karen has a surprising moment of intimacy."
      },
      {
        "id": "tvmaze:3103072",
        "title": "Knock Knock",
        "season": 8,
        "episode": 14,
        "released": "2025-01-15",
        "overview": "Danni confides in an old friend about the chaos in her life, Fatima collects evidence on Hayden, Andi questions Robin's motives, and Gary brings a new suspect to the forefront."
      },
      {
        "id": "tvmaze:3108087",
        "title": "Tectonic Shifts",
        "season": 8,
        "episode": 15,
        "released": "2025-01-22",
        "overview": "Gary struggles to remember what happened to him, Karen and Andi receive unexpected visitors, and Sabrina and Rich are given devastating news."
      },
      {
        "id": "tvmaze:3115767",
        "title": "Choose You",
        "season": 8,
        "episode": 16,
        "released": "2025-01-29",
        "overview": "Agent Josh Watt threatens Zac and Fatima, Rich grows jealous of Damany, and Marie Willis confronts the Sister's Circle about their questionable decisions."
      },
      {
        "id": "tvmaze:3136328",
        "title": "Call Me By His Name",
        "season": 8,
        "episode": 17,
        "released": "2025-02-05",
        "overview": "Andi agrees to meet with Jordan, Sabrina and Rich work through a misunderstanding, Danni escalates a fight with a coworker, and Fatima and Zac decide how to satisfy Agent Watt's demands."
      },
      {
        "id": "tvmaze:3129887",
        "title": "War to Roses",
        "season": 8,
        "episode": 18,
        "released": "2025-02-12",
        "overview": "Andi and Jordan determine the future of their relationship, Danni receives grave news about her job, and Hayden handles an issue driven by his hidden truths."
      },
      {
        "id": "tvmaze:3140063",
        "title": "Knuckin' and Buckin'",
        "season": 8,
        "episode": 19,
        "released": "2025-02-19",
        "overview": "Andi confronts Robin and the partners with Marie Willis's help, Tony is shocked by Sabrina's major decision, and Fatima's visit with Tamara has brutal repercussions."
      },
      {
        "id": "tvmaze:3149135",
        "title": "Boss Lady",
        "season": 8,
        "episode": 20,
        "released": "2025-02-26",
        "overview": "Hayden humbles himself and wishes Andi well as she embarks on her journey, and Sabrina has an unpleasant run-in with Tony when she questions him about a misunderstanding with Danni."
      },
      {
        "id": "tvmaze:3155185",
        "title": "London Bridges",
        "season": 8,
        "episode": 21,
        "released": "2025-03-05",
        "overview": "The ladies find themselves at a crossroads, Andi is shocked to learn Robin is once again planning to leave town, and Sabrina receives a blast from the past."
      },
      {
        "id": "tvmaze:3161349",
        "title": "Before You Walk Out of My Life",
        "season": 8,
        "episode": 22,
        "released": "2025-03-12",
        "overview": "Sabrina gets closure from an old flame, Andi must decide if she wants to make it work with Robin before he walks out of her life, and Gary's investigation comes to a head."
      },
      {
        "id": "tvmaze:3171101",
        "title": "No Time to Wait",
        "season": 9,
        "episode": 1,
        "released": "2025-07-16",
        "overview": "Zac and Andi try to regroup after Hudson's shocking act, a furious Sabrina confronts Rich, and a city-wide blackout adds further complications as Karen's labor turns dangerous."
      },
      {
        "id": "tvmaze:3301618",
        "title": "Do No Harm",
        "season": 9,
        "episode": 2,
        "released": "2025-07-23",
        "overview": "Karen's suffering is ignored by a dismissive doctor, and desperation sets in as the women search for a doctor who cares."
      },
      {
        "id": "tvmaze:3308130",
        "title": "Having Faith",
        "season": 9,
        "episode": 3,
        "released": "2025-07-30",
        "overview": "Zac, Aaron and the ladies lean on one another for support as Karen's life hangs in the balance, and Danni chastises Rich after Sabrina reveals his betrayal."
      },
      {
        "id": "tvmaze:3316302",
        "title": "One Is The Loneliest Number",
        "season": 9,
        "episode": 4,
        "released": "2025-08-06",
        "overview": "Despite best efforts, Karen refuses any kind of comforting company while the rest of the Sistas confront their own individual problems as they all rear their ugly heads again."
      },
      {
        "id": "tvmaze:3321799",
        "title": "Heavy Is The Crown",
        "season": 9,
        "episode": 5,
        "released": "2025-08-13",
        "overview": "Karen sinks deeper into postpartum struggles, Andi digs into a grave case, Sabrina confronts her betrayers, and Danni, Fatima and Zac face unexpected turns that test their limits."
      },
      {
        "id": "tvmaze:3324118",
        "title": "New Normal",
        "season": 9,
        "episode": 6,
        "released": "2025-08-20",
        "overview": "Maurice teaches a newly single Sabrina about the world of casual hookups, Andi encounters a setback in her legal pursuit of Dr. Cruise, and Zac finds comfort in an unexpected source."
      },
      {
        "id": "tvmaze:3335132",
        "title": "Cutting Ties",
        "season": 9,
        "episode": 7,
        "released": "2025-08-27",
        "overview": "Zac and Karen bond as they reflect on their complicated past, Tamara gives Hayden a brutal wake-up call, and Maurice and Paige take Sabrina out on the town to find a new man."
      },
      {
        "id": "tvmaze:3364722",
        "title": "Truth Is",
        "season": 9,
        "episode": 8,
        "released": "2025-09-03",
        "overview": "Sabrina's one-night stand doesn't go as planned, tensions rise between Zac and Fatima over pregnancy plans, and Andi and Dr. Vaughn have surprising news for one another on their first date."
      },
      {
        "id": "tvmaze:3348687",
        "title": "Return To Sender",
        "season": 9,
        "episode": 9,
        "released": "2025-09-10",
        "overview": "Danni grows impatient with Tony as he enjoys unemployment, Karen confides in Dr. Vaughn about her mental health, and gifts from Fatima's overly generous clients trigger Zac's jealousy."
      },
      {
        "id": "tvmaze:3360219",
        "title": "Back Shot",
        "season": 9,
        "episode": 10,
        "released": "2025-09-17",
        "overview": "Zac reverts to his old ways when he confronts one of Fatima's clients, Karen finds her salon running differently than how she left it, and Andi unearths even more dirt on Dr. Cruise."
      },
      {
        "id": "tvmaze:3366881",
        "title": "Surprise, Surprise",
        "season": 9,
        "episode": 11,
        "released": "2025-09-24",
        "overview": "Everyone's problems must be put on hold when one of their own goes missing, and the circumstances of the disappearance cause them all to fear the worst."
      },
      {
        "id": "tvmaze:3389152",
        "title": "Search Party",
        "season": 9,
        "episode": 12,
        "released": "2025-10-08",
        "overview": "Gary begs Andi for closure, Chaz and Zac butt heads over Fatima, Maurice nervously welcomes Dylan to his home, and Karen's loved ones search for her and baby Faith."
      },
      {
        "id": "tvmaze:3395725",
        "title": "On My Own",
        "season": 9,
        "episode": 13,
        "released": "2025-10-15",
        "overview": "When Karen disappears with Faith, a cryptic call sends Fatima on a tense search, Aaron struggles with doubt and guilt, and all must face how their actions drove her away when she resurfaces."
      },
      {
        "id": "tvmaze:3402034",
        "title": "Pull Up On Me!",
        "season": 9,
        "episode": 14,
        "released": "2025-10-22",
        "overview": "Karen and Aaron talk through her big decision, Danni gets both good and bad news, and Andi, Fatima, Sabrina and Maurice are surprised by unexpected visitors at their places of business."
      },
      {
        "id": "tvmaze:3407163",
        "title": "Family Affair",
        "season": 9,
        "episode": 15,
        "released": "2025-10-29",
        "overview": "Andi gets a surprise visit and an earful from her mother, Karen and Aaron plan for their future, and Sabrina hesitates to take a chance on a new relationship."
      },
      {
        "id": "tvmaze:3430497",
        "title": "Unbreakable Bond",
        "season": 9,
        "episode": 16,
        "released": "2025-11-05",
        "overview": "Karen's sister circle is upended by Danni and Andi's squabbling, and Gary realizes his attempts to make amends may all be for nothing when he gets cornered by Fatima, Zac and Hayden."
      },
      {
        "id": "tvmaze:3430498",
        "title": "The Ties That Bind",
        "season": 9,
        "episode": 17,
        "released": "2025-11-12",
        "overview": "Danni discovers Tony's destructive \"hobby,\" Andi slows things down with Dr. Vaughn, Sabrina sets ground rules with her latest hookup, and Aaron has a romantic surprise for Karen."
      },
      {
        "id": "tvmaze:3442276",
        "title": "Diamonds Are Forever",
        "season": 9,
        "episode": 18,
        "released": "2025-11-19",
        "overview": "Karen happily plans her new life, Sabrina is outraged by Damany's request, Zac learns some hard truths, Danni receives a diagnosis, and Andi sits down with the women harmed by Dr. Cruise."
      },
      {
        "id": "tvmaze:3450535",
        "title": "Taking It All Back",
        "season": 9,
        "episode": 19,
        "released": "2025-11-26",
        "overview": "Andi and Karen present the stories of the female survivors to solidify the case against Dr. Cruise, Danni's day goes from bad to worse, and Fatima comes to Sabrina's rescue."
      }
    ]
  }
}