{
  "meta": {
    "id": "tvmaze:10040",
    "type": "series",
    "name": "The Real Housewives of Potomac",
    "description": "Just up the river from our nation's capital lies a hidden gem—Potomac, Maryland. Its rolling hills, gated mansions, sophisticated prep schools, and exclusive country clubs all serve to keep the area invitation-only. Sprinkled throughout this community are a handful of old-line, wealthy African-American families who have historically broken racial barriers to provide a life of privilege for their children. The Real Housewives of Potomac follows the upscale lives of six intriguing, well-to-do women: Gizelle Bryant, Katie Rost, Karen Huger, Charrisse Jackson-Jordan, Robyn Dixon, and Ashley Darby, all of whom have fought for their places in this society by way of legacy or marriage. In a town where entry is granted only through class, pedigree, and lineage, how far will these ladies go to secure their spot at the top of this prestigious circle?",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/538/1345329.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/538/1345329.jpg",
    "videos": [
      {
        "id": "tvmaze:3460597",
        "title": "Lease Is Up, Giddy Up",
        "season": 10,
        "episode": 11,
        "released": "2025-12-14",
        "overview": ""
      },
      {
        "id": "tvmaze:3456138",
        "title": "Blunt Truths",
        "season": 10,
        "episode": 10,
        "released": "2025-12-07",
        "overview": ""
      },
      {
        "id": "tvmaze:529285",
        "title": "Mind Your Manners",
        "season": 1,
        "episode": 1,
        "released": "2016-01-17",
        "overview": "Welcome to Potomac, where proper etiquette is key, and breaking the rules comes with serious consequences. At a birthday party celebrating Karen Huger, grande dame of Potomac high society, Gizelle Bryant's lack of manners puts the two divas into a battle for supremacy. And as if that wasn't enough, Gizelle is under fire from Charrisse Jackson Jordan, for acting not very lady like in her plush home. International model Katie Rost, a divorced socialite with three toddlers, is doing everything in her power to get her boyfriend to put a ring on it. Meanwhile, Robyn Dixon, who lives with her ex-husband, former NBA star Juan Dixon, must decide if she wants to rekindle her relationship with her ex."
      },
      {
        "id": "tvmaze:567569",
        "title": "Divas, Queens and Bubalas",
        "season": 1,
        "episode": 2,
        "released": "2016-01-24",
        "overview": "Gizelle's reputation is called into question by Potomac's queen bee, Karen, and its self-appointed social director, Charrisse. Will they be able to play nice, or are these domestic divas going to take off their white gloves and get dirty? Katie has to tap into her Jewish roots to prove herself a true member of the tribe for her twins' naming ceremony. Things get a little dicey when the ladies meet the young, boisterous beauty queen Ashley Darby. Will Ashley be able to break into this coveted circle of sophisticated women?"
      },
      {
        "id": "tvmaze:567570",
        "title": "What a Little Whiskey Can Do",
        "season": 1,
        "episode": 3,
        "released": "2016-01-31",
        "overview": "Katie steps out into Washington DC's charity social scene to attract attention and dollars for her family's foundation. But the pressure shifts from her philanthropic work to her marital status. Robyn faces a difficult choice that may threaten her unconventional relationship with her ex-husband. Karen and Charrisse meet Katie's new friend, 26-year-old Ashley Darby. Married to a wealthy businessman almost 30 years her senior, this young wife has her sights set on joining Potomac society. Ashley attempts to impress the women when she hosts a whiskey tasting, but the liquor isn't the only thing causing discomfort."
      },
      {
        "id": "tvmaze:602252",
        "title": "Desperately Seeking Marriage",
        "season": 1,
        "episode": 4,
        "released": "2016-02-14",
        "overview": "Reeling from the news that Andrew doesn't plan on getting married anytime soon, Katie does some secret home renovating behind his back. Charrisse finally tells her friends the truth about her 18-year marriage, leaving the women in shock. With her daughter about to leave for college, Karen takes to the air...literally, by learning how to fly a plane. Ashley violates the rules of Potomac by spreading online gossip about the ladies of Potomac - leaving her to face the wrath of this close-knit community."
      },
      {
        "id": "tvmaze:625466",
        "title": "Error on the High Seas",
        "season": 1,
        "episode": 5,
        "released": "2016-02-21",
        "overview": "Karen is over Ashley's kitty-cat parties, so she launches a couples' soiree on a yacht to school her young protégée. Gizelle's newest suitor scores an invite to Karen's cruise, but can he seal it with a kiss? Meanwhile, after showing too much PDA at Ashley's birthday party, Katie finds herself in hot water. And, after going to Charrisse for advice, Robyn is shocked by the news that Charrisse's marriage has reached the point of no return."
      },
      {
        "id": "tvmaze:628732",
        "title": "Beach Session",
        "season": 1,
        "episode": 6,
        "released": "2016-03-06",
        "overview": "With Karen in her corner to mentor her, Ashley hopes to impress her new friends with a trip to her beach house on the Delaware shore. But when the accommodations turn out to be less than five-star, Ashley finds herself on the ropes fighting to keep the women from abandoning ship before the trip even gets started. Meanwhile, under pressure to turn her family's foundation into a philanthropic force, Katie struggles to persuade any of her friends to support her. And Charrisse convinces the women to share some of their darkest secrets."
      },
      {
        "id": "tvmaze:634424",
        "title": "Reading Is Fundamental",
        "season": 1,
        "episode": 7,
        "released": "2016-03-13",
        "overview": "A night of girl bonding takes a turn when Gizelle confronts Katie about her strange behavior. Katie gets a lesson in Reading 101 as the other women encourage her to put Gizelle in her place. Meanwhile, it looks like Ashley has rescued the trip from the edge of disaster - until a surprise from her husband throws the future of her new friendships into question all over again."
      },
      {
        "id": "tvmaze:645722",
        "title": "All Shades of Shade",
        "season": 1,
        "episode": 8,
        "released": "2016-03-20",
        "overview": "Gizelle's inner entrepreneur takes center stage, but the shade is real when Katie blows off a focus group for her budding makeup line. Juan and Robyn take a romantic trip down memory lane, making her more confused than ever about the state of their relationship. Karen launches a charity event close to her heart, but Ashley and Michael must get \"on par\" before they are welcome in her home. And will Karen push Ashley one-step too far?"
      },
      {
        "id": "tvmaze:658132",
        "title": "Fifty Sense",
        "season": 1,
        "episode": 9,
        "released": "2016-03-27",
        "overview": "Whether or not her husband, Eddie, shows up for the big party, Charrisse is determined to celebrate her 50th birthday to the tune of $80,000 of his money. Karen faces her empty nest after an emotional college send-off for her daughter Rayvin. The future of Robyn and Juan's relationship hangs in the balance as they finally get the news about a possible job out of state. Ashley and Karen's friendship may have reached the point of no return. And Michael's game of grab-ass on the dance floor stirs up a new feud among the ladies."
      },
      {
        "id": "tvmaze:691646",
        "title": "Rules of Enragement",
        "season": 1,
        "episode": 10,
        "released": "2016-04-03",
        "overview": "Katie and Andrew's relationship takes a turn when he surprises her with a weeklong trip to Scotland... that he's taking without her. Hearing her biological clock ticking at the ripe old age of 27, Ashley puts pressure on a reluctant Michael to start having kids. Gizelle hosts a \"come to Jesus\" lunch to try to get friendships amongst the ladies back on track. Karen takes off the white gloves and reads Ashley for filth, while an uproar ensues between Katie, Robyn, and Gizelle over butt grabs and biracial labels."
      },
      {
        "id": "tvmaze:691778",
        "title": "Reunion Part 1",
        "season": 1,
        "episode": 11,
        "released": "2016-04-10",
        "overview": "Fevers spike as Gizelle, Katie, Ashley, and Robyn try to pull Karen off her podium as the Grande Dame of Potomac. Ashley defends her hostessing, her husband and her humping despite the slings and arrows of shade-rageousness. Robyn makes a surprising admission about her feelings for her ex-husband. And questions about the sensitive topic of race spark a high-octane feud."
      },
      {
        "id": "tvmaze:691779",
        "title": "Reunion Part 2",
        "season": 1,
        "episode": 12,
        "released": "2016-04-17",
        "overview": "Katie's revelation about her relationship with Andrew leaves everyone wondering if she's headed down the aisle or out the door. Karen's husband, Ray (the \"Black Bill Gates\"), and Ashley's husband, Michael, join the ladies to weigh in on Michael's surprise visit to the girls' beach trip and his dance-floor butt grab that sent shockwaves through Potomac. Charrisse reveals just how close her marriage is to destruction. And Gizelle and Katie battle over shocking allegations, leaving all the women to wonder who's right and who's wrong."
      },
      {
        "id": "tvmaze:1079365",
        "title": "Don't Let the Zip Code Fool Ya",
        "season": 2,
        "episode": 1,
        "released": "2017-04-02",
        "overview": "Gizelle and Charrisse's friendship hangs in the balance following Gizelle's shocking accusation that Charrisse is cheating on her husband. When the two ladies finally get together to talk, all bets are off! Meanwhile, Ashley's involvement in a new charity threatens her responsibilities to her and Michael's restaurant, causing tension in their marriage. Also, Robyn and Juan adjust to their new lives outside of Potomac, while Karen and Ray butt heads as they hunt for a new home."
      },
      {
        "id": "tvmaze:1101351",
        "title": "All Tea, All Shade",
        "season": 2,
        "episode": 2,
        "released": "2017-04-09",
        "overview": "Gizelle finds a new love interest in an old friend, while Ashley and Michael's inability to mix business with pleasure continues to create tension in their marriage. The women (finally) attend Katie's Casino Royale event, where they are less than impressed. Meanwhile, Karen organizes a high-class high afternoon tea in hopes of avoiding any low-class antics, but Gizelle gets her claws into Charrisse's new friend Monique -while Karen questions Robyn's loyalty--causing things to get a little improper."
      },
      {
        "id": "tvmaze:1101352",
        "title": "Hold Your Horses",
        "season": 2,
        "episode": 3,
        "released": "2017-04-16",
        "overview": "The ladies of Potomac get decked out in their best hats and are off to the races for one of Baltimore's elite events, The Preakness Stakes. Charrisse continues to reinvent her life by gifting herself a new champagne room. Karen welcomes her daughter with open arms, when she returns home for the summer. Robyn struggles to answer questions about her relationship status with Juan. Meanwhile, Monique heads to the \"Dirty South\" to celebrate her husband's induction into the Alabama Hall of Fame, where she also reunites with her \"Monster-In-Law\" for the first time in months."
      },
      {
        "id": "tvmaze:1101353",
        "title": "Mother Knows Best",
        "season": 2,
        "episode": 4,
        "released": "2017-04-23",
        "overview": "When Gizelle's mom comes to visit, she finds herself on a date with her new boyfriend AND her mom. Charrisse a.k.a \"Cha-Cha\" throws her daughter a lavish Sweet 16 birthday party, but when her elusive husband shows up at the party, it becomes too much for her to handle. Meanwhile, a hookah lounge fête turns sour when Ashley's prodding about Eddie puts Charrisse on edge and Monique shuts down Gizelle's hazing antics."
      },
      {
        "id": "tvmaze:1101354",
        "title": "Kick the Trick Out",
        "season": 2,
        "episode": 5,
        "released": "2017-04-30",
        "overview": "Monique hosts all of the ladies for a friendly card game of spades, but this house of cards comes crumbling down when she is pushed to kick Gizelle out of her home. Charrisse attempts to move forward with her life by prematurely announcing her divorce to a room full of strangers.  Karen throws a special celebration for her mother's 70th birthday, meanwhile, tensions arise when Ashley confronts Robyn with rumors about Juan."
      },
      {
        "id": "tvmaze:1153706",
        "title": "Messy Games",
        "season": 2,
        "episode": 6,
        "released": "2017-05-07",
        "overview": "After Gizelle is kicked out of Monique's party with her coat between her legs, Ashley continues to shuffle the deck -- and deals Charrisse a low blow about her marriage. While Karen tries to find a buyer for her \"outdated\" home, Monique lands right in the middle of Potomac with a $4.7 million mansion. Worried about their friend, Gizelle and Charrisse decide to host a \"Juantervention,\" causing Robyn to take a hard look at her unconventional relationship. Should she stay or should she go?"
      },
      {
        "id": "tvmaze:1159579",
        "title": "Over the River and Thru the Woods",
        "season": 2,
        "episode": 7,
        "released": "2017-05-21",
        "overview": "While Charrisse struggles to break the news of her marriage troubles to her daughter, Monique and her husband Chris try to reconnect as a married couple by returning to where they started. Karen shocks the world of Potomac by revealing her most guarded secret, leaving the rest of the ladies speechless. Armed with Gizelle by her side, Robyn decides to pay Ashley a visit to her restaurant. The pleasantries quickly go out the window as Ashley and Robyn get into it over spreading rumors, gossip, and emu!"
      },
      {
        "id": "tvmaze:1159580",
        "title": "War of the Darbys",
        "season": 2,
        "episode": 8,
        "released": "2017-05-28",
        "overview": "Ashley and Michael's marriage is tested when she unveils a new menu for their restaurant at a press event and Michael attempts to shut it down. Gizelle and Karen head out for a double date where the truth comes out about Gizelle's date. Meanwhile, Robyn questions her home life and identity after a birthday dinner for her mom. Golf balls fly when Karen attempts to mend fences between Monique, Gizelle, Ashley and everyone."
      },
      {
        "id": "tvmaze:1178319",
        "title": "A Host of Issues",
        "season": 2,
        "episode": 9,
        "released": "2017-06-04",
        "overview": "Gizelle faces some harsh payback when she is shut out of Monique's lake house summer bash. As Karen closes the deal on the sale of her Potomac home the reality of having to move sends her looking for a distraction. Ashley reveals a decision about her and Michael's future after their big Oz blow out. Robyn finds herself in therapy after everyone questions her relationship with Juan. Karen's scheme to \"getaway\" with a girls' trip to Bermuda goes awry after she decides to kick her planning partner, Charrisse to the curb."
      },
      {
        "id": "tvmaze:1178320",
        "title": "Welcome to the Bermuda Triangle",
        "season": 2,
        "episode": 10,
        "released": "2017-06-11",
        "overview": "The ladies' \"bonding\" trip to Bermuda turns cold after Karen leaves some of the women out of a once in a lifetime opportunity. Meanwhile, Robyn makes a critical decision regarding her relationship with Juan. Monique and Gizelle finally address their issues with one another, and the ladies come together for a sunset cruise... but will one of the women walk the plank before the trip is over?"
      },
      {
        "id": "tvmaze:1178321",
        "title": "The Grand Dame Sham",
        "season": 2,
        "episode": 11,
        "released": "2017-06-18",
        "overview": "A sunset cruise hits rough waters when Charrisse confronts Karen about her overbearing hosting duties while in Bermuda. Robyn takes steps to open herself up to meeting new men and quickly becomes the Belle of Bermuda when she discovers many of them are interested in her. When the girls return to Potomac, Ashley discovers Michael has been making big changes at the restaurant without her knowledge. Meanwhile, Karen reveals she no longer resides at her coveted Potomac address, and the ladies are shocked and determined to find out why."
      },
      {
        "id": "tvmaze:1178322",
        "title": "Home Is Where the Truth Is",
        "season": 2,
        "episode": 12,
        "released": "2017-07-02",
        "overview": "The ladies question Karen's quick move out of Potomac after she reveals the location of her new home. Robyn finally confronts her ex-husband Juan about their relationship and is surprised by his confession. Monique shows off her new Potomac home, while Gizelle searches for the courage to break it off with her boyfriend Kevin. The women attend an \"exotic\" anniversary party at Karen's new home and are shocked to discover her new life outside of Potomac."
      },
      {
        "id": "tvmaze:1222258",
        "title": "Reunion Part 1",
        "season": 2,
        "episode": 13,
        "released": "2017-07-09",
        "overview": "The ladies revisit this season's highs and shady lows as suspicions surrounding Karen's move are revealed and the question of who will claim the new title of \"Grande Dame of Potomac\" is answered. Gizelle and Monique go head to head, while Charrisse disputes cheating allegations. Rumors continue to swirl about Robyn and Juan's relationship, leading Robyn to call out Ashley for her meddling. And the reunion takes a shocking turn when Charrisse accuses Gizelle of having an open relationship in her first marriage."
      },
      {
        "id": "tvmaze:1243982",
        "title": "Reunion Part 2",
        "season": 2,
        "episode": 14,
        "released": "2017-07-16",
        "overview": "The two-part reunion concludes with a mixture of insults and apologies when the husbands join the ladies on stage. Juan finally tells his side of the story and expresses his feelings about his relationship with Robyn. Monique attempts to put Gizelle in her place once and for all, and she also drops a sassy freestyle rap that ruffles everyone's feathers. Charrisse drops the ultimate \"tea\" about Karen, while Ashley reveals an explosive secret about her and Michael that drops jaws."
      },
      {
        "id": "tvmaze:1427165",
        "title": "You Gotta Make Millions to Owe Millions",
        "season": 3,
        "episode": 1,
        "released": "2018-04-01",
        "overview": "Finally residents of 20854, Monique and Chris adjust to their new Potomac neighborhood. After months of living apart from Michael, Ashley decides it's time to give her marriage another shot, influenced by sage advice from newly-in-love Gizelle. Karen and Ray become the talk of Potomac after a shocking headline in The Washington Post. And things get heated between Karen and Robyn after a huge breach of trust."
      },
      {
        "id": "tvmaze:1427166",
        "title": "Meet the Press",
        "season": 3,
        "episode": 2,
        "released": "2018-04-08",
        "overview": "With their relationship back on track, Robyn and Juan upgrade their lives by moving to a new condo with an interesting address. Trying to keep her man happy, Gizelle takes her new boyfriend Sherman on a romantic picnic, while Monique and Ashley hang out with a fabulous young friend who has a bubbly personality and a crown to go with it. Feeling hurt and betrayed by her friends, Karen decides to hold a \"Press Conference\" to answer all their questions regarding her financial situation."
      },
      {
        "id": "tvmaze:1427167",
        "title": "Meme Your Own Business",
        "season": 3,
        "episode": 3,
        "released": "2018-04-15",
        "overview": "Gizelle leaves Karen's \"Press Conference\" earlier than expected, but not before revealing a special message that left everyone in shock. Meanwhile, Ashley finds herself in a tough situation after Michael continues to pressure her to cut financial ties with her mother. Robyn and Juan get acclimated in their new home, as Candiace tries to adjust to her overbearing mother being in town. Monique throws Chris a fabulous party for his 40th birthday, but things quickly go left when a three-way fight between Robyn, Ashley and Monique gets out of hand."
      },
      {
        "id": "tvmaze:1427168",
        "title": "First Ladies and Second Chances",
        "season": 3,
        "episode": 4,
        "released": "2018-04-22",
        "overview": "Ready to close the chapter on her days of being the \"First Lady\" of the Black Church, Gizelle decides to write a controversial book loosely based on her life. Monique and Robyn try to get to the root of their issues, while Candiace hopes to step out from her mother's shadow. Ashley seeks the advice of a therapist to help solve her marital problems and as a result, tries to make the impossible choice between her husband and her mother."
      },
      {
        "id": "tvmaze:1427169",
        "title": "Shade in a Bubble",
        "season": 3,
        "episode": 5,
        "released": "2018-04-29",
        "overview": "Ashley invites Gizelle and Candiace to yoga, where Candiace reveals a little too much private information about her fiancé. Karen distracts herself from her husband's financial issues by sending her daughter off to college, and Robyn continues to settle into her new home by hosting a paint party. Candiace invites the ladies to \"Bubble Soccer,\" but things quickly go from playful to personal as the ladies interrogate her about the source of her wealth."
      },
      {
        "id": "tvmaze:1445961",
        "title": "I Came From Jesus",
        "season": 3,
        "episode": 6,
        "released": "2018-05-06",
        "overview": "Exhausted from her busy life, Monique has a car accident that leaves everyone concerned about her well-being. Karen embraces her entrepreneurial spirit with a new business venture, meanwhile things heat up between Robyn and Juan. Ashley plans a fun outdoor retreat for the ladies to let off some steam, but things take a surprising turn as two of the ladies challenge Candiace when she stands up for herself."
      },
      {
        "id": "tvmaze:1451441",
        "title": "Blue Skies and Blue Eyes",
        "season": 3,
        "episode": 7,
        "released": "2018-05-13",
        "overview": "The ladies continue their weekend escape in the woods, but it's not quite as relaxing as Ashley had hoped. After a few glasses of champagne, Karen starts hurling insults at Robyn, leaving all the ladies confused. Tensions come to a halt for an afternoon of fishing, but things escalate once again when allegations swirl over Monique's denials and Karen's possible secrets."
      },
      {
        "id": "tvmaze:1453402",
        "title": "That's Scentertainment",
        "season": 3,
        "episode": 8,
        "released": "2018-05-20",
        "overview": "After not hearing from her boyfriend, Sherman in a couple of days, Gizelle starts to worry about the status of their relationship. Ashley is faced with the daunting task of moving her mother out her house, while Candiace continues to struggle for independence from her overbearing mom. Karen hosts all the ladies at a \"Scent\" event for her new business venture, but things take a turn for the worst when Monique confronts Ashley about a damaging rumor."
      },
      {
        "id": "tvmaze:1453403",
        "title": "A Happy Medium",
        "season": 3,
        "episode": 9,
        "released": "2018-05-27",
        "overview": "Tired of keeping Chris' full family history from her mom, Candiace decides to face her fears. Monique organizes a donation drive for the victims of Hurricane Harvey, while an emotional Gizelle breaks down over the stress of her relationship. Robyn and Juan seek closure from their past, but a visit from past loved ones leaves the couple in extreme shock."
      },
      {
        "id": "tvmaze:1470748",
        "title": "RSVPlease!",
        "season": 3,
        "episode": 10,
        "released": "2018-06-03",
        "overview": "Candiace attempts to persuade her mother to give her control of the family business, while Ashley and Michael revisit their prenup. Monique and Robyn host two different events on the same day, forcing the ladies to reveal their loyalty. After celebrating her birthday without Sherman, Gizelle begins to re-evaluate their relationship and receives advice from a very unlikely source."
      },
      {
        "id": "tvmaze:1470749",
        "title": "Ex's and Oh No's",
        "season": 3,
        "episode": 11,
        "released": "2018-06-10",
        "overview": "Having one extra ticket to her gala, Monique decides to invite an unlikely guest to sit at her table. Baby talk puts another roadblock in Ashley and Michael's relationship, while the pressure of finding a wedding venue creates tension between Candiace and Chris. Upset that Karen chose to not come to Robyn's event, Gizelle and Robyn decide to confront her, but are caught off guard by her shocking response."
      },
      {
        "id": "tvmaze:1472795",
        "title": "Can't Hide from These Green Eyes",
        "season": 3,
        "episode": 12,
        "released": "2018-06-17",
        "overview": "After seeking counsel from her uncle, Ashley must face the truth about why Michael is hesitant to have more children. Robyn confronts Karen about her lies in a public forum, while Charrisse is left questioning her friendship with Monique. The stress of wedding planning becomes too much for Candiace, testing her relationship with Chris."
      },
      {
        "id": "tvmaze:1476992",
        "title": "Mime Your Own Business",
        "season": 3,
        "episode": 13,
        "released": "2018-07-01",
        "overview": "Candiace and Chris get marriage insurance in the form of a pre-nup, meanwhile Ashley decides to give Michael a surprise to get their relationship back on track. Karen and Gizelle try to work things out over lunch, but are interrupted by an unexpected visitor. Tired of all the fighting, Monique decides to plan a trip to France for all the ladies, but is quickly met with objections from the green-eyed sisters."
      },
      {
        "id": "tvmaze:1479531",
        "title": "Cannes We All Just Get Along",
        "season": 3,
        "episode": 14,
        "released": "2018-07-08",
        "overview": "As the ladies travel to the beautiful South of France for a relaxing vacation on the French Riviera, Gizelle and Robyn clash over their accommodations. Monique opens up to the women about her marriage, while Ashley questions Karen's living situation. And things get heated between Karen and Gizelle over their businesses, leading to an explosive revelation about Karen's marriage."
      },
      {
        "id": "tvmaze:1483293",
        "title": "Turm-Oil in France",
        "season": 3,
        "episode": 15,
        "released": "2018-07-15",
        "overview": "While the ladies enjoy a fabulous day on the French Riviera, Candiace begins feeling detached from the group. After noticing Karen without her wedding ring, suspicion mounts about the state of her marriage. Monique and Charrisse's friendship is officially put to the test, leading to a revelation that leaves everyone stunned."
      },
      {
        "id": "tvmaze:1489659",
        "title": "Au Revoir Drama",
        "season": 3,
        "episode": 16,
        "released": "2018-07-22",
        "overview": "While the ladies celebrate Monique's birthday with a fabulous night of burlesque, Candiace finally uses her vocals to win the women over. Gizelle confronts Charrisse about her involvement in bringing Sherman's ex-wife around, leaving Charrisse and Monique at odds. Ashley and Karen exchange heated words and accusations regarding Karen's marriage, cause a deeper rift in their already rocky friendship."
      },
      {
        "id": "tvmaze:1492122",
        "title": "Hot Gossip, Cold Pizza",
        "season": 3,
        "episode": 17,
        "released": "2018-07-29",
        "overview": "Karen meets with her assistant Matt to find out his involvement in the alleged rumors regarding her living situation. Ashley finally comes clean to her mother about some of Michael's inflammatory comments, causing more tension between the two. Determined to find out the truth about whether Karen really lives in her house, Gizelle, Robyn and Ashley plan a scheme of epic proportions."
      },
      {
        "id": "tvmaze:1495410",
        "title": "Unsolved Mystery",
        "season": 3,
        "episode": 18,
        "released": "2018-08-05",
        "overview": "Ashley finally gives Michael an ultimatum on having a baby, while reality starts to set in for Candiace that she is about to be an instant stepmother. Robyn throws a birthday party for her youngest son, and a new family member makes a special appearance. Meanwhile, Karen and Ashley get into a heated discussion that is escalated by Michael and Ray's interaction. The ladies question Karen about the mysterious pizza delivery, and her response leaves everyone puzzled."
      },
      {
        "id": "tvmaze:1498927",
        "title": "Reunion Part 1",
        "season": 3,
        "episode": 19,
        "released": "2018-08-12",
        "overview": "The ladies revisit this season's emotional highs and lows, all while trying to mend their fractured friendships. Monique and Robyn finally get to the core of their rivalry, while Candiace reveals some intimate details about her relationship. Karen sheds some light on her mysterious life, but the pain she is dealing with is too much to handle, and Gizelle proves to her that old friends are the best friends."
      },
      {
        "id": "tvmaze:1505506",
        "title": "Reunion Part 2",
        "season": 3,
        "episode": 20,
        "released": "2018-08-19",
        "overview": "The two-part reunion concludes and more shocking secrets are revealed when the husbands join the ladies onstage. Karen goes after Michael for his business and personal struggles, while Ray explains the rumors about his wife's infidelity. Gizelle opens up about the \"new\" man in her life, while Ashley reveals big news about her relationship with Michael, leaving all of the women in tears."
      },
      {
        "id": "tvmaze:1625535",
        "title": "That's the Way the Cookie Crumbles",
        "season": 4,
        "episode": 1,
        "released": "2019-05-05",
        "overview": "Gizelle attempts to rekindle her friendship with Karen by delivering her homemade treats, but is shocked by what greets her at the door. Recovering from their miscarriage, Ashley &amp;amp; Michael are back in full baby making mode, meanwhile Robyn takes her romantic relationship with Juan to new heights. And with her wedding only days away, Candiace reveals that she's invited her half-brother to the nuptials, causing her mother to launch a verbal attack that threatens to derail the festivities."
      },
      {
        "id": "tvmaze:1646070",
        "title": "Here Comes the Bride",
        "season": 4,
        "episode": 2,
        "released": "2019-05-12",
        "overview": "Candiace's big day is here, but instead of focusing on her soon to be husband, she's more nervous about her mother's unpredictable behavior. A buzzed Ashley tries her best to make amends with Karen and Monique, but her intentions are met with cold shoulders. Meanwhile an emotional Gizelle makes her way to Candiace's wedding — and after several downed shots ends up in a heated discussion with Monique."
      },
      {
        "id": "tvmaze:1651824",
        "title": "Hot Mike",
        "season": 4,
        "episode": 3,
        "released": "2019-05-19",
        "overview": "Gizelle goes to therapy to help deal with her recent breakup, but a big revelation forces her to rekindle her relationship with a long-time foe. Karen is still keeping Gizelle in time out, but they might be able to renew their friendship with the help of some sage. Meanwhile Robyn and Juan work to ensure that their financial foundation remains on solid ground.  Ashley remains hopeful about baby making with Michael, but her frequent drinking causes Candiace to doubt her intentions."
      },
      {
        "id": "tvmaze:1656192",
        "title": "The Wig Easy",
        "season": 4,
        "episode": 4,
        "released": "2019-05-26",
        "overview": "Ashley moves forward with baby making plans, while Candiace and Robyn grapple with the decision of revealing Michael's shocking comment from the night before. The ladies head to New Orleans in an effort to learn more about Gizelle, but Robyn's habit of being late almost leaves her grounded in Potomac. A night of Creole cooking takes a left turn, as things get heated between Karen and Gizelle, forcing the Grande Dame to make a dramatic exit."
      },
      {
        "id": "tvmaze:1658306",
        "title": "The Big Easy Show Down",
        "season": 4,
        "episode": 5,
        "released": "2019-06-02",
        "overview": "Gizelle takes the ladies on an emotional journey to a plantation where her ancestors were enslaved, but the experience is too much for a still grieving Karen to handle. The women hit the legendary Bourbon Street for a night of fun, but the merriment comes to startling halt when Candiace questions Ashley's intentions to have a baby."
      },
      {
        "id": "tvmaze:1660988",
        "title": "Boundaries, Bayous and Beignets",
        "season": 4,
        "episode": 6,
        "released": "2019-06-09",
        "overview": "The ladies wrap up their time in the Big Easy with some enlightening and frightening experiences, but unresolved issues still fester between Ashley and Candiace. Gizelle throws an 80th birthday party for her father and an old flame makes a special appearance. Tired of being singled out, Karen unleashes her fury on Gizelle and leaves everyone speechless."
      },
      {
        "id": "tvmaze:1664014",
        "title": "Salty Behavior",
        "season": 4,
        "episode": 7,
        "released": "2019-06-16",
        "overview": "Monique celebrates her rainbow pregnancy, but the presence of her mother-in-law presents new challenges. Candiace reveals to Gizelle that Monique called Katie a name causing Gizelle to question Monique's behavior. Ashley and Karen share a spiritual moment in an unusual place, but the presence of an unlikely visitor brings Karen to tears."
      },
      {
        "id": "tvmaze:1672827",
        "title": "Sex, Lies and Butter Knives",
        "season": 4,
        "episode": 8,
        "released": "2019-06-30",
        "overview": "Monique has a breathtaking underwater photo shoot to commemorate her pregnancy, while Karen shows off her sexy dance moves with Ray. Candiace hosts a dinner party where revelations about Michael's alleged secrets are brought center stage. Ashley and Candiace get in a heated argument, causing a serious meltdown."
      },
      {
        "id": "tvmaze:1675008",
        "title": "Days of Our Knives",
        "season": 4,
        "episode": 9,
        "released": "2019-07-07",
        "overview": "Robyn finally reveals Michael's secret comment, causing everyone to wonder about the state of the Darby's marriage. Candiace takes her mother to therapy in an effort to fix their relationship, but Dottie's resistance brings Candiace to tears. Ashley performs at Gay Pride, but the joyful event quickly turns sour once her issues with Robyn reach a boiling point."
      },
      {
        "id": "tvmaze:1677347",
        "title": "Showdown at the Hoedown",
        "season": 4,
        "episode": 10,
        "released": "2019-07-14",
        "overview": "Robyn confronts Gizelle about throwing her under the bus with Ashley, meanwhile Candiace and Chris have a fight of epic proportions. Katie hosts the ladies at a Potomac hoedown, but breaking news about Michael overshadows the event and one housewife is left feeling vindicated."
      },
      {
        "id": "tvmaze:1682187",
        "title": "Can I Get a Witness?",
        "season": 4,
        "episode": 11,
        "released": "2019-07-21",
        "overview": "After feeling like an absentee mom, Gizelle focuses her attention on her daughter Adore. Meanwhile, Candiace and her mother Dorothy try to work on their relationship, but her mom is over Candiace's antics. While others question her husband's innocence, Ashley goes to therapy to deal with the stress of it all — and leaves with the realization she is still suffering from old wounds."
      },
      {
        "id": "tvmaze:1682188",
        "title": "Good Will Haunting",
        "season": 4,
        "episode": 12,
        "released": "2019-07-28",
        "overview": "With the help of singer Macy Gray, Karen and her daughter Rayvin record a tribute to her parents. Meanwhile, Robyn plans a haunted house party for Juan's birthday, where an unexpected guest makes a surprise appearance. The charges against Michael are dropped, but Katie reveals new information about Michael, leaving more unanswered questions regarding the Darbys' marriage."
      },
      {
        "id": "tvmaze:1689407",
        "title": "Opening Old Wounds",
        "season": 4,
        "episode": 13,
        "released": "2019-08-04",
        "overview": "With her due date quickly approaching, Monique calls on Chris for help, but his unexpected reaction catches her off guard. Ashley makes the courageous decision to seek out her roots, meanwhile, Katie and her boyfriend Jacob spread some surprising information about Michael, leaving the other ladies confused about where she stands in her relationship."
      },
      {
        "id": "tvmaze:1689408",
        "title": "Open House and Closed Doors",
        "season": 4,
        "episode": 14,
        "released": "2019-08-11",
        "overview": "Ashley finally makes contact with her distant relative, but their startling reaction leaves her in tears. Meanwhile, Candiace and her mother are still at odds, but Dorothy proves that old habits die hard. Robyn hosts an open house to celebrate her finished property, but things go sour when Gizelle confronts Monique – causing surprising tension between the Green-eyed sisters."
      },
      {
        "id": "tvmaze:1692104",
        "title": "Cayman We Get Along?",
        "season": 4,
        "episode": 15,
        "released": "2019-08-18",
        "overview": "The ladies head to the beautiful Cayman Islands, but things gets off to a bumpy start when Robyn's lateness finally catches up to her.  Meanwhile, Karen and Gizelle get into a hotel lobby showdown that proves to be bigger than the last.  Ashley confronts Katie about the gossip she's been spreading about her husband, but Ashley's rage proves too much for Katie to handle."
      },
      {
        "id": "tvmaze:1696319",
        "title": "Trouble in Paradise",
        "season": 4,
        "episode": 16,
        "released": "2019-08-25",
        "overview": "The ladies enjoy a day of adventure in the Cayman Islands. Ashley and Candiace bury their issues over yoga. Robyn decides to confront Gizelle about her behavior at her open house, catching her fellow green-eyed bandit off guard. Meanwhile, Katie's behavior continues to grow more questionable —  but things go from bad to worse when she decides make a big statement."
      },
      {
        "id": "tvmaze:1700543",
        "title": "Unanswered Questions",
        "season": 4,
        "episode": 17,
        "released": "2019-09-01",
        "overview": "The women scramble to find Katie, and are shocked to discover her true whereabouts. Gizelle battles mother nature, while Karen teaches the ladies a unique technique. The fun comes to screeching halt when Karen and Ashley get into an unexpected conflict – catching everyone off guard."
      },
      {
        "id": "tvmaze:1705120",
        "title": "Mom's the Word",
        "season": 4,
        "episode": 18,
        "released": "2019-09-08",
        "overview": "Robyn and Juan make a grand gesture to solidify their relationship. Candiace begins making financial strides without her mother's help. Karen finally reveals her La Dame perfume with an extravagant soirée, but the ladies leave with more questions than answers. After taking a pregnancy test, a fearful Ashley visits her doctor."
      },
      {
        "id": "tvmaze:1709732",
        "title": "Reunion Part 1",
        "season": 4,
        "episode": 19,
        "released": "2019-09-15",
        "overview": "Gizelle and Karen confront each other about the confusing nature of their friendship, and Gizelle reveals a shocking development in her love life. Candiace's mother, Dorothy, joins the couch — and brings her purse. Ashley and Candiace have a heated exchange regarding the legitimacy of Ashley's life and relationship. Michael Darby makes a jaw-dropping appearance."
      },
      {
        "id": "tvmaze:1709733",
        "title": "Reunion Part 2",
        "season": 4,
        "episode": 20,
        "released": "2019-09-22",
        "overview": "Monique and Candiace address their broken relationship and the breach of trust that lead to its downfall. Robyn's future with Juan is put into question. Gizelle and Monique address their ongoing feud in hopes of finally putting it to bed. Robyn reveals whose \"bleep\" Michael wanted to \"bleep\" that fateful night at L2."
      },
      {
        "id": "tvmaze:1712099",
        "title": "Reunion Part 3",
        "season": 4,
        "episode": 21,
        "released": "2019-09-29",
        "overview": "The husbands take center stage for the dramatic conclusion to the Season 4 three-part reunion. The couples reveal their secrets in the bedroom, but the fun and games end there when the topic shifts to the charges against Michael. The women reveal secrets about Michael from seasons past. Chris Bassett and Ray chime in with new information that steers the conversation onto an unexpected course."
      },
      {
        "id": "tvmaze:1896877",
        "title": "Old Testaments, New Revelations",
        "season": 5,
        "episode": 1,
        "released": "2020-08-02",
        "overview": "Gizelle rekindles her relationship with ex-husband and pastor Jamal Bryant. Ashley adjusts to life as a new mom. Candiace and Chris celebrate their one-year anniversary with a diamond themed party, but the festivities quickly come to a halt."
      },
      {
        "id": "tvmaze:1896878",
        "title": "The Rumor Meal",
        "season": 5,
        "episode": 2,
        "released": "2020-08-09",
        "overview": "Ashley continues to struggle with post-partum, meanwhile Juan secretly seeks relationship advice from Gizelle. Karen realizes that her marriage is not the institution she thought when Ray refuses to say the three magic words. Gizelle and Monique bury the hatchet and host a support dinner for Ashley, but after learning about Candiace's sudden connection to a longtime foe, Monique starts to doubt their friendship."
      },
      {
        "id": "tvmaze:1908640",
        "title": "Sip and See You Later",
        "season": 5,
        "episode": 3,
        "released": "2020-08-16",
        "overview": "Gizelle spends her birthday with Jamal and the girls, but underlying tension makes for an awkward celebration. Candiace struggles to understand Monique's anger towards her after their recent reconciliation. Wendy takes note of Karen's cold shoulder. Ashley hosts the ladies to meet baby Dean, but an unexpected guest causes Monique to make a dramatic exit."
      },
      {
        "id": "tvmaze:1908641",
        "title": "Celebrations and Strange Explanations",
        "season": 5,
        "episode": 4,
        "released": "2020-08-23",
        "overview": "Gizelle struggles with the fact that her daughters have questions about her rekindling a relationship with their father, and turns to her best friend Kal for guidance. Candiace and Ashley finally bury their year-long feud, meanwhile Monique expresses her marital frustrations to Chris. Karen decides to throw a lavish housewarming party, but Candiace and Gizelle's spat almost puts the celebration on pause."
      },
      {
        "id": "tvmaze:1915923",
        "title": "Look Who's Squawking",
        "season": 5,
        "episode": 5,
        "released": "2020-08-30",
        "overview": "Monique invites everyone to her lake house for a weekend retreat, but the ladies are not prepared for her additional guest. Karen expresses her dislike for Wendy's obsession with her sex life, meanwhile Gizelle and Candiace's friendship takes a surprising turn. Ashley decides to bring baby Dean along for the festivities, but Wendy's strong opinions on her decision leaves the women stunned."
      },
      {
        "id": "tvmaze:1921496",
        "title": "The Text Heard 'Round the Lake House",
        "season": 5,
        "episode": 6,
        "released": "2020-09-06",
        "overview": "The ladies host a pageant to help pass the time at Monique's lake house. Meanwhile, Monique's frustration with her husband Chris' lack of support grows. Wendy and Ashley make amends, but Wendy's sudden turn leaves Karen questioning her authenticity. Candiace's world is turned upside down when she receives a shocking text about one of the ladies' husband, leaving her contemplating whether or not to break the news."
      },
      {
        "id": "tvmaze:1921497",
        "title": "Fireball and Firepits",
        "season": 5,
        "episode": 7,
        "released": "2020-09-13",
        "overview": "Karen reveals intimate details about her relationship with Ray leaving the ladies concerned about the state of her marriage. The husbands join their wives at the lake house. Candiace tells Ashley about Michael's alleged escapades. Meanwhile, things come to a screeching halt when Michael's alleged indiscretion takes center stage."
      },
      {
        "id": "tvmaze:1921498",
        "title": "Serving Up Betrayals",
        "season": 5,
        "episode": 8,
        "released": "2020-09-20",
        "overview": "Ashley confronts Michael about the blog rumors, and inadvertently reveals intimate details about their sex life. Gizelle corrals the ladies together for a wine tasting to celebrate her literary award, but the celebration is quickly halted when tension escalates to an alarming level."
      },
      {
        "id": "tvmaze:1921499",
        "title": "The Tipping Point",
        "season": 5,
        "episode": 9,
        "released": "2020-09-27",
        "overview": "The ladies try to make sense of the altercation between Monique and Candiace, but are left in the dark. Gizelle heads to Atlanta for her daughters' restaurant opening, meanwhile Ashley presents Michael with a post-nuptial agreement. Karen seeks help from a third party to mend her relationship, but Ray's surprising revelation leaves her in tears."
      },
      {
        "id": "tvmaze:1931479",
        "title": "Sorry… Not Sorry",
        "season": 5,
        "episode": 10,
        "released": "2020-10-04",
        "overview": "Karen hosts the ladies to hear Monique's side of what happened at the winery, meanwhile Candiace seeks therapy to deal with the aftermath of the altercation. Monique attempts to apologize for getting physical, but her account of the sequence of events leaves a bad taste in some of the ladies' mouths."
      },
      {
        "id": "tvmaze:1931480",
        "title": "Taxing Times and Blurry Lines",
        "season": 5,
        "episode": 11,
        "released": "2020-10-11",
        "overview": "Karen invites Gizelle and Ashley to her homecoming in Virginia, but an emotional visit to her childhood farm shows the ladies a different side of the Grande Dame. Robyn's tax woes go public. Candiace considers legal action against Monique. Meanwhile, Monique seeks guidance from her pastor, but a shocking past revelation brings her to tears."
      },
      {
        "id": "tvmaze:1931481",
        "title": "Fully Charged",
        "season": 5,
        "episode": 12,
        "released": "2020-10-18",
        "overview": "Wendy and her husband, Eddie host a \"Sip and See\" for their baby girl, and extend an invitation to Eddie's estranged parents. Ashley and Michael seek counseling for their issues, while Karen continues to fight for her marriage. After weeks without an apology from Monique, Candiace decides to take a legal next step, and the possibility of jail time for Monique leaves the rest of the ladies in shock."
      },
      {
        "id": "tvmaze:1931482",
        "title": "No Shows and Show Downs",
        "season": 5,
        "episode": 13,
        "released": "2020-10-25",
        "overview": "Monique invites the ladies to her podcast, but their lack of support leaves her feeling even more isolated. Juan asks Robyn's parents for their blessing to remarry their daughter. Meanwhile, Gizelle and Jamal continue to struggle with their long-distance relationship. Wendy hosts the ladies for an evening of wine and politics, but Karen's unwillingness to admit to Monique's wrongdoing leaves a sour taste in Candiace's mouth."
      },
      {
        "id": "tvmaze:1957760",
        "title": "Hats Off... Shades On",
        "season": 5,
        "episode": 14,
        "released": "2020-11-01",
        "overview": "Ashley searches to find happiness amidst Michael's infidelity. Emotions run high as Monique files a counterclaim against Candiace, and Robyn hosts a photo shoot for her Embellished hat line, but the atmosphere gets heated once Wendy learns of disparaging comments made about her."
      },
      {
        "id": "tvmaze:1963239",
        "title": "Portu-Girl-Bye",
        "season": 5,
        "episode": 15,
        "released": "2020-11-08",
        "overview": "The ladies head to Madeira, Portugal for some fun and sun, but the distance proves to be too much for Ashley. Karen questions Gizelle's relationship with Jamal, causing a heated discussion on whether or not Gizelle's relationship is even real. Things get interesting when Robyn sides with Karen against her fellow green-eyed bandit — causing the two besties to be at odds."
      },
      {
        "id": "tvmaze:1963686",
        "title": "Picking Sides",
        "season": 5,
        "episode": 16,
        "released": "2020-11-15",
        "overview": "The ladies play a prank on Wendy that leaves her screaming. Gizelle struggles with keeping Juan's impending proposal to herself. Meanwhile, Karen surprises the group with very personal details about her marriage. Ashley shocks Gizelle and Robyn with the news that she wrote a witness statement in defense of Monique."
      },
      {
        "id": "tvmaze:1963687",
        "title": "Fifty Shades of Betrayal",
        "season": 5,
        "episode": 17,
        "released": "2020-11-22",
        "overview": "Robyn reveals the ladies‘ photos on her \"Embellished\" website, causing tension between her and the \"Grand Dame.\" Ashley and Gizelle host a dominatrix party filled with whips, sex toys and leather, but the fun is quickly halted when Ashley reveals her statement in defense of Monique — leaving Candiace feeling betrayed."
      },
      {
        "id": "tvmaze:1963688",
        "title": "Shifty Wigs",
        "season": 5,
        "episode": 18,
        "released": "2020-11-29",
        "overview": "Gizelle plans a family photo shoot, but hearts are broken when there is an issue with Jamal. Wendy struggles with telling her mother she wants to quit teaching, meanwhile Ashley arranges for Michael to have a face to face with her uncle and mom. Karen celebrates her wig line launch with a 'Wig Shift Party,' but a close run-in between Candiace and Monique leaves everyone in an uproar."
      },
      {
        "id": "tvmaze:1975179",
        "title": "Deck the Halls with Drama",
        "season": 5,
        "episode": 19,
        "released": "2020-12-06",
        "overview": "Robyn and Juan seek couples therapy to move forward in their relationship. Gizelle works hard to make sure Robyn's engagement goes off without a hitch, but Michael's skepticism causes her to panic. Candiace confronts Karen about setting her up, while Michael Darby and Chris Bassett square off, leaving Michael unhinged."
      },
      {
        "id": "tvmaze:1975180",
        "title": "Reunion Part 1",
        "season": 5,
        "episode": 20,
        "released": "2020-12-13",
        "overview": "Part one of an explosive three-part reunion begins, as the Potomac ladies come together for the first time since the altercation that divided the cast. The women host a fashion intervention for Gizelle, which isn't well received. Ashley confronts Candiace and Wendy about their \"aggressive\" behavior, which leads to a discussion of colorism within the cast. Karen questions the legitimacy of Gizelle's relationship, and Monique, armed with a binder of receipts - presents damning evidence to back up Karen's accusations."
      },
      {
        "id": "tvmaze:1977973",
        "title": "Reunion Part 2",
        "season": 5,
        "episode": 21,
        "released": "2020-12-20",
        "overview": "The reunion continues as Gizelle reacts to the contents of Monique's binder and responds to the shocking allegations against Jamal. Karen opens up about her challenging season with Ray, and Ashley is questioned about Michael's hotel-room antics and responds to some damning new evidence. Monique accuses some of the women of \"plotting\" against her family, and things get intense when the conversation about the altercation between Candiace and Monique begins."
      },
      {
        "id": "tvmaze:1983475",
        "title": "Reunion Part 3",
        "season": 5,
        "episode": 22,
        "released": "2020-12-27",
        "overview": "The Season 5 Reunion concludes with an epic 90-minute finale. Candiace gathers herself after walking off-stage during the conversation surrounding the altercation and returns to face Monique. Ashley and Monique are accused of having a strategic relationship, and an emotional exchange takes place when Candiace questions Karen's loyalty. Things take a dramatic turn when the husbands join the stage - Chris Samuels comes in hot and demands accountability against the alleged \"plot\" against his family, and sets his sights on Gizelle."
      },
      {
        "id": "tvmaze:2098736",
        "title": "The Nude Interlude",
        "season": 6,
        "episode": 1,
        "released": "2021-07-11",
        "overview": "It's a new day in Potomac! Ashley has a bun in the oven, Candiace has a new home of her own and Karen is set to walk down the aisle (again)! - but while some of the women are taking big steps forward in the personal lives, others are at a standstill. After a mysterious and salacious invitation, the ladies gather and become acquainted with a new friend (or two) - and a years' worth of tension boils over into a war of words between longtime frenemies Gizelle and Karen."
      },
      {
        "id": "tvmaze:2129885",
        "title": "Sing Sing for Your Supper",
        "season": 6,
        "episode": 2,
        "released": "2021-07-18",
        "overview": "At the Nude Interlude, the rift between frenemies Gizelle and Karen grows deeper, and unexpected sides are taken. Wendy announces a drastic new career change, and Ashley prepares for the arrival of her new baby - but worries about keeping Michael happy in the process. Karen invites all the ladies to her Love Lunch in hopes of healing...but it instead ends up being quite...revealing!"
      },
      {
        "id": "tvmaze:2133363",
        "title": "Jiminy Crickets",
        "season": 6,
        "episode": 3,
        "released": "2021-07-25",
        "overview": "Robyn struggles to get her home and work life in balance, while Wendy turns to the Grand Dame for some much needed advice. Mia shares a traumatic childhood experience that has left her with difficulty connecting with her mother. With Ashley days away from going into labor, Gizelle decides to gather the ladies for a Pamper Party to celebrate the mom-to-be. Unfortunately, this spa day becomes anything but relaxing."
      },
      {
        "id": "tvmaze:2133449",
        "title": "Going Ham at the Pajammy Jam",
        "season": 6,
        "episode": 4,
        "released": "2021-08-01",
        "overview": "Mia and Gordon wonder if she can repair the broken relationship with her mother. Gizelle works on showing compassion when her oldest daughter goes through a life obstacle. Candiace realizes what's at stake in recording her new song, while Michael surprises his very pregnant wife Ashley with a new venture. Robyn and Gizelle attempt to clear the air with Mia, but are met with a shocking reply."
      },
      {
        "id": "tvmaze:2140566",
        "title": "\"The Rumor Mill\"",
        "season": 6,
        "episode": 5,
        "released": "2021-08-08",
        "overview": "Ashley's new baby, Dylan, makes a first impression that Gizelle will never forget. Mia opens up about her childhood trauma to Gizelle and Robyn. Wendy looks to Eddie for support in her candle business, but he thinks her business plan isn't up to par. Candiace hosts a girls' trip to Williamsburg, VA, where the cold war between Gizelle and Karen heats back up."
      },
      {
        "id": "tvmaze:2143303",
        "title": "Land of the Free, Home of the Shade",
        "season": 6,
        "episode": 6,
        "released": "2021-08-15",
        "overview": "Ashley and Michael adjust to caring for two children while on a family photoshoot. It's Candiace's first time hosting a girl's trip, but the mood dampens after Gizelle and Karen's issues resurface - again. Robyn opens up to the women about her lack of motivation, and Gizelle shuts down any talk of her relationship with her ex. The evening takes a turn when the women question the reasoning behind Wendy's many changes - and her alleged \"lack of substance\" hits deep."
      },
      {
        "id": "tvmaze:2149420",
        "title": "Gossip, Girl!",
        "season": 6,
        "episode": 7,
        "released": "2021-08-22",
        "overview": "It's Day 2 in Williamsburg, Virginia, and the ladies work off last night's dramatic dinner with a little water aerobics. Robyn has a heart-to-heart with Gizelle about her lack of motivation, and is met with tough love. Ashley joins the ladies for a post-birth getaway - bringing her breast pump and a whole lot of drama in tow. Candiace hosts a whiskey tasting to lighten the mood, but alcohol isn't the only thing on the rocks after a rumor pertaining to Wendy's husband Eddie unexpectedly resurfaces."
      },
      {
        "id": "tvmaze:2154364",
        "title": "Talk to the Braids",
        "season": 6,
        "episode": 8,
        "released": "2021-08-29",
        "overview": "After an explosive confrontation in Williamsburg, tension is at an all-time high between Wendy and the Green Eyed Bandits. As hostess, Candiace hopes the ladies of the Estate and Cottage can twerk it out. Back home, Ashley hopes Michael is going to be a more attentive husband and father. Karen is inducted as the ambassador of Surry County and during her acceptance speech she reveals some surprising news."
      },
      {
        "id": "tvmaze:2156749",
        "title": "High Infidelity",
        "season": 6,
        "episode": 9,
        "released": "2021-09-05",
        "overview": "Wendy fills in Eddie on the betrayal that took place in Williamsburg, and Eddie gives his side of the story. Gizelle and Robyn open up about their history with infidelity. Mia seeks answers from her estranged mom about why she ended up in foster care. Candiace preps for her music video shoot but learns that bringing business into her marriage may have been a catastrophic mistake."
      },
      {
        "id": "tvmaze:2156750",
        "title": "Goddesses of War",
        "season": 6,
        "episode": 10,
        "released": "2021-09-12",
        "overview": "Candiace and Chris cool off from their fight, and realize it's not very pleasurable to mix business with marriage. Karen gets to work in a new position…in an unusual place. Gizelle opens up to her daughters about her past mistakes in her relationships, and Wendy answers some tough questions from her sons about police brutality. Mia hosts a \"Goddess Picnic\" for the ladies, with the hopes of restoring harmony in the group...but will these Goddesses come ready to battle?"
      },
      {
        "id": "tvmaze:2168379",
        "title": "No Business Like Shade Business",
        "season": 6,
        "episode": 11,
        "released": "2021-09-19",
        "overview": "Gizelle hits some speed bumps trying to teach her daughter Grace to drive, while Ashley's family isn't happy with Michael's proposed venture into the movie business. Karen and Wendy work on putting together their candle lines- one seemingly more successfully than the other- and Robyn confronts Juan about his approach. At Candiace's music video shoot, Mia gets Candiace's mom, Dorothy, to spill all the tea. Meanwhile, a huge misstep threatens to bring the entire shoot to a halt."
      },
      {
        "id": "tvmaze:2168380",
        "title": "Reasonable or Shady?",
        "season": 6,
        "episode": 12,
        "released": "2021-09-26",
        "overview": "Karen is ready to reveal her new candle line to the rest of the ladies, while Wendy struggles to get on equal footing. Mia's family and her mom sit down for some much needed time together, but there is still a lot of work to be done. Gizelle and Robyn gather their \"Friends and Haters\" to celebrate the launch of their new podcast... in Gizelle's driveway. The party goes off the rails when some shady games are played, and Candiace confronts Mia about questioning if her husbandger is on the payroll."
      },
      {
        "id": "tvmaze:2180962",
        "title": "GVO or GTFO!",
        "season": 6,
        "episode": 13,
        "released": "2021-10-03",
        "overview": "The ladies and their husbands head to Maryland's Eastern Shore for a couples trip - but the Green Eyed bandits threaten to stay home due to their rocky relationship with the hostess, Wendy. The party goes from 0-100 - Gordon reveals his wild side, and Candiace and Mia go head to head in a shocking way."
      },
      {
        "id": "tvmaze:2182443",
        "title": "Tossing Salads and Spilling Tea (Bags)",
        "season": 6,
        "episode": 14,
        "released": "2021-10-10",
        "overview": "On a couples trip to the Eastern Shore, Candiace and Mia's argument puts a damper on Wendy's Good Vibes Only. Wendy's hosting skills are under pressure when two surprise guests are left without adequate accommodations. Karen has an interesting run-in with Mia's husband, Gordon. And at dinner, Ashley and Candiace unbury their hatchets once again."
      },
      {
        "id": "tvmaze:2187983",
        "title": "Lost at Sea",
        "season": 6,
        "episode": 15,
        "released": "2021-10-17",
        "overview": "Wendy's couple's trip continues, and so does the drama. Gizelle and Robyn leave in the middle of the night, furthering the tension between them and Wendy. Ashley tries to get some R&amp;amp;R, but Gordon's wild side is wearing thin. Ray joins the group for a boat ride on the bay, and Candiace and Mia have a surprising heart to heart."
      },
      {
        "id": "tvmaze:2187984",
        "title": "Crab-Boiling Over",
        "season": 6,
        "episode": 16,
        "released": "2021-10-24",
        "overview": "The group wraps up their trip with a crab boil - and things between Ashley and Gordon get heated. Upon their return to Potomac, Mia's relationship with her mother takes a turn for the worse, and Gizelle's daughters confront her about her relationship woes. Ashley reveals that she is having intimacy issues with Michael, and attempts to spice things up in order to revive her marriage. Karen shocks the ladies with an invitation for her upcoming Vow Renewal that is ...out of the box."
      },
      {
        "id": "tvmaze:2187985",
        "title": "Altar-ed State of Mind",
        "season": 6,
        "episode": 17,
        "released": "2021-10-31",
        "overview": "Karen and Ray prepare to say \"I do,\" again - and celebrate the occasion with close friends including a special surprise guest. Meanwhile, Robyn brings up issues from the past that throw her relationship with Juan off course. Tensions between the ladies linger, as Gizelle reveals a well-kept secret and Juan's attempts to broker peace between his bros Michael Darby and Chris Bassett goes off the rails."
      },
      {
        "id": "tvmaze:2187986",
        "title": "Reunion Part 1",
        "season": 6,
        "episode": 18,
        "released": "2021-11-07",
        "overview": "The Season 6 Reunion begins with a bang as the women take the stage ready to discuss all of the drama that took place both on and off the screen. Gizelle admits a shocking revelation regarding her breakup with Jamal, and also opens up about his recent tax woes. The ladies call out Mia for all of her \"lies.\" Askale joins the stage bringing her fashion and…shade. Candiace opens up about the current rift between her mom and Chris, and hashes it out with the ladies about her constant trolling commentary."
      },
      {
        "id": "tvmaze:2203910",
        "title": "Reunion Part 2",
        "season": 6,
        "episode": 19,
        "released": "2021-11-14",
        "overview": "Gizelle becomes emotional while discussing her friendship and history with Karen. The ladies continue to take Candiace to task for her habitual line-stepping throughout the season, and Mia is questioned about her erratic social media behavior. Wendy gets fired up about the Eddie rumors, but winds up finding herself in the hot seat."
      },
      {
        "id": "tvmaze:2205228",
        "title": "Reunion Part 3",
        "season": 6,
        "episode": 20,
        "released": "2021-11-21",
        "overview": "The husbands join the couch to discuss the fun and drama this season. Chris opens up about feeling let down by his mother-in-law. Eddie gives his take on all of the rumors, and the ladies get the surprise of their lives."
      },
      {
        "id": "tvmaze:2205229",
        "title": "Reunion Part 4",
        "season": 6,
        "episode": 21,
        "released": "2021-11-28",
        "overview": "Nicki Minaj takes over and surprises the ladies of \"The Real Housewives of Potomac.\" Nicki gets down to business on the reunion stage. Unafraid to ask the difficult questions, she leaves no stone unturned."
      },
      {
        "id": "tvmaze:2206180",
        "title": "Secrets Revealed",
        "season": 6,
        "episode": 22,
        "released": "2021-12-05",
        "overview": "We're revealing all of the moments that couldn't fit in the regular season, but deserve to be seen! Gizelle embarks on her movie career in a role that she wasn't exactly made for... a stylist. We get a peek into Askale's home life and follow her and her hubby on a double date with Candiace and Chris. Mia gives her son Josh the birds and the bees talk; and Robyn wins Dean's approval. Plus, outtakes from Karen's Love Lunch and Candiace's Never Have I Ever game reveal several fun and INTIMATE details about the ladies!"
      },
      {
        "id": "tvmaze:2388088",
        "title": "Spring Awakening",
        "season": 7,
        "episode": 1,
        "released": "2022-10-09",
        "overview": "Spring has sprung in Potomac, and the gossip is in full bloom! The word on the street is that the Darbys are divorcing, but Ashley's story doesn't quite add up. Wendy explores a new venture with Peter Thomas. Mia's murky social media behavior leaves the ladies wondering about the real status of her health. Karen hosts a \"Spring Fling Celebration of Life\" extravaganza, but it's cut short when some of the ladies are confronted on their alleged lies."
      },
      {
        "id": "tvmaze:2389134",
        "title": "Allegation Nation",
        "season": 7,
        "episode": 2,
        "released": "2022-10-16",
        "overview": "Karen's spring fling concludes with a whole lot of drama. Mia battles more than just a health scare when the ladies make a jarring allegation. A newly liberated Ashley hosts a sexy dance class for the ladies, but the fun comes to an end when Gizelle drops a bombshell allegation."
      },
      {
        "id": "tvmaze:2389135",
        "title": "Stand in Your Truth",
        "season": 7,
        "episode": 3,
        "released": "2022-10-23",
        "overview": "Robyn loses her cool with Wendy and accuses her of being phony when it comes to Mia's alleged health scare. Gizelle's allegations against Chris leave Candiace furious and the Green-Eyed Bandits divided. Ashley begins her house-hunting journey but finds herself getting emotional in the process. Robyn asks Juan for a prenup, but things don't go as planned."
      },
      {
        "id": "tvmaze:2389136",
        "title": "Not All Fun and Games",
        "season": 7,
        "episode": 4,
        "released": "2022-10-30",
        "overview": "Robyn hosts a family fun day for everyone and their kids but leaves out one of the ladies. Gizelle and Mia are unimpressed by Robyn's hosting skills. Karen falls unexpectedly ill after she catches sight of Charrisse. Ashley prepares to tell the world about her separation from Michael, but an unexpected surprise sends her into a tailspin."
      },
      {
        "id": "tvmaze:2421115",
        "title": "The Burn Session",
        "season": 7,
        "episode": 5,
        "released": "2022-11-06",
        "overview": "In the aftermath of her divorce being leaked to the press, Ashley visits Candiace hoping to strengthen their budding friendship. Naturally, hot gossip is served. Gizelle and the girls discuss details of the twins' upcoming sweet 16 party. Robyn meets with a lawyer to discuss her prenup. Wendy looks to settle the rift between herself and several of the ladies by inviting the group to a winery for a \"burn session,\" but the whole event goes up in flames."
      },
      {
        "id": "tvmaze:2421116",
        "title": "Burnin' and Beefin'",
        "season": 7,
        "episode": 6,
        "released": "2022-11-13",
        "overview": "The \"burn session\" continues and Candiace confronts Ashley by dropping a bombshell rumor. Gizelle attempts to make things right with Candiace, but her apology isn't well received. The ladies get ready for a trip to Miami hosted by the queen of MIA herself, Mia, but find a surprise waiting for them when they arrive. Mia gets a call from an old friend who claims to have beef with Wendy."
      },
      {
        "id": "tvmaze:2433533",
        "title": "Beef Is Served",
        "season": 7,
        "episode": 7,
        "released": "2022-11-20",
        "overview": "The girls trip continues as the ladies head out to a dinner where there's a whole lot of \"beef\" on the menu. The birthday girl, Karen, continues to deflect questions about her friendship with Charrisse. Peter Thomas reveals to Mia that Wendy has been dodging his calls. Mia questions Wendy's business savvy in a shocking manner and Robyn catches it all on camera. The dramatic tussle causes a rift in the group, leaving Mia questioning Karen's loyalty."
      },
      {
        "id": "tvmaze:2433534",
        "title": "Queen vs. Queen",
        "season": 7,
        "episode": 8,
        "released": "2022-11-27",
        "overview": "After Mia and Wendy argue, the ladies must decide with whom their loyalty lies. Candiace arrives to find that Wendy has been ostracized from the group, but she makes up for it by bringing her to meet rap legend Trina. Gizelle reveals that she caught Mia and Jacqueline in a \"steamy\" situation. Karen gets heated with Mia for ruining her birthday."
      },
      {
        "id": "tvmaze:2441963",
        "title": "Ambush in Paradise",
        "season": 7,
        "episode": 9,
        "released": "2022-12-04",
        "overview": "Karen and Mia struggle to recover after an explosive confrontation. When Candiace is caught red-handed talking trash about the group to the public, Robyn confronts the issue with the help of a special guest. Ashley brings a rumor about Karen to the table that gets a dramatic response. A night of drunken debauchery prompts the women to open up as never before."
      },
      {
        "id": "tvmaze:2442530",
        "title": "Cleaning Up the Mess",
        "season": 7,
        "episode": 10,
        "released": "2022-12-11",
        "overview": "The ladies return to Potomac and get back to business. Gizelle and Robyn prepare for their Reasonably Shady live show while Karen prepares for a \"live experience\" of her own. Ashley gets emotional about her separation with Michael. Gizelle hosts a sweet 16 party for her twins with a special guest. Robyn has a heart-to-heart with some of the ladies. Ray encourages Chris Bassett to make an apology of his own."
      },
      {
        "id": "tvmaze:2446500",
        "title": "Show Time!",
        "season": 7,
        "episode": 11,
        "released": "2022-12-18",
        "overview": "When Gizelle and Robyn put on their live podcast, Karen takes shady notes for her own live show. Candiace shoots a music video with rapper Trina. Robyn broaches a tough subject with Juan. As Gizelle investigates the details of Mia and Jacqueline's close relationship, Wendy and Eddie deal with an unexpected emergency."
      },
      {
        "id": "tvmaze:2452735",
        "title": "Mic Drop",
        "season": 7,
        "episode": 12,
        "released": "2023-01-01",
        "overview": "Karen hosts her first-ever live show as the ladies brace themselves for a \"Grande Dame Experience.\" Mia and Gordon discuss their relationship with Jacqueline. Ashley's friend makes some shocking revelations about some of the husbands and attends Karen's show to set the record straight. When Mia finds out that Karen has been spreading gossip, she takes the mic and puts the Grande Dame in the hot seat."
      },
      {
        "id": "tvmaze:2456973",
        "title": "Sisterhood of the Traveling Beefs",
        "season": 7,
        "episode": 13,
        "released": "2023-01-08",
        "overview": "Gizelle receives some serious news from her doctor; Robyn is adamant about keeping some guests off the list while planning her wedding."
      },
      {
        "id": "tvmaze:2462124",
        "title": "Shake-Ups and Makeups",
        "season": 7,
        "episode": 14,
        "released": "2023-01-15",
        "overview": "Karen reveals the reason she stopped being friends with Charrisse and the ladies question her version of the truth; Mia does something that causes her and Jacqueline's friendship to hang in the balance."
      },
      {
        "id": "tvmaze:2473505",
        "title": "Indecent Disclosure",
        "season": 7,
        "episode": 15,
        "released": "2023-01-22",
        "overview": "Karen questions the validity of Robyn's upcoming nuptials and brings up alleged rumors about Juan; Robyn shares a suspicious photo with the ladies; Mia reaches her breaking point with Jacqueline but attempts to repair her friendship with Wendy."
      },
      {
        "id": "tvmaze:2473506",
        "title": "The Naked Truth",
        "season": 7,
        "episode": 16,
        "released": "2023-01-29",
        "overview": "After returning from vacation, the ladies discover that what happens in Mexico doesn't always stay in Mexico; Ashley spills the beans about Mia and Wendy's interesting exchange; Charrisse shares a story about Karen that leaves the ladies shocked."
      },
      {
        "id": "tvmaze:2480489",
        "title": "A Grande Finale",
        "season": 7,
        "episode": 17,
        "released": "2023-02-05",
        "overview": "Ashley lands her dream home, with a little help; Robyn makes an unexpected change to her wedding plans; Gizelle reveals her health diagnosis; Karen and Charrisse have a showdown at Candiace's music video reveal party; Mia confronts Karen."
      },
      {
        "id": "tvmaze:2484215",
        "title": "Reunion Part 1",
        "season": 7,
        "episode": 18,
        "released": "2023-02-19",
        "overview": "In part one, Ashley reveals the reason behind her recent breakup with Winter House's Luke and what she is set to gain from her divorce settlement with Michael. Mia discloses how she and Gordon lost control of their businesses and updates the group on their rocky financial status. Candiace reacts to watching Gizelle's allegations against Chris play out and accuses her former friend of bold-faced lies."
      },
      {
        "id": "tvmaze:2484216",
        "title": "Reunion Part 2",
        "season": 7,
        "episode": 19,
        "released": "2023-02-26",
        "overview": "The rift between Candiace and Gizelle continues as they address all of Gizelle's allegations against Chris from Season 7. Gizelle opens up about her recent surgery and dating a younger man, but the ladies question her willingness to share information about her personal life. Wendy gets fired up about Mia's \"assault\" on her in Miami. Jacqueline joins to reveal her truths about her relationship with Mia."
      },
      {
        "id": "tvmaze:2484217",
        "title": "Reunion Part 3",
        "season": 7,
        "episode": 20,
        "released": "2023-03-05",
        "overview": "The reunion concludes as Ashley and Candiace discuss the events that led to the dissolution of their once-burgeoning friendship. The husbands join and Chris confronts Gizelle about the accusations she made against him. Karen faces off against Charrisse and sets the record straight about the rumors of her infidelity. Andy has a special post-reunion conversation with Robyn and dives into Robyn's bombshell admission that Juan was inappropriately communicating with another woman prior to their wedding."
      },
      {
        "id": "tvmaze:2654827",
        "title": "Projections and Deflections",
        "season": 8,
        "episode": 1,
        "released": "2023-11-05",
        "overview": "Gizelle has a new love interest, Ashley has a new house and Mia has a new lifestyle; rumors of Juan's alleged infidelity return, but he stands firm on his innocence; with Robyn remaining by his side, Gizelle has no choice but to confront her BFF."
      },
      {
        "id": "tvmaze:2680429",
        "title": "Home Sweet Drama",
        "season": 8,
        "episode": 2,
        "released": "2023-11-12",
        "overview": "As Robyn discusses her intervention with Juan, Karen meets with Mia to discuss their fractured relationship. Ashley throws a housewarming party and invites her new friend Nneka. It soon turns out Nneka and Wendy may be more familiar with each other than anyone knew."
      },
      {
        "id": "tvmaze:2680430",
        "title": "Heaven Is a Place in Potomac",
        "season": 8,
        "episode": 3,
        "released": "2023-11-19",
        "overview": "Ashley's housewarming party continues as Robyn shares Juan's response to her intervention; Gizelle prepares for Grace to go off to college; while Wendy organizes her two sons' first communion brunch, Nneka makes claims against Wendy's family."
      },
      {
        "id": "tvmaze:2690901",
        "title": "In a Pickle",
        "season": 8,
        "episode": 4,
        "released": "2023-11-26",
        "overview": "Karen invites all of the couples to a fun day of pickleball, but things get heated on and off the court. Candiace comes face-to-face with Robyn and Gizelle. Everyone is surprised when a certain husband makes an appearance. Nneka confronts Wendy with some shocking allegations."
      },
      {
        "id": "tvmaze:2690902",
        "title": "Pie in the Austin Sky",
        "season": 8,
        "episode": 5,
        "released": "2023-12-03",
        "overview": "Ashley attempts to combat rising tensions in the group with a trip. Mia and Robyn bond over recent personal struggles. The rift between Wendy and Nneka widens as new claims and questions arise."
      },
      {
        "id": "tvmaze:2691710",
        "title": "Tequila, Tears, Texas",
        "season": 8,
        "episode": 6,
        "released": "2023-12-10",
        "overview": "Everything's bigger in Texas, including the drama. Ashley continues her mission to keep spirits high and Austin weird, but plans are derailed when Robyn is pushed to her breaking point."
      },
      {
        "id": "tvmaze:2703336",
        "title": "Don't Rock the Boat",
        "season": 8,
        "episode": 7,
        "released": "2023-12-17",
        "overview": "The ladies experience a chicken spin on bingo, but Robyn is sent over the edge; Gizelle and Karen discuss the state of the group; everyone comes together to celebrate Karen's \"Triple Twenty\" with an adventurous excursion."
      },
      {
        "id": "tvmaze:2714481",
        "title": "Painting Austin Red",
        "season": 8,
        "episode": 8,
        "released": "2024-01-07",
        "overview": "Karen's Triple Twenty continues as the group takes on an art project of the Grande Dame herself; the ladies wrap up their trip with a drag show, but things turn shady when they're asked to participate."
      },
      {
        "id": "tvmaze:2731486",
        "title": "Hard Conversations",
        "season": 8,
        "episode": 9,
        "released": "2024-01-14",
        "overview": "Mia invites the Dixons to a cooking experience; Gizelle takes Grace to a self-defense class as she prepares to send her off to college; the ladies come together to support Karen's PAVE event and rally behind an important cause."
      },
      {
        "id": "tvmaze:2735465",
        "title": "Friendship Is a Mother",
        "season": 8,
        "episode": 10,
        "released": "2024-01-21",
        "overview": "Candiace hosts a special Mother's Day brunch with some noticeable absences; Rayvin comes to town to celebrate Karen's Triple Twenty and meets with Gizelle and Grace to talk college; Robyn and Candiace try to see if they can salvage their friendship."
      },
      {
        "id": "tvmaze:2748421",
        "title": "First Come, First Served",
        "season": 8,
        "episode": 11,
        "released": "2024-01-28",
        "overview": "Mia gets candid with Robyn about her marital issues. Gizelle and Ashley collaborate on a foray into the fashion world. When Karen invites a few of the ladies to Surry County for a special occasion, unforeseen drama puts the Grande Dame in the hot seat."
      },
      {
        "id": "tvmaze:2748422",
        "title": "Blazed and Confused",
        "season": 8,
        "episode": 12,
        "released": "2024-02-04",
        "overview": "Wendy's husband, Eddie, throws a launch party for his new marijuana business; several long-running feuds threaten to disrupt the festivities."
      },
      {
        "id": "tvmaze:2763757",
        "title": "Sharing Is Caring",
        "season": 8,
        "episode": 13,
        "released": "2024-02-18",
        "overview": "Ashley comes clean about her divorce; Nneka and Wendy meet in hopes of making peace; Gizelle braces for Grace's impending graduation; the group sets off to the Dominican Republic, but things get off to a surprising start."
      },
      {
        "id": "tvmaze:2770128",
        "title": "Sun's Out Buns Out",
        "season": 8,
        "episode": 14,
        "released": "2024-02-25",
        "overview": "The ladies kick back in the DR with some fun and revealing games. Just when it seems like the drama is done and dusted, things go left between an unexpected trio."
      },
      {
        "id": "tvmaze:2774266",
        "title": "Fool's Gold",
        "season": 8,
        "episode": 15,
        "released": "2024-03-03",
        "overview": "As the Dominican Republic trip winds down, Wendy and Candiace respond to Gizelle's accusations about their demeanor regarding her daughter's education; Karen revisits the identity of her secret trainer; Mia has some choice words for Ashley."
      },
      {
        "id": "tvmaze:2781879",
        "title": "Boiling Point",
        "season": 8,
        "episode": 16,
        "released": "2024-03-10",
        "overview": "Charrisse hosts her annual Crab Boil and invites her closest friends; Gizelle gets emotional while taking her daughter Grace off to college; Candiace accuses Robyn of a surprising betrayal; Charrisse reaches a boiling point of her own."
      },
      {
        "id": "tvmaze:2789510",
        "title": "Fashion Show-Down",
        "season": 8,
        "episode": 17,
        "released": "2024-03-17",
        "overview": "Ashley and Gizelle work on their fashion line; Robyn and Juan tour potential franchise locations; Wendy organizes her pilot episode; Mia brings everyone together for an iconic photoshoot."
      },
      {
        "id": "tvmaze:2794640",
        "title": "An Iconic Ending",
        "season": 8,
        "episode": 18,
        "released": "2024-03-24",
        "overview": "Mia hosts a reveal party for the ladies' Icons photoshoot; Ashley's friendships are called into question; Charrisse confronts Candiace; news of a couple's shocking separation breaks."
      },
      {
        "id": "tvmaze:2799373",
        "title": "Reunion Part 1",
        "season": 8,
        "episode": 19,
        "released": "2024-03-31",
        "overview": "Robyn gets called to task for always defending Juan; Candiace is caught off guard; Mia opens up about her new boyfriend."
      },
      {
        "id": "tvmaze:2799374",
        "title": "Reunion Part 2",
        "season": 8,
        "episode": 20,
        "released": "2024-04-07",
        "overview": "Gizelle becomes emotional reflecting on her relationship with her late father; Robyn reveals the reason her friendship with Candiace came to a seeming end; Wendy and Nneka face off to clear up all the rumors, but things go south."
      },
      {
        "id": "tvmaze:2799375",
        "title": "Reunion Part 3",
        "season": 8,
        "episode": 21,
        "released": "2024-04-14",
        "overview": "Gordan shares heartbreaking news; Ashley gives an update on her divorce with Michael; Keiarna takes the stage as the ladies discuss who to blame for the altercation at the GnA Showcase; Andy attempts to mend the fractured group."
      },
      {
        "id": "tvmaze:3003316",
        "title": "A Crash Course in Deflection",
        "season": 9,
        "episode": 1,
        "released": "2024-10-06",
        "overview": "As news spreads of Karen's car accident and DUI charge, the ladies rally around her, but not without asking a few probing questions. Wendy closes an important chapter in her life. Ashley meets with a lawyer to finally take the next steps toward divorce. Mia navigates co-parenting with Gordon, but her unique family dynamic leads to a big conflict."
      },
      {
        "id": "tvmaze:3004574",
        "title": "Double Trouble",
        "season": 9,
        "episode": 2,
        "released": "2024-10-13",
        "overview": "The fallout from Karen's \"hattitude\" birthday continues as a few of the ladies try to reel in the drama. Gizelle and Wendy meet to hash out their issues, Keiarna checks-in on Karen and Stacey opens up to Ashley. Gizelle and Ashley's GnA event is challenged by the Grande Dame, who forces the ladies to make a difficult choice."
      },
      {
        "id": "tvmaze:3004575",
        "title": "Momma Knows Best",
        "season": 9,
        "episode": 3,
        "released": "2024-10-20",
        "overview": "Shocked by the dramatic GnA ousting, the group seeks answers and apologies. Keiarna settles in at her boyfriend's house. Mia and Inc have a staycation to get some space of their own. Stacey's close friend TJ comes to town. Gizelle attempts to make amends with the ladies before an upcoming trip, with surprising results."
      },
      {
        "id": "tvmaze:3027320",
        "title": "Bunking Beds and Butting Heads",
        "season": 9,
        "episode": 4,
        "released": "2024-10-27",
        "overview": "The ladies arrive in Lake Norman, N.C., to turn up, but some aren't ready for the heat that's unleashed. Jacqueline's relationship with Mia is questioned. Stacey and Keiarna both have bones to pick with Ashley. Mia reveals a long-held alleged secret about Karen, leaving everyone shocked."
      },
      {
        "id": "tvmaze:3027321",
        "title": "Blast From Everyone's Past",
        "season": 9,
        "episode": 5,
        "released": "2024-11-03",
        "overview": "Mia reveals what she allegedly overheard on the phone with Karen years ago, leaving the table speechless. The ladies ring in Wendy's 40th birthday. Gizelle heads back to Maryland to attend Angel and Adore's cap-and-gown ceremony. Chaos erupts over breakfast when Mia and Ashley's friendship takes an unusual turn."
      },
      {
        "id": "tvmaze:3032468",
        "title": "Shady Waters",
        "season": 9,
        "episode": 6,
        "released": "2024-11-10",
        "overview": "The group is shook as they navigate the fallout from the messy breakfast. Gizelle returns to Lake Norman. Mia takes the ladies on a detour to unwind before trying to work things out with Keiarna. At a celebratory dinner for Wendy's 40th, Jassi opens up to the women about her relationship, but some details aren't adding up."
      },
      {
        "id": "tvmaze:3037941",
        "title": "Hard Launch, Soft Landing",
        "season": 9,
        "episode": 7,
        "released": "2024-11-17",
        "overview": "The clock is ticking on Karen's court date as she examines what really caused her accident. Jassi hosts an event for her boyfriend, Darius, after a meeting at the White House. It's a cavalcade of partners as some of the ladies' men are introduced to the group for the first time. Mia's co-parenting arrangement with Gordon is strained when he confronts her and Inc about the timeline of their relationship."
      },
      {
        "id": "tvmaze:3041696",
        "title": "Healing, Thriving and Surviving",
        "season": 9,
        "episode": 8,
        "released": "2024-11-24",
        "overview": "Wendy preps for her 40th birthday bash and tries to bring her extended family together. Karen's big day in court arrives. Ashley performs her new single at a GnA event. Mia confides to the ladies about rising tensions between Gordon and Inc. Gizelle and Mia's confrontation causes issues within the group."
      },
      {
        "id": "tvmaze:3044933",
        "title": "Mediation Nation",
        "season": 9,
        "episode": 9,
        "released": "2024-12-01",
        "overview": "Ashley and Stacey each attend their divorce mediation appointments with unforeseen outcomes. Keiarna and Greg examine their relationship more closely. Gizelle spends time with Grace as she anticipates becoming an empty nester. Mia is pushed to her breaking point when her life choices are questioned."
      },
      {
        "id": "tvmaze:3049243",
        "title": "Love in the Fast Lane",
        "season": 9,
        "episode": 10,
        "released": "2024-12-08",
        "overview": "Gizelle joins Ashley in her quest to find new love; Karen and Ray address the work needed to repair their institution; TJ confronts Stacey about the state of their relationship; Wendy embraces for a tough conversation with her mother. Mia and Gordon discuss their decision to divorce and the conversation takes a surprising turn."
      },
      {
        "id": "tvmaze:3063854",
        "title": "Secrets of the Love Lagoon",
        "season": 9,
        "episode": 11,
        "released": "2024-12-15",
        "overview": "Stacey gets some heat for her relationship with TJ. Wendy makes a grand invitation to continue her 40th festivities in Panama. Karen hosts a Love Lagoon party at her home - full of risqué questions, unexpected answers and one uninvited guest with eight uninvited balloons."
      },
      {
        "id": "tvmaze:3080197",
        "title": "Shake the Devil Off",
        "season": 9,
        "episode": 12,
        "released": "2024-12-22",
        "overview": "Jacqueline's peace offering at Karen's Love Lagoon falls flat. The ladies head to Panama where Wendy sets up some choice room pairings. During a dinner, the group has words with Mia about her behavior."
      },
      {
        "id": "tvmaze:3081758",
        "title": "Rum-ble in the Jungle",
        "season": 9,
        "episode": 13,
        "released": "2025-01-05",
        "overview": "Wendy takes the group to Panama City for some fun with rum. Stacey continues to try and win over her roommate, Gizelle. As the nightly festivities continue, a few of the ladies unload on Mia about unresolved issues."
      },
      {
        "id": "tvmaze:3098202",
        "title": "Red, White and Smooch",
        "season": 9,
        "episode": 14,
        "released": "2025-01-12",
        "overview": "Stacey comes to grips with her divorce. The ladies take a yacht cruise, and Keiarna opens up about a recent botched trip with Greg. A seductive moment between two of the women stirs feelings of jealousy within the group."
      },
      {
        "id": "tvmaze:3116417",
        "title": "Old Rumors, Die Hard",
        "season": 9,
        "episode": 15,
        "released": "2025-01-19",
        "overview": "The ladies return from their Panama trip. Ashley prepares for her Drag King event. Stacey works to finalize her divorce while fielding requests from TJ. Gordon reveals some shocking information to Ray, which Karen levies against Mia to figure out the truth."
      },
      {
        "id": "tvmaze:3116882",
        "title": "The Truth Will Set You Off",
        "season": 9,
        "episode": 16,
        "released": "2025-01-26",
        "overview": "Keiarna and Greg work through their issues together. Inc expresses his frustrations to Mia. Karen decides to bow out of Stacey's event after feeling betrayed. Stacey responds accordingly."
      },
      {
        "id": "tvmaze:3116883",
        "title": "All Bark, No Bite",
        "season": 9,
        "episode": 17,
        "released": "2025-02-02",
        "overview": "Gizelle honors her father, Ashley gives a major life update and Dr. Wendy goes to the White House. Karen's latest court date looms as she questions her friendships. Stacey's charity event unravels in an unexpected fashion."
      },
      {
        "id": "tvmaze:3127693",
        "title": "Reunion Part 1",
        "season": 9,
        "episode": 18,
        "released": "2025-02-16",
        "overview": "The season nine reunion begins with a surprise as the ladies learn that the Grande Dame will not be in attendance, but not completely absent either. Wendy expresses her disappointment with Karen's lack of accountability this season. Ashley, Mia and Stacey reveal the statuses of their divorces. Jassi and Stacey confront Mia about her shocking behavior during her off-camera birthday in Miami."
      },
      {
        "id": "tvmaze:3128187",
        "title": "Reunion Part 2",
        "season": 9,
        "episode": 19,
        "released": "2025-02-23",
        "overview": "The reunion continues with Mia spiraling backstage after her confrontation. Keiarna and Stacey face tough criticism about their relationships with Greg and TJ, but when new revelations are made, the women are left speechless. When the ladies take her to task for her actions throughout the season, Mia finally reaches her breaking point."
      },
      {
        "id": "tvmaze:3129869",
        "title": "Reunion Part 3",
        "season": 9,
        "episode": 20,
        "released": "2025-03-02",
        "overview": "A shocking exit threatens to disrupt the reunion, but the drama continues. The nature of Stacey's relationship with TJ is called into question when one of the husbands drops a huge bombshell. The group takes a deep dive into Karen's DUI and long-held secrets finally come to light. Never-before-seen footage of Karen and Ray leaves a few of the ladies stunned."
      },
      {
        "id": "tvmaze:3343178",
        "title": "Second Bloom",
        "season": 10,
        "episode": 1,
        "released": "2025-10-05",
        "overview": "The housewives of Potomac usher in a decade on TV in a state of shock. Gizelle brings the group together to process Karen's trial and sentencing, but the conversation shifts toward relationships. Keiarna and Stacey circle the block on love. Ashley hosts her first big outing as newly divorced woman. The ladies continue to question Stacey's authenticity and uncover new revelations that demand answers."
      },
      {
        "id": "tvmaze:3383317",
        "title": "Mint to be Shady",
        "season": 10,
        "episode": 2,
        "released": "2025-10-12",
        "overview": "Stacey finds herself in hot water with the ladies who try and separate her facts from fiction. Keiarna's frustrations with Wendy affect her friendship with Angel. Angel hosts a retreat to try and mend bridges with interesting results. Gizelle, Keiarna and Ashley discover a bombshell rumor that brings an old friend back into the fold."
      },
      {
        "id": "tvmaze:3387114",
        "title": "Chin Checked",
        "season": 10,
        "episode": 3,
        "released": "2025-10-19",
        "overview": "Wendy and Keiarna try to find common ground, but dueling events put them at odds with one another. Stacey discovers a secret Gizelle has been hiding from the group. Tensions boil over at a pre-Preakness brunch when Angel's loyalties are called into question."
      },
      {
        "id": "tvmaze:3387115",
        "title": "Tropic Like It's Hot",
        "season": 10,
        "episode": 4,
        "released": "2025-10-26",
        "overview": "After resolving their differences at the Preakness, the ladies jet off to Nevis, but the island vibes don't last long. Angel struggles to find her place in the group while Gizelle questions her and Stacey. Keiarna deals with the fallout of her feuds with Wendy and Jassi. Stacey claps back at Gizelle with swirling rumors of a tryst."
      },
      {
        "id": "tvmaze:3394224",
        "title": "Sunshine and Sexts",
        "season": 10,
        "episode": 5,
        "released": "2025-11-02",
        "overview": "The ladies end their first night in Nevis with a celebration. A day filled with sunshine, history and shopping isn't enough to shake Keiarna and Angel's feelings of uneasiness within the group. Stacey tries a more direct approach in her relationship with unexpected results."
      },
      {
        "id": "tvmaze:3399900",
        "title": "Suns Out, Buns Out",
        "season": 10,
        "episode": 6,
        "released": "2025-11-09",
        "overview": "On the final day in Nevis, the group hits the high seas. Gizelle attempts to broker peace between several of the women. Tia has a surprising confrontation at dinner. The ladies throw a raunchy bachelorette party to celebrate Jassi, but old rumors rear their head and threaten to disrupt the festivities."
      },
      {
        "id": "tvmaze:3430485",
        "title": "Guess Who's Back?",
        "season": 10,
        "episode": 7,
        "released": "2025-11-16",
        "overview": "Stacey unveils her new line of gummies, but the brand name gives the ladies cause for pause. Wendy gets candid about her father. Keiarna and Greg discuss the state of their relationship. Angel and Tia connect with their families. Monique Samuels makes her long-awaited return to the Potomac circle and immediately finds herself in the middle of drama."
      },
      {
        "id": "tvmaze:3446072",
        "title": "Pride and Pettiness",
        "season": 10,
        "episode": 8,
        "released": "2025-11-23",
        "overview": "Monique gets reacquainted with her Potomac crew, but gets more than she bargained for with some of the ladies. Stacey introduces Tia to Thiemo with interesting results. At Gizelle's Reasonably Shady party, Keiarna and Tia confront Stacey about her pattern of inconsistency."
      },
      {
        "id": "tvmaze:3446073",
        "title": "Leak What You Speak",
        "season": 10,
        "episode": 9,
        "released": "2025-11-30",
        "overview": "The ladies continue to press Stacey about spreading rumors. Angel confronts Wendy about their strained relationship. While Ashley worries about her mother's well-being, Wendy contemplates her future with her father. Monique sits down with the group to solve the mystery of the Potomac leak once and for all."
      }
    ]
  }
}