{
  "meta": {
    "id": "tvmaze:66869",
    "type": "series",
    "name": "Elsbeth",
    "description": "Elsbeth follows Elsbeth Tascioni, an astute but unconventional attorney who utilizes her singular point of view to make unique observations and corner brilliant criminals alongside the NYPD. After leaving her successful legal career in Chicago to tackle a new investigative role in New York City, Elsbeth finds herself jockeying with the toast of the NYPD, Captain C.W. Wagner, a charismatic and revered leader. Working alongside Elsbeth is Officer Kaya Blanke, a stoic and ethical officer who quickly develops an appreciation for Elsbeth's insightful and offbeat ways.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/591/1479795.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/591/1479795.jpg",
    "videos": [
      {
        "id": "tvmaze:3400600",
        "title": "Glamazons",
        "season": 3,
        "episode": 9,
        "released": "2025-12-11",
        "overview": "A fallen '90s supermodel returns to New York for a reunion and revenge, leading Elsbeth to sort through old grudges and lies to catch a killer; Officer Hackett takes her turn in the spotlight."
      },
      {
        "id": "tvmaze:3400601",
        "title": "A Hard Nut to Crack",
        "season": 3,
        "episode": 10,
        "released": "2025-12-18",
        "overview": "When an avant-garde choreographer's Nutcracker rehearsal turns deadly, Elsbeth leaps into the cutthroat world of New York ballet."
      },
      {
        "id": "tvmaze:3442980",
        "title": "TBA",
        "season": 3,
        "episode": 11,
        "released": "2026-02-26",
        "overview": ""
      },
      {
        "id": "tvmaze:3400599",
        "title": "Basket Case",
        "season": 3,
        "episode": 8,
        "released": "2025-12-04",
        "overview": "Elsbeth goes from the squad room to the locker room when a campus murder rocks the world of college basketball after an athletic director winds up dead following a heated confrontation with his basketball coach's 22-year-old girlfriend."
      },
      {
        "id": "tvmaze:2687415",
        "title": "Pilot",
        "season": 1,
        "episode": 1,
        "released": "2024-02-29",
        "overview": "When a college theater student is mysteriously found dead in her high-rise New York City apartment, Elsbeth immediately suspects foul play and enters a game of wits against the victim's popular theater director Alex Modarian who she believes is involved. Throughout the evolution of the murder investigation, Elsbeth must balance her consent decree role with the NYPD and her uncommon methods to make her case and uncover the real killer."
      },
      {
        "id": "tvmaze:2765572",
        "title": "A Classic New York Character",
        "season": 1,
        "episode": 2,
        "released": "2024-04-04",
        "overview": "After the loathed co-op board president of a luxury pre-war building falls off her balcony to her death, Elsbeth and Kaya are called to the scene to dig for a lead when they meet Joann, a high-powered Manhattan real estate broker with huge clients and even bigger secrets."
      },
      {
        "id": "tvmaze:2784030",
        "title": "Reality Shock",
        "season": 1,
        "episode": 3,
        "released": "2024-04-04",
        "overview": "When a larger-than-life reality TV star is found dead in her bathtub, Elsbeth and Kaya investigate the circumstances around her death to determine if it was an accident or murder. As they get deeper into the events surrounding her demise, they meet Skip Mason, the mercurial producer behind the popular, guilty-pleasure reality series \"Lavish Ladies,\" who becomes a prime suspect after he is accused of going to dangerous lengths to concoct \"good TV.\""
      },
      {
        "id": "tvmaze:2789987",
        "title": "Love Knocked Off",
        "season": 1,
        "episode": 4,
        "released": "2024-04-11",
        "overview": "Things turn deadly when elite matchmaker Margo Clarke goes to extreme lengths to keep her socialite client from finding out the truth about her perfect new husband. When the husband goes missing, Captain Wagner assigns Elsbeth and Kaya to investigate."
      },
      {
        "id": "tvmaze:2805661",
        "title": "Ball Girl",
        "season": 1,
        "episode": 5,
        "released": "2024-04-18",
        "overview": "When the world's top tennis champion drops dead on the court, Elsbeth and Kaya home in on a rising tennis star and his competitive father and coach. Meanwhile, Captain Wagner begins to suspect Elsbeth's reason for being in New York goes beyond the consent decree."
      },
      {
        "id": "tvmaze:2809359",
        "title": "An Ear for an Ear",
        "season": 1,
        "episode": 6,
        "released": "2024-04-25",
        "overview": "After one of New York's most sought-after plastic surgeons is found dead, Elsbeth has her eye on the victim's former boss, Dr. Vanessa Holmes, who she believes has motives that are more than skin-deep. Also, Kaya keeps tabs on Elsbeth's whereabouts as her investigation into Captain Wagner heats up."
      },
      {
        "id": "tvmaze:2818305",
        "title": "Something Blue",
        "season": 1,
        "episode": 7,
        "released": "2024-05-02",
        "overview": "Elsbeth suspects foul play after a posh country club wedding meticulously planned by an esteemed, but shady, financial advisor, Ashton Hayes, ends in the golf cart death of the hapless groom. Also, Elsbeth plans a housewarming party with some old friends."
      },
      {
        "id": "tvmaze:2818306",
        "title": "Artificial Genius",
        "season": 1,
        "episode": 8,
        "released": "2024-05-09",
        "overview": "Elsbeth goes to battle with artificial intelligence when Quinn the young CEO of a location-based crime alert app, murders a journalist and uses her app to divert authorities and create a phony killer. Meanwhile, Wagner hatches a plan to fight the D.O.J. investigation."
      },
      {
        "id": "tvmaze:2823956",
        "title": "Sweet Justice",
        "season": 1,
        "episode": 9,
        "released": "2024-05-16",
        "overview": "After hearing his favorite patron talk about being bullied mercilessly in college, the charismatic owner of an exclusive cocktail bar decides to seek revenge on her behalf, but his desire for justice leads to a deadly mistake, leaving Elsbeth and Kaya to connect the dots. Meanwhile, after learning that the DOJ investigation is close to an indictment, Elsbeth and Captain Wagner join forces to expose the real criminal."
      },
      {
        "id": "tvmaze:2823957",
        "title": "A Fitting Finale",
        "season": 1,
        "episode": 10,
        "released": "2024-05-23",
        "overview": "When an unlikable fashion photographer is murdered in the middle of a fashion show, Elsbeth and the team suspect the killer to be either the photographer's college ex – and leading model of the show – or her jealous husband. Meanwhile, Elsbeth's role at the precinct is thrown into question."
      },
      {
        "id": "tvmaze:2941338",
        "title": "Subscription to Murder",
        "season": 2,
        "episode": 1,
        "released": "2024-10-17",
        "overview": "When a womanizing finance executive is found stabbed to death after a night at the opera, Elsbeth suspects an obsessed opera lover was driven to murder because of a ringing cell phone."
      },
      {
        "id": "tvmaze:3010070",
        "title": "The Wrong Stuff",
        "season": 2,
        "episode": 2,
        "released": "2024-10-24",
        "overview": "When a billionaire dies in a freak accident during a space training simulation, Elsbeth suspects a fellow magnate and wannabe astronaut with a grudge named Neal is responsible; Elsbeth is reunited with a former colleague from Chicago."
      },
      {
        "id": "tvmaze:3010071",
        "title": "Devil's Night",
        "season": 2,
        "episode": 3,
        "released": "2024-10-31",
        "overview": "When a former child star wakes up on Halloween after a wild night on the town with no recollection of her whereabouts, Elsbeth and the team retrace her steps; Capt. Wagner must address low morale at the precinct."
      },
      {
        "id": "tvmaze:3010072",
        "title": "Diamonds Are for Elsbeth",
        "season": 2,
        "episode": 4,
        "released": "2024-11-07",
        "overview": "While investigating the death of an employee at New York's most exclusive jewelry store, Elsbeth and the team uncover plans for a gala heist orchestrated by a chic VIP customer."
      },
      {
        "id": "tvmaze:3010073",
        "title": "Elsbeth Flips the Bird",
        "season": 2,
        "episode": 5,
        "released": "2024-11-14",
        "overview": "Elsbeth investigates the death of a devious kitchen staffer after he causes havoc in New York's hottest restaurant and enrages one of America's most revered chefs."
      },
      {
        "id": "tvmaze:3033011",
        "title": "Gold, Frankincense, and Murder",
        "season": 2,
        "episode": 6,
        "released": "2024-12-05",
        "overview": "Celebrity Christmas curators Dirk and DeeDee Dashers, go from tinsel to tragedy after Dirk is killed in a freak accident and Elsbeth begins to suspect his wife is behind the murder. Meanwhile, Elsbeth gets a holiday surprise courtesy of Wagner and Kaya."
      },
      {
        "id": "tvmaze:3034013",
        "title": "One Angry Woman",
        "season": 2,
        "episode": 7,
        "released": "2024-12-12",
        "overview": "Elsbeth is summoned to jury duty and lands on a murder trial where she faces off with the unusually difficult Judge Milton Crawford."
      },
      {
        "id": "tvmaze:3010074",
        "title": "Toil and Trouble",
        "season": 2,
        "episode": 8,
        "released": "2024-12-19",
        "overview": "Elsbeth is thrown into the world of procedural TV after a prolific producer is brutally murdered in his office."
      },
      {
        "id": "tvmaze:3034742",
        "title": "Unalive and Well",
        "season": 2,
        "episode": 9,
        "released": "2025-01-30",
        "overview": "When a young man is found dead in his car, Elsbeth visits the wellness center he'd just left."
      },
      {
        "id": "tvmaze:3110146",
        "title": "Finance Bros",
        "season": 2,
        "episode": 10,
        "released": "2025-02-06",
        "overview": "When a Wall Street titan is murdered after giving away his fortune, Elsbeth suspects the victim's twin brother and business partner in a deadly case of sibling rivalry. Meanwhile, the Van Ness case continues to cause trouble for Elsbeth."
      },
      {
        "id": "tvmaze:3114831",
        "title": "Tiny Town",
        "season": 2,
        "episode": 11,
        "released": "2025-02-13",
        "overview": "Sparks fly between Elsbeth and a handsome Scottish musician named Angus after he witnesses a murder through a video art installation linking Manhattan with his tiny seaside town. The two join forces to solve the case together from across the pond."
      },
      {
        "id": "tvmaze:3122846",
        "title": "Foiled Again",
        "season": 2,
        "episode": 12,
        "released": "2025-02-20",
        "overview": "While investigating the mysterious death of a college admissions officer, Elsbeth finds herself fencing with Lawrence Grey, an independent educational consultant who promises an Ivy League future to high-paying clients and their painfully average kids. The case also causes Elsbeth and Teddy to question how well she prepared him for the real world."
      },
      {
        "id": "tvmaze:3129640",
        "title": "Tearjerker",
        "season": 2,
        "episode": 13,
        "released": "2025-02-27",
        "overview": "While investigating the death of a wealthy real estate developer, Elsbeth is led to the last person to see him alive, a lifestyle consultant named Chloe who is usually found on the arms of residents of New York City's Billionaires' Row."
      },
      {
        "id": "tvmaze:3139941",
        "title": "Scenes From an Italian Restaurant",
        "season": 2,
        "episode": 14,
        "released": "2025-03-06",
        "overview": "When Elsbeth takes a tour of famous New York crime scenes she is left with nagging questions about a legendary Mafia slaying in Little Italy, and about the owner of the family restaurant where it happened, Pupetta Del Ponte. Also, Judge Crawford's grudge against Elsbeth causes a roadblock in the investigation."
      },
      {
        "id": "tvmaze:3139942",
        "title": "I See... Murder",
        "season": 2,
        "episode": 15,
        "released": "2025-03-13",
        "overview": "Elsbeth matches wits with a professional psychic after the stepson of one of her wealthy clients is found murdered in Central Park. Meanwhile, Kaya's dreams of becoming a detective may come true."
      },
      {
        "id": "tvmaze:3139943",
        "title": "Hot Tub Crime Machine",
        "season": 2,
        "episode": 16,
        "released": "2025-04-03",
        "overview": "After a man's suspicious death in a hot tub, Elsbeth consults his wife, Freya, a decluttering guru whose less-is-more philosophy and controlling personality appear at odds with her \"throuple\" relationship."
      },
      {
        "id": "tvmaze:3162317",
        "title": "Four Body Problem",
        "season": 2,
        "episode": 17,
        "released": "2025-04-10",
        "overview": "Elsbeth visits the historic and elite funeral home owned by Arthur Greene Jr. when his conspiracy-minded nephew goes missing. Meanwhile, Elsbeth continues to adjust to Kaya's new role and works the case with a chatty new hire, Officer Chandler."
      },
      {
        "id": "tvmaze:3180963",
        "title": "I Know What You Did Thirty-Three Summers Ago",
        "season": 2,
        "episode": 18,
        "released": "2025-04-24",
        "overview": "As Judge Milton Crawford inches closer to becoming a federal judge, Elsbeth scours his past to prove he's a murderer before it's too late, but her attempts to take him down put everyone around her in jeopardy. Meanwhile, Teddy considers following in his mother's professional footsteps."
      },
      {
        "id": "tvmaze:3180964",
        "title": "I've Got a Little List",
        "season": 2,
        "episode": 19,
        "released": "2025-05-01",
        "overview": "While investigating what appears to be a random shooting, Elsbeth meets Rod, an entitled playboy working through his bucket list of thrills, which may include murder. In the end, Elsbeth's efforts to catch the killer land her in serious legal trouble."
      },
      {
        "id": "tvmaze:3180966",
        "title": "Ramen Holiday",
        "season": 2,
        "episode": 20,
        "released": "2025-05-08",
        "overview": "When Elsbeth tries to solve a murder, she comes face to face with many familiar suspects."
      },
      {
        "id": "tvmaze:3301135",
        "title": "Yes, And…",
        "season": 3,
        "episode": 1,
        "released": "2025-10-12",
        "overview": "Elsbeth dives into the world of late-night comedy when backstage tensions rise between a talk show host, his head writer and her on-air sidekick husband; Elsbeth meets a new police officer who is an aspiring stand-up comic when off the clock."
      },
      {
        "id": "tvmaze:3301136",
        "title": "Doll Day Afternoon",
        "season": 3,
        "episode": 2,
        "released": "2025-10-16",
        "overview": "When a murder investigation at a famous New York toy store spirals into a hostage crisis, Elsbeth must negotiate with Nolan, the hapless ex-con inside; Captain Wagner clashes with a rival whose reckless tactics could turn the standoff deadly."
      },
      {
        "id": "tvmaze:3372436",
        "title": "Good Grief",
        "season": 3,
        "episode": 3,
        "released": "2025-10-23",
        "overview": "When \"grief influencer\" Raquel Drabowski's presumed-dead husband makes a miraculous return, their reunion takes a fatal plunge; Elsbeth's surprise reunion with an old friend could expose a dangerous undercover operation."
      },
      {
        "id": "tvmaze:3372432",
        "title": "Ick, A Bod",
        "season": 3,
        "episode": 4,
        "released": "2025-10-30",
        "overview": "Elsbeth must separate trick from treat in Sleepy Hollow when a rivalry reaches a ghoulish climax on Halloween night after a suburban housewife butts heads with a new neighbor; Capt. Wagner makes a frightening discovery about his daughter."
      },
      {
        "id": "tvmaze:3372433",
        "title": "Poetic Justice",
        "season": 3,
        "episode": 5,
        "released": "2025-11-06",
        "overview": "After a donor's death shakes New York's nonprofit arts scene, Elsbeth questions the motives of the victim's friend, Gary, the founder of a prominent poetry journal; Elsbeth runs into her old friend Marissa Gold."
      },
      {
        "id": "tvmaze:3372434",
        "title": "Bunker Down",
        "season": 3,
        "episode": 6,
        "released": "2025-11-13",
        "overview": "Elsbeth investigates when a crisis manager vanishes inside a billionaire's panic room; Elsbeth meets the late Judge Crawford's widow, Winnie."
      },
      {
        "id": "tvmaze:3372435",
        "title": "And Then There Were Nuns",
        "season": 3,
        "episode": 7,
        "released": "2025-11-20",
        "overview": "A pop star's purchase of a failing convent turns divine real estate into a murder scene; Teddy digs into Alec Bloom's past for a feature he is working on."
      }
    ]
  }
}