{
  "meta": {
    "id": "tvmaze:88818",
    "type": "series",
    "name": "See No Evil",
    "description": "See No Evil is a forensic look at the biggest scandal in Church of England history. Featuring never-seen-before interviews, this two-part series explores the psychology of a prolific abuser and tells the inside story of John Smyth's sinister world, through exclusive and intimate testimony from his children and widow.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/603/1507578.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/603/1507578.jpg",
    "videos": [
      {
        "id": "tvmaze:3464662",
        "title": "Episode 2",
        "season": 1,
        "episode": 2,
        "released": "2025-12-11",
        "overview": "This concluding part explores the new life Smyth builds in Zimbabwe, setting up Christian summer camps which provide him access to hundreds of young boys every year. On the camps, Smyth satiates his violent cravings. The camps involve enforced nudity, skinny dipping and beatings on a hugely increased scale. The film also explores the suspicious death of Guide Nyacharu, a schoolboy and camp-goer who is found dead in a swimming pool on one of Smyth's camps. On multiple occasions insiders tried to hold Smyth to account, but he continued to evade justice and his behaviour was repeatedly covered up. After decades of abuse, the episode charts Smyth's downfall, the impact on his family and victims, and the true scale of the Channel 4 investigation. After his death, a damning review found Smyth's crimes were covered up by senior church officials, causing a seismic scandal that resulted in the resignation of the Archbishop of Canterbury, Justin Welby. For the first time ever, Smyth's widow Anne speaks out about his actions. An in-depth interview reveals details about their relationship and the fall out of the Channel 4 News investigation, and includes a long-awaited conversation between two of their children and Anne about their father's actions."
      },
      {
        "id": "tvmaze:3464661",
        "title": "Episode 1",
        "season": 1,
        "episode": 1,
        "released": "2025-12-10",
        "overview": "The story begins in the 1980s, in the quintessential English town of Winchester. Smyth, a young, high-flying barrister, has started offering discipleship to young Christians at Winchester College, the local elite boarding school. Smyth builds intimate relationships with these teenagers, inviting them to Sunday lunches and parties at his family home. Soon, he has introduced them to a secret and brutal regime; the boys endure ritualistic cane-beatings in Smyth's garden shed, which Smyth justified as spiritual discipline necessary to relieve them of their sins. The film explores who knew about Smyth's actions, and whether or not they were complicit, or victims; the painstaking work of those trying to expose Smyth, and the role of senior Church officials in allowing him to leave the country and continue his teachings in Zimbabwe. The two-part series investigates how Smyth weaponised faith, its impact on others and the reasons why they have decided to speak out now."
      }
    ]
  }
}