{
  "meta": {
    "id": "tvmaze:5310",
    "type": "series",
    "name": "After the First 48",
    "description": "After the First 48 revisits some of the most powerful cases originally featured on the First 48 and features exclusive interviews with detectives, prosecutors, defense attorneys, and families of victims. After the First 48 takes viewers through the dramatic and emotional inside story; from the investigation, to the murder trial itself, the verdict and beyond.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/542/1356508.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/542/1356508.jpg",
    "videos": [
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3460655",
        "title": "Along Came a Killer",
        "season": 11,
        "episode": 6,
        "released": "2025-12-04",
        "overview": "After a barrage of gunfire leaves three men dead in a residential neighborhood, Gwinnett detectives use every available resource to identify the killer; at trial, the defendant claims he acted in self-defense."
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      },
      {
        "id": "tvmaze:322166",
        "title": "Murder on the Interstate / At Close Range Update",
        "season": 1,
        "episode": 1,
        "released": "2008-10-07",
        "overview": ""
      },
      {
        "id": "tvmaze:322167",
        "title": "Fool for Love / Crash",
        "season": 1,
        "episode": 2,
        "released": "2008-10-14",
        "overview": "In Dallas, Detective Rick Duggan arrested two suspects for the murder of Leonel Valle. Now the justice system needed to determine which of them was most responsible - the girlfriend, Marsela Cortez, whose fingerprints were found on his empty safe, or her jealous ex-boyfriend, Gerardo Hernandez?"
      },
      {
        "id": "tvmaze:322168",
        "title": "Blindsided / Killing Spree",
        "season": 1,
        "episode": 3,
        "released": "2009-02-12",
        "overview": "In Dallas, Detective Eddie Ibarra used surveillance video to track down Jose Castro who was accused of brutally murdering a fifty-one year-old woman in the lobby of her office building. Castro now faced the death penalty, but his defense team would come up with an unexpected counter argument that could change the outcome of the case."
      },
      {
        "id": "tvmaze:322169",
        "title": "Silenced / Downstream Drifter",
        "season": 1,
        "episode": 4,
        "released": "2009-02-26",
        "overview": ""
      },
      {
        "id": "tvmaze:322170",
        "title": "Blackout",
        "season": 1,
        "episode": 5,
        "released": "2009-07-14",
        "overview": "Detective Robert Arredondo and his team find themselves involved in a cross country manhunt for suspects in the brutal shootings of three young men."
      },
      {
        "id": "tvmaze:1111558",
        "title": "Ashes and Snow / Backyard Murder",
        "season": 1,
        "episode": 6,
        "released": "2009-08-18",
        "overview": "A look back at the Ashes and Snow and Backyard Murder cases.Ashes and Snow: Sgt. Rick Zimmerman and Sgt. Tammy Diedrich were called to the murder of a young woman, found strangled in a partially burned car in Minneapolis just days before Christmas. Backyard Murder: Sgt. Mike Martel found a young man shot to death in a neighborhood yard in Detroit. Martel had to rely on a friend of the victim's to help him close the case."
      },
      {
        "id": "tvmaze:1111560",
        "title": "Bait and Switch",
        "season": 1,
        "episode": 7,
        "released": "2010-02-18",
        "overview": "On a Sunday night in June 2007, Christian Marton and his girlfriend Monica Stafford drove two hours from Axtell, Texas to Dallas where Christian had arranged to buy a car. By the end of the evening, Christian was dead–shot in a robbery attempt. Lead Detective John Palmer and his partner, Armando Perez used both surveillance footage from a fast food restaurant and cell phone records to build a case against the man who planned the robbery. For the man who actually pulled the trigger, Palmer relied on both his fingerprint found at the scene of the crime and an id by Monica. Both men were charged with capital murder. The case went to trial in February of 2009."
      },
      {
        "id": "tvmaze:1111564",
        "title": "Burden of Proof / Last Ride",
        "season": 1,
        "episode": 8,
        "released": "2010-04-29",
        "overview": "A father of five found stabbed over 50 times shocks friends and family. Cleveland Homicide follows a bizarre trail of evidence that takes the case someplace they least expected."
      },
      {
        "id": "tvmaze:1111565",
        "title": "Disappeared / Red Handed",
        "season": 1,
        "episode": 9,
        "released": "2010-06-03",
        "overview": "In Dallas, detectives investigated the disappearance of a 20-year old woman who suddenly went missing. After a six-day search, detectives arrested Douglas Edwards who confessed to the murder of his ex-girlfriend, found strangled and burned in a remote field. Two years later, in the hope of begging the court for mercy, Edwards opts to have his sentenced determined by a jury."
      },
      {
        "id": "tvmaze:1111566",
        "title": "The Boogey Man",
        "season": 1,
        "episode": 10,
        "released": "2010-07-15",
        "overview": "On March 26th, 2006, homicide detectives were called to the site of a burning car. Inside were the charred remains of 22-year-old Xenia Wilson, the mother of a four-year-old daughter. Detectives Rick Duggan and Randy Laboda closed the case by arresting three suspects: Jose \"J.J.\" Verduzco, Chito Rojas and Ismael \"Boogeyman\" Moreno. Verduzco and Rojas pled guilty and agreed to testify against Moreno. The trial would take turns that surprised both defendant and prosecutor. And the case itself would have a tragic postcript."
      },
      {
        "id": "tvmaze:1111681",
        "title": "Bail Out",
        "season": 1,
        "episode": 11,
        "released": "2010-08-03",
        "overview": "In Dallas, detectives investigated the shooting death of 26-year-old Daniel Barron, who was killed in the doorway of his home. Detectives soon discovered that the victim's residence doubled as a drug den and that he was robbed. A tipster called-in and eventually six suspects were arrested and charged with capital murder. All six individuals admit involvement in the crime and point to 19-year-old Callie Marshall, mother of two, as the group's ringleader. A year and a half later, Callie finally faces a jury of her peers. Will they see a confused girl who organized the robbery in order to bail her boyfriend out of jail in time for Christmas, or a coldblooded killer?"
      },
      {
        "id": "tvmaze:322171",
        "title": "Letters of Intent / Family Friend",
        "season": 1,
        "episode": 12,
        "released": "2010-10-07",
        "overview": "In Dallas, Texas in 2007 Darell Billingsela was charged with brutally attacking and killing twenty-two-year old Jessica Lewalling in a jealous rage. Billingslea was a two-time convicted murderer out on parole. Prosecutor Jennifer Bennett was determined to make sure Billingslea would not slip through the system again. And, in February 2007, thirty-six-year old Antoine, \"Tony\" Hamilton was found shot dead, and left behind a vacant house. His friend, Carlos Mitchell, confessed to the crime. Prosecutor Jenni Morse thought she had a slam dunk case--until the verdict in a similar case shook her confidence in getting a conviction."
      },
      {
        "id": "tvmaze:322172",
        "title": "The Good Book",
        "season": 1,
        "episode": 13,
        "released": "2010-10-14",
        "overview": "In November 2006, Dallas detectives investigated the murder of a twenty-nine-year-old mother of four, found burned beyond recognition in her car behind a remote warehouse. Detectives soon discovered that the victim's former boyfriend and father of her infant son, had been stalking her for months, leading up to her death. After tracking down two homeless witnesses and finding a piece of crucial evidence, police were able to charge James Bartley with capital murder. The Dallas DA's office was responsible for bringing the case to a close. In order to do that successfully, the prosecutor and her investigator had to keep close tabs on their key homeless witnesses for years, while the cased awaited trial. When Bartley finally stood trial in 2009, the prosecution worried the jury wouldn't believe the testimony of two homeless crack addicts and find the evidence insufficient to prove Bartley guilty beyond a reasonable doubt."
      },
      {
        "id": "tvmaze:322173",
        "title": "Last Fare",
        "season": 1,
        "episode": 14,
        "released": "2010-10-21",
        "overview": "Suspects in the case of a cab driver who was robbed and murdered face their day in court."
      },
      {
        "id": "tvmaze:322174",
        "title": "Innocent Lost",
        "season": 1,
        "episode": 15,
        "released": "2010-10-28",
        "overview": "In July of 2006, Miami detectives Rolando Garcia and Orlando Silva responded to the shooting death of nine-year-old Sherdavia Jenkins. After a three-week investigation, detectives were able to close their case, charging two men with second-degree murder: Damon \"Red Rock\" Darling and Leroy \"Yellowman\" Larose. Three years later the two men would face Sherdavia's family in court."
      },
      {
        "id": "tvmaze:322175",
        "title": "Gun Play / No-Tell Motel",
        "season": 1,
        "episode": 16,
        "released": "2010-11-04",
        "overview": "Now that some of our strongest cases have been adjudicated, we can take viewers inside the powerful and dramatic events that unfolded after the arrest, up to and including the conviction."
      },
      {
        "id": "tvmaze:322176",
        "title": "Drama at the Classic / 50G Murder",
        "season": 1,
        "episode": 17,
        "released": "2010-11-11",
        "overview": "Cases involving a football game murder and a shooting at an illegal dentist office go to court."
      },
      {
        "id": "tvmaze:322177",
        "title": "Return to Sender / Left Behind",
        "season": 1,
        "episode": 18,
        "released": "2011-10-19",
        "overview": "In 2008, 19-year old Mikael Hudson was shot in Texas, two suspects were arrest. In 2005, Virginia Rodriguez was murdered, and her husband was caught and extradited to the US, but Prosecutor Treena Kay had concerns about getting a conviction."
      },
      {
        "id": "tvmaze:1111682",
        "title": "Signs of Violence",
        "season": 2,
        "episode": 1,
        "released": "2011-04-14",
        "overview": "One man was part of a love triangle, the other a complete stranger--both were murdered a week apart. Little did Louisville Homicide Detectives realize these two brutal homicides were linked, until they met Michael Knights and Jeston Murray. Were they both murderers or was one a witness? Both faced the death penalty but only one would go to trial."
      },
      {
        "id": "tvmaze:1111683",
        "title": "Last Yard",
        "season": 2,
        "episode": 2,
        "released": "2011-06-23",
        "overview": "University of Memphis football star Taylor Bradford was killed in his beloved Lincoln Town Car. At first police thought the motive was robbery. Then as they investigated, a love triangle emerged. Finally four men were charged with Bradford's murder. The first to go on trial wasn't even at the crime scene. Could prosecutors convince a jury to find him guilty of murder?"
      },
      {
        "id": "tvmaze:1111684",
        "title": "Lester Street",
        "season": 2,
        "episode": 3,
        "released": "2011-08-11",
        "overview": "In September of 2010, Jessie Dotson went on trial for one of the worst mass murders in Memphis history. He wasn't accused of killing strangers--he was brother, friend and uncle to the six people he'd allegedly murdered and three surviving children he'd allegedly beaten and stabbed. Even seasoned detectives were horrified by the bloody crime scene. Now, all of Memphis wanted an answer to the same question: How could only one man be responsible for such brutal carnage?"
      },
      {
        "id": "tvmaze:1111685",
        "title": "Torn",
        "season": 2,
        "episode": 4,
        "released": "2011-11-03",
        "overview": "In February of 2009, 21-year-old James \"Jamo\" Allen was gunned down outside of a Louisville, Kentucky housing project. After discovering that his ex-girlfriend knows the truth about the crime, detectives work quickly to track down the alleged killer and elicit a confession from him. Nearly two years later, what should have been a straightforward trial goes haywire when a detective stumbles on the stand and the defense calls a surprise witness. Will justice be served or will the confessed murderer go free?"
      },
      {
        "id": "tvmaze:1111686",
        "title": "Final Investment",
        "season": 2,
        "episode": 5,
        "released": "2011-11-10",
        "overview": "When a robbery goes bad in south Memphis, one man is dead and very little physical evidence is left at the scene. Detectives track down several witnesses, but the one person who saw the shooting was a 10-year-old boy. Fast forward five years to a dramatic murder trial. The witness is now 15 and well aware of the dangers of testifying. Will he do the right thing? Or not..."
      },
      {
        "id": "tvmaze:1111687",
        "title": "Hale Storm",
        "season": 2,
        "episode": 7,
        "released": "2011-12-22",
        "overview": "A Louisville, Kentucky family awakes before dawn as a barrage of gunfire rips through their home. When the smoke clears, three teenage boys are bleeding from bullet wounds. One would not survive. The lives of two others would be forever altered. Now, a family friend with violent tendencies stands trial for the shooting, but a lack of eyewitnesses threatens to derail the whole case. Will a jury find him guilty or will the angry suspect walk free?"
      },
      {
        "id": "tvmaze:1111688",
        "title": "Bad Company",
        "season": 2,
        "episode": 8,
        "released": "2011-12-29",
        "overview": "On a warm, clear night in the desert near Lake Mead, the body of a man--shot dead--was found in the middle of the road. When Las Vegas Metro homicide detectives began investigating the death, they had no idea the case would lead them to a conspiracy that involved five people. Or that it would take six years to bring down the man behind the murder."
      },
      {
        "id": "tvmaze:1111690",
        "title": "Loose Ends",
        "season": 2,
        "episode": 9,
        "released": "2012-01-12",
        "overview": "Detectives link Martin Seay to several killings--but he only goes on trial for one. The state's key witness is his former girlfriend, Kandi Hawkins. Hawkins was paralyzed from the neck down when Seay ordered a hit on her. Will her testimony be enough to convict the ruthless killer?"
      },
      {
        "id": "tvmaze:1111691",
        "title": "Fifteen",
        "season": 2,
        "episode": 10,
        "released": "2012-01-26",
        "overview": "Fifteen-year-old Juanita Payne was killed outside a party by a stray round from an AK-47. Detectives arrest a man they are sure is the killer. But the case begins to fall apart soon after. Will the alleged killer walk free?"
      },
      {
        "id": "tvmaze:1111692",
        "title": "Shattered Dreams",
        "season": 3,
        "episode": 1,
        "released": "2012-04-12",
        "overview": "In 2008 Mohamed Abdelrahman, a Darfurian immigrant, was killed in his store during a robbery. Det. Arnold charged three suspects with his murder. Mohamed's widow watches and worries that the jury will let her husband's alleged killers go free."
      },
      {
        "id": "tvmaze:1111693",
        "title": "Better Days / Inked in Blood",
        "season": 3,
        "episode": 2,
        "released": "2012-04-19",
        "overview": "In Memphis, a 79-year-old man is shot dead. When the young man accused of the killing comes to trial, his defense attorney argues an unusual defense. Also, a female tattoo artist is killed in her shop. The alleged shooter faces the death penalty."
      },
      {
        "id": "tvmaze:1111694",
        "title": "In Harm's Way",
        "season": 3,
        "episode": 3,
        "released": "2012-04-26",
        "overview": "In 2009, John Craig Froelich, II was shot and killed while taking his girlfriend to buy drugs in south Houston. Sgt. Craig Clopton charged the shooter and his girlfriend with capital murder. Without forensic evidence, prosecutor Terrence Windham had to rely on three eyewitnesses who all had credibility issues. Would the jury believe them on the stand? Or would the shooter walk?"
      },
      {
        "id": "tvmaze:1111696",
        "title": "Cold as Ice",
        "season": 3,
        "episode": 4,
        "released": "2012-05-03",
        "overview": "In January of 2009, Louisville resident Billy Wagner was killed in the street by a single bullet to the back of the head. After nearly two weeks, Det. Rick Arnold charged 20-year-old Gary Lindsey with murder, but the story was far from over. At trial, a young prosecutor faced off against a power veteran defense attorney. And the jury had to decide: Was the killing self-defense or murder?"
      },
      {
        "id": "tvmaze:1111697",
        "title": "Torched / Girl Fight",
        "season": 3,
        "episode": 5,
        "released": "2012-05-10",
        "overview": "In Miami, Detective Freddie Ponce arrests a man who tortured and killed his childhood friend. The case is strong--until an unexpected event in the first days of trial puts the whole thing in jeopardy. In Birmingham, a young mother is killed in front of her children. The killer is a young woman with no criminal history. Will this unlikely defendant win the jury's sympathy--and a verdict of self-defense?"
      },
      {
        "id": "tvmaze:1111698",
        "title": "Tag Team / Heart of Gold",
        "season": 3,
        "episode": 6,
        "released": "2012-05-17",
        "overview": "In Memphis, TN, Lt. Caroline Mason revisits the 2007 homicide of a 19-year-old man shot to death during a street fight that got out of hand. But when 26-year-old DeMario Thomas went to trial in 2009, the victim's mother surprised everyone. While in Louisville, KY, a prosecutor's case comes close to collapse when an unforeseen twist of fate threatens to let an alleged murderer walk."
      },
      {
        "id": "tvmaze:1111699",
        "title": "Rules of the Game",
        "season": 3,
        "episode": 7,
        "released": "2012-07-05",
        "overview": "When a popular local celebrity in Louisville is murdered during a drug deal, homicide detectives Brenda Wescott and John Lesher search for his killer. Lashawn \"Shizz\" Talbert created a popular dance called \"The Shizz.\" In August, 2010 he was driven to a drug deal by a local club promoter named David Curd. They drove to a quiet neighborhood and met a dealer named Kenneth Brown. Brown claimed that Talbert robbed him at gunpoint. Detectives unravel the case and learn about the role of Curd. And in an exclusive interview after his trial, Brown claims self-defense."
      },
      {
        "id": "tvmaze:1111700",
        "title": "Last Call / Road Hazard",
        "season": 3,
        "episode": 8,
        "released": "2012-07-26",
        "overview": "A brutal shooting in Memphis leaves a single mom mourning her only son. The main suspect is a high-ranking gang member. Will his violent reputation keep witnesses from testifying? Then--a Birmingham motorist calls 911 in the middle of the night after his car is run off the road. But when responders arrive, they find the caller shot dead. A lone eyewitness steps forward, but will his testimony be enough to convince a jury to convict?"
      },
      {
        "id": "tvmaze:1111701",
        "title": "Cold and Callous / Wrong Man",
        "season": 3,
        "episode": 9,
        "released": "2012-08-02",
        "overview": "In Harris County, Texas, an innocent fifteen year old is heartlessly murdered by another teenager during a robbery. But when witnesses to the crime are shown photos of the killer, they fail to identify him. Will he get away with murder? And in Memphis, Tennessee, an innocent bystander, trying to break up a fight is killed when he is caught in the crossfire. But the more police question the suspect in the shooting, the more he adamantly proclaims his innocence. Did the police actually have the wrong man?"
      },
      {
        "id": "tvmaze:1111702",
        "title": "Stolen Lives / Crimson Trail",
        "season": 3,
        "episode": 10,
        "released": "2012-08-09",
        "overview": "In Miami, Florida, 25-year-old Pedro Roteta is stabbed in the middle of the street and left to die. Despite video of the murder and a confession the defense attempts to get immunity based on the controversial \"Stand Your Ground\" law. Will a judge let the suspect walk out of court a free man? And in Dallas Texas, a man is stabbed to death in an alley and the sole suspect disappears over the Mexican border. Then, after four years on the run, the alleged killed is finally arrested and claims self defense. Will a jury buy his story?"
      },
      {
        "id": "tvmaze:322178",
        "title": "Devil Inside / Flight Risk",
        "season": 3,
        "episode": 11,
        "released": "2012-09-27",
        "overview": "After a woman's dismembered body is found beneath an overpass in Tucson, Arizona, the suspect reveals a disturbing dark side--and shocks investigators with a revelation no one saw coming. Will the justice system deliver the ultimate punishment? Then, a weekend getaway in Dallas, Texas turns deadly when a woman is shot to death by her cousin's boyfriend. At trial, it's a game of he said, she said. But whom will the jury believe--the eyewitness or the suspect?"
      },
      {
        "id": "tvmaze:322179",
        "title": "Bad Attitude",
        "season": 3,
        "episode": 12,
        "released": "2012-10-18",
        "overview": "After an unidentified man's stabbed body is found in a vacant Dallas, Texas apartment, two suspects both admit to setting up the man for robbery--and blame each other for the murder. Will the prosecutor succeed in determining who indeed is the actual killer? And will justice be served with an appropriate prison sentence for both defendants, or will one get off easily?"
      },
      {
        "id": "tvmaze:322180",
        "title": "Caught Up / Chasing Shadows",
        "season": 3,
        "episode": 13,
        "released": "2012-10-25",
        "overview": "In two cases in Louisville, Kentucky, detectives arrested suspects whose actions were caught on videotape? But will the surveillance tapes help the prosecutor s case--or help the defendants walk free?"
      },
      {
        "id": "tvmaze:322181",
        "title": "No Return",
        "season": 3,
        "episode": 14,
        "released": "2012-11-01",
        "overview": "A beloved father of three is gunned down outside his home in Atascocita, Texas, during a robbery gone wrong. Investigators catch a lucky break with surprise piece of evidence. But when the two main suspects point the finger at each other, it's up to the prosecution to convince a jury that they're both guilty of capital murder."
      },
      {
        "id": "tvmaze:322182",
        "title": "Into the Woods",
        "season": 4,
        "episode": 1,
        "released": "2013-02-14",
        "overview": "After a 17-year-old girl is found with a bullet through the back of her head in the woods of Katy, Texas, a young man comes forward who claims to be an eyewitness. Investigators are shocked by the unusual deal he's made with the DA. Is the eyewitness telling the truth — or is he involved in the murder? And will the prosecution convince the jury that the defendant is the real killer?"
      },
      {
        "id": "tvmaze:1111703",
        "title": "John Doe",
        "season": 4,
        "episode": 2,
        "released": "2013-02-21",
        "overview": ""
      },
      {
        "id": "tvmaze:1111704",
        "title": "The Witness",
        "season": 4,
        "episode": 3,
        "released": "2013-02-28",
        "overview": "In Liberty City, Miami a well-liked husband and wife are brutally murdered in an ambush shooting. The eyewitness to the crime is the couple's ten-year-old daughter. She is the only thing linking the suspect to the crime. It's up to her to sway the jurors as she gives an emotional testimony in the hopes of putting her parents' killer behind bars."
      },
      {
        "id": "tvmaze:1111705",
        "title": "Brother's Blood",
        "season": 4,
        "episode": 4,
        "released": "2013-03-07",
        "overview": "When a Honduran immigrant is found stabbed to death in his Miami apartment, his brother claims it was a suicide. But as investigators dig deeper, all evidence points to the surviving brother. His attorney claims self-defense, citing Florida's stand your ground law–but the prosecution fights hard to send the defendant to trial, and ultimately, to prison."
      },
      {
        "id": "tvmaze:1111706",
        "title": "Friends for Life",
        "season": 4,
        "episode": 5,
        "released": "2013-03-14",
        "overview": "The case of a fatal shooting in Cleveland takes a strange turn when a witness comes forward claiming the victim was shot by his best friend."
      },
      {
        "id": "tvmaze:1111707",
        "title": "Cold Light of Day",
        "season": 4,
        "episode": 6,
        "released": "2013-03-21",
        "overview": "In Cleveland, Detectives Mike Smith and Walley Everett investigate the murder of a young woman who's body is burned beyond recognition. A key witness comes forward who leads them to the suspect. But when the case moves to court, the key witness could become the prosecution's main liability."
      },
      {
        "id": "tvmaze:1111708",
        "title": "Dumped",
        "season": 4,
        "episode": 7,
        "released": "2013-03-28",
        "overview": "In Memphis, Tennessee a man's body is found dumped in a field. Despite every effort, the case goes cold and the murderer remains a mystery. For six years the victim's father investigates the murder on his own, trying to find out who killed his son. When an unexpected tip leads to the arrest of a close friend of the victim, the victim's family worries that there is not enough evidence to put the murderer away for life. And the details of the brutal killing are finally revealed in court."
      },
      {
        "id": "tvmaze:1111709",
        "title": "Missing / Deadly Ride",
        "season": 4,
        "episode": 8,
        "released": "2013-08-22",
        "overview": "In Harris County, Texas investigators are called to an abandoned SUV, its interior covered in blood. The vehicle's owner, a 20-year-old single mother, is nowhere to be found. The Sheriff's department believes she's been murdered, and her boyfriend is the main suspect--but he's not talking. Thirteen hundred miles away an SUV slams into a house, its driver shot dead behind the wheel. Detectives soon have an ID on his shooter, but he's fled the state, and a manhunt is on."
      },
      {
        "id": "tvmaze:1111710",
        "title": "House of Rage",
        "season": 4,
        "episode": 9,
        "released": "2013-08-29",
        "overview": "A mother of five young boys is found shot to death in her Cleveland, Ohio apartment. A witness emerges, guiding detectives to a critical piece of evidence–and ultimately, a suspect. Going into trial, prosecutors think their case is airtight, but when their key witness falters on the stand, the veteran defense team is poised and ready to dismantle the prosecution's case"
      },
      {
        "id": "tvmaze:1111711",
        "title": "The Ring / House of Pain",
        "season": 4,
        "episode": 10,
        "released": "2013-09-05",
        "overview": "In Birmingham Alabama a mother of a two-year-old boy is found stabbed to death in her own bedroom. Investigators have a mystery on their hands when they learn the killer opened the victim's front door with a key and stole her diamond ring. In Cleveland Ohio, two 19 year-old men are shot and killed during a party at an abandoned house. All signs point to a good friend of the victims' as the shooter but no one actually saw him pull the trigger. With no DNA or murder weapon found, the state needs to convince a jury the defendant is a cold-blooded killer."
      },
      {
        "id": "tvmaze:1111712",
        "title": "Prince of Darkness / Last Words",
        "season": 4,
        "episode": 11,
        "released": "2013-10-31",
        "overview": "In Harris County Texas, a young mother of three daughters is found in her trailer with her throat slashed. Investigators arrest her alleged killer with the help of a key witness, but the defense turns the tables when the case goes to trial. And in Birmingham, Alabama, a popular man is shot blocks from his home, but manages to name the shooter but investigators need the help of witnesses to put away the killer."
      },
      {
        "id": "tvmaze:1111714",
        "title": "Wild Ride / Jacked Up",
        "season": 4,
        "episode": 12,
        "released": "2013-11-07",
        "overview": ""
      },
      {
        "id": "tvmaze:1111715",
        "title": "Good Man Down",
        "season": 4,
        "episode": 13,
        "released": "2013-11-21",
        "overview": "In Cleveland, Ohio, an aspiring police officer is gunned down during a vicious nightclub brawl, and it's all caught on tape. Investigators pore over more than 80 hours of surveillance footage, hoping to identify the triggerman, but the video doesn't show who fired the fatal shot. With so few witnesses willing to talk, the state needs to use the video to convince the jury of the events that led to this cold-blooded killing."
      },
      {
        "id": "tvmaze:1111716",
        "title": "What Lies Beneath",
        "season": 4,
        "episode": 14,
        "released": "2013-12-06",
        "overview": "One of the most bizarre The First 48 cases becomes a compelling After the First 48 special. When a body is discovered buried in a basement for six months in an Old Louisville home, the home's owner and his boyfriend are charged with murder. Each claims the other is responsible for the gruesome crime. In two separate trials, the shocking details of their life together come out. And all of Louisville wonders: What really happened in that house?"
      },
      {
        "id": "tvmaze:1111718",
        "title": "A Simple Plan",
        "season": 4,
        "episode": 15,
        "released": "2014-01-03",
        "overview": "In Harris county Texas, a 41-year-old woman is killed in her home by four masked men. Investigators have an idea of who did, but can they get enough evidence to prove it? Then, when one of the defendants faces a jury, the defense turns the table and puts the Harris County Sheriffs' department on trial."
      },
      {
        "id": "tvmaze:1111719",
        "title": "Brutal Business",
        "season": 4,
        "episode": 16,
        "released": "2014-01-10",
        "overview": "In the Dallas Neighborhood of Oak Cliff, two young men are shot in the head inside a drug house, their bodies, found burned in the trunk of a car. Investigators scramble to find eyewitnesses to the crime and the three suspects, but at trial, no one could say who pulled the trigger. It would be up to the prosecution to paint a gruesome, vivid picture of this brutal crime in the hopes of securing a capital murder conviction."
      },
      {
        "id": "tvmaze:1111720",
        "title": "Uncommon Valor",
        "season": 4,
        "episode": 17,
        "released": "2014-01-17",
        "overview": ""
      },
      {
        "id": "tvmaze:1111721",
        "title": "Trail of Evidence",
        "season": 5,
        "episode": 1,
        "released": "2014-03-14",
        "overview": "In Harris County Texas, a 38-year-old man is stabbed to death in his own home leaving behind two children and his wife. Investigators track down the suspect thanks to surveillance video and some good old fashion detective work. But when the defendant claims self defense, the state must put together a case that will convince the jury the dead man was in fact the victim and not a predator."
      },
      {
        "id": "tvmaze:1111722",
        "title": "Burned Alive",
        "season": 5,
        "episode": 2,
        "released": "2014-03-27",
        "overview": "A Houston woman is beaten, set on fire, and left to die in an attack that police investigators suspect was committed by someone the victim knew."
      },
      {
        "id": "tvmaze:1111723",
        "title": "Into the Night",
        "season": 5,
        "episode": 3,
        "released": "2014-04-03",
        "overview": "Police detectives arrest two young men for the murder of a man at a gas station."
      },
      {
        "id": "tvmaze:1111724",
        "title": "Burning Rage",
        "season": 5,
        "episode": 4,
        "released": "2014-05-15",
        "overview": "In Birmingham, AL, a woman, her son and her young niece are stabbed more than 75 times then set on fire inside their apartment. Investigators zero in on the victims' relative. But at trial, the defense claims the suspect's IQ is too low to qualify for the death penalty. It would be up to the prosecution to paint a gruesome, vivid picture of this brutal crime to secure a capital murder conviction and the ultimate punishment."
      },
      {
        "id": "tvmaze:1111725",
        "title": "Birthday Girl / Nightmare",
        "season": 5,
        "episode": 5,
        "released": "2014-05-22",
        "overview": "In Cleveland, a 14-year-old girl was gunned down at her own birthday party when rival gangs opened fire. After interviewing eyewitnesses, detectives hunted down several suspects. But would the prosecutor be able to bring all of the defendants to justice? 1200 miles south, in Miami, a woman was shot over a dozen times during a drug deal gone wrong and lived to tell about it. When the woman identified the man who shot her and killed her boyfriend, Det. Manny Castillo hoped her story would be enough to convict a killer."
      },
      {
        "id": "tvmaze:1111726",
        "title": "Love Thy Neighbor",
        "season": 5,
        "episode": 6,
        "released": "2014-07-24",
        "overview": "An armed robbery escalates into capital murder and rocks a residential Houston neighborhood. One man is left for dead while his killers flee into the night. Four years later, will justice finally be served?"
      },
      {
        "id": "tvmaze:1111727",
        "title": "Easy Money",
        "season": 5,
        "episode": 7,
        "released": "2014-07-31",
        "overview": "A robbery at a Cleveland convenience store turns deadly when a store clerk is shot and killed. As police track down the men responsible, they discover more robberies and a second homicide that can be tied to the same suspects. But when the killers are brought into custody, the real drama begins, as they turn on each other--each bringing a very different story to the witness box."
      },
      {
        "id": "tvmaze:1111728",
        "title": "Hot Ride",
        "season": 6,
        "episode": 1,
        "released": "2014-10-30",
        "overview": "A carjacking-turned-murder leaves a youth minister dead. Two men are caught and one suspect turns on the other. But, a last minute change of heart changes everything."
      },
      {
        "id": "tvmaze:3466351",
        "title": "Jacked Up / Wrong Man",
        "season": 6,
        "episode": 2,
        "released": "2015-02-12",
        "overview": ""
      },
      {
        "id": "tvmaze:1111729",
        "title": "Cold Justice",
        "season": 6,
        "episode": 3,
        "released": "2015-02-19",
        "overview": "In 1983, several young mothers are raped and murdered on the west side of Louisville Kentucky. A conviction on two of the murders leaves a third family with no justice. Until 31 years later, when the re-opened case and preserved DNA evidence lead police to a killer. But at trial, his attorneys question the investigation--and the memory of the victim's children--leading to an explosive confrontation."
      },
      {
        "id": "tvmaze:1111730",
        "title": "Kiss of Death",
        "season": 6,
        "episode": 4,
        "released": "2015-03-05",
        "overview": "A man is brutally gunned down on a neighborhood street in Rochester, New York. Investigators believe his estranged wife, a prostitute, is lying to them about his murder. And when the case goes to trial, a conviction hinges on the testimony of two witnesses with shaky credibility."
      },
      {
        "id": "tvmaze:1111731",
        "title": "Deadly Dance",
        "season": 6,
        "episode": 5,
        "released": "2015-03-12",
        "overview": "In Las Vegas, a professional dancer disappears without a trace. Her boyfriend, the last person to see her alive, provides no leads. Finally, after weeks of dead ends, a tip blows the case wide open. At trial, the prosecution has an eyewitness and plenty of evidence on their side. But when the defendant takes the stand, will his dramatic testimony win over the jury?"
      },
      {
        "id": "tvmaze:1111732",
        "title": "Date Night",
        "season": 6,
        "episode": 6,
        "released": "2015-03-19",
        "overview": "Just four days before Christmas 2013, a single mother of five is shot twice, dumped in a East Cleveland street, and ran over by the killer. As the investigation moves forward, the victim's husband goes from grieving spouse to main suspect. But at trial, his attorneys question the investigation--and say the state, which can't provide any witnesses to the crime, rushed to judgment. But what truly shocks the victims family is the deep, dark secrete about her husbands past."
      },
      {
        "id": "tvmaze:1111733",
        "title": "Murder Rap / New Year's Terror",
        "season": 6,
        "episode": 7,
        "released": "2015-04-16",
        "overview": "In Cleveland, Ohio, two murders rock the city. A young man leaves gang life behind to dedicate himself to ending the violence in his west side neighborhood. But soon after, he's shot dead. Once in custody, the killers shock police with their motive. And across town, two hours into the new year, a man is shot to death in a home invasion. The killers leave a blood trail but are nowhere to be found. Police and prosecutors search for justice and a family is left wondering if the killers will face justice."
      },
      {
        "id": "tvmaze:1111734",
        "title": "Twice Told Tale",
        "season": 6,
        "episode": 8,
        "released": "2015-04-23",
        "overview": "It's a murder case that spans twelve years and centers on one 911 call. The victim says a name in the last moments of her life--will that be enough to convict her alleged killer."
      },
      {
        "id": "tvmaze:1111735",
        "title": "The Rookie",
        "season": 6,
        "episode": 9,
        "released": "2015-05-07",
        "overview": "In Cleveland, a beloved son and father is shot to death during a robbery. A single eyewitness comes forward to identify two suspects, both members of a notorious gang. Prosecutors assemble a case against the shooter they hope will send him away for good–but as trial approaches, the defendant's violent reputation has their witnesses terrified."
      },
      {
        "id": "tvmaze:2303225",
        "title": "Crossroads",
        "season": 7,
        "episode": 1,
        "released": "2022-02-03",
        "overview": "In Tulsa, the brutal murder of a man gunned down and left to die alone in the street tears apart two families."
      },
      {
        "id": "tvmaze:2303226",
        "title": "Chain of Death",
        "season": 7,
        "episode": 2,
        "released": "2022-02-10",
        "overview": "A young mother and her friend are murdered in a parking lot, sending Tulsa detectives and prosecutors on a mission to put the shooter behind bars."
      },
      {
        "id": "tvmaze:2303227",
        "title": "Spree Killer",
        "season": 7,
        "episode": 3,
        "released": "2022-02-17",
        "overview": "After a man is killed and several others are injured, the Tulsa PD and District Attorney's Office team with the homeless community to convict a potential spree killer."
      },
      {
        "id": "tvmaze:2303228",
        "title": "Family First",
        "season": 7,
        "episode": 4,
        "released": "2022-03-24",
        "overview": "In Tulsa, detectives must break a family's code of silence to solve the gruesome murder of an 18-year-old. At trial, justice hinges on a critical witness who initially refuses to testify."
      },
      {
        "id": "tvmaze:2307960",
        "title": "Down a Dark Hallway",
        "season": 7,
        "episode": 5,
        "released": "2022-03-31",
        "overview": "After an elderly man is murdered, the suspect shocks prosecutors when he goes against his lawyer's advice in court."
      },
      {
        "id": "tvmaze:2309348",
        "title": "Tracked",
        "season": 7,
        "episode": 6,
        "released": "2022-04-07",
        "overview": "In Gwinnett County, Georgia, after a hard-working father of three is murdered at his doorstep, his family and friends must process a horrifying betrayal in order to bring the killers to justice."
      },
      {
        "id": "tvmaze:2334194",
        "title": "Old Wounds",
        "season": 7,
        "episode": 7,
        "released": "2022-05-26",
        "overview": "In Tulsa, a 19-yr-old woman is killed in a drive-by shooting, but the bullet was meant for someone else. At trial, justice hinges on a witness with close ties to both the victim and the suspect."
      },
      {
        "id": "tvmaze:2339324",
        "title": "Devil's Trail",
        "season": 7,
        "episode": 8,
        "released": "2022-06-02",
        "overview": "When a homeless woman is raped and murdered, Tulsa detectives team up with prosecutors and the suspect's previous victim, hoping to stop him before he strikes again."
      },
      {
        "id": "tvmaze:2343050",
        "title": "Trap House",
        "season": 7,
        "episode": 9,
        "released": "2022-06-09",
        "overview": "Just before Christmas, a man is killed during an armed robbery gone wrong. Tulsa detectives and the District Attorney's Office will try and convince a jury to convict one of the armed men for murder, even if he didn't fire the fatal shot."
      },
      {
        "id": "tvmaze:2362081",
        "title": "The Dark Trail",
        "season": 7,
        "episode": 10,
        "released": "2022-06-16",
        "overview": "After a homeless man is ambushed and murdered on a dark trail in Tulsa, prosecutors and police struggle to track down their key witness, who is living on the streets--the victim's wife."
      },
      {
        "id": "tvmaze:2360015",
        "title": "Rogue Gun",
        "season": 7,
        "episode": 11,
        "released": "2022-07-14",
        "overview": "After a devoted father is gunned down in Georgia, detectives uncover a string of shootings that terrorized the community. Police and prosecutors must rely on circumstantial evidence to put the shooter behind bars."
      },
      {
        "id": "tvmaze:2365089",
        "title": "Truly Lost",
        "season": 7,
        "episode": 12,
        "released": "2022-07-21",
        "overview": "The homicide department attempts to find answers after a parking lot fight leaves two men shot dead and four others facing time in prison all due to one bad decision, and the authorities discover that three of the suspects never fired a shot."
      },
      {
        "id": "tvmaze:2479554",
        "title": "Chat Trap",
        "season": 8,
        "episode": 1,
        "released": "2023-01-26",
        "overview": "Gwinnett County detectives investigate the murder of an innocent fifteen-year-old, caught up in a petty crime. But how will the prosecution take on a witness who claims the shooter acted in self-defense?"
      },
      {
        "id": "tvmaze:2483451",
        "title": "Out of the Darkness",
        "season": 8,
        "episode": 2,
        "released": "2023-02-02",
        "overview": "Detectives rely on a 12-year-old girl as the only witness to a domestic dispute that escalated to a double homicide, but questions arise as to whether the young girl will be able to withstand the pressure of testifying about the crime."
      },
      {
        "id": "tvmaze:2483453",
        "title": "Escape Plan",
        "season": 8,
        "episode": 3,
        "released": "2023-02-09",
        "overview": "After detectives find a mother stabbed to death, they turn to her young son to identify the killer, but the prosecutors worry that the child will have a hard time testifying at court, which means that their entire case is in jeopardy."
      },
      {
        "id": "tvmaze:2498753",
        "title": "Buried Secrets",
        "season": 8,
        "episode": 4,
        "released": "2023-03-02",
        "overview": "A Mobile mother goes missing after blowing millions at the casino. At trial, the DA and detective take a gamble of their own to bring her killer to justice."
      },
      {
        "id": "tvmaze:2520666",
        "title": "Close to Home",
        "season": 8,
        "episode": 5,
        "released": "2023-04-06",
        "overview": "Homicide detectives investigate the death of a man who was shot in the head, and they wonder about the neighbor's role in the shooting after they find guns hidden in the garage next door, and they uncover a family connection as well."
      },
      {
        "id": "tvmaze:2520667",
        "title": "Mother of Two",
        "season": 8,
        "episode": 6,
        "released": "2023-04-13",
        "overview": "Detectives turn to the victim's family for help in catching her killer after her sons find their mother's dead body in the back of her car, but the defendant's explosive testimony leaves the prosecution's case hanging on a single piece of evidence."
      },
      {
        "id": "tvmaze:2530132",
        "title": "End of the Road",
        "season": 8,
        "episode": 7,
        "released": "2023-04-20",
        "overview": "In Tulsa, a rookie detective is pushed to the brink searching for a beloved man who ultimately turns up brutally murdered. After a grinding two-year investigation, bringing the killer to justice could hang on the testimony of a jailhouse informant."
      },
      {
        "id": "tvmaze:2587924",
        "title": "Backslide",
        "season": 8,
        "episode": 8,
        "released": "2023-07-06",
        "overview": "Detectives investigate the shooting death of a father who was shot near his ex-girlfriend's house and decide which person of interest should be charged with his murder, and after the court case is resolved, a conflicting account emerges."
      },
      {
        "id": "tvmaze:2587925",
        "title": "Bloodline",
        "season": 8,
        "episode": 9,
        "released": "2023-07-13",
        "overview": "After a former Marine is gunned down in broad daylight, Tulsa detectives must track down a family of three, suspected in the killing. But, at trial, justice hangs on whether the gunman and victim are actually who they appear to be."
      },
      {
        "id": "tvmaze:2606006",
        "title": "One Good Deed",
        "season": 8,
        "episode": 10,
        "released": "2023-07-27",
        "overview": "Tulsa detectives believe the victim of a shooting was a Good Samaritan who'd been robbed. But at trial, the jury must decide if his killer actually acted in fear of his own life."
      },
      {
        "id": "tvmaze:2612238",
        "title": "Among Friends",
        "season": 8,
        "episode": 11,
        "released": "2023-08-03",
        "overview": "Detectives theorize that a young victim was murdered by two gunmen after they uncover evidence at the crime scene, but the jurors debate whether one of the suspects should be found not guilty during the high-stakes trial."
      },
      {
        "id": "tvmaze:2612240",
        "title": "Lips are Sealed",
        "season": 8,
        "episode": 12,
        "released": "2023-08-10",
        "overview": "Investigators and the prosecutor fail to find a witness willing to say they saw the shooting that led to a man being gunned down in an after-hours club, so the case hangs in the balance on the defendant's claim of self-defense."
      },
      {
        "id": "tvmaze:2646469",
        "title": "Cruel Intentions",
        "season": 9,
        "episode": 1,
        "released": "2023-10-26",
        "overview": "In Mobile, a woman in a volatile relationship is found dead in her car. Detectives suspect her boyfriend, but, at trial, he takes the stand to brazenly claim she was actually the victim of a drug deal gone bad."
      },
      {
        "id": "tvmaze:2679644",
        "title": "Flashing Colors",
        "season": 9,
        "episode": 2,
        "released": "2023-11-02",
        "overview": "A massive, gang-related melee outside a nightclub leaves Gwinnett County detectives struggling to identify just who shot a young murder victim. And the death of one of the witnesses makes that challenge even harder for prosecutors."
      },
      {
        "id": "tvmaze:2679645",
        "title": "Jealous Heart",
        "season": 9,
        "episode": 3,
        "released": "2023-11-09",
        "overview": "When a Mobile mother of four is shot just blocks from her home, detectives look to her loved ones to identify her killer. But, at trial, his attorneys claim he acted in self-defense."
      },
      {
        "id": "tvmaze:2679646",
        "title": "End Game",
        "season": 9,
        "episode": 4,
        "released": "2023-11-16",
        "overview": "In Mobile, a professor is murdered in his own home. It takes a missing gaming console, and a strategic game of cat and mouse with the suspects, for detectives and prosecutors to get justice."
      },
      {
        "id": "tvmaze:2714643",
        "title": "Friends And Enemies",
        "season": 9,
        "episode": 5,
        "released": "2023-12-14",
        "overview": "When three people are gunned down in a Tulsa home, detectives face two suspects, and a web of lies. Prosecutors are left with circumstantial evidence to clinch the case against a calculated, cold-blooded killer."
      },
      {
        "id": "tvmaze:2719900",
        "title": "Murder in Mobile",
        "season": 9,
        "episode": 6,
        "released": "2023-12-21",
        "overview": "When a transient man is gunned downed, the only eyewitness Mobile detectives have is also a suspect. At trial, reluctant witnesses, defendants pointing fingers at each other, and a surprise ruling from the judge leave a novice prosecutor struggling to clinch his case."
      },
      {
        "id": "tvmaze:2858729",
        "title": "Raw Deal",
        "season": 9,
        "episode": 7,
        "released": "2024-05-09",
        "overview": "In Gwinnett County, a beloved rapper is gunned down in a hail of bullets from a drive-by shooting. With little hard evidence, detectives and prosecutors need to rely on a tipster to testify--despite the risks--and bring the suspect to justice."
      },
      {
        "id": "tvmaze:2858731",
        "title": "Ringside Seat",
        "season": 9,
        "episode": 8,
        "released": "2024-05-16",
        "overview": "Tulsa homicide delves into a dark world of drugs and prostitution to solve the murder of a man executed in his car in a motel parking lot."
      },
      {
        "id": "tvmaze:2880590",
        "title": "Vengeance",
        "season": 9,
        "episode": 9,
        "released": "2024-05-23",
        "overview": "Detectives and attorneys struggle to understand a man's mental state in the wake of a shooting that killed four people in broad daylight, and the entire case rests on the man's sanity and the reaction of the victims' families."
      },
      {
        "id": "tvmaze:2940473",
        "title": "The Invitation",
        "season": 9,
        "episode": 10,
        "released": "2024-07-25",
        "overview": "Investigators and prosecutors hope to convince two accomplices to betray their friends in the wake of a party that turned into the site of a murder, and they must openly acknowledge the risk the two accomplices are running by talking."
      },
      {
        "id": "tvmaze:2957357",
        "title": "Freestyling",
        "season": 9,
        "episode": 11,
        "released": "2024-08-01",
        "overview": "When a young rapper is shot in a well-to-do suburban neighborhood, detectives search for a suspect, and at trial, the defense accuses the prosecution's key witness of actually being the one to pull the trigger and end the victim's life."
      },
      {
        "id": "tvmaze:3032256",
        "title": "Thick as Thieves",
        "season": 10,
        "episode": 1,
        "released": "2024-11-07",
        "overview": "After a violent melee leaves two young men brutally gunned down, Mobile detectives have to track down multiple suspects to piece together what happened. But without an eyewitness, the prosecution must rely on the defendants themselves to reveal the truth."
      },
      {
        "id": "tvmaze:3041937",
        "title": "Secrets and Lies",
        "season": 10,
        "episode": 2,
        "released": "2024-11-14",
        "overview": "When a vulnerable woman is shot to death, witnesses are hesitant to help Tulsa detectives clinch the case; at trial, the defense questions their reliability and claims the prosecution has accused the wrong man."
      },
      {
        "id": "tvmaze:3041938",
        "title": "Fatal Mistake",
        "season": 10,
        "episode": 3,
        "released": "2024-11-21",
        "overview": "In Tulsa, there's little evidence and no clear motive after a beloved 24-year-old is gunned down in the backseat of a car; in a tragic case of mistaken identity, it's up to his friends to help detectives and prosecutors deliver justice."
      },
      {
        "id": "tvmaze:3055130",
        "title": "Murder on Maiden Lane",
        "season": 10,
        "episode": 4,
        "released": "2024-12-05",
        "overview": "In Atlanta, when a young father is gunned down, a rookie homicide detective draws from her own experience losing a family member to murder, to track down his killers. The prosecution's case hinges on a witness grappling with survivor's guilt, who goes missing."
      },
      {
        "id": "tvmaze:3114640",
        "title": "A Killer Fight",
        "season": 10,
        "episode": 5,
        "released": "2025-02-27",
        "overview": "After a beloved Mobile man is gunned down in his front yard, conflicting eyewitness accounts leave detectives wondering if the suspect might have acted in self-defense. To find justice, the prosecution will need the community the victim stood up for to come forward at trial."
      },
      {
        "id": "tvmaze:3146546",
        "title": "Meet Up For Murder",
        "season": 10,
        "episode": 6,
        "released": "2025-03-06",
        "overview": "After an immigrant, lured by a woman, is beaten to death, Gwinnett County Police discover that one of the three suspects believes no one will care about him because he's Mexican. The prosecution is determined to prove the assailant wrong, but justice hinges on one brother turning against another."
      },
      {
        "id": "tvmaze:3146547",
        "title": "In a Lonely Place",
        "season": 10,
        "episode": 7,
        "released": "2025-03-13",
        "overview": "After New Orleans detectives find a woman's burned body in her car's trunk, they discover that her desperate 911 call went unheeded. But her determined mother won't be silenced, as she turns to prosecutors to bring her beloved daughter's killers to justice."
      },
      {
        "id": "tvmaze:3365107",
        "title": "Bad Driver",
        "season": 11,
        "episode": 1,
        "released": "2025-10-23",
        "overview": "When a beloved son and brother is murdered just feet from his home, his grieving family has one burning question: Why? It's up to a determined team of Gwinnett County investigators and the prosecutor to get their defiant suspect to talk."
      },
      {
        "id": "tvmaze:3365108",
        "title": "Deadly Spree",
        "season": 11,
        "episode": 2,
        "released": "2025-10-30",
        "overview": "The latest in a string of brazen robberies leaves a beloved, retired sheriff's deputy brutally gunned down, and a survivor of the assault terrified."
      },
      {
        "id": "tvmaze:3365109",
        "title": "Green-Eyed Monster",
        "season": 11,
        "episode": 3,
        "released": "2025-11-06",
        "overview": "When two beloved brothers are gunned down in their home, their devastated mother leads Gwinnett detectives to a suspect close to home. But with no clear motive to bolster their case, prosecutors could be in trouble at trial."
      },
      {
        "id": "tvmaze:3438972",
        "title": "Murder in Treme",
        "season": 11,
        "episode": 4,
        "released": "2025-11-13",
        "overview": "A beloved mother is found stabbed to death in a vacant lot and, when New Orleans detectives investigate the case, their only suspect seems an unlikely killer."
      },
      {
        "id": "tvmaze:3438973",
        "title": "Under Pressure",
        "season": 11,
        "episode": 5,
        "released": "2025-11-20",
        "overview": "After a beloved teacher is gunned down in broad daylight, Gwinnett detectives must track down the suspects, with only their getaway car's description. In the pursuit of justice, the prosecution must overcome the threat of a mistrial."
      },
      {
        "id": "tvmaze:3460655",
        "title": "Along Came a Killer",
        "season": 11,
        "episode": 6,
        "released": "2025-12-04",
        "overview": "After a barrage of gunfire leaves three men dead in a residential neighborhood, Gwinnett detectives use every available resource to identify the killer; at trial, the defendant claims he acted in self-defense."
      },
      {
        "id": "tvmaze:3461253",
        "title": "Brothers Down",
        "season": 11,
        "episode": 7,
        "released": "2025-12-11",
        "overview": "In Tulsa, two men are murdered in a parking lot, but a gun from another shooting incident leads detectives to their suspect."
      },
      {
        "id": "tvmaze:3470020",
        "title": "Cold Fury",
        "season": 11,
        "episode": 8,
        "released": "2025-12-18",
        "overview": ""
      }
    ]
  }
}