{
  "meta": {
    "id": "tvmaze:43276",
    "type": "series",
    "name": "Tyler Perry's The Oval",
    "description": "The Oval tells the story of a family placed in the White House by people of power while also highlighting the personal side and everyday lives of the staff who run the inner workings of the nation's most iconic residence.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/502/1256068.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/502/1256068.jpg",
    "videos": [
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3455534",
        "title": "Air Tight",
        "season": 6,
        "episode": 19,
        "released": "2025-12-09",
        "overview": "Donald and Kyle realize they've underestimated Eli, Constance puts a suspicious Max in his place, Alonzo learns of Allan's job promotion, and Victoria refuses to go down without a fight."
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      },
      {
        "id": "tvmaze:1730731",
        "title": "The Pilot",
        "season": 1,
        "episode": 1,
        "released": "2019-10-23",
        "overview": "Chaos ensues as the Franklin family prepares for the inauguration ball, Nancy's kind gesture backfires, Barry is caught off guard, and Lilly makes a risky choice."
      },
      {
        "id": "tvmaze:1730732",
        "title": "Unforgettable",
        "season": 1,
        "episode": 2,
        "released": "2019-10-30",
        "overview": "Barry defends his character, Lilly's decision puts her in a precarious situation, Victoria demands to know the truth, and Nancy and Sharon deal with an emergency."
      },
      {
        "id": "tvmaze:1744897",
        "title": "Heat",
        "season": 1,
        "episode": 3,
        "released": "2019-11-06",
        "overview": "Donald seeks answers from the man who followed his wife home, President Franklin greets a late-night visitor, and the first children irk the White House staff."
      },
      {
        "id": "tvmaze:1748022",
        "title": "Rats Can Smell Poison",
        "season": 1,
        "episode": 4,
        "released": "2019-11-13",
        "overview": "Jean deals with uncomfortable advances from Jason, the president confronts Richard about Gayle's accusation, and Agent Flint seeks info from the Winthrops' intruder."
      },
      {
        "id": "tvmaze:1752734",
        "title": "Allies",
        "season": 1,
        "episode": 5,
        "released": "2019-11-20",
        "overview": "Barry learns disturbing news about Ruth, Victoria invites Lilly along for an unusual shopping trip, Jason's behavior raises eyebrows, and Nancy makes a startling discovery."
      },
      {
        "id": "tvmaze:1758905",
        "title": "Lab Rats",
        "season": 1,
        "episode": 6,
        "released": "2019-11-27",
        "overview": "The hostility between President Franklin and Victoria reaches new heights, Barry forces Sharon to make a choice, and Jason helps Gayle devise a plan."
      },
      {
        "id": "tvmaze:1764530",
        "title": "The Dark Sheep",
        "season": 1,
        "episode": 7,
        "released": "2019-12-04",
        "overview": "Max gets caught in the middle of Hunter and Victoria's marital drama, Barry continues the search for his daughter, and Lilly is confronted with compromising photos."
      },
      {
        "id": "tvmaze:1767872",
        "title": "Eye on the Sparrow",
        "season": 1,
        "episode": 8,
        "released": "2019-12-11",
        "overview": "Gayle discovers quickly that her actions have consequences outside the walls of the White House. Barry blows Gayle's cover, Kyle makes a power grab, the secret service searches for Gayle, Sharon and Nancy learn new information, and Lilly has an unexpected guest."
      },
      {
        "id": "tvmaze:1776973",
        "title": "The Fish Bowl",
        "season": 1,
        "episode": 9,
        "released": "2019-12-18",
        "overview": "Richard comes to the rescue, Bobby pays Lilly a visit, Hunter gives Denise lucrative information, and Victoria's tumultuous relationship with Gayle takes a darker turn."
      },
      {
        "id": "tvmaze:1777019",
        "title": "Going Black",
        "season": 1,
        "episode": 10,
        "released": "2020-01-08",
        "overview": "Richard wrestles with guilt over his deadly mistake, Hunter and Denise are interrupted during a late-night rendezvous, and the staff carefully navigate first family drama."
      },
      {
        "id": "tvmaze:1787099",
        "title": "The United Front",
        "season": 1,
        "episode": 11,
        "released": "2020-01-15",
        "overview": "After their explosive fight, Victoria and Hunter try to calm concerns among the White House staff, Gayle receives appalling news, and Richard and Nancy search for answers."
      },
      {
        "id": "tvmaze:1790442",
        "title": "Hidden Secrets",
        "season": 1,
        "episode": 12,
        "released": "2020-01-22",
        "overview": "Bobby gives Lilly an urgent warning, Hunter tasks Kyle with a personal assignment, Victoria's mother pays a surprise visit, and Barry makes an incriminating discovery."
      },
      {
        "id": "tvmaze:1853136",
        "title": "Fear of God",
        "season": 1,
        "episode": 13,
        "released": "2020-05-06",
        "overview": "The evidence mounts against Barry, Kyle jumps into action to help out a dazed Hunter, Richard and Nancy are questioned, Lilly confronts Donald, and Sam calls in a favor."
      },
      {
        "id": "tvmaze:1860142",
        "title": "One Time",
        "season": 1,
        "episode": 14,
        "released": "2020-05-13",
        "overview": "Jean and Donald are drawn into the President's scandal, Barry is released from police custody, things heat up between Kareem and Sharon, and Lilly stands up to Victoria."
      },
      {
        "id": "tvmaze:1860732",
        "title": "Clock Work",
        "season": 1,
        "episode": 15,
        "released": "2020-05-20",
        "overview": "Barry and Kareem's fight yields collateral damage, Kyle makes veiled threats toward Jean, Sam and Max go on a fact-finding mission, and Donald and Kyle rehash the past."
      },
      {
        "id": "tvmaze:1860733",
        "title": "The Dangerous Game",
        "season": 1,
        "episode": 16,
        "released": "2020-05-27",
        "overview": "Kyle is concerned Lilly knows too much, Nancy learns the cause of Richard's injury, Victoria makes a startling discovery, and Donald tries to keep Lilly from leaving him."
      },
      {
        "id": "tvmaze:1873314",
        "title": "Five Families",
        "season": 1,
        "episode": 17,
        "released": "2020-06-03",
        "overview": "Donald tells Lilly who really runs the Franklin administration, Gayle enlists Jean to find out what happened to her boyfriend, and Hunter suspects Jason is spying on him."
      },
      {
        "id": "tvmaze:1876985",
        "title": "Me and You",
        "season": 1,
        "episode": 18,
        "released": "2020-06-10",
        "overview": "Victoria learns Hunter's secret and devises a plan to cover it up, Lilly tries to figure out who she can trust, and Nancy worries about Barry."
      },
      {
        "id": "tvmaze:1881242",
        "title": "Clueless",
        "season": 1,
        "episode": 19,
        "released": "2020-06-17",
        "overview": "Victoria comes to an arrangement with Donald, Kareem gives Sharon the dirt on Barry, Jake offers Barry an out, and a security breach at the White House leads to a discovery."
      },
      {
        "id": "tvmaze:1885602",
        "title": "Call of Duty",
        "season": 1,
        "episode": 20,
        "released": "2020-06-24",
        "overview": "Max and Yuma discover a smoking gun in the form of a blood-soaked mattress, Victoria propositions a White House staffer, and Gayle seeks a legal remedy to her unhappiness."
      },
      {
        "id": "tvmaze:1890818",
        "title": "The Godfather",
        "season": 1,
        "episode": 21,
        "released": "2020-07-01",
        "overview": "Word of Gayle's emancipation efforts reaches the Oval Office, Sam attempts to clear Barry's name, Kyle tries to gain Max's trust, and Hunter has plans for a White House aide."
      },
      {
        "id": "tvmaze:1896043",
        "title": "The Loving Parents",
        "season": 1,
        "episode": 22,
        "released": "2020-07-08",
        "overview": "Kyle ties up loose ends, a mutual interest unifies Victoria and Hunter, Lilly asks for Bobby's help, Hunter gets an unexpected tip, and Nancy reveals a shocking family secret."
      },
      {
        "id": "tvmaze:1898862",
        "title": "Unexpected Guest",
        "season": 1,
        "episode": 23,
        "released": "2020-07-15",
        "overview": "Nancy's confession jeopardizes her marriage, Sharon and Barry have a change of heart, Victoria issues a warning to Gayle, and Hunter has a steamy encounter."
      },
      {
        "id": "tvmaze:1901631",
        "title": "Twenty-four Hours",
        "season": 1,
        "episode": 24,
        "released": "2020-07-22",
        "overview": "Secrets and lies abound as the president looks to fill the press secretary position."
      },
      {
        "id": "tvmaze:1901632",
        "title": "One of Us",
        "season": 1,
        "episode": 25,
        "released": "2020-07-22",
        "overview": "Victoria's mom vows to get Gayle and Jason in line, Barry makes a desperate decision, Sam is tested, and a revealing press conference has the White House doing damage control."
      },
      {
        "id": "tvmaze:2009232",
        "title": "A Little Girl Talk",
        "season": 2,
        "episode": 1,
        "released": "2021-02-16",
        "overview": "Priscilla questions Sam, Jason and Gayle balk at their grandma's authority, Nancy sees Richard's dark side, Hunter gets troubling news, Barry's plan backfires, and Diane protects a witness."
      },
      {
        "id": "tvmaze:2032605",
        "title": "Natural Habitat",
        "season": 2,
        "episode": 2,
        "released": "2021-02-23",
        "overview": "Jason carries out another fatal plan, Richard tries to piece together a timeline, Bobby sets out to protect Max, Nancy turns to Priscilla for help, and Victoria makes a gruesome discovery."
      },
      {
        "id": "tvmaze:2037303",
        "title": "Wicked Things",
        "season": 2,
        "episode": 3,
        "released": "2021-03-02",
        "overview": "Victoria and Hunter begin to connect the dots, Sharon bails out Barry, Sam delivers tragic news, Diane meets up with Bobby and Lilly, and Priscilla tries to pinpoint Jean's whereabouts."
      },
      {
        "id": "tvmaze:2040866",
        "title": "The Fencer",
        "season": 2,
        "episode": 4,
        "released": "2021-03-09",
        "overview": "Denise, Bobby, Lilly and Max discuss a plan of action, Sam is concerned about Priscilla's behavior, Nancy has a realization about the mystery money, and Hunter and Victoria confront Jason."
      },
      {
        "id": "tvmaze:2043845",
        "title": "A Stranger At Home",
        "season": 2,
        "episode": 5,
        "released": "2021-03-16",
        "overview": "Jason reveals the truth about what happened on the flight, Richard escalates a workplace flirtation, and a new pharmacy employee has information that could help Barry find Callie."
      },
      {
        "id": "tvmaze:2048167",
        "title": "Malicious Intent",
        "season": 2,
        "episode": 6,
        "released": "2021-03-23",
        "overview": "Priscilla grows increasingly suspicious about Jean's disappearance, Sam receives an unexpected offer, Nancy discovers a secret, and Kyle is apprehensive about Lilly's return."
      },
      {
        "id": "tvmaze:2053372",
        "title": "Hidden Secrets",
        "season": 2,
        "episode": 7,
        "released": "2021-03-30",
        "overview": "Allan is sworn to secrecy, Sam considers Victoria's offer, Jean's boyfriend finds her home ransacked, Barry confronts Sharon, Jason sees a psychologist, and Kyle catches Lilly by surprise."
      },
      {
        "id": "tvmaze:2053373",
        "title": "Don't Believe Your Eyes",
        "season": 2,
        "episode": 8,
        "released": "2021-04-06",
        "overview": "Victoria's relationship with Jason worsens, Donald arranges a meeting with a disgruntled former staffer, Richard prepares for his date, and Sam gets more info about the Rakudushis."
      },
      {
        "id": "tvmaze:2063725",
        "title": "Political Junkie",
        "season": 2,
        "episode": 9,
        "released": "2021-04-13",
        "overview": "Pricilla searches for Jean, Jason makes Allan uncomfortable, Victoria tries to intimidate Ellie, Richard goes on his date with Freda, and Dale makes a connection with Kyle."
      },
      {
        "id": "tvmaze:2065924",
        "title": "The Master",
        "season": 2,
        "episode": 10,
        "released": "2021-04-20",
        "overview": "Bobby preaches patience to Max, Dale tends to Kyle, Victoria makes her intentions known to Sam, Barry contacts the Rakudushis, and Jason lets Allan in on a secret."
      },
      {
        "id": "tvmaze:2072132",
        "title": "Empty Your Bag",
        "season": 2,
        "episode": 11,
        "released": "2021-04-27",
        "overview": "After Allan catches Ellie with Hunter, Jason suggests a way for him to get even, Dikahn tells Barry how he can get his daughter back, and Donald sends Kyle on a mission to tie up loose ends."
      },
      {
        "id": "tvmaze:2079605",
        "title": "Misunderstood",
        "season": 2,
        "episode": 12,
        "released": "2021-05-04",
        "overview": "A looming news investigation threatens Hunter's presidency, Diane attends a meeting at the White House, Richard makes an accusation, and Sam's willpower is tested."
      },
      {
        "id": "tvmaze:2079606",
        "title": "Every Weekend",
        "season": 2,
        "episode": 13,
        "released": "2021-05-11",
        "overview": "Sam distances himself from Victoria after their tryst, Kyle goes to extremes to get information from Diane, Nancy reveals the identity of Picky's father, and Barry meets with Ruth."
      },
      {
        "id": "tvmaze:2089111",
        "title": "The Target",
        "season": 2,
        "episode": 14,
        "released": "2021-07-20",
        "overview": "Ruth takes Barry to the Rakudushis, Ellie reveals her ambitions to Allan, Hunter authorizes a risky military operation, Lilly lays down ground rules for Donald, and Priscilla confronts Sam."
      },
      {
        "id": "tvmaze:2131796",
        "title": "Don't Move",
        "season": 2,
        "episode": 15,
        "released": "2021-07-27",
        "overview": "Barry's temper gets him in trouble with the Rakudushis, Dale receives unwanted attention from Kyle, Richard asks for Sharon's help in tracking down Barry, and Priscilla confronts Jason."
      },
      {
        "id": "tvmaze:2137196",
        "title": "Familiar Faces",
        "season": 2,
        "episode": 16,
        "released": "2021-08-03",
        "overview": "Victoria and Priscilla lay their cards on the table, Max calls on an old friend for help, Hunter takes a risk in order to impress Ellie, and Sharon and Dale visit Richard at the White House."
      },
      {
        "id": "tvmaze:2138337",
        "title": "Body Parts",
        "season": 2,
        "episode": 17,
        "released": "2021-08-10",
        "overview": "Hunter feels more powerful than ever after visiting the drone strike site, Dale leads Richard and Sharon to the Rakadushi compound, and Priscilla seeks relationship advice from Nancy."
      },
      {
        "id": "tvmaze:2153945",
        "title": "Misunderstood",
        "season": 2,
        "episode": 18,
        "released": "2021-08-17",
        "overview": "Sharon is rushed to the hospital, Victoria's dad requests a meeting with her and Hunter, Lilly learns the truth about Bobby, Sam faces down Kyle, and Priscilla confides in a trusted friend."
      },
      {
        "id": "tvmaze:2147174",
        "title": "Nine Lives",
        "season": 2,
        "episode": 19,
        "released": "2021-08-24",
        "overview": "Nancy and Richard try to figure out what happened to Barry, Sharon receives devastating news, Jason secretly follows a White House employee home, and Lilly confronts Bobby about the photos."
      },
      {
        "id": "tvmaze:2151124",
        "title": "The Skies Have Eyes",
        "season": 2,
        "episode": 20,
        "released": "2021-08-31",
        "overview": "Allan and Ellie figure out what to do with their intruder, Sam's affair pushes Priscilla to the edge, Ruth makes a secret plea to Barry's parents, and Hunter offers Sharon a private tour."
      },
      {
        "id": "tvmaze:2156211",
        "title": "Powerful Hands",
        "season": 2,
        "episode": 21,
        "released": "2021-09-07",
        "overview": "Priscilla struggles to control her emotions, Bobby plots to use Lilly's shopping excursion with Victoria to make a bold play, and Hunter and Ellie's relationship takes an unexpected turn."
      },
      {
        "id": "tvmaze:2161287",
        "title": "Doomsday",
        "season": 2,
        "episode": 22,
        "released": "2021-09-14",
        "overview": "Priscilla finally speaks her mind, Kyle gets an unpleasant assignment, Barry devises a desperate plan to get Callie back, and Hunter and Victoria are summoned to her father's deathbed."
      },
      {
        "id": "tvmaze:2171275",
        "title": "An Eye For An Eye",
        "season": 3,
        "episode": 1,
        "released": "2021-10-12",
        "overview": "Hunter seeks retribution against someone close to him after the attempt on his life, Jason harasses a Secret Service agent, and Sharon tries to figure out what happened to Dale."
      },
      {
        "id": "tvmaze:2192179",
        "title": "Off Limits",
        "season": 3,
        "episode": 2,
        "released": "2021-10-19",
        "overview": "Bobby, Max and Blakely attempt to access the White House computer system, Hunter demands Ellie ignore her official duties, and Victoria tries to coerce Allan into an act of violence."
      },
      {
        "id": "tvmaze:2196718",
        "title": "The Mole",
        "season": 3,
        "episode": 3,
        "released": "2021-10-26",
        "overview": "Priscilla calls on a powerful, secret ally when Victoria attempts to fire her, Blakely grows increasingly paranoid, Jason feels betrayed by Allan, and Barry reaches out to Sharon."
      },
      {
        "id": "tvmaze:2202267",
        "title": "In Need of Protection",
        "season": 3,
        "episode": 4,
        "released": "2021-11-02",
        "overview": "Victoria follows through on her threat to Allan, Sam suspects Priscilla is in the intelligence community, Dale is wary when Kyle pays him a visit, and Donald resist the president's orders."
      },
      {
        "id": "tvmaze:2207483",
        "title": "Behind Closed Doors",
        "season": 3,
        "episode": 5,
        "released": "2021-11-09",
        "overview": "Bobby devises a plan to rescue Max, Kyle is assigned to watch over Jason, Ellie ends things with Hunter, Donald visits Dale in the hospital, and Hunter invites Sharon to the White House."
      },
      {
        "id": "tvmaze:2209764",
        "title": "A Family Matter",
        "season": 3,
        "episode": 6,
        "released": "2021-11-16",
        "overview": "Victoria and Hunter respond to a family emergency, Dale fears for his life, Richard and Barry confide in Sam, Alonzo bears a difficult assignment, and Kyle goes on a mission for Hunter."
      },
      {
        "id": "tvmaze:2214337",
        "title": "Ho Patrol",
        "season": 3,
        "episode": 7,
        "released": "2021-11-23",
        "overview": "Sharon tries to escape from Kyle, Bobby searches the White House for Max, Lilly accidentally raises her husband's suspicions, and Jason finally pushes Alonzo past his breaking point."
      },
      {
        "id": "tvmaze:2219077",
        "title": "One Rule",
        "season": 3,
        "episode": 8,
        "released": "2021-11-30",
        "overview": "The President makes Sharon a salacious offer, Donald discovers a major security breach, and Bobby and Max discover a powerful new ally."
      },
      {
        "id": "tvmaze:2223638",
        "title": "Glove Up",
        "season": 3,
        "episode": 9,
        "released": "2021-12-07",
        "overview": "Allan balks at Victoria's demands, Sharon goes to Richard for help, Barry gets a shock, the vice president reveals his plan to Max and Bobby, and Donald and Kyle press Lilly for answers."
      },
      {
        "id": "tvmaze:2230135",
        "title": "Checkmate",
        "season": 3,
        "episode": 10,
        "released": "2021-12-14",
        "overview": "Kyle takes extreme measures to get information from Lilly, Allan has suspicions about Ellie's death, Jason makes a troubling confession, and the vice president demands a meeting with Hunter."
      },
      {
        "id": "tvmaze:2234559",
        "title": "The Children",
        "season": 3,
        "episode": 11,
        "released": "2021-12-21",
        "overview": "Hunter and Victoria exercise control over Jason by any means necessary, Lilly is close to breaking as she's held captive, and Sam comes forward with concerning news about the vice president."
      },
      {
        "id": "tvmaze:2254327",
        "title": "The Dutiful Wife",
        "season": 3,
        "episode": 12,
        "released": "2022-01-11",
        "overview": "Bobby and Max come to Lilly's aid, Victoria has a tense lunch with the second lady, Nancy tries to stop Barry from making a big mistake, and the vice president calls a press conference."
      },
      {
        "id": "tvmaze:2254328",
        "title": "Tragic Monologues",
        "season": 3,
        "episode": 13,
        "released": "2022-01-18",
        "overview": "Eli causes chaos to erupt in the White House when he exposes Hunter's criminal activity to the press, and Victoria decides to use it to her advantage."
      },
      {
        "id": "tvmaze:2257942",
        "title": "The Command Performance",
        "season": 3,
        "episode": 14,
        "released": "2022-01-25",
        "overview": "Victoria revels in the aftermath of her press conference, Barry accuses his father of withholding information, the vice president's confidence is shaken, and Kareem goes to the authorities."
      },
      {
        "id": "tvmaze:2261615",
        "title": "Wicked",
        "season": 3,
        "episode": 15,
        "released": "2022-02-01",
        "overview": "Hunter concocts a plan to take out all his enemies in one fell swoop, Barry grows impatient with the FBI's investigation into the Rakudushi, and Allan sneaks a gun into the West Wing."
      },
      {
        "id": "tvmaze:2266838",
        "title": "The Hornet's Nest",
        "season": 3,
        "episode": 16,
        "released": "2022-02-08",
        "overview": "Kareem finds himself in a dangerous position, Victoria lures the second lady to lunch, Allan angles to work closer with Hunter, and Dale and Sharon get an unexpected visitor at the pharmacy."
      },
      {
        "id": "tvmaze:2270944",
        "title": "Get a Grip",
        "season": 3,
        "episode": 17,
        "released": "2022-02-15",
        "overview": "Hunter strongly urges Sharon to reconsider his offer, Victoria and the second lady lay their cards on the table, Sam tries to impede Donald's search for Kyle, and Allan makes a bold move."
      },
      {
        "id": "tvmaze:2273806",
        "title": "Next to Impossible",
        "season": 3,
        "episode": 18,
        "released": "2022-02-22",
        "overview": "Allan's behavior draws suspicion, Jason's improving health unsettles Victoria, Max and Bobby meet with the vice president, Grip searches for Kyle, and Sharon asks Richard for help."
      },
      {
        "id": "tvmaze:2280129",
        "title": "Gathering Evidence",
        "season": 3,
        "episode": 19,
        "released": "2022-03-01",
        "overview": "Kareem refuses to answer questions about his disappearance, the vice president seeks to compile all the evidence against Hunter in one place, and Donald hatches an escape plan for Kyle."
      },
      {
        "id": "tvmaze:2284737",
        "title": "The Vendetta",
        "season": 3,
        "episode": 20,
        "released": "2022-03-08",
        "overview": "Sam and Kyle wind up in a tense standoff, Victoria and Donald don't see eye to eye about how to handle Jason, Priscilla tries to gain Allan's trust, and Hunter's vigil is interrupted."
      },
      {
        "id": "tvmaze:2288732",
        "title": "Ugly Politics",
        "season": 3,
        "episode": 21,
        "released": "2022-03-15",
        "overview": "The first family deals with a tragedy, Richard gets tough on Barry, Sam and Kyle play a waiting game, Priscilla lets Allan in on the vice president's plan, and Donald issues a deadly order."
      },
      {
        "id": "tvmaze:2294076",
        "title": "Road Kill",
        "season": 3,
        "episode": 22,
        "released": "2022-03-22",
        "overview": "Priscilla and Allan face a dangerous threat, Hunter recruits Alonzo for a secret mission, Donald asks for Victoria's help, Sam's situation grows dire, and Lilly's escape plan hits a snag."
      },
      {
        "id": "tvmaze:2394174",
        "title": "The Package",
        "season": 4,
        "episode": 1,
        "released": "2022-10-11",
        "overview": "Priscilla and Grip face off, President Franklin seeks to indulge his vices, Jason's autopsy yields a stunning revelation, and Sam asks Richard to attend an important rendezvous."
      },
      {
        "id": "tvmaze:2411039",
        "title": "Black Stallion",
        "season": 4,
        "episode": 2,
        "released": "2022-10-18",
        "overview": "Priscilla, Kareem, Allan and Dale grow tired of waiting for Richard, the president hires a sex worker, Jason tries to figure out what's happening to him, and Donald uses Lilly to lure Bobby."
      },
      {
        "id": "tvmaze:2414461",
        "title": "Into the Woods",
        "season": 4,
        "episode": 3,
        "released": "2022-10-25",
        "overview": "Alonzo helps Hunter out of a jam, Max and Bobby devise a plan to rescue Lilly, Richard searches for Barry, Sam senses danger at the hospital, and Dale, Allan and Kareem go off-grid."
      },
      {
        "id": "tvmaze:2419238",
        "title": "Wicked",
        "season": 4,
        "episode": 4,
        "released": "2022-11-01",
        "overview": "Hunter seeks more information about his son's death, Max tries to talk Bobby out of acting rashly, Dale and Allan figure out their next move, and the vice president has change of heart."
      },
      {
        "id": "tvmaze:2419239",
        "title": "Image, Power, and Money",
        "season": 4,
        "episode": 5,
        "released": "2022-11-08",
        "overview": "Victoria and Donald tie up loose ends, Hunter suspects Victoria is working with someone close to home on a plot against him, Eli shares his shocking findings, and Donald threatens Lilly."
      },
      {
        "id": "tvmaze:2419240",
        "title": "Guns Blazing",
        "season": 4,
        "episode": 6,
        "released": "2022-11-15",
        "overview": "Eli pushes Simone to apologize to Hunter and Victoria, Allan and Dale debate their next move while hiding from the president, and Kareem is driven away by Sharon's relationship with Barry."
      },
      {
        "id": "tvmaze:2429612",
        "title": "Hook, Line, and Sinker",
        "season": 4,
        "episode": 7,
        "released": "2022-11-22",
        "overview": "Lilly makes a difficult decision, Jason learns about his body double's fate, Max and Bobby devise a plan to take down Hunter, and Victoria presents Donald with a solution to their problems."
      },
      {
        "id": "tvmaze:2434382",
        "title": "It's Over",
        "season": 4,
        "episode": 8,
        "released": "2022-11-29",
        "overview": "Kyle finds Dale and Allan staking out in the woods, Bobby and Max approach Sharon with a proposition for an undercover operation, and Hunter grows suspicious of Victoria and Donald."
      },
      {
        "id": "tvmaze:2437338",
        "title": "Out of Line",
        "season": 4,
        "episode": 9,
        "released": "2022-12-06",
        "overview": "The president arranges another debauched excursion, Jason confides in David, Donald shows Allan compromising photos, and Max and Bobby doubt the vice president's motives."
      },
      {
        "id": "tvmaze:2441036",
        "title": "Truth Be Told",
        "season": 4,
        "episode": 10,
        "released": "2022-12-13",
        "overview": "Jason takes out David before making a break for it, Hunter and Victoria have a tense meeting with the vice president and second lady, and Nancy puts herself in harm's way."
      },
      {
        "id": "tvmaze:2445564",
        "title": "What's Done in the Dark",
        "season": 4,
        "episode": 11,
        "released": "2022-12-20",
        "overview": "Nancy gets captured by the Rakadushi cult, Bobby makes a pass at Priscilla, a drunk Hunter nearly incriminates his wife, Jason threatens Allan, and Kareem makes a horrifying discovery."
      },
      {
        "id": "tvmaze:2454052",
        "title": "The Stories We Tell",
        "season": 4,
        "episode": 12,
        "released": "2023-01-03",
        "overview": "Kareem tries to figure out what happened in his apartment, Victoria grows suspicious of Donald, Simone enlists the help of Bobby, and Priscilla catches Sam in a compromising situation."
      },
      {
        "id": "tvmaze:2458441",
        "title": "Back Off",
        "season": 4,
        "episode": 13,
        "released": "2023-01-10",
        "overview": "Sam calls Victoria out when she decides to interfere with his already rocky marriage with Priscilla; Jason goes into survivor mode and finds solace in an unlikely ally while on the run."
      },
      {
        "id": "tvmaze:2463612",
        "title": "Know Your Place",
        "season": 4,
        "episode": 14,
        "released": "2023-01-17",
        "overview": "Lilly finds herself trapped, Allan tries to pacify Jason, Max unleashes his rage on Kyle, Priscilla takes a bold step with Bobby, and Richard is surprised by unwelcome guests."
      },
      {
        "id": "tvmaze:2465195",
        "title": "Deception",
        "season": 4,
        "episode": 15,
        "released": "2023-01-24",
        "overview": "Alonzo aids Allan, the Hallsens host an unusual dinner party, Officer Heller takes an interest in Lilly, Bobby has second thoughts about Priscilla's offer, and Richard gets disturbing news."
      },
      {
        "id": "tvmaze:2465196",
        "title": "Problem Diverted",
        "season": 4,
        "episode": 16,
        "released": "2023-01-31",
        "overview": "While Kareem and his cousin Norman bury his difficulties, Richard is forced to reconcile Nancy's unexpected madness; Hunter and Victoria discover the truth about Jason just as his life is about to implode."
      },
      {
        "id": "tvmaze:2465197",
        "title": "Bridge Over Troubled Water",
        "season": 4,
        "episode": 17,
        "released": "2023-02-07",
        "overview": "When Jason and Alonzo's cover is blown, they must go to extreme measures to escape; Agent Kane is tested against a well-trained adversary."
      },
      {
        "id": "tvmaze:2465198",
        "title": "No Regrets",
        "season": 4,
        "episode": 18,
        "released": "2023-02-14",
        "overview": "David attempts a desperate escape, Hunter balks at attending a sham funeral for Jason, Priscilla and Bobby arrange a rendezvous, and Sharon makes a shocking discovery at Kareem's home."
      },
      {
        "id": "tvmaze:2465199",
        "title": "It's No Secret",
        "season": 4,
        "episode": 19,
        "released": "2023-02-21",
        "overview": "Sharon discovers Kareem's dark secret and fears for her life; Victoria and Donald are worried, as they think the Federal Bureau is after them; Dale is caught in the middle of an illegal transaction."
      },
      {
        "id": "tvmaze:2465200",
        "title": "The Point of No Return",
        "season": 4,
        "episode": 20,
        "released": "2023-02-28",
        "overview": "Alonzo questions Dale about the drugs that are being stashed at the pharmacy; Kyle makes a new discovery about David, putting everyone on high alert."
      },
      {
        "id": "tvmaze:2465201",
        "title": "Pins and Needles",
        "season": 4,
        "episode": 21,
        "released": "2023-03-07",
        "overview": "Following a terrible accident, Sharon finds herself in the hands of the law; after Nancy's delirium, Richard finds her in a horrible situation."
      },
      {
        "id": "tvmaze:2465202",
        "title": "The Last Strike",
        "season": 4,
        "episode": 22,
        "released": "2023-03-14",
        "overview": "Richard tries to revive Nancy, Sharon receives a disturbing phone call, Hunter's partying reaches dangerous levels, Jason and David attempt a daring escape, and Simone confronts Victoria."
      },
      {
        "id": "tvmaze:2644740",
        "title": "Turning Tables",
        "season": 5,
        "episode": 1,
        "released": "2023-10-17",
        "overview": "The White House goes into panic mode after the president overdoses, Jason finds himself in a dangerous place, and Sam grapples with his jealousy over Priscilla and Bobby."
      },
      {
        "id": "tvmaze:2664318",
        "title": "The Missing Link",
        "season": 5,
        "episode": 2,
        "released": "2023-10-24",
        "overview": "Nancy makes a surprising accusation against Richard, Donald feels the impact of changes in the White House as Eli is sworn in as president, and Simone learns of Victoria's sinister plan."
      },
      {
        "id": "tvmaze:2667520",
        "title": "Man Down",
        "season": 5,
        "episode": 3,
        "released": "2023-10-31",
        "overview": "Newly sworn-in Eli accelerates his abuse of power, Simone receives upsetting news, Allan is trapped in a deadly situation, Jason bonds with River, and Priscilla takes violent revenge on Sam."
      },
      {
        "id": "tvmaze:2674319",
        "title": "Coming Clean",
        "season": 5,
        "episode": 4,
        "released": "2023-11-07",
        "overview": "Priscilla makes her demands clear to Sam, Dale gets dragged into the pharmacy's shady dealings, Nancy's brutal honesty rattles Richard, and Eli and Victoria's celebration is short-lived."
      },
      {
        "id": "tvmaze:2679661",
        "title": "Something To Hide",
        "season": 5,
        "episode": 5,
        "released": "2023-11-14",
        "overview": "While Jason realizes he can no longer hide, Hunter finds Victoria in a compromising position; Dale assists Allan as he realizes he may be a part of a bigger scheme."
      },
      {
        "id": "tvmaze:2683577",
        "title": "Gone In A Second",
        "season": 5,
        "episode": 6,
        "released": "2023-11-21",
        "overview": "Jason tries to keep his identity hidden from the Rakudushi as he plots his escape, Victoria and Eli strengthen their grip on presidential power, and Hunter turns his wrath on Alonzo."
      },
      {
        "id": "tvmaze:2688228",
        "title": "Exit Wound",
        "season": 5,
        "episode": 7,
        "released": "2023-11-28",
        "overview": "Hunter makes accusations about fidelity that could turn the district upside down; Kareem is taken from the hospital against his will to face Hunter once and for all."
      },
      {
        "id": "tvmaze:2692015",
        "title": "Sorry Not Sorry",
        "season": 5,
        "episode": 8,
        "released": "2023-12-05",
        "overview": "Sam has a run-in with the Rakudushi, Donald tasks Allan with being his eyes and ears in the White House, Victoria takes pleasure in Simone's apology, and Hunter grills Kareem for answers."
      },
      {
        "id": "tvmaze:2699576",
        "title": "Better Than Revenge",
        "season": 5,
        "episode": 9,
        "released": "2023-12-12",
        "overview": "Hunter is determined to find the person responsible for his overdose, Simone confides in Priscilla, Sam and Max interrogate a Rakudushi soldier, and Jason reveals his intentions to Victoria."
      },
      {
        "id": "tvmaze:2706345",
        "title": "Sound Of Silence",
        "season": 5,
        "episode": 10,
        "released": "2023-12-19",
        "overview": "Sam's loyalty is questioned when he's caught in an unexplainable situation, and Victoria is nervous the truth will surface now that Jason is back in the picture."
      },
      {
        "id": "tvmaze:2712544",
        "title": "Recovery",
        "season": 5,
        "episode": 11,
        "released": "2023-12-26",
        "overview": "Donald asks Victoria to use her influence to solve a problem, Kareem and Antonio try to figure their way out of a tight spot, Hunter seeks payback, and Richard brings home a surprise guest."
      },
      {
        "id": "tvmaze:2719683",
        "title": "Who's Playing Who",
        "season": 5,
        "episode": 12,
        "released": "2024-01-02",
        "overview": "Hunter rethinks his trust in those around him and goes into self- preservation mode after learning the truth from Victoria, and Richard forces Nancy to face a secret from her past."
      },
      {
        "id": "tvmaze:2728687",
        "title": "A Snake In The Grass",
        "season": 5,
        "episode": 13,
        "released": "2024-01-09",
        "overview": "Hunter is ready to go to any length to regain his power, meanwhile tension inside the White House it at an all- time high. With his back against the wall, Jason must decide who he can trust and who he can't."
      },
      {
        "id": "tvmaze:2733602",
        "title": "Off the Deep End",
        "season": 5,
        "episode": 14,
        "released": "2024-01-16",
        "overview": "Hunter has Victoria right where he wants her as Kal and Bobby come head-to-head over the key to the first family's demise; Bobby holds major evidence to Victoria's downfall."
      },
      {
        "id": "tvmaze:2739752",
        "title": "Dark Secrets",
        "season": 5,
        "episode": 15,
        "released": "2024-01-23",
        "overview": "Jason exercises a power play involving Nancy attempting to get to the source of his issues, and Hunter, feeling threatened and betrayed, makes plans to shake things up in the district."
      },
      {
        "id": "tvmaze:2746131",
        "title": "Bed of Lies",
        "season": 5,
        "episode": 16,
        "released": "2024-01-30",
        "overview": "As secrets begin to spill out around the White House, Priscilla must pick a side; Simone formulates an evil plan to get back at Eli."
      },
      {
        "id": "tvmaze:2751044",
        "title": "No Regrets",
        "season": 5,
        "episode": 17,
        "released": "2024-02-06",
        "overview": "Sam prepares for an interview that will reveal the First Families' misdeeds; Donald must show his devotion to Hunter; Victoria finds herself in a life-threatening situation."
      },
      {
        "id": "tvmaze:2751045",
        "title": "Adjust and Adapt",
        "season": 5,
        "episode": 18,
        "released": "2024-02-13",
        "overview": "Donald springs into action when his best ally, Victoria, finds herself helpless; thanks to his secret eye, Hunter uses his power to move against Victoria and Donald."
      },
      {
        "id": "tvmaze:2767808",
        "title": "Breaking News",
        "season": 5,
        "episode": 19,
        "released": "2024-02-20",
        "overview": "Richard and Nancy receive devastating news, Hunter and Victoria face off and trade threats, and Sam presents Lena with a career-changing opportunity to break a huge story."
      },
      {
        "id": "tvmaze:2771213",
        "title": "Keep Your Enemies Close",
        "season": 5,
        "episode": 20,
        "released": "2024-02-27",
        "overview": "Jason breaks his silence pertaining to his parents; Priscilla proves her loyalty to Hunter after catching Kyle in a questionable scenario."
      },
      {
        "id": "tvmaze:2778065",
        "title": "Losing It",
        "season": 5,
        "episode": 21,
        "released": "2024-03-05",
        "overview": "Eli searches desperately in the hopes of uncovering Victoria's whereabouts. All hell is breaking loose at the White House while the lost are being found."
      },
      {
        "id": "tvmaze:2783770",
        "title": "Wild Wild West",
        "season": 5,
        "episode": 22,
        "released": "2024-03-12",
        "overview": "As Eli and Victoria put their plans in motion, the White House is on high alert, and Hunter has his own schemes in the works."
      },
      {
        "id": "tvmaze:3092640",
        "title": "No Escape",
        "season": 6,
        "episode": 1,
        "released": "2025-01-07",
        "overview": "Hunter and Eli recover from the shootout as they both plan their next steps, and Priscilla is convinced she can talk the president into leaving the White House residence peacefully."
      },
      {
        "id": "tvmaze:3099389",
        "title": "Blow For Blow",
        "season": 6,
        "episode": 2,
        "released": "2025-01-14",
        "overview": "Sam stirs up suspicions about Bobby and Simone to Eli, Max tries to save Bobby from himself, and Priscilla turns on the charm to try and convince Hunter to do the right thing."
      },
      {
        "id": "tvmaze:3107644",
        "title": "Grown Woman",
        "season": 6,
        "episode": 3,
        "released": "2025-01-21",
        "overview": "Sam catches Nancy in a compromising position, Priscilla proposes a plan to trick Hunter into leaving the residence, and Victoria shows Eli footage that could unravel Simone's story."
      },
      {
        "id": "tvmaze:3114873",
        "title": "Stalemate",
        "season": 6,
        "episode": 4,
        "released": "2025-01-28",
        "overview": "Bobby finds himself in hot water as Eli gets close to the truth about him and Simone, Hunter makes a discovery about his paralysis, and Richard has a surprising run-in."
      },
      {
        "id": "tvmaze:3122998",
        "title": "Something to Hide",
        "season": 6,
        "episode": 5,
        "released": "2025-02-04",
        "overview": "Nancy is devastated by her husband's rash actions, Sam cooks up a scheme to save Richard from himself, and Eli and Victoria are stunned by Hunter's latest move."
      },
      {
        "id": "tvmaze:3144622",
        "title": "Power Play",
        "season": 6,
        "episode": 6,
        "released": "2025-02-11",
        "overview": "With tension at an all-time high inside the White House, Hunter must orchestrate a plan to regain his power. Elsewhere, Jason is formulating a way to escape the compound."
      },
      {
        "id": "tvmaze:3146817",
        "title": "If These Walls Could Talk",
        "season": 6,
        "episode": 7,
        "released": "2025-02-18",
        "overview": "The White House is on high alert when Victoria and Eli's lives are at risk, and as Richard's life unravels, Simone's vengeance for Victoria spirals out of control."
      },
      {
        "id": "tvmaze:3151472",
        "title": "In Due Time",
        "season": 6,
        "episode": 8,
        "released": "2025-02-25",
        "overview": "Eli and Victoria see red after a harrowing move by Hunter, Nancy is adamant on getting revenge, and Donald and Kyle are caught in a compromising position."
      },
      {
        "id": "tvmaze:3154459",
        "title": "Between Two Fires",
        "season": 6,
        "episode": 9,
        "released": "2025-03-04",
        "overview": "Victoria devises a scheme to remove Hunter once and for all, but Priscilla has other plans, and Richard has had enough of Nancy and decides to take matters into his own hands."
      },
      {
        "id": "tvmaze:3160988",
        "title": "The Breaking Point",
        "season": 6,
        "episode": 10,
        "released": "2025-03-11",
        "overview": "Lily considers a drastic option, Sam and Max get an important message to Jason, Eli makes a definitive decision, and Richard faces the consequences of his actions."
      },
      {
        "id": "tvmaze:3166764",
        "title": "Seeing Is Believing",
        "season": 6,
        "episode": 11,
        "released": "2025-03-18",
        "overview": "Sam presses forward with his plan to control Nancy and protect Richard, and Eli calls in reinforcements to remove Hunter once and for all."
      },
      {
        "id": "tvmaze:3407164",
        "title": "On Your Mark",
        "season": 6,
        "episode": 12,
        "released": "2025-10-28",
        "overview": "Eli puts into motion his no-holds-barred plan to finally get Hunter, Nancy discovers what it means to anger the men inside the White House, and Donald sends Allan on a mission."
      },
      {
        "id": "tvmaze:3407165",
        "title": "The Fight For Power",
        "season": 6,
        "episode": 13,
        "released": "2025-10-28",
        "overview": "Drugs and alcohol put Allan in a precarious situation, and Sam urges Richard to think twice about what he wants."
      },
      {
        "id": "tvmaze:3430496",
        "title": "Crossed Boundaries",
        "season": 6,
        "episode": 14,
        "released": "2025-11-04",
        "overview": "Allan becomes Donald's pawn, Victoria needs Alonzo's help to implement her plan to get Hunter out, Dale reunites with Sharon, and Sam pays the price for his sins against Priscilla."
      },
      {
        "id": "tvmaze:3429846",
        "title": "The Time Is Now",
        "season": 6,
        "episode": 15,
        "released": "2025-11-11",
        "overview": "Alonzo and Allan find a creative solution to Victoria's demand, Simone struggles with her feelings for Eli, Sharon and Dale make a huge discovery, and Hunter realizes his time is up."
      },
      {
        "id": "tvmaze:3441169",
        "title": "Ironclad",
        "season": 6,
        "episode": 16,
        "released": "2025-11-18",
        "overview": "The first family learns a valuable lesson as Eli orders a changing of the guard, Simone is shocked to learn how deep the conspiracy goes, and Sharon is in the hands of a dangerous person."
      },
      {
        "id": "tvmaze:3441170",
        "title": "A Plan Deferred",
        "season": 6,
        "episode": 17,
        "released": "2025-11-25",
        "overview": "Sam visits Nancy at the police station, Eli meets a high-profile fixer to manage White House optics, and chaos erupts when the first family reunites in an unexpected place."
      },
      {
        "id": "tvmaze:3449563",
        "title": "Lies And Alibis",
        "season": 6,
        "episode": 18,
        "released": "2025-12-02",
        "overview": "Donald and Kyle plan their escape, Eli questions the new press secretary's intentions, Bobby rejects Simone, and tensions rise in the bunker as the Franklins vent their hateful feelings."
      },
      {
        "id": "tvmaze:3455534",
        "title": "Air Tight",
        "season": 6,
        "episode": 19,
        "released": "2025-12-09",
        "overview": "Donald and Kyle realize they've underestimated Eli, Constance puts a suspicious Max in his place, Alonzo learns of Allan's job promotion, and Victoria refuses to go down without a fight."
      },
      {
        "id": "tvmaze:3466359",
        "title": "The Price We Pay",
        "season": 6,
        "episode": 20,
        "released": "2025-12-16",
        "overview": ""
      }
    ]
  }
}