{
  "meta": {
    "id": "tvmaze:62943",
    "type": "series",
    "name": "Road Wars",
    "description": "Roadways can be a wild place. With violent road rage incidents increasing 500% over the last decade, \"road raging\" is a human behavior that has become widely known. Road Wars takes a deep dive into American roadways, examining extreme human behavior, wild weather, insane accidents and a few welcome instances of acts of kindness.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/595/1488025.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/595/1488025.jpg",
    "videos": [
      {
        "id": "tvmaze:3439965",
        "title": "Planes, Trains and Automobiles",
        "season": 6,
        "episode": 16,
        "released": "2025-12-16",
        "overview": "A small plane in California makes an emergency landing on train tracks, with a train quickly approaching. A man in Kansas makes things difficult for a driver attempting to squeeze into a parking spot. Police in Texas struggle to apprehend a runaway beast."
      },
      {
        "id": "tvmaze:3451080",
        "title": "Top 10: Bumper Brawls",
        "season": 6,
        "episode": null,
        "released": "2025-12-16",
        "overview": "On this top ten special of Road Wars, see what happens when these hot headed drivers lose their cool."
      },
      {
        "id": "tvmaze:3439966",
        "title": "I'm Walking Here!",
        "season": 6,
        "episode": 17,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3451081",
        "title": "Top 10: Fired Up",
        "season": 6,
        "episode": null,
        "released": "2025-12-23",
        "overview": ""
      },
      {
        "id": "tvmaze:3439963",
        "title": "Crashing a Checkpoint",
        "season": 6,
        "episode": 14,
        "released": "2025-12-09",
        "overview": "A driver in Seattle follows a woman after an incident on the road, resulting in an emotional confrontation. A sobriety checkpoint in New Mexico takes an unexpected and terrifying turn."
      },
      {
        "id": "tvmaze:3439964",
        "title": "Motorbike Mayhem",
        "season": 6,
        "episode": 15,
        "released": "2025-12-09",
        "overview": "Drivers in Harlem hurl insults during an intense standoff over a parking spot. In England, bystanders intervene when two boys appear to take a motorbike that doesn't belong to them."
      },
      {
        "id": "tvmaze:2358201",
        "title": "Man vs. Truck",
        "season": 1,
        "episode": 1,
        "released": "2022-07-06",
        "overview": "A raging back and forth between three vehicles on a California highway ends with a man being rammed head on by a truck. Carjackers relentlessly pursue a terrified driver in Albuquerque. An angry motorcyclist confronts a driver in Massachusetts, and is met with a baseball bat. And people are caught asleep at the wheel in self-driving cars."
      },
      {
        "id": "tvmaze:2358202",
        "title": "Rideshare Nightmare",
        "season": 1,
        "episode": 2,
        "released": "2022-07-13",
        "overview": "It's a life or death situation in Reading, Pennsylvania when a rideshare driver picks up a very dangerous passenger. Chaos ensues in Aurora, Illinois when tempers flare in an explosive showdown between an enraged trucker and dozens of motorcyclists. An alleged drug deal gone wrong in Portland, Oregon ends with an SUV driver running down three men on a sidewalk."
      },
      {
        "id": "tvmaze:2358203",
        "title": "Amped Up in Tampa",
        "season": 1,
        "episode": 3,
        "released": "2022-07-20",
        "overview": "Motorcyclists in Tampa, Florida may be in trouble when they fight with an angry driver and find themselves staring down the barrel of a gun. A semi-truck is no match for high speed winds from a tornado in Pennsylvania. In Tennessee, a concerned driver rescues an elderly woman who appears to be taking her motorized scooter cross-country. And one mistake at a red light in Indiana causes a near death crash with a bizarre ending."
      },
      {
        "id": "tvmaze:2358204",
        "title": "Burning Down the RV",
        "season": 1,
        "episode": 4,
        "released": "2022-07-27",
        "overview": "A driver and a motorcyclist in Florida play a dangerous game of cat and mouse, reaching speeds well over 100 MPH. A couple's shortcut in Canada causes their truck to plummet into an icy lake. An RV engulfed in flames rolls down a Philadelphia street, directly toward a young man trying to film it. And two men engage in a high speed pursuit of thieves who stole a motorcycle in California."
      },
      {
        "id": "tvmaze:2369154",
        "title": "Do You Know Who I Am?",
        "season": 1,
        "episode": 5,
        "released": "2022-08-03",
        "overview": "An impatient SUV driver in Oregon attacks a cyclist at a red light and gets a serious comeuppance. A rideshare driver in Fort Lauderdale chases down and rams into a fleeing driver who just hit her. A scenic wagon ride in Carmel Valley, California takes a terrifying turn when an inebriated truck driver rams it from behind. And a congressional candidate in Florida threatens an officer's job when she pulls him over for speeding and texting while driving."
      },
      {
        "id": "tvmaze:2429447",
        "title": "All Keyed Up",
        "season": 1,
        "episode": 6,
        "released": "2022-11-09",
        "overview": "A distracted police officer in Missouri strikes a bicyclist with his vehicle. A woman is caught red-handed keying another person's car in Louisiana. A motorcyclist crashes into a ditch after being sideswiped by a jeep in Illinois. And a man in California appears to flee the scene of an accident, until he realizes the man he hit has his license plate number."
      },
      {
        "id": "tvmaze:2429448",
        "title": "Not on My Street",
        "season": 1,
        "episode": 7,
        "released": "2022-11-09",
        "overview": "Professional photographers become the victims of a broad daylight smash and grab in San Francisco. In San Diego, an enraged dog walker goes ballistic when she confronts a speeding driver in her neighborhood. A roadside altercation in Florida turns violent. A woman's car goes over a 20 foot embankment in Charlotte, North Carolina, landing directly on top of an SUV driving on the highway below. And a routine traffic stop in Denver, Colorado turns into two drivers' worst nightmare."
      },
      {
        "id": "tvmaze:2429453",
        "title": "Attack of the Tacos",
        "season": 1,
        "episode": 8,
        "released": "2022-11-16",
        "overview": "A man in Texas is pursued by an angry driver wielding a finger gun. A driver raging at two women in California is intercepted by two men who send him packing. A rideshare driver in Texas has food thrown in her face by an unruly passenger. A motorcyclist in Virginia Beach attempts to talk his way out of a baseball bat beatdown after a close call with a pedestrian."
      },
      {
        "id": "tvmaze:2429454",
        "title": "Baby on Board",
        "season": 1,
        "episode": 9,
        "released": "2022-11-16",
        "overview": "Two men attempt a carjacking at a Louisiana car wash. A hapless teenage driver turns an Alabama parking lot into a demolition derby. A reckless driver in an SUV hits a biker and car with a baby on a Texas Highway. And it's a tiny kitten versus rush hour traffic in Oklahoma."
      },
      {
        "id": "tvmaze:2429455",
        "title": "Wrong Way",
        "season": 1,
        "episode": 10,
        "released": "2022-11-23",
        "overview": "A disagreement over driving rules in a Washington State parking lot ends with multiple gunshots. A confrontational driver pushes two friends to the brink. Things spin out of control when a driver pursues someone in an SUV who allegedly smashed her rear window. A man in Massachusetts rebuilds his truck, backwards."
      },
      {
        "id": "tvmaze:2429456",
        "title": "Attack of the Semi",
        "season": 1,
        "episode": 11,
        "released": "2022-11-23",
        "overview": "In Olympia, Washington, the driver of a dump truck has a furious face to face with a man who takes offense to the truck's exhaust. When an aggressive driver in California can't pass the car in front of her, she takes out her anger by hurling bottles at the windshield. A skilled driver in New York City takes on an impossible parallel parking puzzle with grace. In McDermitt, Nevada, the driver of a semi truck goes on a rampage, crushing any vehicle in its path."
      },
      {
        "id": "tvmaze:2433595",
        "title": "Highway Robbery",
        "season": 1,
        "episode": 12,
        "released": "2022-11-30",
        "overview": "A taxi driver is held at gunpoint in Pennsylvania. A raging driver threatens others with an ax in Texas."
      },
      {
        "id": "tvmaze:2436843",
        "title": "Full Throttle Semi Disaster",
        "season": 1,
        "episode": 13,
        "released": "2022-12-07",
        "overview": "Outside a bar in Oregon, a woman is nearly crushed by a car after confronting an alleged thief. A Colorado family on their way to a Father's Day picnic is cut off by an aggressive motorcycle gang. A man has a meltdown, allegedly over a parking ticket, and bares all in the middle of a California parking lot. In Upstate New York, a man's car is totaled after he attempts to pass a truck. A motorcyclist in California loses control of his bike and slides under a moving semi."
      },
      {
        "id": "tvmaze:2442657",
        "title": "Houston, We Have a Problem",
        "season": 1,
        "episode": 14,
        "released": "2022-12-14",
        "overview": "Drinks are thrown, fists fly and a car is rammed during an argument at a Houston intersection. A lane change miscalculation turns into a nightmare when a semi truck rolls over on a highway in Macon, Georgia. A stop sign runner in North Carolina sends a dump truck careening right into the side of a brick house. A rogue tire on an Indiana highway causes an SUV to fly into the air and roll over twice. Following a near-miss collision, two drivers settle their differences in a refreshing way."
      },
      {
        "id": "tvmaze:2445712",
        "title": "Lit Joyride",
        "season": 1,
        "episode": 15,
        "released": "2022-12-21",
        "overview": "A motorcyclist in Colorado keeps his cool during a heated argument... until the other driver touches his bike. A valet's joyride in Miami goes up in smoke. An erratic driver crashes their way down an interstate in New Jersey. A mother and her toddler are knocked off a motorbike into oncoming traffic in Vietnam."
      },
      {
        "id": "tvmaze:2506933",
        "title": "Stick Shift Disaster",
        "season": 2,
        "episode": 1,
        "released": "2023-04-11",
        "overview": "In Santa Clarita, California, a motorcyclist kicks a car and sets off a catastrophic chain reaction on the highway. A bicyclist and driver in New York City have a heated confrontation over blocking the bike lane. In Pleasant Hills, California, a dazed driver is chased down after an alleged hit and run. A Florida man pulled over for speeding blames Vladimir Putin. In Washington, an alleged car thief's getaway is thwarted by his apparent lack of driving skills... In Rowland Heights, California, an erratic driver exits her moving vehicle in the middle of the highway, causing a multi-car pileup."
      },
      {
        "id": "tvmaze:2506934",
        "title": "Burning Rubber",
        "season": 2,
        "episode": 2,
        "released": "2023-04-11",
        "overview": "A driver burning rubber in Times Square nearly runs over an NYPD officer. A sedan is dragged or miles down a California highway after getting wedged underneath a tractor trailer. A Florida police officer clings to the open door of a speeding vehicle when a suspect attempts to flee. A plane is forced to make an emergency landing in the middle of a Washington highway. At a train crossing in North Carolina, a car and truck are trapped between the guard rails as a northbound train approaches."
      },
      {
        "id": "tvmaze:2506935",
        "title": "The Fast and the Fearless",
        "season": 2,
        "episode": 3,
        "released": "2023-04-18",
        "overview": "A Bronx driver gets a heavy dose of instant karma. A woman in Long Beach, California finds herself in a standoff against an entire parking lot in an attempt to hold an empty spot. In St. Petersburg, Florida, an allegedly stolen Maserati leads to a tragic end. A Texas man who believes he is the victim of a hit and run follows a driver all the way to her doorstep. In Golden, Colorado, a dog leaps from an open car window onto the highway. In Boca Raton, Florida, good Samaritans race to rescue an unconscious driver from a smoking car. Gym users in Moreno Valley, California, get an unpleasant surprise when a car crashes through the front window."
      },
      {
        "id": "tvmaze:2511305",
        "title": "Highway Hero",
        "season": 2,
        "episode": 4,
        "released": "2023-04-18",
        "overview": "A New York City driver gets into a brutal street fight with an electric unicycler after allegedly cutting him off. A motorcyclist risks risk own life to help a driver with a stalled car get off the highway. A dangerous driver in Georgia rams patrol vehicles with her car as she tries to evade police. In Sydney, Australia, two parties settle their road rage despute in the middle of traffic with their fists and feet. A semi-truck gets stuck on the tracks at a railway crossing in Del Rio, Texas as a train barrels towards it. In Kansas City, Missouri, a naked man on an ATV going against traffic leads police on a miles long high speed chase."
      },
      {
        "id": "tvmaze:2523864",
        "title": "Red Light Rumble",
        "season": 2,
        "episode": 5,
        "released": "2023-04-25",
        "overview": "Good samaritans assist a lone police officer in Willoughby, Ohio, after a traffic stop turns violent. In Orlando, Florida. a driver fires his gun through his own windshield after an aggressive driver allegedly flashes a firearm. In Dana Point, California, two drivers come to blows at a red light. In Detroit, Michigan, a tow truck driver is surrounded by a furious crowd after crashing into seven cars. Passengers are sent flying after a pickup truck slams into a bus in Syracuse, New York. In Fayette County, PA, a drowsy driver causes a severe accident."
      },
      {
        "id": "tvmaze:2523865",
        "title": "On the Run",
        "season": 2,
        "episode": 6,
        "released": "2023-04-25",
        "overview": "In the UK, two men get much more than they bargained for when the driver they confront takes them both down with ease. A Florida man leads police on a high speed chase when he steals two separate squad cars. An apparent street fight in Rochester, NY, leads to a terrifying head on collision for a rideshare driver and her passengers. A woman spots an erratic driver on a Tennessee highway. In Alberta, Canada, a pickup driver befriends a lost goose and leads it to the nearest lake."
      },
      {
        "id": "tvmaze:2526381",
        "title": "Handcuff Houdini",
        "season": 2,
        "episode": 7,
        "released": "2023-05-02",
        "overview": "In Canton, OH, a horn honk on the road allegedly leads to a man wreaking havoc on a woman's car. A fender-bender in Houston, TX, turns violent when a driver allegedly refuses to hand over his information. In Jonesboro, AR, chaos ensues when a suspect manages to break free from his handcuffs and holds a lighter flame to the seat, resulting in a terrifying crash. A parked car is brutally sideswiped by a moving truck in Port Orange, FL. A driver appears to drive off after hitting a pedestrian at a crosswalk in Atlanta, GA. In Austin, TX, a woman drives away with a used car after test driving it."
      },
      {
        "id": "tvmaze:2535336",
        "title": "Crash Course",
        "season": 2,
        "episode": 8,
        "released": "2023-05-09",
        "overview": "In Chula Vista, California, passengers take center stage in two brutal road rage altercations. On a late night motorcycle ride in Southern California, things take a surreal turn when one of the bikers officers assistance to another motorist in need. A routine traffic stop suddenly turns terrifying when another vehicle enters the scene. In Austin, Texas, the brakes of a large dump truck give out at the top of a hill, leading to disaster down below. A home security employee in Gatlinburg, Tennessee, discovers two black bear cubs locked inside his van, and races to get them out before their mother arrives."
      },
      {
        "id": "tvmaze:2538296",
        "title": "Freeway Fiasco",
        "season": 2,
        "episode": 9,
        "released": "2023-05-16",
        "overview": "In Kennebunk, Maine, a motorist gets into a dangerous confrontation with road workers. On a Texas highway off ramp, a stunned driver swerves to avoid a man who was ejected from his car moments earlier during an accident. In Camden, Arkansas, two motorcyclists are nearly run off the road by a man who's upset about the way he believes they drove by his home. In Goldendale, Washington, a semi-truck takes its chances with an unprotected left-hand turn, and loses. At a mall in New Jersey, a dispute over a poor parking job escalates quickly. In Houston, Texas, a motorcyclist fails to secure a small package, which allegedly leads to some unintended consequences."
      },
      {
        "id": "tvmaze:2545475",
        "title": "Snow Storm Pileup",
        "season": 2,
        "episode": 10,
        "released": "2023-05-23",
        "overview": "In Hawaii, an altercation between two motorists escalates after one of them appears to be holding a pocket knife. On a highway in Rawlins, Wyoming, a snow storm turns a single accident into a pileup involving nearly 100 vehicles. In Livonia, Michigan, a woman is found asleep behind the wheel at a stop light. Traffic cameras in Iowa capture shocking video of a teen falling out of a vehicle on the highway. A bicycling event on a closed off road in Portland, Oregon, takes a turn when an angry motorist demands to drive his truck through. A man on a motorcycle has a head on collision in South Australia. A woman in new Hampshire is taught a lesson when she parks over the line at a grocery store."
      },
      {
        "id": "tvmaze:2557135",
        "title": "Give Me a Brake",
        "season": 2,
        "episode": 11,
        "released": "2023-05-30",
        "overview": "On a highway in Phoenix, Arizona, a driver comes to a sudden stop causing a disastrous situation for a motorcyclist coming from behind. A dispute allegedly over a New York City parking spot leads to a man driving his car into a bakery. In Milwaukee, rescue crews race against time to save a woman whose car is partially submerged in an icy pond. A minor league baseball player risks his life when he jumps out of his car to help a driver in need on a Massachusetts Highway. In Ontario, Canada, a large tractor trailer veers into a ditch and is catapulted through some power lines and onto the roof of a home."
      },
      {
        "id": "tvmaze:2712830",
        "title": "Tailgating Tirade",
        "season": 3,
        "episode": 1,
        "released": "2024-01-02",
        "overview": "In Sacramento, California, two motorists attempt to out-threaten each other over an alleged tailgating incident. In Las Vegas, Nevada, a driver upset at being allegedly cut off confronts another motorist at a stoplight. In Plano, Texas, a motorcyclist gets physical with a man washing his car during a heated discussion about the biker's speed. In Chicago, Illinois, a man appears to throw a rock at a passing car and pays a heavy price. On a Florida Highway, an alleged tailgating situation leads to shots fired on the road. In Olympia, Washington, a motorcyclist trying to avoid a collision ends up on the trunk of a moving sedan. On a highway in Texas, a box truck swerves into a semi's path and causes a massive collision. In Florida, a father and son watch as a train hits a watermelon truck."
      },
      {
        "id": "tvmaze:2712831",
        "title": "Carjacking Catastrophe",
        "season": 3,
        "episode": 2,
        "released": "2024-01-02",
        "overview": "In California, an alleged carjacking goes awry, damaging several cars and putting lives at risk. A traffic stop in Houston, Texas, turns into a terrifying shootout at a gas station. A semi truck driver suffers serious consequences after appearing to block cars from passing on a busy highway in Mexico. In Oklahoma City, a woman must dance for her daughter to gain entry into her car. A vehicle's sudden left hand turn causes a motorcyclist to be catapulted down the road in Fort Pierce, Florida. A father daughter duo in Miami team up to teach drivers who park poorly a lesson."
      },
      {
        "id": "tvmaze:2712832",
        "title": "Zero to One Hundred",
        "season": 3,
        "episode": 3,
        "released": "2024-01-09",
        "overview": "In a Michigan parking lot, a truck driver repeatedly rams a car in a seemingly random attack. On a remote road in Oklahoma, a group of motorcyclists get into an altercation with the driver of a pickup truck, who calls in a sibling and a neighbor for backup. On a busy Minnesota highway, a speeding car overshoots the onramp and careens into a semi causing a massive explosion. In Texas, a rapid response to an emergency call causes an officer to jump the gun at a railroad crossing."
      },
      {
        "id": "tvmaze:2712833",
        "title": "On Thin Ice",
        "season": 3,
        "episode": 4,
        "released": "2024-01-09",
        "overview": "In Allen, Texas, an automatic car wash allegedly becomes the scene of a minor collision when one car appears to back into another. In Los Angeles, California, an accident on the highway leads to several others, damaging six cars, and injuring two motorists. In a suburban driveway, a woman exits her car without apparently putting it in park, leading to disaster. Near Vancouver, Washington, an impaired driver swerves into a stopped truck on the highway. In New Sharon, Maine, a semi-truck loses control on an ice-covered road, jackknifing into oncoming traffic. In Sacramento, California, a motorcyclist's head cam captures the potential dangers of splitting lanes."
      },
      {
        "id": "tvmaze:2712834",
        "title": "My Way or the Highway",
        "season": 3,
        "episode": 5,
        "released": "2024-01-16",
        "overview": "In Torrance, California, an alleged fender bender leads to a roadside fight, leaving one driver unconscious. In Baltimore, a reported stolen vehicle fleeing from police crashes into a building causing it to collapse. A driver in England who is confronted by a motorcyclist she apparently cut off has an unexpected reaction. A stalled pickup truck on a Minnesota highway causes a major accident. At a traffic stop in New Jersey, a high ranking government official argues with police officers."
      },
      {
        "id": "tvmaze:2712836",
        "title": "Gas Station Blowout",
        "season": 3,
        "episode": 6,
        "released": "2024-01-16",
        "overview": "In Woodland Hills, California, good samaritans attempt to box in a driver involved in multiple wrecks near a freeway overpass. A woman in Louisiana is berated by another driver who believes she is not driving fast enough. A verbal altercation at a Chicago gas station escalates, leading to a woman flipping her own vehicle. In Fairfax County, VA an officer at a routine traffic stop runs for his life when a reckless driver loses control. A loose lug nut causes a truck to lose a tire, launching a nearby car several feet into the air on a California Freeway. A case of driving under the influence has devastating results for a mother and daughter."
      },
      {
        "id": "tvmaze:2712838",
        "title": "Man Versus Machine",
        "season": 3,
        "episode": 7,
        "released": "2024-01-23",
        "overview": "In Castle Rock, Colorado, a school bus driver finds himself in hot water when he comes to a sudden stop and frightens some of his young passengers. In Florida, after pulling a driver over for speeding, a sheriff experiences a shocking first in his decades long career. In Honolulu, Hawaii, an aggrieved driver cusses out a fellow motorist who she believes cut her off. In Joplin, Missouri, a driver accidentally reverses into a gaming store causing total mayhem inside. In Miami, Florida, a road related fist fight leads to an unexpected offer. In Anaheim, California, police pursue a stolen fire truck after it was reportedly taken from a local medical center. In Alberta, Canada, a semi driver pushes his luck while towing a mobile home underneath an overpass."
      },
      {
        "id": "tvmaze:2712839",
        "title": "Tireless Chase",
        "season": 3,
        "episode": 8,
        "released": "2024-01-30",
        "overview": "At a red light in Phoenix, a man gets out of his car to confront another motorist, who ends up driving directly into him. When a large truck slows traffic on a small road in New Jersey, an angry driver gets out of his car with a baseball bat. At a marketplace in Seattle, an impatient motorist uses a hammer to smash a vehicle's rear window, and then drives his car into two people. A driver in Florida leads police in the air and on the ground on a high speed chase. A woman in Detroit locks herself out of her car and watches helplessly as it drives itself in reverse circles in the middle of the road."
      },
      {
        "id": "tvmaze:2742781",
        "title": "Roadside Standoff",
        "season": 3,
        "episode": 9,
        "released": "2024-01-30",
        "overview": "In Apollo Beach, Florida, a woman brandishes a gun after an alleged altercation on the road. After a wild chase through downtown Los Angeles, a man attempts to flee from police on a skateboard. In Richfield, Minnesota, two drivers are caught on a traffic camera throwing slabs of concrete at each other's cars. A car t-bones a motorist and then plows into a convenience store in Los Angeles. An RV driver miscalculates, resulting in disaster. After an alleged thief jumps out of a moving vehicle, it rolls into a pedestrian and pins him underneath it. A quick-thinking couple in California use a car's self-driving capabilities to come to the aid of an apparently incapacitated driver."
      },
      {
        "id": "tvmaze:2741884",
        "title": "Parking Lot Pandemonium",
        "season": 3,
        "episode": 10,
        "released": "2024-02-06",
        "overview": "In Vernon, California, a motorcyclist escalates an altercation on the road by smashing a driver's rear windshield with his helmet. When a driver in Flushing, New York, allegedly blocks a mobility van from unloading wheelchair passengers, bystanders intervene, leading to a brutal fistfight. An auto shop owner in Johnson City, Tennessee, is run over when he attempts to stop a man from driving a customer's pickup truck. After being discovered sleeping in his car, a Cranston, Rhode Island, city councilman is arrested for drug possession. A bus operator in Milwaukee rescues a 6 year old boy she spots wandering in an intersection. In Atlanta, an erratic driver runs over a man in a bar parking lot."
      },
      {
        "id": "tvmaze:2741886",
        "title": "Guard Rail Fail",
        "season": 3,
        "episode": 11,
        "released": "2024-02-13",
        "overview": "In Wooster, OH, a road rage incident escalates when one of the drivers follows the other back to his home. A driver in Georgia hits a stopped tow truck's ramp and soars over 120 feet. A fender bender in a Texas parking lot spins out of control when neither party appears to back down. In Washington, an elderly driver allegedly forgets to put her car into park and suddenly finds herself under the vehicle. A driver in New Jersey learns the devastating consequences of moving too quickly through traffic. In Volusia County, FL, a motorcycle rider fleeing police runs directly into the path of a pickup truck. A Minnesota highway traffic camera captures the strengths and weaknesses of a guardrail as a pickup truck veers off the road."
      },
      {
        "id": "tvmaze:2741887",
        "title": "You Shall Not Pass",
        "season": 3,
        "episode": 12,
        "released": "2024-02-13",
        "overview": "On a rural highway in Iowa, a driver and his passenger both fall asleep while on the road. In a San Francisco parking lot, a woman berates another driver who she claims parked too close to her car. At a California gas station, a driver who claims to have witnessed an accident on the road corners a vehicle he believes was involved. A Florida driver gets out of his car and attempts to fight an SUV with his bare hands. In Brazil, a scooter is clipped by a turning car, sending the rider down a storm drain."
      },
      {
        "id": "tvmaze:2768796",
        "title": "The Good, the Bat and the Ugly",
        "season": 3,
        "episode": 13,
        "released": "2024-02-27",
        "overview": "In Florida, a bat-wielding motorist goes after another driver. A senior citizen in North Carolina threatens to lie to police after allegedly backing into another car. An ATV rider in St. Louis loses control, sending his vehicle on a collision course with a streetlight. An altercation on a London road is averted with some childish taunts. In Phoenix, a couple with a baby begin to cross a road just as two cars collide in the intersection. A fender bender in Des Moines leads to a smashed windshield and an alleged face full of pepper spray. In Kenosha, Washington, police officers attempt to pull over a minivan that's engulfed in flames."
      },
      {
        "id": "tvmaze:2768797",
        "title": "Runaway Rampage",
        "season": 3,
        "episode": 14,
        "released": "2024-02-27",
        "overview": "At a red light in Arizona, a car sideswipes the door on another driver's vehicle during a heated road rage encounter. Two drivers get into a yelling match as they attempt to squeeze by each other on a narrow street in the Boston suburbs. In Florida, a brave motorist intervenes during a road rage altercation. A minor fender bender in Austin gets out of hand when one driver throws a punch. In Australia, a double length semi loses control while heading down a busy suburban street."
      },
      {
        "id": "tvmaze:2768798",
        "title": "Swarm of Bees",
        "season": 3,
        "episode": 15,
        "released": "2024-03-05",
        "overview": "A driver pulls out a machete and a pedestrian hurls a trash can during a heated altercation in NYC. A suspect in Ocala, FL leads police on a destructive high-speed off-road chase. A woman is horrified when a swarm of bees surround her vehicle. A car in Arizona crashes through a salon's storefront, narrowly missing a waiting customer. In San Francisco, a car goes flying over a landmark before plummeting down to the street below."
      },
      {
        "id": "tvmaze:2768799",
        "title": "No Brakes",
        "season": 3,
        "episode": 16,
        "released": "2024-03-05",
        "overview": "A confrontation erupts in a Virginia alleyway when a driver yells at a woman for allegedly blocking her car. In Atlanta, a man on a bike leads multiple police cruisers on a high-speed chase. A hydroplaning accident in Louisiana sends an SUV spiraling off the road. In Ohio, a tractor-trailer's brakes fail as it heads directly towards a school bus full of children. In Phoenix, a personal dispute leads to a man on a bicycle being hit by a woman in a car."
      },
      {
        "id": "tvmaze:2771244",
        "title": "Two-Wheel Terror",
        "season": 3,
        "episode": 17,
        "released": "2024-03-12",
        "overview": "A property manager in California is hit by a car after an altercation with its driver. In Oklahoma, a semi hauling cars gets stuck at a crossing with a train fast approaching. A routine call for two ambulance workers in Chicago is interrupted when a man in a passing car appears to shoot a firearm out the window. A large group of cyclists confront a driver who attempts to weave through a mass bike ride in Houston."
      },
      {
        "id": "tvmaze:2771248",
        "title": "Wake-Up Call",
        "season": 3,
        "episode": 18,
        "released": "2024-03-12",
        "overview": "An altercation in an Ohio parking lot spirals out of control. Disaster strikes when a bus driver in Atlanta appears to fall asleep at the wheel. An irate driver's wrath is unleashed on two friends in Oklahoma after they attempt to assist an elderly motorist. A wrong-way driver on a Texas Highway causes a deadly crash."
      },
      {
        "id": "tvmaze:2781921",
        "title": "All Blocked Off",
        "season": 3,
        "episode": 19,
        "released": "2024-03-19",
        "overview": "A heated argument over a merge in Indiana leads to a collision. In Portland, Oregon, an enraged driver barrels through a street parade. In China, a pickup truck reverses into a young boy. A woman in Indianapolis has a terrifying encounter with the passenger in the car ahead of her. A quirky group of birds block a driver in Maine."
      },
      {
        "id": "tvmaze:2781922",
        "title": "High Stakes Chase",
        "season": 3,
        "episode": 20,
        "released": "2024-03-19",
        "overview": "An apparent rear-ending in Myrtle Beach leads to a frightening confrontation with a gun. A motorcyclist on a New York highway has a devastating head-on collision with a sedan. A driver in London is hit with a belt during a street fight. A handcuffed suspect in Colorado steals a trooper's cruiser and leads police on a deadly pursuit."
      },
      {
        "id": "tvmaze:2915881",
        "title": "A Fork in the Road",
        "season": 4,
        "episode": 1,
        "released": "2024-11-12",
        "overview": "In Denver, a wayward driver nearly destroys her car trying to get out of a tight spot. An out-of-control semi in Utah wreaks havoc along a road and, ultimately, a car dealership. In Scotland, a fender bender becomes violent when one driver accuses the other of distracted driving. A motorcyclist in Michigan is pursued by a road raging driver."
      },
      {
        "id": "tvmaze:2915882",
        "title": "Interstate Inferno",
        "season": 4,
        "episode": 2,
        "released": "2024-11-12",
        "overview": "In California, an angry driver upsets residents when she refuses to stop honking her horn at a parked car. In New Mexico, a military veteran opens fire at another driver after a collision. A massive explosion erupts in Ohio when a dump truck barrels into a service vehicle. In Oregon, the owner of a missing car tracks it to a nearby parking lot."
      },
      {
        "id": "tvmaze:2915883",
        "title": "Seatbelt Ticket Tantrum",
        "season": 4,
        "episode": 3,
        "released": "2024-11-19",
        "overview": "A Wisconsin driver melts down over a $10 seatbelt ticket. A fender bender in Indiana leads to punches and gunfire. In San Diego, an attempted carjacking is thwarted by a group of bystanders. In Taiwan, a dispute allegedly over two men dating the same woman grows violent when a driver pulls out a bat. In Virginia, a driver's car inadvertently becomes involved in a police pursuit."
      },
      {
        "id": "tvmaze:2915884",
        "title": "Windshield Warrior",
        "season": 4,
        "episode": 4,
        "released": "2024-11-19",
        "overview": "In Florida, a road rage dispute turns violent when an uncle and nephew brawl with a minivan driver in the street. A misunderstanding between cyclists and bikers in Australia causes a heated clash. In Albania, an angry restaurant owner clings to the hood of a car as he smashes through the windshield. A motorcycle rider in Mississippi is ejected from his bike after colliding with an SUV. A resident of an apartment complex learns the consequences of parking in someone else's spot."
      },
      {
        "id": "tvmaze:2915885",
        "title": "Fighting the Tow",
        "season": 4,
        "episode": 5,
        "released": "2024-11-26",
        "overview": "In Queens, a car owner attempts to drive off a tow truck's boom. On Long Island, a large family brawl breaks out in the middle of the street after a major collision. A postal worker in California is pinned between two vehicles. A traffic jam in Columbia leads to a car slamming into a pedestrian. \"Ice Missiles\" fly off cars and shatter windshields."
      },
      {
        "id": "tvmaze:2915886",
        "title": "Don't Point the Finger",
        "season": 4,
        "episode": 6,
        "released": "2024-11-26",
        "overview": "A road raging Dekalb woman launches a hair-pulling attack in the street against another female driver. In Illinois, an ATV rider appears to be followed across open terrain by a disgruntled man in a pickup. A broken-down vehicle in the middle of a dark California freeway wreaks havoc on unsuspecting commuters. Gun-wielding would-be highway robbers in South Africa face fierce resistance from a former sniper-turned-armored car driver."
      },
      {
        "id": "tvmaze:2915887",
        "title": "Rumble at the Roundabout",
        "season": 4,
        "episode": 7,
        "released": "2024-12-03",
        "overview": "A motorcyclist encounters a young driver whose car is on fire but who refuses to call authorities. In the United Kingdom, a biker and a motorist exchange words and hands at a roundabout. A police officer in Washington must drive through an out of control wildfire. A trucker in Georgia is involved in a tragic accident after his semi stops on the highway."
      },
      {
        "id": "tvmaze:2915888",
        "title": "Trash Talk",
        "season": 4,
        "episode": 8,
        "released": "2024-12-03",
        "overview": "In Nebraska, an SUV runs into a sanitation worker whose truck blocks its way. A driver in Las Vegas falls out of his vehicle while doing donuts in a parking lot. In Los Angeles, a stolen utility vehicle goes on a wild rampage while fleeing from police. A driver in Peru is caught in a terrifying landslide of sedan-sized boulders."
      },
      {
        "id": "tvmaze:3055101",
        "title": "Traffic Stop Crasher",
        "season": 4,
        "episode": 9,
        "released": "2024-12-10",
        "overview": "A motorcyclist in California engages in a dangerous pursuit of a suspect who allegedly committed a hit and run. A street fight between commuters in Canada takes an unexpected turn. An Oklahoma trooper at a traffic stop is brutally blindsided. In China, a chemical tanker and a fuel truck prove to be an explosive combination."
      },
      {
        "id": "tvmaze:3055102",
        "title": "Crosswalk Confrontation",
        "season": 4,
        "episode": 10,
        "released": "2024-12-10",
        "overview": "A crossing guard in Pennsylvania gets in a fight with an impatient motorist. In Texas, a four-car pile-up leads to a stabbing on the freeway. An exploding manhole cover in Thailand launches a motorcyclist into the air. In Florida, a jet makes an emergency landing on a three-lane highway. Climate protesters blocking Burning Man traffic are confronted by authorities."
      },
      {
        "id": "tvmaze:3082297",
        "title": "Rats on the Run",
        "season": 4,
        "episode": 11,
        "released": "2025-01-07",
        "overview": "In Florida, a driver stumbles through a field sobriety test. Good Samaritans in Kansas try to save an unconscious driver who crashed into a bus with his foot still on the gas. In Ecuador, a heroic motorist rams a motorcyclist who appears to be mugging a woman. In Ottawa, stunned drivers witness a swarm of rats spilling out of a moving garbage truck. A livestreaming driver in Colorado captures an out of control semi truck barreling into stopped traffic."
      },
      {
        "id": "tvmaze:3082298",
        "title": "Flippin' Tow Truck",
        "season": 4,
        "episode": 12,
        "released": "2025-01-07",
        "overview": "A confrontation between motorists in Toronto turns into a group rumble in the street. In Texas, an ex-convict risks his life to save a wounded officer during a freeway shootout. A bus driver working the early morning shift causes a six-car pileup in Colorado. In Cleveland, a tow truck flips a disabled vehicle into oncoming highway traffic with the driver still inside."
      },
      {
        "id": "tvmaze:3082299",
        "title": "Construction Truck Catastrophe",
        "season": 4,
        "episode": 13,
        "released": "2025-01-14",
        "overview": "A woman is dragged by a car along a Delaware highway after an apparent dispute. In Brazil, a delivery driver fights back when she believes that a man is attempting to steal her motorcycle. A construction truck's raised crane wrecks havoc through a Brooklyn street. Police in California pursue a suspect. In Albuquerque, a sedan plows into a school bus filled with children."
      },
      {
        "id": "tvmaze:3082300",
        "title": "Brick Wall Body Slam",
        "season": 4,
        "episode": 14,
        "released": "2025-01-14",
        "overview": "After a wild pursuit in New Mexico, police are surprised by whom they find in the vehicle. On a quiet Michigan street, a speeding car goes airborne into a telephone pole. In England, a car owner gets slammed into a brick wall by his own vehicle. A car plows through a smoke shop in California. A biker unleashes a fierce tirade after a fender bender in Thailand."
      },
      {
        "id": "tvmaze:3082301",
        "title": "Carjack Kidnapping",
        "season": 4,
        "episode": 15,
        "released": "2025-01-21",
        "overview": "A mother in New Mexico clings to the hood of her own car as a thief takes off with it with her children inside. A Texas man pursues a driver after a collision in an intersection. A late-night driver in Washington loses control and rams into parked cars. A motorcyclist in Brazil has a run-in with a bus making a wide turn. In Mississippi, a trucker tries to rescue a family trapped in a fiery crash."
      },
      {
        "id": "tvmaze:3082302",
        "title": "Two Tons of Trouble",
        "season": 4,
        "episode": 16,
        "released": "2025-01-21",
        "overview": "A female shoplifting suspect in Texas takes off in a police vehicle, triggering a pursuit across town. After a clash over the right-of-way in a California parking lot, a driver is up in arms about being filmed. Police officers and civilians struggle to lift a crashed car off of a driver in Georgia. A dispute between cabbies in Argentina leads to a collision with a passing motorcyclist."
      },
      {
        "id": "tvmaze:3082303",
        "title": "Cellphone Sideswipe",
        "season": 4,
        "episode": 17,
        "released": "2025-01-28",
        "overview": "A vehicle owner in California jumps onto the back of a tow truck and is taken for a harrowing ride. In England, an angry confrontation between a driver and a cyclist leads to a stumbling foot chase on the sidewalk. In Los Angeles, a biker is hit by a car after scolding its driver for allegedly being on their phone. On a highway in Michigan, a blinding snowstorm causes a 120-car pileup. A motorcycle rider on a freeway in L.A. goes head over heels after slamming into stopped traffic."
      },
      {
        "id": "tvmaze:3082304",
        "title": "I Don't Like Bullies",
        "season": 4,
        "episode": 18,
        "released": "2025-01-28",
        "overview": "A traffic stop in Florida goes off the rails when a CEO loses his cool with an officer. A woman in the UK exits her car with a big dog during a confrontation with another driver. A Nebraska motorist falls unconscious while cruising on the interstate. A truck rolls out of a gas station in West Hollywood and into a barbershop across the street. Would-be carjackers in Chile meet their match when a potential victim fights back."
      },
      {
        "id": "tvmaze:3278521",
        "title": "Trapped in Flames",
        "season": 5,
        "episode": 1,
        "released": "2025-07-15",
        "overview": "In Missouri, a rideshare driver is repeatedly rammed by a trailing sedan for no apparent reason. A cyclist is thrown from his bike when an approaching car rear-ends him. A mechanic in Georgia has to answer to police after his engine modification is mistaken for gunfire. When a fast-moving SUV crashes on a Houston highway, strangers work to save its occupants from the burning vehicle."
      },
      {
        "id": "tvmaze:3278522",
        "title": "Dude, That's My Truck",
        "season": 5,
        "episode": 2,
        "released": "2025-07-15",
        "overview": "A car allegedly fleeing a hit-and-run on a San Diego highway crashes into a disabled vehicle. In Washington, a man who takes on alleged late-night thieves in his driveway gets slammed by their car. In Australia, a man on a mobility scooter takes a dangerous trip on the freeway. A gas station in New Mexico goes up in flames when an out-of- control vehicle crashes into a pump. In London, a bus driver appears to trap a biker on board during an argument over a near miss on the road."
      },
      {
        "id": "tvmaze:3278523",
        "title": "Pushy Parker",
        "season": 5,
        "episode": 3,
        "released": "2025-07-22",
        "overview": "In a Rhode Island drive-through, a family is horrified as an enraged woman appears to stab their vehicle. An off-duty officer in Alabama is run down outside his home by a stranger's SUV. When a man in China can't fit into a parking spot, he rams his way in. In South Africa, an apparently distracted truck driver dramatically crashes off the highway. A father and son in Wyoming roll their car eleven times after hydroplaning."
      },
      {
        "id": "tvmaze:3278524",
        "title": "Blinded by the (sun) Light",
        "season": 5,
        "episode": 4,
        "released": "2025-07-22",
        "overview": "An entitled district attorney in New York gets contentious with police after a speeding infraction. A motorist blinded by the sun in California launches his SUV over a cliff. A dispute involving ex-girlfriends in Georgia ends with one getting run over by a car. An emergency services vehicle in Ohio is slammed from behind by an alleged drunk driver."
      },
      {
        "id": "tvmaze:3278525",
        "title": "Mom vs Biker",
        "season": 5,
        "episode": 5,
        "released": "2025-07-29",
        "overview": "A mother in Philadelphia takes on a biker who shatters her window. In England, two drivers get into a street fight that appears to involve a rock. A school bus in South Carolina veers off-road and slams into a house. In New Jersey, a car that appears to brake-check a semi gets instant karma. A delivery driver in China gets involved in a violent altercation after an alleged collision. On a California highway, a man is ejected from his RV after his wife reportedly falls asleep at the wheel."
      },
      {
        "id": "tvmaze:3304917",
        "title": "Give Me Back My Keys!",
        "season": 5,
        "episode": 6,
        "released": "2025-08-05",
        "overview": "A 60-year-old driver in Florida is physically attacked by a teen after an attempted merge. A fight erupts on a street in England after a cyclist confronts a driver about using his cell phone. A Salt Lake City driver goes airborne when a loose tire flies under his car. A Texas motorcyclist falls onto train tracks after being hit by a car. A driver destroys his own vehicle after getting stuck."
      },
      {
        "id": "tvmaze:3304912",
        "title": "Side Mirror Shenanigans",
        "season": 5,
        "episode": 7,
        "released": "2025-08-05",
        "overview": "A car owner in Indiana opens fire at a pickup truck charging toward him in his driveway. In Australia, a tight lane change prompts a motorcyclist to strike a car's mirror. Emergency personnel assisting a stalled car in Iowa are caught in the path of a wayward sedan. Police in Brazil engage in a harrowing pursuit of a couple on a motorcycle. A Montana man inadvertently drives off in someone else's car with their dog inside."
      },
      {
        "id": "tvmaze:3304913",
        "title": "Detour Gone Wrong",
        "season": 5,
        "episode": 8,
        "released": "2025-08-12",
        "overview": "In Arizona, two off-road enthusiasts have a close call that leads to a violent confrontation. Tourists in Mexico on a sightseeing detour are stopped by a group of men with guns. In Oklahoma, a semi truck driver launches off an overpass. A woman in San Diego expresses her discontent with another driver in an unexpected way. On a Utah highway, a discarded piece of office furniture becomes a dangerous projectile. In the UK, a driver has to choose between a head-on collision and swerving into a stone wall."
      },
      {
        "id": "tvmaze:3304914",
        "title": "Bike Lane Lambasting",
        "season": 5,
        "episode": 9,
        "released": "2025-08-12",
        "overview": "A woman in London berates a cyclist over his use of a bike lane. A man in California is struck by a sedan after a heated confrontation over an alleged theft. A confused motorist crashes a New Jersey family's get-together. In South Africa, an explosion under the street wreaks havoc across five city blocks. A confused late-night driver in Georgia finds themself stuck in a pedestrian plaza. In Minnesota, a good Samaritan helps a state trooper struggling to subdue a DUI suspect."
      },
      {
        "id": "tvmaze:3304915",
        "title": "Semi Disaster",
        "season": 5,
        "episode": 10,
        "released": "2025-08-19",
        "overview": "A man in San Diego strikes an SUV with a bat after it appears to hop a curb and head toward him. A cyclist in England has a run-in with a delivery driver. An attempted carjacking in Florida is thwarted when police use a state-of-the-art grappling device. In New York, a woman is sent flying when a garbage truck's mechanical arm grabs the bench she's seated on. A speeding biker in California is pulled over by a no-nonsense officer. A semi truck driver's life hangs in the balance when an erratic driver causes her rig to careen halfway off a bridge in Louisville."
      },
      {
        "id": "tvmaze:3365093",
        "title": "Rounda-Bout",
        "season": 6,
        "episode": 1,
        "released": "2025-10-14",
        "overview": "A car in Texas rams a motorcycle trying to pass on a double yellow line. A driver in Australia is nearly dragged out of his car window allegedly over a parking spot."
      },
      {
        "id": "tvmaze:3365094",
        "title": "Can't Outrun the Law",
        "season": 6,
        "episode": 2,
        "released": "2025-10-14",
        "overview": "A motorcyclist fleeing from authorities in Wisconsin has a run in with the Sheriff. In Texas, an argument between two men at a red light erupts into a shirt-tearing brawl. A driver in Nevada loses his cool when flying tumbleweeds create a traffic jam."
      },
      {
        "id": "tvmaze:3365095",
        "title": "Dangerous Directions",
        "season": 6,
        "episode": 3,
        "released": "2025-10-21",
        "overview": "Bystanders in Los Angeles intervene when a man on the street tussles with a driver. A motor scooter rider and a sedan driver come to blows in Panama City."
      },
      {
        "id": "tvmaze:3365096",
        "title": "Blind Spot",
        "season": 6,
        "episode": 4,
        "released": "2025-10-21",
        "overview": "In Iowa, an officer clings to the hood of a suspect's moving vehicle. On the Fourth of July in Minneapolis, vehicles drive through the city shooting fireworks toward pedestrians."
      },
      {
        "id": "tvmaze:3365097",
        "title": "See Ya Later, Excavator",
        "season": 6,
        "episode": 5,
        "released": "2025-10-28",
        "overview": "A skateboarder blasting down a steep hill in San Francisco collides with a car. A clash between a driver and pedestrians in Ft. Lauderdale becomes a raging pursuit down a busy street."
      },
      {
        "id": "tvmaze:3365098",
        "title": "Honk if You Love Drama",
        "season": 6,
        "episode": 6,
        "released": "2025-10-28",
        "overview": "A claimed lane-change dispute in Texas leads to a woman beating on a car that has a mother and four children inside. A motorbiker in Brazil is hit by a car door and knocked under a truck."
      },
      {
        "id": "tvmaze:3394702",
        "title": "Gone in 60 Seconds",
        "season": 6,
        "episode": 7,
        "released": "2025-11-04",
        "overview": "A wrong-way driver in Florida takes issue with police administering her a DUI test. A couple in England has their car taken while they are standing in their own driveway. In Ireland, a cab driver offers riders a unique experience."
      },
      {
        "id": "tvmaze:3394704",
        "title": "Near Death Whiskey Throttle",
        "season": 6,
        "episode": 8,
        "released": "2025-11-11",
        "overview": "When a pulled-over driver in Texas curses out police, they uncover more than meets the eye. After a near miss in Wisconsin, a cyclist has a fierce confrontation with a driver and his deaf passenger."
      },
      {
        "id": "tvmaze:3394705",
        "title": "Mother Doesn't Know Best",
        "season": 6,
        "episode": 9,
        "released": "2025-11-18",
        "overview": "An argument between two drivers in Indiana intensifies when it appears that both men are armed. A confrontation in a Maryland parking lot turns dire as a sedan runs into a man on foot."
      },
      {
        "id": "tvmaze:3394706",
        "title": "Parking Garage Nightmare",
        "season": 6,
        "episode": 10,
        "released": "2025-11-18",
        "overview": "A rideshare driver in Virginia is pursued by another driver who claims he cut him off. A female driver in Ohio confronts the male passenger of another vehicle and pays a heavy price."
      },
      {
        "id": "tvmaze:3394707",
        "title": "Caught in an Avalanche",
        "season": 6,
        "episode": 11,
        "released": "2025-11-25",
        "overview": "A traffic stop in Oklahoma turns disastrous for a driver who flees after refusing to accept a ticket. A brawl outside a nightclub in England becomes life-threatening when a car enters the fray."
      },
      {
        "id": "tvmaze:3394708",
        "title": "Crashing on a Curve",
        "season": 6,
        "episode": 12,
        "released": "2025-11-25",
        "overview": "A driver in Los Angeles squares off with a group of cyclists in a battle over the right of way. A motorcyclist in Arkansas pursues a driver he believes left the scene of an accident."
      },
      {
        "id": "tvmaze:3433226",
        "title": "Fleeing in Reverse",
        "season": 6,
        "episode": 13,
        "released": "2025-12-02",
        "overview": "A cyclist in Utah berates a driver for passing too closely, until police arrive. In England, a fight outside a pub escalates when a motorist gets involved. A man in Ohio leads police on a hard-charging pursuit in reverse."
      }
    ]
  }
}