{
  "meta": {
    "id": "tvmaze:12365",
    "type": "series",
    "name": "NAACP Image Awards",
    "description": "An NAACP Image Award is an accolade presented by the American National Association for the Advancement of Colored People to honor outstanding people of color infilm, television, music, and literature. Similar to other awards, like the Oscars and the Grammys, the 35 categories of the Image Awards are voted on by the award organization's members (that is, NAACP members). Honorary awards (similar to the Academy Honorary Award) have also been included, such as the President's Award, the Chairman's Award, Entertainer of the Year and The Image Award Hall of Fame. The award ceremony was first presented in 1967 and was first nationally televised in 1994 on the Fox Network. The first live broadcast of the event, also on the Fox Network, occurred in 2007 for its 38th edition (up until 2007, the ceremony had been broadcast with tape delay) and the annual ceremonies usually take place in or around the Los Angeles, United States (US) area, in February or early March. The 44th edition aired on NBC.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/449/1123382.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/449/1123382.jpg",
    "videos": [
      {
        "id": "tvmaze:3448717",
        "title": "57th Annual NAACP Image Awards",
        "season": 2026,
        "episode": 1,
        "released": "2026-02-28",
        "overview": "Live from the Pasadena Civic Auditorium in Pasadena, California."
      },
      {
        "id": "tvmaze:591054",
        "title": "17th Annual NAACP Image Awards",
        "season": 1984,
        "episode": 1,
        "released": "1984-12-04",
        "overview": "The 17th Annual NAACP Image Awards was the 1st time this show was seen on TV and it aired at that time on NBC. The 1st Annual Awards were held in the Beverly Hilton Hotel in Beverly Hills, California on 4 February 1967."
      },
      {
        "id": "tvmaze:591055",
        "title": "27th Annual NAACP Image Awards",
        "season": 1996,
        "episode": 1,
        "released": "1996-04-23",
        "overview": "The 27th Annual NAACP Image Awards was held on 23 April 1996 and it was the 1st year that the show aired on FOX TV."
      },
      {
        "id": "tvmaze:591056",
        "title": "45th Annual NAACP Image Awards",
        "season": 2014,
        "episode": 1,
        "released": "2014-02-22",
        "overview": "The 45th Annual NAACP Image Awards show was the first to air on TV One."
      },
      {
        "id": "tvmaze:591057",
        "title": "46th Annual NAACP Image Awards",
        "season": 2015,
        "episode": 1,
        "released": "2015-02-06",
        "overview": ""
      },
      {
        "id": "tvmaze:591058",
        "title": "47th Annual NAACP Image Awards",
        "season": 2016,
        "episode": 1,
        "released": "2016-02-05",
        "overview": ""
      },
      {
        "id": "tvmaze:1061813",
        "title": "48th Annual NAACP Image Awards",
        "season": 2017,
        "episode": 1,
        "released": "2017-02-11",
        "overview": ""
      },
      {
        "id": "tvmaze:3106011",
        "title": "49th Annual NAACP Image Awards",
        "season": 2018,
        "episode": 1,
        "released": "2018-01-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3106012",
        "title": "50th Annual NAACP Image Awards",
        "season": 2019,
        "episode": 1,
        "released": "2019-03-30",
        "overview": ""
      },
      {
        "id": "tvmaze:3106013",
        "title": "51st Annual NAACP Image Awards",
        "season": 2020,
        "episode": 1,
        "released": "2020-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:1988131",
        "title": "52nd Annual NAACP Image Awards",
        "season": 2021,
        "episode": 1,
        "released": "2021-03-27",
        "overview": "The NAACP Image Awards honors the accomplishments of people of color in the fields of television, music, literature, and film and also recognizes individuals or groups who promote social justice through creative endeavors."
      },
      {
        "id": "tvmaze:2221281",
        "title": "53rd Annual NAACP Image Awards",
        "season": 2022,
        "episode": 1,
        "released": "2022-02-26",
        "overview": "Will be hosted by seven-time NAACP Image Awards Winner Anthony Anderson.Academy Award-nominated actor and producer Samuel L. Jackson will receive the prestigious Chairman's Award.Entertainer of the Year nominees: Jennifer Hudson, Lil Nas X, Megan Thee Stallion, Regina King, Tiffany Haddish  Outstanding Motion Picture: Judas and the Black Messiah (Warner Bros. Pictures), King Richard (Warner Bros. Pictures), Respect (Metro Goldwyn Mayer Pictures/United Artists Releasing), The Harder They Fall (Netflix), The United States vs. Billie Holiday (Hulu Original / New Slate Ventures / Lee Daniels Entertainment / Roth-Krischenbaum Films)Outstanding Actor in a Motion Picture: Denzel Washington - The Tragedy of Macbeth (Apple TV+ / A24), Jonathan Majors - The Harder They Fall (Netflix), LaKeith Stanfield - Judas and the Black Messiah (Warner Bros. Pictures), Mahershala Ali - Swan Song (Apple TV+), Will Smith - King Richard (Warner Bros. Pictures)Outstanding Actress in a Motion Picture: Andra Day - The United States vs. Billie Holiday (Hulu Original / New Slate Ventures / Lee Daniels Entertainment / Roth-Krischenbaum Films), Halle Berry - Bruised (Netflix), Jennifer Hudson - Respect (Metro Goldwyn Mayer Pictures/United Artists Releasing), Tessa Thompson - Passing (Netflix), Zendaya - Malcolm &amp; Marie (Netflix)"
      },
      {
        "id": "tvmaze:2444603",
        "title": "54th Annual NAACP Image Awards",
        "season": 2023,
        "episode": 1,
        "released": "2023-02-25",
        "overview": "Queen Latifah hosts one of the biggest nights in Black culture, which honors the achievements of Black creators, artists, entertainers and activists, including Ben Crump, Gabrielle Union and Dwyane Wade."
      },
      {
        "id": "tvmaze:2655221",
        "title": "55th Annual NAACP Image Awards",
        "season": 2024,
        "episode": 1,
        "released": "2024-03-16",
        "overview": "Live from the Shrine Auditorium in Los Angeles, California.GRAMMY® -nominated singing group New Edition will be inducted into the acclaimed NAACP Image Awards Hall of Fame.Award-winning writer, inaugural poet, and activist Amanda Gorman will be presented the Chairman's Award."
      },
      {
        "id": "tvmaze:3105853",
        "title": "56th Annual NAACP Image Awards",
        "season": 2025,
        "episode": 1,
        "released": "2025-02-22",
        "overview": "Live from the Pasadena Civic Auditorium in Pasadena, California.Comedy legend and cultural icon Dave Chappelle will receive the prestigious President's Award.The legendary Wayans family will be inducted into the esteemed NAACP Image Awards Hall of Fame.Former Vice President Kamala Harris will be honored with the prestigious Chairman's Award."
      }
    ]
  }
}