{
  "meta": {
    "id": "tvmaze:6099",
    "type": "series",
    "name": "30 for 30",
    "description": "Inspired by ESPN's anniversary, ESPN Films is launching 30 for 30, an unprecedented documentary series featuring 30 of today's finest storytellers telling thirty remarkable stories from the ESPN era. On their own, each of the films will be an intimate look at a specific story, relevant to larger themes from the modern era. Collectively, these films will be a diverse mosaic of what sports has meant to American and World culture in the last thirty years. Each storyteller will bring their passion and personal point of view to their film detailing the issues, trends, athletes, teams, rivalries, games and events that transformed the sports landscape from 1979 to 2009.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/63/159166.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/63/159166.jpg",
    "videos": [
      {
        "id": "tvmaze:3447440",
        "title": "Boo-Yah: A Portrait of Stuart Scott",
        "season": 4,
        "episode": 47,
        "released": "2025-12-10",
        "overview": "\"Boo-Yah\" goes beyond the highlights to reveal the man who made millions of fans — and a generation of broadcasters — not only feel seen, but also heard. Featuring never-before-seen archival footage, including self-shot home videos, Stuart himself helped document his rise to prominence, painting an unfiltered and deeply personal portrait of a man who redefined what it meant to be both a journalist and cultural icon. \"Boo-Yah\" traces Stuart's journey from local television in North Carolina to becoming one of ESPN's most influential voices. At a time when hip-hop and popular culture was often marginalized in mainstream media and few Black anchors held national prominence, Stuart brought both unapologetically to SportsCenter — blending sharp analysis, pop culture and swagger in a way that spoke directly to a new generation of fans."
      },
      {
        "id": "tvmaze:364839",
        "title": "King's Ransom",
        "season": 1,
        "episode": 1,
        "released": "2009-10-06",
        "overview": "The 1988 trade of Wayne Gretzky from the Edmonton Oilers to the Los Angeles Kings and the effect it had on Gretzky, the fans in Edmonton, and the popularity of hockey in Southern California."
      },
      {
        "id": "tvmaze:364840",
        "title": "The Band That Wouldn't Die",
        "season": 1,
        "episode": 2,
        "released": "2009-10-13",
        "overview": "A profile of Baltimore's love affair with football and the Colts, focusing on the Colts Marching Band. After the Colts decamped for Indianapolis in 1984, the band remained in Baltimore and helped promote the eventual return of the NFL to the city."
      },
      {
        "id": "tvmaze:364841",
        "title": "Small Potatoes: Who Killed the USFL?",
        "season": 1,
        "episode": 3,
        "released": "2009-10-20",
        "overview": "Fresh interviews and archival footage track the life and demise of the United States Football League in the mid-1980s. A highlight is Tollin's interview with Donald Trump, the former New Jersey Generals owner whose post-interview comments on the league give this documentary its title."
      },
      {
        "id": "tvmaze:364842",
        "title": "Muhammad and Larry",
        "season": 1,
        "episode": 4,
        "released": "2009-10-27",
        "overview": "A look at the October 1980 Muhammad Ali–Larry Holmes fight and its impact on both fighters, featuring fresh interviews with participants and previously unseen lead-up footage from both fighters' camps."
      },
      {
        "id": "tvmaze:364843",
        "title": "Without Bias",
        "season": 1,
        "episode": 5,
        "released": "2009-11-03",
        "overview": "The death of Len Bias from a cocaine-induced heart attack, two days after Boston selected him as the second overall pick in the 1986 NBA draft, and its impact on casual drug use, especially by the sports community."
      },
      {
        "id": "tvmaze:364844",
        "title": "The Legend of Jimmy the Greek",
        "season": 1,
        "episode": 6,
        "released": "2009-11-10",
        "overview": "The life of Jimmy \"the Greek\" Snyder, from his career as a Las Vegas bookmaker to his tenure on The NFL Today, from which he was fired in 1988."
      },
      {
        "id": "tvmaze:364845",
        "title": "The U",
        "season": 1,
        "episode": 7,
        "released": "2009-12-12",
        "overview": "The racial and cultural evolution of Miami during the 1980s as represented within the University of Miami football team."
      },
      {
        "id": "tvmaze:364846",
        "title": "Winning Time: Reggie Miller vs. The New York Knicks",
        "season": 1,
        "episode": 8,
        "released": "2010-03-14",
        "overview": "The impact of Indiana Pacer Reggie Miller on the New York Knicks in the 1990s, specifically focusing on the Pacers/Knicks battles in the 1994 and 1995 NBA Playoffs and on Miller's interaction with Knicks fan Spike Lee."
      },
      {
        "id": "tvmaze:364847",
        "title": "Guru of Go",
        "season": 1,
        "episode": 9,
        "released": "2010-04-03",
        "overview": "A profile of Paul Westhead's coaching tenure at Loyola Marymount University (1985–1990), where his Lions' team was known for its high-scoring run-and-gun offense and talented players such as Bo Kimble and Hank Gathers, who died on-court in 1990."
      },
      {
        "id": "tvmaze:364849",
        "title": "No Crossover: The Trial of Allen Iverson",
        "season": 1,
        "episode": 10,
        "released": "2010-04-13",
        "overview": "The 1993 trial of Hampton, Virginia, high school athlete Allen Iverson, convicted for his role in a racially tinged melee, and its impact on both the community and on Iverson's life."
      },
      {
        "id": "tvmaze:364850",
        "title": "Silly Little Game",
        "season": 1,
        "episode": 11,
        "released": "2010-04-20",
        "overview": "Meeting at New York City's La Rotisserie Francaise restaurant in 1980, a group of writers and academics develop Rotisserie Fantasy baseball, only to see it take off in popularity and leave them behind."
      },
      {
        "id": "tvmaze:364851",
        "title": "Run Ricky Run",
        "season": 1,
        "episode": 12,
        "released": "2010-04-27",
        "overview": "A profile of Ricky Williams focuses on his brief 2004 departure from the NFL, when he sought self-redemption amidst media criticism and fresh rumors of marijuana use."
      },
      {
        "id": "tvmaze:364852",
        "title": "The 16th Man",
        "season": 1,
        "episode": 13,
        "released": "2010-05-04",
        "overview": "How hosting (and winning) the1995 Rugby World Cup and Nelson Mandela's support of the Springboks national team affected post-apartheid South Africa."
      },
      {
        "id": "tvmaze:364853",
        "title": "Straight Outta L.A.",
        "season": 1,
        "episode": 14,
        "released": "2010-05-11",
        "overview": "The relationship between the Raiders and the minority fan base in Los Angeles during the team's 13 seasons in L.A. (1982–1994)."
      },
      {
        "id": "tvmaze:364854",
        "title": "June 17, 1994",
        "season": 1,
        "episode": 15,
        "released": "2010-06-16",
        "overview": "Quick-cut archival footage captures the various US sporting events on the day in question and the emotions they generated, including but not limited to the opening of the World Cup soccer tournament, the Knicks/Rockets battle in the NBA Finals, Arnold Palmer's last round in the U.S. Open, and the New York Rangers' Stanley Cup victory celebration. One event overshadows them all: O.J. Simpson's run from the police."
      },
      {
        "id": "tvmaze:364855",
        "title": "The Two Escobars",
        "season": 1,
        "episode": 16,
        "released": "2010-06-22",
        "overview": "The lives of soccer player Andrés Escobar and drug lord Pablo Escobar; the intertwining of crime and soccer in their native Colombia; and the connections between the murders of both men."
      },
      {
        "id": "tvmaze:364856",
        "title": "The Birth of Big Air",
        "season": 1,
        "episode": 17,
        "released": "2010-07-29",
        "overview": "The life of Mat Hoffman and his 25-year career of advancing BMX riding, both creatively and promotionally."
      },
      {
        "id": "tvmaze:364858",
        "title": "Jordan Rides the Bus",
        "season": 1,
        "episode": 18,
        "released": "2010-08-24",
        "overview": "Motivated by the dream his late father had for him, Michael Jordan retires from basketball and has a brief career in minor league baseball."
      },
      {
        "id": "tvmaze:364859",
        "title": "Little Big Men",
        "season": 1,
        "episode": 19,
        "released": "2010-08-31",
        "overview": "The Kirkland National Little League team's success at the 1982 Little League World Series, examining why their title win is considered one of the biggest upsets in the event's history."
      },
      {
        "id": "tvmaze:364860",
        "title": "One Night in Vegas",
        "season": 1,
        "episode": 20,
        "released": "2010-09-07",
        "overview": "The friendship of boxer Mike Tyson and rapper Tupac Shakur and the night of September 7, 1996, when Shakur was murdered after attending the Tyson-Bruce Seldon fight in Las Vegas."
      },
      {
        "id": "tvmaze:364861",
        "title": "Unmatched",
        "season": 1,
        "episode": 21,
        "released": "2010-09-14",
        "overview": "A look at the rivalry and friendship between tennis legends Chris Evert and Martina Navratilova."
      },
      {
        "id": "tvmaze:364862",
        "title": "The House of Steinbrenner",
        "season": 1,
        "episode": 22,
        "released": "2010-09-21",
        "overview": "The legacy of George Steinbrenner's ownership of the New York Yankees."
      },
      {
        "id": "tvmaze:364863",
        "title": "Into the Wind",
        "season": 1,
        "episode": 23,
        "released": "2010-09-28",
        "overview": "Terry Fox's attempt to run across Canada in support of fundraising for cancer research captures the attention of his fellow Canadians and the world."
      },
      {
        "id": "tvmaze:364865",
        "title": "Four Days in October",
        "season": 1,
        "episode": 24,
        "released": "2010-10-05",
        "overview": "The remarkable comeback of the Boston Red Sox against the New York Yankees in the 2004 ALCS."
      },
      {
        "id": "tvmaze:364866",
        "title": "Once Brothers",
        "season": 1,
        "episode": 25,
        "released": "2010-10-12",
        "overview": "The story of Croatian Dražen Petrović and Serbian Vlade Divac, NBA players and Yugoslavian national teammates, and how upheaval in their homeland adversely and irretrievably affected their friendship."
      },
      {
        "id": "tvmaze:364867",
        "title": "Tim Richmond: To the Limit",
        "season": 1,
        "episode": 26,
        "released": "2010-10-19",
        "overview": "The career of NASCAR driver Tim Richmond, his flamboyant lifestyle, and his 1989 death from AIDS."
      },
      {
        "id": "tvmaze:364868",
        "title": "Fernando Nation",
        "season": 1,
        "episode": 27,
        "released": "2010-10-26",
        "overview": "The euphoria created by Fernando Valenzuela's 1981 arrival with the Los Angeles Dodgers."
      },
      {
        "id": "tvmaze:364869",
        "title": "Marion Jones: Press Pause",
        "season": 1,
        "episode": 28,
        "released": "2010-11-02",
        "overview": "The successful track and field career of Marion Jones, her 2007 admission of performance-enhancing drug use, and subsequent prison sentence."
      },
      {
        "id": "tvmaze:364870",
        "title": "The Best That Never Was",
        "season": 1,
        "episode": 29,
        "released": "2010-11-09",
        "overview": "The 1981 recruiting of high school football player Marcus Dupree by multiple big-time college programs, his resulting injury-prone college and professional career, and how his pursuit by college and USFL teams changed the recruiting process."
      },
      {
        "id": "tvmaze:364871",
        "title": "Pony Excess",
        "season": 1,
        "episode": 30,
        "released": "2010-12-11",
        "overview": "The rise, fall, and rebirth of the SMU Mustangs football program, which received a 1-year \"death penalty\" for major infractions after former SMU player David Stanley blew the whistle on the long-suspected program."
      },
      {
        "id": "tvmaze:364872",
        "title": "Broke",
        "season": 2,
        "episode": 1,
        "released": "2012-10-02",
        "overview": "An exploration of the road to fortune in sports and the eventual detours (for various reasons) to financial difficulties and bankruptcy, as experienced by top athletes including Bernie Kosar, Andre Rison, Keith McCants, and Cliff Floyd."
      },
      {
        "id": "tvmaze:364873",
        "title": "9.79*",
        "season": 2,
        "episode": 2,
        "released": "2012-10-09",
        "overview": "A profile of the Men's 100 meter final at the 1988 Summer Olympics and the lives of the 8 men who participated, including Ben Johnson (whose world-record run of 9.79 seconds was scrubbed after he tested positive for anabolic steroids) and Carl Lewis (who was awarded the gold medal after Johnson's disqualification)."
      },
      {
        "id": "tvmaze:364874",
        "title": "There's No Place Like Home",
        "season": 2,
        "episode": 3,
        "released": "2012-10-16",
        "overview": "The story of one fan's obsessive quest to purchase, at a 2010 auction, James Naismith's original rules of basketball, perhaps the most important historical document in American sports history, and to bring it \"home\" to Lawrence, Kansas, where Naismith taught and coached at the University of Kansas for 39 years."
      },
      {
        "id": "tvmaze:364875",
        "title": "Benji",
        "season": 2,
        "episode": 4,
        "released": "2012-10-23",
        "overview": "The life of Ben Wilson, a well-regarded Chicago high school basketball star, and how his November 1984 murder (one day before the start of his senior season) had a wide-ranging impact."
      },
      {
        "id": "tvmaze:364877",
        "title": "Ghosts of Ole Miss",
        "season": 2,
        "episode": 5,
        "released": "2012-10-30",
        "overview": "Mississippi native Wright Thompson explores tumultuous events of 1962, when the University of Mississippi campus both erupted in violence over integration and swelled with pride over its unbeaten football team, and how those incidents continue to shape the state 50 years later."
      },
      {
        "id": "tvmaze:364878",
        "title": "You Don't Know Bo",
        "season": 2,
        "episode": 6,
        "released": "2012-12-08",
        "overview": "A profile of Bo Jackson and how his college and professional feats in two sports (baseball and football) captured the public's imagination and made Jackson a cultural (and marketing) icon."
      },
      {
        "id": "tvmaze:364879",
        "title": "Survive and Advance",
        "season": 2,
        "episode": 7,
        "released": "2013-03-17",
        "overview": "A look at the North Carolina State Wolfpack men's basketball team's successful and improbable championship runs through the 1983 ACC and the 1983 NCAA tournaments."
      },
      {
        "id": "tvmaze:364880",
        "title": "Elway to Marino",
        "season": 2,
        "episode": 8,
        "released": "2013-04-23",
        "overview": "A look at the 1983 NFL Draft and the six quarterbacks taken in its first round, specifically John Elway (the first overall pick) and Dan Marino (the last QB picked in Round 1). The film features the recollections of Martin Demoff, the agent for both Elway and Marino, who shares a personal diary he kept to chronicle the indecision the Baltimore Colts had with drafting Elway with the first pick or trading it away, as well as the other teams' interest in his two future-Hall of Fame clients."
      },
      {
        "id": "tvmaze:364881",
        "title": "Hawaiian: The Legend of Eddie Aikau",
        "season": 2,
        "episode": 9,
        "released": "2013-10-01",
        "overview": "A chronicling of the life of Eddie Aikau, a big wave surfer and lifeguard whose death served as inspiration to an entire spiritual movement."
      },
      {
        "id": "tvmaze:364882",
        "title": "Free Spirits",
        "season": 2,
        "episode": 10,
        "released": "2013-10-08",
        "overview": "The story of the colorful figures who made up the American Basketball Association's Spirits of St. Louis, and how Spirits owners Ozzie and Daniel Silna, with their team about to be left out in the ABA's merger with the NBA, managed to negotiate a deal that allowed the brothers' involvement in pro basketball to continue in a most unusual fashion."
      },
      {
        "id": "tvmaze:364883",
        "title": "No Mas",
        "season": 2,
        "episode": 11,
        "released": "2013-10-15",
        "overview": "An inside look at the two boxing matches between Sugar Ray Leonard and Roberto Durán in the 1980s, with insight from boxing experts, family members and the two fighters themselves."
      },
      {
        "id": "tvmaze:364884",
        "title": "Big Shot",
        "season": 2,
        "episode": 12,
        "released": "2013-10-22",
        "overview": "The story of how young businessman John Spano struck a deal to purchase the New York Islanders in 1996, only to be later revealed as a fraud and being near financial insolvency."
      },
      {
        "id": "tvmaze:364886",
        "title": "This Is What They Want",
        "season": 2,
        "episode": 13,
        "released": "2013-10-29",
        "overview": "The story of a 39-year-old Jimmy Connors and his unexpected and extraordinary underdog run at the 1991 US Open, where he played as a wildcard entrant and reached the semifinals of the men's singles draw."
      },
      {
        "id": "tvmaze:364887",
        "title": "Bernie and Ernie",
        "season": 2,
        "episode": 14,
        "released": "2013-11-05",
        "overview": "A profile of Bernard King and Ernie Grunfeld, their decades-long friendship, and their on-court partnership on the University of Tennessee basketball team, better known as the \"Ernie and Bernie Show\"."
      },
      {
        "id": "tvmaze:364888",
        "title": "Youngstown Boys",
        "season": 2,
        "episode": 15,
        "released": "2013-12-14",
        "overview": "The stories of two Ohio State football figures connected with Youngstown, Ohio, running back Maurice Clarett (a native of the city) and coach Jim Tressel (former head coach at Youngstown State University), their football exploits at OSU (including a national championship in 2002), and their scandalous exits from the school."
      },
      {
        "id": "tvmaze:364889",
        "title": "The Price of Gold",
        "season": 2,
        "episode": 16,
        "released": "2014-01-16",
        "overview": "A profile of a January 6, 1994, incident at the U.S. Figure Skating Championships, where an unknown attacker strikes entrant Nancy Kerrigan — an assailant that is later revealed to be a hit man hired by the ex-husband of Kerrigan's rival, Tonya Harding, as part of a plan to prevent Kerrigan from competing in the 1994 Winter Olympics."
      },
      {
        "id": "tvmaze:364890",
        "title": "Requiem for the Big East",
        "season": 2,
        "episode": 17,
        "released": "2014-03-16",
        "overview": "A recollection of the original Big East Conference, from its simple beginnings and regional rivalries to its national prominence as one of the most successful college basketball leagues, and how it ended up fighting for its survival in the 2010s during conference realignment."
      },
      {
        "id": "tvmaze:364891",
        "title": "Bad Boys",
        "season": 2,
        "episode": 18,
        "released": "2014-04-17",
        "overview": "A look back at the Detroit Pistons of the late 1980s and early 1990s. Narrated by rapper Kid Rock, a native of nearby Romeo."
      },
      {
        "id": "tvmaze:364892",
        "title": "Slaying the Badger",
        "season": 2,
        "episode": 19,
        "released": "2014-07-22",
        "overview": "An examination of the competitive nature that teammates Greg LeMond and Bernard Hinault exhibited in the1986 Tour de France; a film based on Richard Moore's book of the same name."
      },
      {
        "id": "tvmaze:364893",
        "title": "Playing for the Mob",
        "season": 2,
        "episode": 20,
        "released": "2014-10-07",
        "overview": "How Mafia associate Henry Hill orchestrated a point-shaving scheme involving Boston College basketball. Narrated by Ray Liotta, who portrayed Hill in Goodfellas."
      },
      {
        "id": "tvmaze:364894",
        "title": "The Day the Series Stopped",
        "season": 2,
        "episode": 21,
        "released": "2014-10-14",
        "overview": "A 25-year retrospective of the Loma Prieta earthquake, which struck just before the scheduled start of Game 3 of the 1989 World Series."
      },
      {
        "id": "tvmaze:364895",
        "title": "When the Garden Was Eden",
        "season": 2,
        "episode": 22,
        "released": "2014-10-21",
        "overview": "A look back at the New York Knicks' championship teams of the 1970s."
      },
      {
        "id": "tvmaze:364896",
        "title": "Brian and the Boz",
        "season": 2,
        "episode": 23,
        "released": "2014-10-28",
        "overview": "The rise, fall, and post-football life of Brian Bosworth."
      },
      {
        "id": "tvmaze:364897",
        "title": "Brothers in Exile",
        "season": 2,
        "episode": 24,
        "released": "2014-11-04",
        "overview": "The story of Liván and Orlando Hernández, half-brothers who fled Cuba separately and became successful major-league pitchers."
      },
      {
        "id": "tvmaze:364898",
        "title": "Rand University",
        "season": 2,
        "episode": 25,
        "released": "2014-11-11",
        "overview": "An exploration of former NFL receiver Randy Moss and his humble (and humbling) origins in Rand, West Virginia."
      },
      {
        "id": "tvmaze:364899",
        "title": "The U Part 2",
        "season": 2,
        "episode": 26,
        "released": "2014-12-13",
        "overview": "A sequel to The U profiles the Miami Hurricanes football program and its rise from scandal (and calls for the school to drop the sport) to a national championship, only to see new controversy after booster Nevin Shapiro is revealed to have given improper benefits to the program."
      },
      {
        "id": "tvmaze:364900",
        "title": "Of Miracles and Men",
        "season": 2,
        "episode": 27,
        "released": "2015-02-08",
        "overview": "An exploration of the Miracle on Ice from the point of view of the defeated Soviet Union team."
      },
      {
        "id": "tvmaze:364901",
        "title": "I Hate Christian Laettner",
        "season": 2,
        "episode": 28,
        "released": "2015-03-15",
        "overview": "A look at the life and basketball career of Christian Laettner and the intense dislike some fans still harbor for the former Duke University and NBA star."
      },
      {
        "id": "tvmaze:364902",
        "title": "Sole Man",
        "season": 2,
        "episode": 29,
        "released": "2015-04-16",
        "overview": "A profile of Sonny Vaccaro, who rose from steel town roots in Pennsylvania to become an influential force in both basketball and the athletic shoe industry."
      },
      {
        "id": "tvmaze:1280528",
        "title": "Angry Sky: The Legend Of Nick Piantanida",
        "season": 2,
        "episode": 30,
        "released": "2015-07-30",
        "overview": "The story of Nick Piantanida, a New Jersey pet store owner and truck driver whose love of parachuting and skydiving puts him on a quest to break the record for the highest recorded parachute jump."
      },
      {
        "id": "tvmaze:364904",
        "title": "Trojan War",
        "season": 3,
        "episode": 1,
        "released": "2015-10-13",
        "overview": "The rise and fall of the USC Trojan football team under the nine-year leadership of Pete Carroll."
      },
      {
        "id": "tvmaze:394097",
        "title": "The Prince of Pennsylvania",
        "season": 3,
        "episode": 2,
        "released": "2015-10-20",
        "overview": "An exploration of the turbulent relationship between Olympic wrestling brothers Mark and Dave Schultz and their eccentric benefactor, John du Pont, culminating in the murder of Dave by du Pont."
      },
      {
        "id": "tvmaze:364907",
        "title": "The Gospel According to Mac",
        "season": 3,
        "episode": 3,
        "released": "2015-11-03",
        "overview": "A look at how Bill McCartney mixed two religions —college football and evangelical Christianity— while serving as head coach of the Colorado Buffaloes in the 1990s, a tenure that included a national championship."
      },
      {
        "id": "tvmaze:364909",
        "title": "Chasing Tyson",
        "season": 3,
        "episode": 4,
        "released": "2015-11-10",
        "overview": "A look at how Evander Holyfield spent years (1989–91 &amp; 1995–96) trying to arrange his first fight with Mike Tyson in an effort to gain the respect he knew he could only gain by defeating Tyson in the ring."
      },
      {
        "id": "tvmaze:1280529",
        "title": "Four Falls of Buffalo",
        "season": 3,
        "episode": 5,
        "released": "2015-12-12",
        "overview": "A profile of the Buffalo Bills teams of the early 1990s, when the franchise became the first team to play in — and lose — four consecutive Super Bowls."
      },
      {
        "id": "tvmaze:1280530",
        "title": "The '85 Bears",
        "season": 3,
        "episode": 6,
        "released": "2016-02-04",
        "overview": "A 30-year retrospective on the 1985 Chicago Bears, from how they were assembled to their swaggering, dominant run to Super Bowl victory."
      },
      {
        "id": "tvmaze:578632",
        "title": "Fantastic Lies",
        "season": 3,
        "episode": 7,
        "released": "2016-03-12",
        "overview": "On March 13, 2006 the Duke University lacrosse team threw a party that not only changed lives and ruined careers, it jeopardized the future of the sport at the school and tarnished the university's reputation."
      },
      {
        "id": "tvmaze:674406",
        "title": "This Magic Moment",
        "season": 3,
        "episode": 8,
        "released": "2016-04-14",
        "overview": "The Orlando Magic were considered the fairy tale team of the mid-90's whose popularity grew, in part, due to players like Shaquille O'Neal and Penny Hardaway."
      },
      {
        "id": "tvmaze:774443",
        "title": "Believeland",
        "season": 3,
        "episode": 9,
        "released": "2016-05-14",
        "overview": "Director Andy Billman chronicles the struggles of Cleveland's major sports franchises over the past 50 years and the impact it has all had on the psyche of a typical Cleveland sports fan."
      },
      {
        "id": "tvmaze:805133",
        "title": "Doc & Darryl",
        "season": 3,
        "episode": 10,
        "released": "2016-07-14",
        "overview": "The connection between the lives and careers of former New York Mets Dwight \"Doc\" Gooden and Darryl Strawberry."
      },
      {
        "id": "tvmaze:956287",
        "title": "Phi Slama Jama",
        "season": 3,
        "episode": 11,
        "released": "2016-10-18",
        "overview": "The University of Houston's high-flying basketball team, known as ''Phi Slama Jama,'' made three straight trips to the Final Four and transformed the game forever."
      },
      {
        "id": "tvmaze:956288",
        "title": "Hit It Hard",
        "season": 3,
        "episode": 12,
        "released": "2016-11-01",
        "overview": "A look at John Daly's rise from obscurity to two major championship wins and fall back to mediocrity."
      },
      {
        "id": "tvmaze:956289",
        "title": "Catholics vs. Convicts",
        "season": 3,
        "episode": 13,
        "released": "2016-12-10",
        "overview": "The fascinating back story behind the famous/infamous 1988 ''Catholics vs. Convicts'' college football game between Notre Dame and the University of Miami. The slogan summarized the subtext of cultural and racial tensions brewing between the schools."
      },
      {
        "id": "tvmaze:985889",
        "title": "This Was the XFL",
        "season": 3,
        "episode": 14,
        "released": "2017-02-02",
        "overview": "In 2001, sports entertainment titans Dick Ebersol and Vince McMahon launched the XFL, a bold challenge since other leagues had attempted to compete with the NFL and ultimately failed."
      },
      {
        "id": "tvmaze:1064125",
        "title": "One and Not Done",
        "season": 3,
        "episode": 15,
        "released": "2017-04-13",
        "overview": "An intimate look at University of Kentucky men's basketball coach John Calipari, one of the most compelling and controversial figures in sports. Featuring never-before-seen footage as he tries to capture his second national title."
      },
      {
        "id": "tvmaze:1201819",
        "title": "Celtics/Lakers: Best of Enemies Part 1",
        "season": 3,
        "episode": 16,
        "released": "2017-06-13",
        "overview": "The Celtics and Lakers played three riveting NBA Finals in a four-year span during the mid-1980s that fueled the popularity of the league and set the stage for the tremendous growth and heightened profile the NBA has enjoyed since."
      },
      {
        "id": "tvmaze:1207130",
        "title": "Celtics/Lakers: Best of Enemies Part 2",
        "season": 3,
        "episode": 17,
        "released": "2017-06-13",
        "overview": "Boston's Larry Bird and LA's Magic Johnson headline rosters full of charisma and talent as their teams collide in the epic 1984 NBA Finals. The two had previously met in the 1979 NCAA Championship Game, and now welcomed a second title clash."
      },
      {
        "id": "tvmaze:1201820",
        "title": "Celtics/Lakers: Best of Enemies Part 3",
        "season": 3,
        "episode": 18,
        "released": "2017-06-14",
        "overview": "When the Celtics and Lakers meet again in the 1985 and 1987 NBA Finals, the teams' disdain and animosity for each other gradually turns to mutual respect -- led by superstars Magic Johnson and Larry Bird."
      },
      {
        "id": "tvmaze:1215862",
        "title": "Mike and the Mad Dog",
        "season": 3,
        "episode": 19,
        "released": "2017-07-13",
        "overview": "Chronicling the history of Mike Francesa and Chris Russo's \"Mike and the Mad Dog'' radio show, which ruled afternoon sports talk from the New York studios of WFAN 660 for nearly 20 years. Featuring in-depth interviews with colleagues and fans."
      },
      {
        "id": "tvmaze:1250234",
        "title": "George Best: All by Himself",
        "season": 3,
        "episode": 20,
        "released": "2017-07-20",
        "overview": "George Best, Northern Ireland's legendary star, remains one of the most naturally gifted soccer players ever. Best's skill and exuberance lifted Manchester United, but his career was over before he turned 29, the result of his battle with alcoholism."
      },
      {
        "id": "tvmaze:1265627",
        "title": "What Carter Lost",
        "season": 3,
        "episode": 21,
        "released": "2017-08-24",
        "overview": "In any other year, the 1988 team from Dallas'Carter High School would have gone down as one of the greatest in Texas football history, featuring 28 players who received college scholarship offers, eight of whom would eventually play professional football. Fighting off racial prejudice and a grades controversy — not to mention the team that would overshadow them in book and film (Odessa Permian) — Carter would claim the state title, only to be rocked to their core when six of their players were involved in an armed robbery that changed the community's reputation to this day."
      },
      {
        "id": "tvmaze:1279703",
        "title": "Year of the Scab",
        "season": 3,
        "episode": 22,
        "released": "2017-09-12",
        "overview": "Redskins replacements crossed the picket line to play in the NFL, but for most of them, what was billed as the last shot at a dream became a nightmare as these ''scabs'' braved ridicule and threats of violence for one last chance at glory."
      },
      {
        "id": "tvmaze:1284760",
        "title": "Tommy",
        "season": 3,
        "episode": 23,
        "released": "2017-09-14",
        "overview": "The unlikely rise and sudden fall of boxer Tommy Morrison."
      },
      {
        "id": "tvmaze:1341833",
        "title": "Nature Boy",
        "season": 3,
        "episode": 24,
        "released": "2017-11-07",
        "overview": "The life and times of professional wrestling legend Ric Flair."
      },
      {
        "id": "tvmaze:1383735",
        "title": "The Two Bills",
        "season": 3,
        "episode": 25,
        "released": "2018-02-01",
        "overview": "A look at the relationship between NFL coaches Bill Parcells and Bill Belichick. Co-produced with NFL Films."
      },
      {
        "id": "tvmaze:1439465",
        "title": "The Last Days of Knight",
        "season": 3,
        "episode": 26,
        "released": "2018-04-12",
        "overview": "In 1971, a young basketball coach named Bob Knight came to Indiana University. Over the next few decades, he became a coaching god. Knight delivered three national titles to a state that worships the game, earning a reputation as not just a basketball genius, but a brilliant leader who equated hard work and discipline with success. And yet, there was another side to that success. In April 1999, Robert Abbott, a producer for CNN/Sports Illustrated, began reporting a story investigating why three high school All-Americans had left Knight's program over the prior two years. Nearly two decades later, the 30 for 30 film \"The Last Days of Knight\" is the previously untold behind-the-scenes story of that investigation and all it produced - a chronicle of accusations, denials, and discoveries; riots and death threats; a smoking gun video; and the fall of a coaching legend. Directed and narrated by Abbott, it's a tale about success, power, abuse, institutions, journalism, and ultimately, a search for truth."
      },
      {
        "id": "tvmaze:1529896",
        "title": "Seau",
        "season": 3,
        "episode": 27,
        "released": "2018-09-20",
        "overview": "Junior Seau, one of modern football's great icons whose tragic end still reverberates through the sports world all these years later."
      },
      {
        "id": "tvmaze:1575737",
        "title": "42 to 1",
        "season": 3,
        "episode": 28,
        "released": "2018-12-11",
        "overview": "Chronicles Buster Douglas' shocking knockout of the then-undefeated Mike Tyson at the Tokyo Dome on February 11, 1990."
      },
      {
        "id": "tvmaze:1529898",
        "title": "Deion's Double Play",
        "season": 3,
        "episode": 29,
        "released": "2019-01-31",
        "overview": "A look at Pro Football Hall of Famer Deion Sanders, focusing especially on a 24-hour span in 1992 when he sandwiched an NFL game between a pair of Major League Baseball postseason games in cities separated by 1,000 miles."
      },
      {
        "id": "tvmaze:1638419",
        "title": "The Dominican Dream",
        "season": 3,
        "episode": 30,
        "released": "2019-04-30",
        "overview": "A portrait of the Dominican immigrants of New York in the '80s and '90s, seen through a loving family whose youngest son, Felipe Lopez, became the top ranked high school basketball player in the nation and was hailed as \"The Dominican Michael Jordan'. Embraced as an immigrant hero, then cast aside as an American failure, Felipe Lopez would eventually find happiness not as a basketball player, but as the man he was always meant to be."
      },
      {
        "id": "tvmaze:1650893",
        "title": "Qualified",
        "season": 3,
        "episode": 31,
        "released": "2019-05-28",
        "overview": "What Janet Guthrie accomplished in the male bastion of mid-70s American motorsports, stands as a testament to one woman's determination and skill - the kind too often relegated to the margins of history."
      },
      {
        "id": "tvmaze:1662488",
        "title": "The Good, the Bad, the Hungry",
        "season": 3,
        "episode": 32,
        "released": "2019-07-02",
        "overview": "The rivalry between Joey Chestnut and Takeru Kobayashi went beyond hot dogs."
      },
      {
        "id": "tvmaze:1697817",
        "title": "Rodman: For Better or Worse",
        "season": 4,
        "episode": 1,
        "released": "2019-09-10",
        "overview": "The unfettered and definitive look at the life and career of Dennis Rodman."
      },
      {
        "id": "tvmaze:1724186",
        "title": "Chuck & Tito",
        "season": 4,
        "episode": 2,
        "released": "2019-10-15",
        "overview": "The story of Chuck Liddell and Tito Ortiz, frenemies from SoCal who brought millions of fans to mixed martial arts and supercharged the UFC."
      },
      {
        "id": "tvmaze:1788192",
        "title": "Vick - Part 1",
        "season": 4,
        "episode": 3,
        "released": "2020-01-30",
        "overview": "Part one of a comprehensive look back at each chapter of former NFL quarterback Michael Vick's saga: the incredible rise, shocking fall and polarizing return."
      },
      {
        "id": "tvmaze:1788193",
        "title": "Vick - Part 2",
        "season": 4,
        "episode": 4,
        "released": "2020-02-06",
        "overview": "A comprehensive look back at each chapter of Michael Vick's saga: the incredible rise, shocking fall, and polarizing return."
      },
      {
        "id": "tvmaze:1860811",
        "title": "Lance - Part 1",
        "season": 4,
        "episode": 5,
        "released": "2020-05-24",
        "overview": "From acclaimed director Marina Zenovich, LANCE is a fascinating, revealing, comprehensive, chronicle of one of the most inspirational – and then infamous – athletes of all time. Based around extensive interviews and conversations with Lance Armstrong, the two-part, four-hour film tells the story of the cyclist's rise out of Texas as a young superstar cyclist; his harrowing battle with testicular cancer; his recovery and emergence as a global icon with his seven consecutive Tour de France titles; and then his massive fall after he was exposed in one of the largest doping scandals in history."
      },
      {
        "id": "tvmaze:1860812",
        "title": "Lance - Part 2",
        "season": 4,
        "episode": 6,
        "released": "2020-05-31",
        "overview": "From acclaimed director Marina Zenovich, LANCE is a fascinating, revealing, comprehensive, chronicle of one of the most inspirational – and then infamous – athletes of all time. Based around extensive interviews and conversations with Lance Armstrong, the two-part, four-hour film tells the story of the cyclist's rise out of Texas as a young superstar cyclist; his harrowing battle with testicular cancer; his recovery and emergence as a global icon with his seven consecutive Tour de France titles; and then his massive fall after he was exposed in one of the largest doping scandals in history."
      },
      {
        "id": "tvmaze:1860813",
        "title": "Be Water",
        "season": 4,
        "episode": 7,
        "released": "2020-06-07",
        "overview": "A look at the journey that led to Bruce Lee's emergence as a singular icon."
      },
      {
        "id": "tvmaze:1860814",
        "title": "Long Gone Summer",
        "season": 4,
        "episode": 8,
        "released": "2020-06-14",
        "overview": "The unforgettable tale of the most storied home run chase in baseball history"
      },
      {
        "id": "tvmaze:1940842",
        "title": "Life and Trials of Oscar Pistorius (Part 1)",
        "season": 4,
        "episode": 9,
        "released": "2020-09-27",
        "overview": "The story of Oscar Pistorius will always be one of the most shocking stories in the history of sports."
      },
      {
        "id": "tvmaze:1940843",
        "title": "Life and Trials of Oscar Pistorius (Part 2)",
        "season": 4,
        "episode": 10,
        "released": "2020-09-27",
        "overview": ""
      },
      {
        "id": "tvmaze:1940844",
        "title": "Life and Trials of Oscar Pistorius (Part 3)",
        "season": 4,
        "episode": 11,
        "released": "2020-09-27",
        "overview": ""
      },
      {
        "id": "tvmaze:1940845",
        "title": "Life and Trials of Oscar Pistorius (Part 4)",
        "season": 4,
        "episode": 12,
        "released": "2020-09-27",
        "overview": ""
      },
      {
        "id": "tvmaze:1977946",
        "title": "The Infinite Race",
        "season": 4,
        "episode": 13,
        "released": "2020-12-15",
        "overview": "The Tarahumara people inspired a barefoot, ultrarunning craze all across the world."
      },
      {
        "id": "tvmaze:2006179",
        "title": "Al Davis vs. the NFL",
        "season": 4,
        "episode": 14,
        "released": "2021-02-04",
        "overview": "The \"spirits\" of Raiders owner Al Davis and NFL commissioner Pete Rozelle tell the story of their contentious rivalry, in particular Davis' desire to move his team from Oakland to Los Angeles despite the league's objections."
      },
      {
        "id": "tvmaze:2118577",
        "title": "Breakaway",
        "season": 4,
        "episode": 15,
        "released": "2021-07-13",
        "overview": "WNBA superstar and activist Maya Moore was one of the best basketball players in the world when she stepped away from the sport for a remarkable reason: to fight for a man she believed was wrongly imprisoned. In 2019, after four WNBA championships, two Olympic gold medals, a WNBA MVP award, three All-Star MVPs, and a scoring title, Moore decided to take a sabbatical from basketball at the age of 29 to devote herself full-time to working for the release of a man named Jonathan Irons, who was wrongly convicted of burglary and assault and sentenced to 50 years in prison"
      },
      {
        "id": "tvmaze:2155303",
        "title": "Once Upon a Time in Queens Part 1",
        "season": 4,
        "episode": 16,
        "released": "2021-09-14",
        "overview": "The story of the 1986 Mets and a remarkable season, in a tale full of infamy and domination from a team that nearly went bankrupt just a decade earlier."
      },
      {
        "id": "tvmaze:2170280",
        "title": "Once Upon a Time in Queens Part 2",
        "season": 4,
        "episode": 17,
        "released": "2021-09-14",
        "overview": "The 1986 Mets were an amazing team and, whether they were villains or heroes, you couldn't miss them as they dominated the season."
      },
      {
        "id": "tvmaze:2155304",
        "title": "Once Upon a Time in Queens Part 3",
        "season": 4,
        "episode": 18,
        "released": "2021-09-15",
        "overview": "Chronicling the 1986 World Series champion New York Mets, a colorful team marked by dominance and demons."
      },
      {
        "id": "tvmaze:2170281",
        "title": "Once Upon a Time in Queens Part 4",
        "season": 4,
        "episode": 19,
        "released": "2021-09-15",
        "overview": "The grime and hopelessness that defined New York gives way to the high-flying, \"greed is good\" rise in the 1980s - when this Mets side emerged."
      },
      {
        "id": "tvmaze:2259480",
        "title": "The Tuck Rule",
        "season": 4,
        "episode": 20,
        "released": "2022-02-06",
        "overview": "Chronicling the controversial \"tuck rule\" decision in a 2001-2002 Raiders-Patriots playoff game that keyed Tom Brady's first postseason win and helped launch a dynasty under coach Bill Belichick. Raiders DB Charles Woodson discusses the play with Brady, with additional interviews with referee Walt Coleman, and others from the game. Directed by Ken Rodgers and Nick Mascolo."
      },
      {
        "id": "tvmaze:2284205",
        "title": "Shark",
        "season": 4,
        "episode": 21,
        "released": "2022-04-19",
        "overview": "A profile of professional golfer Greg Norman, and how his legendary career was shaped by a stunning collapse (from a 6-shot lead) in the final round of the 1996 Masters."
      },
      {
        "id": "tvmaze:2323091",
        "title": "The Greatest Mixtape Ever",
        "season": 4,
        "episode": 22,
        "released": "2022-05-31",
        "overview": "How the And1 Mixtape video series changed the game of basketball forever"
      },
      {
        "id": "tvmaze:2348759",
        "title": "Dream On, Part 1",
        "season": 4,
        "episode": 23,
        "released": "2022-06-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2348760",
        "title": "Dream On, Part 2",
        "season": 4,
        "episode": 24,
        "released": "2022-06-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2348761",
        "title": "Dream On, Part 3",
        "season": 4,
        "episode": 25,
        "released": "2022-06-15",
        "overview": ""
      },
      {
        "id": "tvmaze:2429202",
        "title": "Jeanette Lee Vs.",
        "season": 4,
        "episode": 26,
        "released": "2022-12-13",
        "overview": "Recounting the rise of Jeanette Lee, \"The Black Widow\" of billiards and distinctive star of the early years of the fledgling espn2 network. Featured are Lee's origins in Brooklyn and her discovery of pool as a teenager; plus her persistent health issues. Directed by Ursula Liang."
      },
      {
        "id": "tvmaze:2475805",
        "title": "Bullies of Baltimore",
        "season": 4,
        "episode": 27,
        "released": "2023-02-05",
        "overview": "A lively and colorful look back at the 2000 Super Bowl-champion Baltimore Ravens' magical season, framed by a reunion of its key figures in Baltimore in May 2022. Shannon Sharpe, Ray Lewis, Trent Dilfer, Tony Siragusa and coach Brian Billick are among those featured. Directed by NFL Films' Ken Rodgers and Jason Weber."
      },
      {
        "id": "tvmaze:2535864",
        "title": "The American Gladiators Documentary: Part 1",
        "season": 4,
        "episode": 28,
        "released": "2023-05-30",
        "overview": "Chronicling the popular syndicated competition show American Gladiators (1989-96), which predated the reality TV era but used many of the same techniques to attract viewers. Creator Johnny Ferraro and cast and crew tell the story of the David and Goliath matchups between 'amateur' contestants and the 'professional' gladiators."
      },
      {
        "id": "tvmaze:2538895",
        "title": "The American Gladiators Documentary: Part 2",
        "season": 4,
        "episode": 29,
        "released": "2023-05-31",
        "overview": "Chronicling the popular syndicated competition show American Gladiators (1989-96), which predated the reality TV era but used many of the same techniques to attract viewers. Creator Johnny Ferraro and cast and crew tell the story of the David and Goliath matchups between 'amateur' contestants and the 'professional' gladiators."
      },
      {
        "id": "tvmaze:2538897",
        "title": "The Luckiest Guy in the World: Part 1",
        "season": 4,
        "episode": 30,
        "released": "2023-06-06",
        "overview": "This Bill Walton documentary covers his days as a high school phenom, his dominance at UCLA, his social activism, an injury-riddled NBA career and to his current job as a controversial basketball commentator."
      },
      {
        "id": "tvmaze:2562826",
        "title": "The Luckiest Guy in the World: Part 2",
        "season": 4,
        "episode": 31,
        "released": "2023-06-06",
        "overview": "This Bill Walton documentary covers his days as a high school phenom, his dominance at UCLA, his social activism, an injury-riddled NBA career and to his current job as a controversial basketball commentator."
      },
      {
        "id": "tvmaze:2538900",
        "title": "The Luckiest Guy in the World: Part 3",
        "season": 4,
        "episode": 32,
        "released": "2023-06-13",
        "overview": "Chronicling the championship (and injury) filled basketball career and free-spirited lifestyle of Hall of Fame player and personality Bill Walton. Music from Walton's beloved Grateful Dead accompanies the series. Part 3 of 4."
      },
      {
        "id": "tvmaze:2562825",
        "title": "The Luckiest Guy in the World: Part 4",
        "season": 4,
        "episode": 33,
        "released": "2023-06-13",
        "overview": "Chronicling the championship (and injury) filled basketball career and free-spirited lifestyle of Hall of Fame player and personality Bill Walton. Music from Walton's beloved Grateful Dead accompanies the series. Part 4 of 4."
      },
      {
        "id": "tvmaze:2691985",
        "title": "The Great Heisman Race of 1997",
        "season": 4,
        "episode": 34,
        "released": "2023-12-09",
        "overview": "The story of the 1997 Heisman Trophy race and the now-legendary players who vied for the honor of College Football's best player award that season."
      },
      {
        "id": "tvmaze:2706338",
        "title": "The Minister of Defense",
        "season": 4,
        "episode": 35,
        "released": "2023-12-13",
        "overview": "Chronicling the life and career of Hall of Fame defensive lineman and ordained minister Reggie White, told in part through never-before-seen footage from a 2004 interview filmed two months before his death. Along with interviews with White's Eagles and Packers teammates, the film features Reggie's son Jeremy embarking on a journey to understand his father's life. Directed by Ken Rodgers and Courtland Bragg."
      },
      {
        "id": "tvmaze:2870003",
        "title": "I'm Just Here for the Riot",
        "season": 4,
        "episode": 36,
        "released": "2024-06-04",
        "overview": "The story of the Vancouver riot that followed the Canucks' loss in Game 7 of the 2011 Stanley Cup Final."
      },
      {
        "id": "tvmaze:2870004",
        "title": "False Positive",
        "season": 4,
        "episode": 37,
        "released": "2024-06-11",
        "overview": "The story of then-world record holder in the 400 metre sprint Butch Reynolds and his 1990 suspension for alleged illegal drug use."
      },
      {
        "id": "tvmaze:2870005",
        "title": "No Scope: The Story of FaZe Clan",
        "season": 4,
        "episode": 38,
        "released": "2024-07-01",
        "overview": "A history of Call of Duty clan turned esports organization FaZe Clan and their numerous tumultuous events throughout their decade-plus existence."
      },
      {
        "id": "tvmaze:2870006",
        "title": "American Son",
        "season": 4,
        "episode": 39,
        "released": "2024-07-29",
        "overview": "A profile of Michael Chang, a Taiwanese-American tennis professional, and his 1989 French Open title win, including his upset over Ivan Lendl."
      },
      {
        "id": "tvmaze:2870007",
        "title": "Dude Perfect: A Very Long Shot",
        "season": 4,
        "episode": 40,
        "released": "2024-08-03",
        "overview": "A look at content creators Dude Perfect, going over their dramatic rise and the sacrifices they went through in the realm of sports-themed entertainment."
      },
      {
        "id": "tvmaze:2988992",
        "title": "Stolen Gold",
        "season": 4,
        "episode": 41,
        "released": "2024-09-17",
        "overview": "Directed by acclaimed filmmaker Suemay Oram, this powerful and riveting film delves into the incredible true story of Ramón Torres and the Spanish intellectually disabled basketball team's dramatic journey to the gold medal at the Sydney Paralympics in 2000. The documentary exposes the shocking aftermath of their victory, where Ramón discovers that some of his teammates are not what they seem. Among them is an undercover journalist intent on revealing an outrageous scandal that will rock the world of Paralympic sport. As the scandal unravels, Ramón realizes that everything he believed in was a lie and is forced to confront not only the fraudulent conspiracy, but also a childhood scarred by bullying and trauma to find out who he really is."
      },
      {
        "id": "tvmaze:3063860",
        "title": "The New York Sack Exchange",
        "season": 4,
        "episode": 42,
        "released": "2024-12-13",
        "overview": "The Jets' 1980s high-octane defensive line featuring the larger than life personalities of Mark Gastineau, Marty Lyons, Joe Klecko and Abdul Salaam became New York legends."
      },
      {
        "id": "tvmaze:3272642",
        "title": "Empire Skate",
        "season": 4,
        "episode": 43,
        "released": "2025-06-30",
        "overview": "\"Empire Skate\" tells the story of 1990's New York City skate culture that inspired the global brand Supreme. It is the scene of a rare, energetic convergence of hip-hop, street art, dance, and culture. Kids who grew up in the 1980s as outsiders, going against the grain, bring their own element to this culture: skateboarding. Many of them fleeing hard lives of dysfunction and family desperation, they turn the forbidding landscape of the city into their own personal skate park – setting the stage for a movement that would grow to transform fashion and sports."
      },
      {
        "id": "tvmaze:3369097",
        "title": "Berlusconi: Condemned to Win (Part 1)",
        "season": 4,
        "episode": 44,
        "released": "2025-09-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3369098",
        "title": "Berlusconi: Condemned to Win (Part 2)",
        "season": 4,
        "episode": 45,
        "released": "2025-09-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3369099",
        "title": "Berlusconi: Condemned to Win (Part 3)",
        "season": 4,
        "episode": 46,
        "released": "2025-09-16",
        "overview": ""
      },
      {
        "id": "tvmaze:3447440",
        "title": "Boo-Yah: A Portrait of Stuart Scott",
        "season": 4,
        "episode": 47,
        "released": "2025-12-10",
        "overview": "\"Boo-Yah\" goes beyond the highlights to reveal the man who made millions of fans — and a generation of broadcasters — not only feel seen, but also heard. Featuring never-before-seen archival footage, including self-shot home videos, Stuart himself helped document his rise to prominence, painting an unfiltered and deeply personal portrait of a man who redefined what it meant to be both a journalist and cultural icon. \"Boo-Yah\" traces Stuart's journey from local television in North Carolina to becoming one of ESPN's most influential voices. At a time when hip-hop and popular culture was often marginalized in mainstream media and few Black anchors held national prominence, Stuart brought both unapologetically to SportsCenter — blending sharp analysis, pop culture and swagger in a way that spoke directly to a new generation of fans."
      }
    ]
  }
}