{
  "meta": {
    "id": "tvmaze:84",
    "type": "series",
    "name": "Family Guy",
    "description": "Family Guy follows Peter Griffin the endearingly ignorant dad, and his hilariously offbeat family of middle-class New Englanders in Quahog, RI. Lois is Peter's wife, a stay-at-home mom with no patience for her family's antics. Then there are their kids: 18-year-old Meg is an outcast at school and the Griffin family punching bag; 13-year-old Chris is a socially awkward teen who doesn't have a clue about the opposite sex; and one-year-old Stewie is a diabolically clever baby whose burgeoning sexuality is very much a work in progress. Rounding out the Griffin household is Brian the family dog and a ladies' man who is one step away from AA.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/555/1388245.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/555/1388245.jpg",
    "videos": [
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      },
      {
        "id": "tvmaze:5556",
        "title": "Death Has a Shadow",
        "season": 1,
        "episode": 1,
        "released": "1999-01-31",
        "overview": "Peter ignores his wife's warning about a bachelor party. Voices include Seth MacFarlane, Alex Borstein, Seth Green and Phil LaMarr."
      },
      {
        "id": "tvmaze:5557",
        "title": "I Never Met the Dead Man",
        "season": 1,
        "episode": 2,
        "released": "1999-04-11",
        "overview": "Peter (voice of Seth MacFarlane) learns to live without TV when he crashes his car into a satellite dish. Meanwhile, Stewie devises a climate-control machine."
      },
      {
        "id": "tvmaze:5558",
        "title": "Chitty Chitty Death Bang",
        "season": 1,
        "episode": 3,
        "released": "1999-04-18",
        "overview": "The Griffins prepare for Stewie's first birthday party, but the precocious lad hatches a plan of his own."
      },
      {
        "id": "tvmaze:5559",
        "title": "Mind Over Murder",
        "season": 1,
        "episode": 4,
        "released": "1999-04-25",
        "overview": "Under house arrest, Peter builds a bar in the basement to have his friends over. And the joint is jumpin', much to Lois' dismay."
      },
      {
        "id": "tvmaze:5560",
        "title": "A Hero Sits Next Door",
        "season": 1,
        "episode": 5,
        "released": "1999-05-02",
        "overview": "When Peter's neighbor---an award-winning ballplayer and cop---makes him feel inadequate, Peter tries to become a hero."
      },
      {
        "id": "tvmaze:5561",
        "title": "The Son Also Draws",
        "season": 1,
        "episode": 6,
        "released": "1999-05-09",
        "overview": "On their way to New York, the Griffins take a wrong turn and end up at a Native American gambling casino, where luck proves to be no lady for Lois (voice of Alex Borstein). Comic Bobby Slayton provides the voice of a pit boss named Lenny."
      },
      {
        "id": "tvmaze:5562",
        "title": "Brian: Portrait of a Dog",
        "season": 1,
        "episode": 7,
        "released": "1999-05-16",
        "overview": "Brian leaves home after his refusal to perform during a dog show prompts a rift with Peter, who later sees Brian whisked away to the pound, where he's marked for death."
      },
      {
        "id": "tvmaze:5563",
        "title": "Peter, Peter, Caviar Eater",
        "season": 2,
        "episode": 1,
        "released": "1999-09-23",
        "overview": "The Griffins are movin' on up (to a Newport mansion, specifically), when Lois inherits a \"weekend house\" from a rich aunt. Robin Leach provides his own voice in a \"Lifestyles of the Rich and Famous\" spoof."
      },
      {
        "id": "tvmaze:5564",
        "title": "Holy Crap",
        "season": 2,
        "episode": 2,
        "released": "1999-09-30",
        "overview": "Peter's dour and devout 80-year-old father (voice of Charles Durning) moves in with the Griffins after he retires from the mill where he has worked for 50 years. He's a hellfire-and-damnation man, and he thinks family is heading south."
      },
      {
        "id": "tvmaze:5565",
        "title": "DaBoom",
        "season": 2,
        "episode": 3,
        "released": "1999-12-26",
        "overview": "The Griffins usher in the Millennium with a bang----a nuclear one. Victoria Principal and Patrick Duffy have cameos (as their \"Dallas\" characters Pam and Bobby Ewing) in a live-action coda to the program, in which every Y2K bug that can bite Quahog (and the rest of the world) does. But the Griffins survive and head off, \"Mad Max\"-like, on a sardonic odyssey through post-apocalyptic New England, where Griffin's Law prevails---until Peter shoots himself in the foot."
      },
      {
        "id": "tvmaze:5566",
        "title": "Brian in Love",
        "season": 2,
        "episode": 4,
        "released": "2000-03-07",
        "overview": "Brian is having \"accidents\" (on rugs and other places) and seeks out a therapist (voice of Sam Waterston) to find out why. The therapist's conclusion: Brian's in love. The object of his yearning: Lois."
      },
      {
        "id": "tvmaze:5567",
        "title": "Love Thy Trophy",
        "season": 2,
        "episode": 5,
        "released": "2000-03-14",
        "overview": "Peter and his neighbors enter a float in Quahog's annual Harvest Festival Parade. They win, but then the trophy turns up missing and the winners all suspect each other of stealing it. Meanwhile, Meg (voice of Lacey Chabert) needs $1100 for a purse, so she takes a waitress job, and takes Stewie with her---pretending that she's an unwed mother and Stewie is her crack baby."
      },
      {
        "id": "tvmaze:5568",
        "title": "Death is a Bitch",
        "season": 2,
        "episode": 6,
        "released": "2000-03-21",
        "overview": "Peter survives a health scare but gets a killer bill. So he writes \"deceased\" next to his name on a form---and is visited by the Grim Reaper himself. How, Peter wonders, did Death get the form? \"It was e-mailed to me by your HMO.\" But Death must take a forced holiday when he sprains his ankle chasing Peter, who has no desire to go gently into that good night."
      },
      {
        "id": "tvmaze:5569",
        "title": "The King is Dead",
        "season": 2,
        "episode": 7,
        "released": "2000-03-28",
        "overview": "Lois is named artistic director of the Quahog Players and makes Peter the producer of the troupe's upcoming show, \"The King and I.\" She had to find something for him to do---Peter was complaining about a lack of outlets for his \"creativity\" (and he certainly can't act)."
      },
      {
        "id": "tvmaze:5570",
        "title": "I Am Peter, Hear Me Roar",
        "season": 2,
        "episode": 8,
        "released": "2000-03-28",
        "overview": "Peter's sense of humor is no laughing matter to the woman who sues him for sexual harassment. He can escape the lawsuit, though---by attending a training session on workplace sensitivity. It's a chance for him to get in touch with his feminine side. Candice Bergen provides the voice of feminist lawyer Gloria Ironbachs."
      },
      {
        "id": "tvmaze:5571",
        "title": "If I'm Dyin' I'm Lyin'",
        "season": 2,
        "episode": 9,
        "released": "2000-04-04",
        "overview": "When Peter and Chris's favorite TV show, \"Gumbel 2 Gumbel,\" is canceled, Peter concocts a plan to get it uncanceled. He goes to the Grant-a-Dream Foundation and says that Chris is dying. His dream: bring back the Gumbels. It's granted, but Peter's \"white lie\" comes back to plague him."
      },
      {
        "id": "tvmaze:5572",
        "title": "Running Mates",
        "season": 2,
        "episode": 10,
        "released": "2000-04-11",
        "overview": "Peter and school-board candidate Lois have divergent views on an education issue, so Peter decides to run against her. The issue: a wacky old science teacher of Peter's is fired after the school's annual \"egg drop\" experiment because he had the kids drop California-condor eggs. Meanwhile, Chris gets into trouble at school for peeking into the girls' locker room."
      },
      {
        "id": "tvmaze:5573",
        "title": "A Picture's Worth a Thousand Bucks",
        "season": 2,
        "episode": 11,
        "released": "2000-04-18",
        "overview": "A New York art dealer sees a painting of Chris's and immediately christens \"Christobel\" as the next big thing in art. So the Griffins head for the Big Apple for the launch of his career. Candice Bergen, Faith Ford, Joe Regalbuto and Charles Kimbrough have cameos as their \"Murphy Brown\" characters."
      },
      {
        "id": "tvmaze:5574",
        "title": "Fifteen Minutes of Shame",
        "season": 2,
        "episode": 12,
        "released": "2000-04-25",
        "overview": "Everything Lois and Peter do seems to embarrass Meg, and now the Griffins are to be featured on a reality TV show. Not surprisingly, Meg is appalled. To make matters worse for her, the audience-research report comes in and she's the \"least popular.\""
      },
      {
        "id": "tvmaze:5575",
        "title": "Road to Rhode Island",
        "season": 2,
        "episode": 13,
        "released": "2000-05-30",
        "overview": "Hope and Crosby they're not, but Brian and Stewie do have some odd adventures when they bum their way across the country together after losing their plane tickets. In another plotline, Lois makes Peter watch a video designed to help couples communicate more effectively. Sam Waterston has a cameo as Brian's analyst. The topic: Brian's loss of his mother."
      },
      {
        "id": "tvmaze:5576",
        "title": "Let's Go to the Hop",
        "season": 2,
        "episode": 14,
        "released": "2000-06-06",
        "overview": "A psychedelic drug craze (licking Colombian toads) hits Quahog's teens, so Peter goes undercover at the high school to stop it, and ends up being the most popular guy in school. Scenes send up John Hughes movies and \"Grease.\""
      },
      {
        "id": "tvmaze:5577",
        "title": "Dammit Janet",
        "season": 2,
        "episode": 15,
        "released": "2000-06-13",
        "overview": "Lacking excitement in her life, Lois decides to get a job, and Peter steers her toward being a flight attendant (because husbands fly free). Elsewhere, Stewie is dispatched to a day-care center, where he promptly falls in love with a girl named Janet (voice of Tara Charendoff). This rattles him. \"I want absolutely nothing to do with the wretched enterprise,\" he declares, to no avail."
      },
      {
        "id": "tvmaze:5578",
        "title": "There's Something About Paulie",
        "season": 2,
        "episode": 16,
        "released": "2000-06-27",
        "overview": "Peter finds himself tied to the mob after he buys a car that turns out to be a lemon, and a wiseguy (voice of Jon Cryer) offers lemon aid. Other guest voices include Michael Chiklis (Big Fat Paulie) and Alan King (the Don)."
      },
      {
        "id": "tvmaze:5579",
        "title": "He's Too Sexy for His Fat",
        "season": 2,
        "episode": 17,
        "released": "2000-06-27",
        "overview": "Tired of being overweight, Chris (voice of Seth Green) decides to diet and exercise. That doesn't work, but there's always liposuction and plastic surgery---if not for Chris, then for another Griffin man (Peter---the one with the fat head)."
      },
      {
        "id": "tvmaze:5580",
        "title": "E. Peterbus Unum",
        "season": 2,
        "episode": 18,
        "released": "2000-07-12",
        "overview": "When Peter goes to City Hall for a pool permit, he discovers that the Griffin house is not located in Quahog---or even in the U.S. And so a new nation---Petoria---is born. Not surprisingly, Peter (voice of series creator Seth MacFarlane) proves to be a saber-rattler, and that leads to a cooling in U.S.-Petorian relations."
      },
      {
        "id": "tvmaze:5581",
        "title": "The Story on Page One",
        "season": 2,
        "episode": 19,
        "released": "2000-07-18",
        "overview": "Luke Perry (who provides his own voice) is the subject of Meg's journalistic excess. Actually, it's Peter's: he writes an article \"outing\" Perry (with no evidence whatsoever), puts Meg's name on it and submits it to her school newspaper."
      },
      {
        "id": "tvmaze:5582",
        "title": "Wasted Talent",
        "season": 2,
        "episode": 20,
        "released": "2000-07-25",
        "overview": "The men of Quahog drink themselves into stupors trying to win a contest sponsored by the mysterious brewer Pawtucket Pete. The prize: a tour of his near-mystical brewery (and a lifetime supply of beer). Meanwhile, Lois (voice of Alex Bornstein), a frustrated pianist who competes vicariously through the students she teaches, finds one with real promise just before a big competition."
      },
      {
        "id": "tvmaze:5583",
        "title": "Fore, Father",
        "season": 2,
        "episode": 21,
        "released": "2000-08-01",
        "overview": "Chris takes up with Quagmire when he feels neglected by Peter, who coaches Cleveland Jr. to play with him in a golf tournament."
      },
      {
        "id": "tvmaze:5584",
        "title": "The Thin White Line",
        "season": 3,
        "episode": 1,
        "released": "2001-07-11",
        "overview": "Family dog Brian is \"in a rut\" so he tries volunteerism, then takes a job as a dope-sniffing narc for the Quahog P.D. Trouble is, he likes what he sniffs a bit too much."
      },
      {
        "id": "tvmaze:5585",
        "title": "Brian Does Hollywood",
        "season": 3,
        "episode": 2,
        "released": "2001-07-18",
        "overview": "Brian heads to Hollywood to be screenwriter and the others follow when Stewie is chosen to be on \"Kids Say the Darndest Things.\" Stewie doesn't exactly hit it off with host Bill Cosby but Brian does make his mark in show business, if not in the way he had intended (as a porn \"auteur\")."
      },
      {
        "id": "tvmaze:5586",
        "title": "Mr. Griffin Goes to Washington",
        "season": 3,
        "episode": 3,
        "released": "2001-07-25",
        "overview": "A conglomerate buys Happy Go Lucky Toys and installs Peter (voice of series creator Seth McFarlane) as president. The conglomerate also owns a tobacco company, and before long Peter is on his way to Washington to testify before Congress on the benefits of smoking."
      },
      {
        "id": "tvmaze:5587",
        "title": "One If by Clam, Two If by Sea",
        "season": 3,
        "episode": 4,
        "released": "2001-08-01",
        "overview": "Peter and his pals catch a beer-besotted version of the \"Spirit of '76\" when a Brit buys the Drunken Clam and turns it into an English pub. As it happens, pub owner Nigel Pinchley (voice of series creator Seth MacFarlane) and his family move in next door to the Griffins, and Stewie (also voiced by MacFarlane) plays 'Enry 'Iggins to Nigel's Cockney-accented 3-year-old daughter."
      },
      {
        "id": "tvmaze:5588",
        "title": "And the Wiener is...",
        "season": 3,
        "episode": 5,
        "released": "2001-08-08",
        "overview": "Meg makes the flag-girl squad at James Woods High. That's \"almost a cheerleader,\" she boasts, but it doesn't impress the cool kids. Meanwhile, Peter (voice of series creator Seth MacFarlane) develops a severe case of Chris-envy."
      },
      {
        "id": "tvmaze:5589",
        "title": "Death Lives",
        "season": 3,
        "episode": 6,
        "released": "2001-08-15",
        "overview": "Peter pays a price when he plays golf on his anniversary---he's struck by lightning. Adam Carolla provides the voice of the Grim Reaper, who guides Peter through his \"near death experience,\" which leads to a \"revelation\" concerning Lois. Also, Peter offers the Reaper dating tips."
      },
      {
        "id": "tvmaze:5590",
        "title": "Lethal Weapons",
        "season": 3,
        "episode": 7,
        "released": "2001-08-22",
        "overview": "With a few tae-jitsu lessons under her black belt, Lois (voice of Alex Borstein) turns herself into Quahog's answer to Xena, cutting a wide swath through the hordes of obnoxious leaf-peeping tourists from New York. But soon her violent ways begin to hit home."
      },
      {
        "id": "tvmaze:5591",
        "title": "The Kiss Seen Around the World",
        "season": 3,
        "episode": 8,
        "released": "2001-08-29",
        "overview": "Meg (voice of Mila Kunis) gets an internship at a TV station. It's a dream job...because she thinks the station's male anchor is dreamy. But it turns nightmarish when the station's other intern, \"the biggest dork on the planet,\" gets a crush on her. Meanwhile, a bully steals Stewie's tricycle."
      },
      {
        "id": "tvmaze:5592",
        "title": "Mr. Saturday Knight",
        "season": 3,
        "episode": 9,
        "released": "2001-09-05",
        "overview": "Peter's boss, Mr. Weed, dies suddenly (at the Griffins' house, as it happens), and the toy factory dies with him. Not surprisingly, Peter's \"career transition\" is less than smooth. Then he decides to follow his 25-year-old dream and become a jouster at Quahog's Renaissance Faire."
      },
      {
        "id": "tvmaze:5593",
        "title": "Fish Out of Water",
        "season": 3,
        "episode": 10,
        "released": "2001-09-19",
        "overview": "A jobless Peter decides on a line of work fit for \"a real New England man\": He becomes a fisherman. But there's something fishy about the bank that finances his boat. Meanwhile, Meg and Lois do some serious spring-break partying (Lois does, anyway) at Rhode Island's Narragansett Beach."
      },
      {
        "id": "tvmaze:5594",
        "title": "Emission Impossible",
        "season": 3,
        "episode": 11,
        "released": "2001-11-08",
        "overview": "After Peter helps deliver Lois's sister's baby, he and Lois decide to try to have another kid, but Stewie will attempt to foil their new plan."
      },
      {
        "id": "tvmaze:5595",
        "title": "To Love and Die in Dixie",
        "season": 3,
        "episode": 12,
        "released": "2001-11-15",
        "overview": "Waylon Jennings has a voice cameo in an episode in which the Griffins discover Southern hospitality---courtesy of the Witness Protection Program. They're in hiding because the convenience-store thief Chris fingers escapes from jail and vows revenge. But should he track Chris (voice of Seth Green) down, he'll have to contend with Sheriff Peter Griffin (series creator Seth MacFarlane)."
      },
      {
        "id": "tvmaze:5596",
        "title": "Screwed the Pooch",
        "season": 3,
        "episode": 13,
        "released": "2001-11-29",
        "overview": "Peter can't stop trying to impress Lois's father, Mr. Pewterschmidt, and Brian can't take his eye off Pewterschmidt's racing grayhound. Bob Barker has a voice cameo as himself. Series creator Seth MacFarlane provides the voices of Peter, Brian, Pewterschmidt, Bill Gates, an ape and a cockroach."
      },
      {
        "id": "tvmaze:5597",
        "title": "Peter Griffin: Husband, Father...Brother?",
        "season": 3,
        "episode": 14,
        "released": "2001-12-06",
        "overview": "When Chris adopts hip-hop speech, Peter (who can't understand a word he's saying) decides to teach his son about his roots. He makes a startling discovery. Meanwhile, Stewie becomes enchanted with the Buddy Cianci Junior High cheerleaders."
      },
      {
        "id": "tvmaze:5598",
        "title": "Ready, Willing, and Disabled",
        "season": 3,
        "episode": 15,
        "released": "2001-12-20",
        "overview": "Joe, Quahog's disabled cop, is depressed after failing to nab a perp, so Peter suggests he compete in the Special People's Games as a confidence booster. His event: the decathlon. His competition: \"a trash-talking quadriplegic\" (voice of series creator Seth MacFarlane). Tony Danza and Valerie Bertinelli have voice cameos as actors playing Joe and his wife, Bonnie, in a movie."
      },
      {
        "id": "tvmaze:5599",
        "title": "A Very Special Family Guy Freakin' Christmas",
        "season": 3,
        "episode": 16,
        "released": "2001-12-21",
        "overview": "It may be the season, but Peter's anything but merry when holiday preparations prevent him from watching his favorite Christmas special, \"KISS Saves Santa.\" And soon the family experiences the same lack of spirit when they're compelled to do last-minute shopping. Members of KISS provide their own voices."
      },
      {
        "id": "tvmaze:5600",
        "title": "Brian Wallows and Peter's Swallows",
        "season": 3,
        "episode": 17,
        "released": "2002-01-17",
        "overview": "Brian, depressed over bad luck in love, is convicted of DUI and sentenced to care for an ornery old woman whose past comes to the attention of celebrity watcher A.J. Benza. Meanwhile, Peter grows a beard, which displeases Lois (who isn't alone in thinking that it's for the birds)."
      },
      {
        "id": "tvmaze:5601",
        "title": "From Method to Madness",
        "season": 3,
        "episode": 18,
        "released": "2002-01-24",
        "overview": "Stewie displays some show-business talent---as long as he's paired with a girl he despises; Meg develops a crush on a teenage nudist. Fred Willard has a voice cameo as the boy's father (who's also a nudist)."
      },
      {
        "id": "tvmaze:5602",
        "title": "Stuck Together, Torn Apart",
        "season": 3,
        "episode": 19,
        "released": "2002-01-31",
        "overview": "Lois runs into an old male friend from school and they renew their friendship. When Peter finds out, he gets jealous, to say the least. Meanwhile, Brian and Stewie get themselves stuck together with industrial-strength glue. Jennifer Love Hewitt has a voice cameo as herself."
      },
      {
        "id": "tvmaze:5603",
        "title": "Road to Europe",
        "season": 3,
        "episode": 20,
        "released": "2002-02-07",
        "overview": "Brian and Stewie stow away on a plane they think is bound for England. They're wrong, and soon they're in Saudi Arabia, at the beginning of a long, strange trip back home. Meanwhile, back in the U.S., Peter and Lois have an odd encounter with KISS."
      },
      {
        "id": "tvmaze:5604",
        "title": "Family Guy Viewer Mail (1)",
        "season": 3,
        "episode": 21,
        "released": "2002-02-14",
        "overview": "Three mini-episodes. In the first, a genie grants Peter three wishes and he ends up being propositioned by Catherine Zeta-Jones (voice of Alex Borstein). Then, exposure to toxic waste gives the Griffins super powers (one per Griffin). Finally, in flashbacks, L'il Peter braves a haunted house (for awhile) to impress L'il Lois."
      },
      {
        "id": "tvmaze:5605",
        "title": "When You Wish Upon a Weinstein",
        "season": 3,
        "episode": 22,
        "released": "2004-12-10",
        "overview": "The day that Peter buys volcano insurance is the day that Lois becomes fed up with their constant money problems. When Peter wishes for a Jewish \"money guy\" to help them, Max Weinstein comes to the rescue. After meeting Max, Peter decides Chris could be successful if he converted to Judaism as soon as possible, but the plans for a \"quickie\" bar mitzvah in Las Vegas are quickly foiled by Lois."
      },
      {
        "id": "tvmaze:5606",
        "title": "North by North Quahog",
        "season": 4,
        "episode": 1,
        "released": "2005-05-01",
        "overview": "Peter decides to take Lois on a second honeymoon. But when things go awry, they end up posing as a famous actor/director to stay in his fancy hotel suite, where they inadvertently discover a copy of \"The Passion of the Christ 2: Crucify This.\" Peter and Lois attempt to destroy the film and end up in a high-speed chase with two Catholic priests hell-bent on saving the movie."
      },
      {
        "id": "tvmaze:5607",
        "title": "Fast Times at Buddy Cianci Jr. High",
        "season": 4,
        "episode": 2,
        "released": "2005-05-08",
        "overview": "When Chris' teacher wins the lotto and quits, Brian fills in as the substitute. All's well until Brian is moved to another class where he must teach troubled kids to aim low. Meanwhile, Chris is instantly smitten with his new teacher, Mrs. Lockhart, who promises to be with him if he kills her husband. But when Lois finds the teacher's written instructions in Chris' laundry, she and Stewie conspire together to find answers and teach Chris a lesson."
      },
      {
        "id": "tvmaze:5608",
        "title": "Blind Ambition",
        "season": 4,
        "episode": 3,
        "released": "2005-05-15",
        "overview": "Peter becomes jealous of his friends' achievements - Mort bowls a perfect game, Joe gets a guilty Quagmire off on unsavory charges and Quagmire accidentally saves a woman's life - so he decides to break a Guinness record to achieve something that he will be remembered for after he dies. After accidentally blinding himself, Peter wanders into the Drunken Clam while it's on fire and unknowingly saves Horace from the flames, becoming a local hero."
      },
      {
        "id": "tvmaze:5609",
        "title": "Don't Make Me Over",
        "season": 4,
        "episode": 4,
        "released": "2005-06-05",
        "overview": "When Meg asks a cute boy at school on a date and he turns her down, she looks to her family for support. In an effort to cheer her up, Lois takes Meg to the mall, where she gets the ultimate makeover. Meanwhile, Peter tries to start a band with the guys, but it's Meg's new look that has the record producers singing their praises. So the Griffins form a traveling family band that takes them all the way to New York to perform on \"Saturday Night Live\"."
      },
      {
        "id": "tvmaze:5610",
        "title": "The Cleveland-Loretta Quagmire",
        "season": 4,
        "episode": 5,
        "released": "2005-06-12",
        "overview": "When Peter hears screams coming from Cleveland and Loretta's house, he tries to help but discovers Loretta in a compromising position. Peter identifies the other man as Quagmire and decides to tell Cleveland of his wife's extracurricular activities. But when Loretta walks out on Cleveland he doesn't take it lying down."
      },
      {
        "id": "tvmaze:5611",
        "title": "Petarded",
        "season": 4,
        "episode": 6,
        "released": "2005-06-19",
        "overview": "At a game night among friends, Lois lets Peter win at Trivial Pursuit, which leads Peter to gloat and think he's a genius. Brian knows the truth and challenges Peter to prove his intelligence by getting an IQ test. But when the test results determine Peter is legally mentally challenged, everyone ends up looking stupid."
      },
      {
        "id": "tvmaze:5612",
        "title": "Brian the Bachelor",
        "season": 4,
        "episode": 7,
        "released": "2005-06-26",
        "overview": "When \"The Bachelorette\" comes to Quahog, they recruit Brian to be a contestant. He signs up for the free martinis and food, but ends up falling in love with the reality starlet, Brooke. Brian wins her heart - and the final rose - but when the cameras are turned off, this romance made in TV heaven takes a turn for the worse. Meanwhile, Chris gets a horrible case of acne."
      },
      {
        "id": "tvmaze:5613",
        "title": "8 Simple Rules for Buying My Teenage Daughter",
        "season": 4,
        "episode": 8,
        "released": "2005-07-10",
        "overview": "When Peter runs up a tab at the local pharmacy, the only way out of paying the bill is to sell Meg to the owner's son, Neil, who has been stalking her for months. But when Neil starts dating another girl, Meg becomes jealous and goes on the hunt to find a boyfriend of her own. Meanwhile, Stewie goes gaga over his hot new babysitter, Liddane."
      },
      {
        "id": "tvmaze:5614",
        "title": "Breaking Out is Hard to Do",
        "season": 4,
        "episode": 9,
        "released": "2005-07-17",
        "overview": "When Lois is short on cash and can't pay her grocery store bill, she resorts to stealing. The adrenaline rush from shoplifting sends her on a stealing spree that spirals out of control and leaves her behind bars. Back at home, the family is a mess without Lois, so Peter and the kids decide to break her out of the clinker to get things back to normal."
      },
      {
        "id": "tvmaze:5615",
        "title": "Model Misbehavior",
        "season": 4,
        "episode": 10,
        "released": "2005-07-24",
        "overview": "When the Griffins visit Lois' parents, Lois realizes that her father prevented her from fulfilling her lifelong dream of becoming a model, so she returns to Quahog and hits the catwalk. Lois is an instant hit, but the glamorous world goes to her head and Peter has to step in to get her back on track. Meanwhile, Stewie starts a pyramid scheme business and hires Brian as his assistant."
      },
      {
        "id": "tvmaze:5616",
        "title": "Peter's Got Woods",
        "season": 4,
        "episode": 11,
        "released": "2005-09-11",
        "overview": "When Brian attends a PTA meeting, he meets Meg's high school teacher and starts to date her. This new relationship puts a strain on Peter and Brian's friendship, so Peter finds solace in new best friend, James Woods. Meanwhile, -The Da Vinci Code- leaves Stewie unable to sleep ."
      },
      {
        "id": "tvmaze:5617",
        "title": "The Perfect Castaway",
        "season": 4,
        "episode": 12,
        "released": "2005-09-18",
        "overview": "When Peter and the guys go on a fishing trip, they end up in choppy waters that leave them stranded on a desert island. Months later, the guys are rescued from the island and Peter returns home to discover the new man of the house has a bark that's worse than his bite."
      },
      {
        "id": "tvmaze:5618",
        "title": "Jungle Love",
        "season": 4,
        "episode": 13,
        "released": "2005-09-25",
        "overview": "When Chris discovers he'll be hazed as part of a high school ritual, he runs away to South America, where he assimilates to the uncivilized, tribal culture. Meanwhile, Peter is forced to look for a job, but after several failed attempts he decides he's tired of starting at the bottom of the ladder. While Peter visits Chris in the South American jungle, tribal members treat him like a god, but both Peter and Chris learn that they can't run away from their problems forever."
      },
      {
        "id": "tvmaze:5619",
        "title": "PTV",
        "season": 4,
        "episode": 14,
        "released": "2005-11-06",
        "overview": "After a controversial mishap occurs during a live broadcast, the FCC begins to censor all of Peter's favorite television shows. Peter retaliates by creating his own TV station - PTV - which he operates out of the Griffin home. Peter and Brian create some edgy hits for the station, until the FCC shows up and starts to regulate their everyday life."
      },
      {
        "id": "tvmaze:5620",
        "title": "Brian Goes Back to College",
        "season": 4,
        "episode": 15,
        "released": "2005-11-13",
        "overview": "After writing a story for a local magazine, Brian lands a job with the prestigious New Yorker. However, his college dropout status haunts him so he decides to go back to Brown University to get his degree. As Brian struggles to pass his class, Stewie enjoys the college lifestyle. Meanwhile, Peter and his friends combine forces to help the city."
      },
      {
        "id": "tvmaze:5621",
        "title": "The Courtship of Stewie's Father",
        "season": 4,
        "episode": 16,
        "released": "2005-11-20",
        "overview": "When Stewie intensifies his efforts to kill Lois, she thinks he is acting out and orders Peter to spend more time with him. They begin to do some bonding until a theme park outing ends disastrously. Meanwhile, Chris does some bonding of his own when he develops a friendship with Herbert after breaking his window."
      },
      {
        "id": "tvmaze:5622",
        "title": "The Fat Guy Strangler",
        "season": 4,
        "episode": 17,
        "released": "2005-11-27",
        "overview": "When Lois drags Peter to the doctor for a physical, his prognosis is clear: he's too fat. This news drives Peter to form the NAAFP, an advocacy group for the advancement of fat people. Meanwhile, Lois discovers her long-lost brother, Patrick, and fights to get him released from an insane asylum. But a string of fat guys go missing soon after, and Peter and the NAAFP ban together to get to the bottom of it."
      },
      {
        "id": "tvmaze:5623",
        "title": "The Father, The Son and the Holy Fonz",
        "season": 4,
        "episode": 18,
        "released": "2005-12-18",
        "overview": "When Peter's dad visits the Griffins, he tries to impose his religious beliefs on the family. But after a mishap leaves Stewie stuck living in a bubble, Peter searches for a new religion finding faith in his television hero the Fonz. But -Happy Days- are not quite here as the newly established Church of the Fonz struggles to retain its members."
      },
      {
        "id": "tvmaze:5624",
        "title": "Brian Sings and Swings",
        "season": 4,
        "episode": 19,
        "released": "2006-01-08",
        "overview": "After an accident lands Brian in the hospital, he has a near-death experience that leads him to take a new lease on life. He finds a passion for singing and develops a new nightly gig with Frank Sinatra Jr., but his \"live in the moment\" lifestyle only goes so far. Meanwhile, Meg's sexuality swings the other way."
      },
      {
        "id": "tvmaze:5625",
        "title": "Patriot Games",
        "season": 4,
        "episode": 20,
        "released": "2006-01-29",
        "overview": "At his high school reunion, Peter pretends to be a big-shot millionaire to impress his classmates, but the truth comes out when he meets Tom Brady and loses all self-control. Peter makes a drunken run for the bathroom that impresses Brady and lands Peter a spot on the New England Patriots football team. Life is great for the Griffins until Peter's new high profile goes to his head. Meanwhile, Stewie becomes a sports bookie ."
      },
      {
        "id": "tvmaze:5626",
        "title": "I Take Thee, Quagmire",
        "season": 4,
        "episode": 21,
        "released": "2006-03-12",
        "overview": "When Peter goes on a television game show and wins a maid for a week, Quagmire becomes smitten with her and ends up popping the question. But when Quagmire's bachelor tendencies resurface, he takes some serious steps to get out of the marriage. Meanwhile, Stewie fights against breast-feeding withdrawals when Lois tries to wean him."
      },
      {
        "id": "tvmaze:5627",
        "title": "Sibling Rivalry",
        "season": 4,
        "episode": 22,
        "released": "2006-03-26",
        "overview": "After a pregnancy scare, Peter reluctantly agrees to get a vasectomy. But after the operation, Peter's sex drive becomes nonexistent. When Lois packs on some extra pounds, Peter's interest is renewed and things heat back up in the bedroom until her unhealthy eating habits get the best of her. Meanwhile, Stewie's half-brother and archrival Beltram confronts him and they declare an all-out war for control over the playground."
      },
      {
        "id": "tvmaze:5628",
        "title": "Deep Throats",
        "season": 4,
        "episode": 23,
        "released": "2006-04-09",
        "overview": "When Meg lands an internship with Mayor West, Brian argues that he's corrupt. Determined to expose his shady ways, Brian and Stewie go undercover and discover that Meg is in deeper than they thought. Meanwhile, a local talent show brings Peter and Lois back to their folk singing days. Unfortunately, they also revert back to their hippie ways and Chris must stage an intervention."
      },
      {
        "id": "tvmaze:5629",
        "title": "Peterotica",
        "season": 4,
        "episode": 24,
        "released": "2006-04-23",
        "overview": "After reading an erotic novel, Peter decides to write one of his own and gets Carter to publish it. But when Carter gets sued for Peter's book on tape, he loses all his money and is forced to become a middle-class citizen, much to his chagrin. Meanwhile, with the flick of a switch, Chris becomes a genius and competes with Stewie to take over the world."
      },
      {
        "id": "tvmaze:5630",
        "title": "You May Now Kiss The...Uh...Guy Who Receives",
        "season": 4,
        "episode": 25,
        "released": "2006-04-30",
        "overview": "While visiting the Griffins, Brian's gay cousin Jasper announces he's engaged to his partner and wants to be married in their home. But when Mayor West bans gay marriage in Quahog to cover up an unrelated scandal, Brian becomes a crazed activist and resorts to hostile ways to change the mayor's decision. Meanwhile, Lois questions her view toward gay marriage and Chris joins the extremist \"Young Republicans\" group to win a girl's heart."
      },
      {
        "id": "tvmaze:5631",
        "title": "Petergeist",
        "season": 4,
        "episode": 26,
        "released": "2006-05-07",
        "overview": "After Joe builds a new home theater system, Peter tries to top it by building a multiplex in his backyard and discovers an Indian burial ground. But when he takes an Indian chief's skull, the house becomes haunted and Stewie pulls a \"Carol Anne\" and gets sucked into the television. Unfortunately for the Griffins, getting Stewie back from the poltergeist is just the beginning."
      },
      {
        "id": "tvmaze:5632",
        "title": "Untitled Griffin Family History",
        "season": 4,
        "episode": 27,
        "released": "2006-05-14",
        "overview": "When the Griffins get robbed, the family runs into Peter's panic room to escape the trespassers. Now isolated and trapped, Peter insists the family know about their ancestry and narrates a chain of events in world history that explain the Griffin name. Meanwhile, after Meg is chosen to go back into the house, she scares off the robbers in an unexpected way."
      },
      {
        "id": "tvmaze:5633",
        "title": "Stewie B. Goode",
        "season": 4,
        "episode": 28,
        "released": "2006-05-21",
        "overview": "After a competitive swim lesson, Stewie tries to destroy his rival by blowing up the lifeguard tower. But when his plan backfires and he has a near-death experience, Stewie turns to the bottle to numb himself. A bizarre chain of events leads Stewie and Brian on a road trip to San Francisco, where Stewie confronts a guy he believes is his real father. But when it turns out he's actually Stewie in the future, Stewie gets a glimpse of his dismal adult life and realizes he must return to his own time and rewrite history. Meanwhile, Peter's rants on everyday irritations become a new hit segment on the Quahog Nightly News."
      },
      {
        "id": "tvmaze:5634",
        "title": "Bango Was His Name Oh!",
        "season": 4,
        "episode": 29,
        "released": "2006-05-21",
        "overview": "California, here they come---Stewie and Brian head to San Francisco in Quagmire's van to search for the man Stewie's convinced is his real father. Meanwhile, Lois and Peter \"help\" Chris and Meg with their dating skills to get them out of the house."
      },
      {
        "id": "tvmaze:5635",
        "title": "Stu & Stewie's Excellent Adventure",
        "season": 4,
        "episode": 30,
        "released": "2006-05-21",
        "overview": "Stewie travels 35 years into the future and doesn't like what he finds: himself, who's known as Stu as an adult. So Stewie goes about remaking Stu's life, despite Stu's objections."
      },
      {
        "id": "tvmaze:5636",
        "title": "Stewie Loves Lois",
        "season": 5,
        "episode": 1,
        "released": "2006-09-10",
        "overview": "After Lois saves Stewie's beloved teddy bear, Rupert, he starts to think that maybe he shouldn't kill his dear old mom and clings to her like a baby blanket. However, Stewie's change in demeanor doesn't go over well with Lois and she gets sick of all of his loving attention. Meanwhile, Peter undergoes a prostate exam and thinks his doctor is molesting him."
      },
      {
        "id": "tvmaze:5637",
        "title": "Mother Tucker",
        "season": 5,
        "episode": 2,
        "released": "2006-09-17",
        "overview": "When Peter's mother announces that she is getting a divorce, Peter feels abandoned until he finds a father figure in his mom's new boyfriend, Quahog's resident anchor man, Tom Tucker. Peter takes such an interest in Tom that he reverts to being a child again, but things aren't all fun and games for long. Meanwhile, Brian gets his own NPR-style radio show, but when Stewie hears the news, he can't help but stir things up."
      },
      {
        "id": "tvmaze:5638",
        "title": "Hell Comes to Quahog",
        "season": 5,
        "episode": 3,
        "released": "2006-09-24",
        "overview": "After Peter buys a military tank with Meg's money, her car fund goes out the window and she's forced to get a job at the newly built Superstore in town. However, the town's economy begins to suffer when Superstore puts all the mom-and-pop shops out of business and sucks up the city's power supply. Brian and Stewie decide to take matters into their own hands in order to save the town from the corporate giant."
      },
      {
        "id": "tvmaze:5639",
        "title": "Saving Private Brian",
        "season": 5,
        "episode": 4,
        "released": "2006-11-05",
        "overview": "After Chris is approached by an Army recruiter, Brian goes to the headquarters to give him a piece of his mind, but Stewie tags along and gets them both enlisted in boot camp. The two make it through training with no help from Sergeant Angryman and end up in Iraq, where they try everything possible to get an honorable discharge. Meanwhile, at home base, Chris joins a Goth rock band and their hit track is -Evil, Evil Monkey-."
      },
      {
        "id": "tvmaze:5640",
        "title": "Whistle While Your Wife Works",
        "season": 5,
        "episode": 5,
        "released": "2006-11-12",
        "overview": "When Peter hurts his hand and his boss Angela tells him he needs to pick up the pace, Lois goes to the brewery and helps him play catch-up. Meanwhile, when Stewie discovers that Brian is dating a very attractive but intellectually challenged girl named Jillian, he tries to convince Brian to break up with her, but Brian can't close the deal because she is so hot."
      },
      {
        "id": "tvmaze:5641",
        "title": "Prick Up Your Ears",
        "season": 5,
        "episode": 6,
        "released": "2006-11-19",
        "overview": "When Lois discovers that Chris has some bad information about sex, she volunteers to teach a sex-ed class at the high school. After Lois upsets the other parents with her honest approach, Principal Shepherd is forced to replace her with Reverend Jerry Kirkwood. Meanwhile, Meg and her new guy take an abstinence pledge, but still manage to find a loophole. And a terrified Stewie sets a series of traps for the Tooth Fairy, hell-bent on destroying him."
      },
      {
        "id": "tvmaze:5642",
        "title": "Chick Cancer",
        "season": 5,
        "episode": 7,
        "released": "2006-11-26",
        "overview": "Stewie ties the knot with his old friend and fading child actress Olivia, but their relationship quickly turns into a traditional marriage filled with resentment and bickering, which comes to an ugly head when they join Brian and Jillian on a double date. Meanwhile, Lois introduces Peter to chick flicks, and he decides to make his own movie based on the plots of every girly movie ever made."
      },
      {
        "id": "tvmaze:5643",
        "title": "Barely Legal",
        "season": 5,
        "episode": 8,
        "released": "2006-12-17",
        "overview": "When Meg can't find a date to her junior prom, Brian gets suckered into going with her, even though he is dating Jillian. When Brian arrives at the dance he gets drunk to ease his pain, but after he makes out with Meg he really hurts. The next morning Meg starts to think of Brian as her boyfriend and becomes obsessed with spending every waking moment with him. Meanwhile, Peter, Cleveland and Quagmire join the police force and have to come to Brian's aid."
      },
      {
        "id": "tvmaze:5644",
        "title": "Road to Rupert",
        "season": 5,
        "episode": 9,
        "released": "2007-01-28",
        "overview": "When the family has a garage sale, Brian accidentally sells Stewie's beloved teddy bear Rupert. Stewie is so distraught that Brian takes him on a cross-country road trip to Aspen, CO. When they find the culprit, Stanford, Stewie challenges him to a ski-off to get Rupert back. Meanwhile, Peter loses his license, so Meg has to drive him around."
      },
      {
        "id": "tvmaze:5645",
        "title": "Peter's Two Dads",
        "season": 5,
        "episode": 10,
        "released": "2007-02-11",
        "overview": "After Peter's dad, Francis, dies, he finds out from Thelma that his real father lives in Ireland. So Peter and Brian head there in search of his father, who ends up being the town drunk, which is a great honor, and he challenges him to a drinking game to prove his paternity. Meanwhile, Stewie acts out and Lois spanks him, but he quickly realizes that he likes it and does whatever he can to get into trouble."
      },
      {
        "id": "tvmaze:5646",
        "title": "The Tan Aquatic with Steve Zissou",
        "season": 5,
        "episode": 11,
        "released": "2007-02-18",
        "overview": "When a bully begins to harass Chris, Peter goes to his defense, but the kid is so annoying that Peter beats him up. This is so satisfying that Peter realizes bullying is fun and begins to bully everyone in the house. Finally, Chris stands up to Peter and beats him senseless. Meanwhile, Stewie goes out without sunscreen and becomes obsessed with getting a tan. After Brian accidentally leaves him in the tanning booth for six hours, Stewie gets sunburned and fears he has cancer. While waiting for the results of his cancer screening, Stewie begins to live his life as if he had only days to live and drives Brian crazy with his demands."
      },
      {
        "id": "tvmaze:5647",
        "title": "Airport '07",
        "season": 5,
        "episode": 12,
        "released": "2007-03-04",
        "overview": "Peter takes Quagmire to the airport for work and messes things up, causing Quagmire to lose his job as a pilot. Quagmire can't find another gig, so Peter and Cleveland devise a plan to help him get his old job back. When the plan flops, Quagmire receives advice from his idol, Hugh Hefner, which leads him to save the day."
      },
      {
        "id": "tvmaze:5648",
        "title": "Bill and Peter's Bogus Adventure",
        "season": 5,
        "episode": 13,
        "released": "2007-03-11",
        "overview": "After Peter helps Bill Clinton out with a flat tire, they become fast friends. They begin spending a lot of time together and Lois starts to think Bill is a bad influence. But when she confronts Bill, they end up having sex. Peter is devastated and tries to get back at Lois but finds he loves her too much to go through with having an affair. Meanwhile, Lois and Stewie try to potty-train Brian."
      },
      {
        "id": "tvmaze:5649",
        "title": "No Meals on Wheels",
        "season": 5,
        "episode": 14,
        "released": "2007-03-25",
        "overview": "When the Griffin family decides to start a restaurant, they have a hard time attracting customers. But after Joe promises to help, Peter is excited that it might become a cop hangout. However, things don't really turn out as Peter had hoped and it begins to be popular with handicapped patrons. Although Peter attempts to change the atmosphere of his new place, a sudden twist of irony quickly changes his mind."
      },
      {
        "id": "tvmaze:5650",
        "title": "Boys Do Cry",
        "season": 5,
        "episode": 15,
        "released": "2007-04-29",
        "overview": "The family heads to church when Lois gets a gig as the organist, but after Stewie gets sick the congregation is convinced he's possessed by the devil. So, the family goes on the run and ends up in Texas. Peter fits right in with the cowboys, Stewie enters the \"Little Miss Texas\" pageant and Chris and Meg sneak into George W. Bush's house."
      },
      {
        "id": "tvmaze:5651",
        "title": "No Chris Left Behind",
        "season": 5,
        "episode": 16,
        "released": "2007-05-06",
        "overview": "After Chris is expelled from public school, he's sent to the same snooty boarding school that Lois' dad attended. Meanwhile, a chicken picks a fight with Peter."
      },
      {
        "id": "tvmaze:5652",
        "title": "It Takes a Village Idiot, and I Married One",
        "season": 5,
        "episode": 17,
        "released": "2007-05-13",
        "overview": "Incensed by Mayor West's complicity in oil-company pollution at Quahog Lake, Lois decides to challenge him in the upcoming election."
      },
      {
        "id": "tvmaze:5653",
        "title": "Meet the Quagmires",
        "season": 5,
        "episode": 18,
        "released": "2007-05-20",
        "overview": "Death grants Peter's wish of going back in time to be 18 again just for one night so that he can sow his wild oats. In 1984, he bails on a date with Lois to go to a bar and make out with a movie actress, but when he returns to the present, he discovers that he is now married to the former starlet and Lois is with Quagmire. Meanwhile, Stewie, Chris and Meg have all inherited Quagmire's charming characteristics."
      },
      {
        "id": "tvmaze:5654",
        "title": "Blue Harvest",
        "season": 6,
        "episode": 1,
        "released": "2007-09-23",
        "overview": "When the power goes out in the Griffin home, Peter decides to educate his family and pass along the greatest story ever told- the story of Star Wars! After Princess Leia comes under siege by Darth Vader and his evil Storm Troopers, C-3PO and R2-D2 escape to find the only person who can help the Rebel Alliance. On their quest thorough the desert planet of Tatooine, C-3PO and R-2D2 find extra help in Obi-Wan Kenobi, Luke Skywalker, Han Solo and Chewbacca and head back to battle the Death Star in an epic intergalactic fight to the death."
      },
      {
        "id": "tvmaze:5655",
        "title": "Movin' Out",
        "season": 6,
        "episode": 2,
        "released": "2007-09-30",
        "overview": "When Peter convinces Brian to move in with his dense girlfriend Jillian, she ends up smothering him, but he keeps her around for the lovin'. Stewie moves in with them to help pay the rent, but he tries to get Brian back on the playing field by throwing him a drunken party and interfering with their relationship. Meanwhile, Meg gets a job at the local convenience store, as does Chris, who gets chummy with the manager, Carl. While Chris and Carl talk about their favorite movies, Meg is saddled with all the hard work. She eventually stands up for herself and as a result gets fired."
      },
      {
        "id": "tvmaze:5656",
        "title": "Believe It or Not, Joe's Walking on Air",
        "season": 6,
        "episode": 3,
        "released": "2007-10-07",
        "overview": "After Bonnie tells Joe that she is tired of being married to a handicapped person, Joe decides to get a leg transplant. Excited about his new ability to walk, Joe dives head first into extreme sports and begins to hang around more active friends. Meanwhile, Peter and the guys are upset at how Joe is acting and decide to teach him a lesson. In doing so, they re cripple him and he is back to normal."
      },
      {
        "id": "tvmaze:5657",
        "title": "Stewie Kills Lois",
        "season": 6,
        "episode": 4,
        "released": "2007-11-04",
        "overview": "In the 100th episode, Lois and Peter go on a cruise, leaving Stewie and the family behind. Upset with Lois for leaving him at home, Stewie vows to carry out a diabolical plan. When Brian challenges him to actually do it, Stewie stows away on the ship, finds Lois and - well - the title of the episode says it all."
      },
      {
        "id": "tvmaze:5658",
        "title": "Lois Kills Stewie",
        "season": 6,
        "episode": 5,
        "released": "2007-11-11",
        "overview": "While all of Quahog assumes she's dead, Lois returns from the wilderness and names Stewie as her killer, but he goes on the run while Joe leads a manhunt around Quahog. Then, Stewie tries to take over the world and in the interim auditions for the AMERICAN IDOL judges Simon Cowell, Randy Jackson and Paula Abdul. Meanwhile, Lois realizes that she must stop Stewie."
      },
      {
        "id": "tvmaze:5659",
        "title": "Padre de Familia",
        "season": 6,
        "episode": 6,
        "released": "2007-11-18",
        "overview": "Peter starts an anti-immigration group after being caught up in the pro-American sentiment at a Veterans' Day parade, but his tune quickly changes when he finds out he was born in Mexico. Unable to prove his citizenship, pass the naturalization test or convince investigators that his marriage to Lois is for real, he ends up working as a groundskeeper on his father-in-law's estate and leading the fight for immigrant rights ."
      },
      {
        "id": "tvmaze:5660",
        "title": "Peter's Daughter",
        "season": 6,
        "episode": 7,
        "released": "2007-11-25",
        "overview": "When a flood hits Quahog, Meg winds up in the hospital in a coma, but she wakes up to a cute med student and they immediately hit it off. After Meg recovers, Peter is very protective of her, so he drives \"McCutie\" away. But when Meg reveals to the family that she is pregnant, Peter forces them to get married."
      },
      {
        "id": "tvmaze:5661",
        "title": "McStroke",
        "season": 6,
        "episode": 8,
        "released": "2008-01-13",
        "overview": "Peter decides to grow a moustache, but then he's mistaken for a fireman, so he lends a hand when a fire breaks out at a local fast food restaurant. The owner gives him unlimited burgers as a \"thank you\" but he eats so many that he eventually has a stroke. When Peter recovers, he vows to expose the fast-food company and becomes friends with a genetically engineered cow he meets after infiltrating the McBurgertown warehouse."
      },
      {
        "id": "tvmaze:5662",
        "title": "Back to the Woods",
        "season": 6,
        "episode": 9,
        "released": "2008-02-17",
        "overview": "James Woods returns after being locked in a crate to seek revenge against Peter. First, James steals Peter's identity and moves in as head of the Griffin household. Then, Peter goes out and ruins James career and image."
      },
      {
        "id": "tvmaze:5663",
        "title": "Play It Again, Brian",
        "season": 6,
        "episode": 10,
        "released": "2008-03-02",
        "overview": "Peter and Lois's marriage is on the rocks, but when Brian wins the New England Rising Writer's award, the three of them head to Martha's Vineyard for a relaxing vacation. As Peter's drinking spirals out of control, so does Brian's self restraint as he professes his undying love for Lois. Peter and Brian test their friendship over the woman of their dreams."
      },
      {
        "id": "tvmaze:5664",
        "title": "The Former Life of Brian",
        "season": 6,
        "episode": 11,
        "released": "2008-04-27",
        "overview": "When Brian is afraid that he has lost his chance at love, he goes in search of a former flame Tracy only to discover he is the father of her unruly son, Dylan. After Brian's surprise visit, Tracy drops Dylan off at the Griffin's so Brian can raise him. Subsequently, his new little angel begins terrorizing the Griffin household and Brian's self-important attitude toward parenting infuriates Peter and Lois."
      },
      {
        "id": "tvmaze:5665",
        "title": "Long John Peter",
        "season": 6,
        "episode": 12,
        "released": "2008-05-04",
        "overview": "Yo ho ho! It's a pirate's life for Peter when he gets a pet parrot. But after raising hell in Quahog and terrorizing the neighbors, Peter accidentally kills his beloved pet. Meanwhile, Chris goes with Brian to the vet and falls for the lovely intern Anna."
      },
      {
        "id": "tvmaze:5666",
        "title": "Love Blactually",
        "season": 7,
        "episode": 1,
        "released": "2008-09-28",
        "overview": "When Brian meets Carolyn, the girl of his dreams, he decides to follow Stewie's advice to take things slow. This drives Carolyn crazy, and she soon moves on to another man. When Brian discovers Cleveland is the new man, he does whatever it takes to win Carolyn back."
      },
      {
        "id": "tvmaze:5667",
        "title": "I Dream of Jesus",
        "season": 7,
        "episode": 2,
        "released": "2008-10-05",
        "overview": "When Peter re-discovers his love for the painfully annoying yet seductively catchy tune \"The Bird's the Word,\" Brian and Stewie decide to take matters into their own hands to ensure that the song will never be heard again! On the verge of tears, Peter goes to every record store in Quahog to track down his beloved jingle, when he runs into a familiar face. Realizing that it is the one and only Jesus Christ, Peter wants the world to know that he and J.C. are BFFs."
      },
      {
        "id": "tvmaze:5668",
        "title": "Road to Germany",
        "season": 7,
        "episode": 3,
        "released": "2008-10-19",
        "overview": "When Mort accidentally steps into a time machine, Brian and Stewie follow him in order to bring him back. But when they discover they're in Poland on the day of the Nazi invasion, things go from bad to worse and the trio has to find a way back to Quahog safely."
      },
      {
        "id": "tvmaze:5669",
        "title": "Baby Not on Board",
        "season": 7,
        "episode": 4,
        "released": "2008-11-02",
        "overview": "Peter wins a year of unlimited gas, and Brian suggests that the family use the funds to take a road trip to the Grand Canyon. So the Griffins pack up the car and hit the road, but leave some very precious cargo at home. When the family finally realizes that they have left behind one of their own, it's a mad, explosive, hilarious dash back to Quahog."
      },
      {
        "id": "tvmaze:5670",
        "title": "The Man with Two Brians",
        "season": 7,
        "episode": 5,
        "released": "2008-11-09",
        "overview": "After watching Johnny Knoxville on \"Jackass,\" Peter and the guys film their own shenanigans. When Brian gets hurt, the family worries that he's getting too old, so Peter brings home a new dog. Everything is great until the \"new Brian\" crosses the line and humps Stewie's favorite toy."
      },
      {
        "id": "tvmaze:5671",
        "title": "Tales of a Third Grade Nothing",
        "season": 7,
        "episode": 6,
        "released": "2008-11-16",
        "overview": "Peter's boss Angela sends him back to the third grade so that he can qualify for a work promotion. Meanwhile, Brian, Frank Sinatra Jr. and Stewie open the coolest club in Quahog."
      },
      {
        "id": "tvmaze:5672",
        "title": "Ocean's Three and a Half",
        "season": 7,
        "episode": 7,
        "released": "2009-02-15",
        "overview": "After being pregnant for seven years, Bonnie finally gives birth to a beautiful baby girl named Susie! Stewie quickly falls for the little tyke and vows to do anything to win her heart and get in her diaper. Meanwhile, Joe borrows $20,000 from a bookie to pay for Bonnie's medical bills, but then plans to steal the money from Mr. Pewterschmidt to pay his debt."
      },
      {
        "id": "tvmaze:5673",
        "title": "Family Gay",
        "season": 7,
        "episode": 8,
        "released": "2009-03-08",
        "overview": "To help pay off his incredible debt, Peter participates in medical experiments to make some extra cash. First, he is injected with the \"Seth Rogen\" gene that \"gives you the appearance of being funny even though you haven't actually done anything funny.\" Then he is injected with a gene that leads him to a new mate, leaving a broken-hearted Lois behind. Although the family is crushed, they quickly realize the most important thing is that Peter is happy."
      },
      {
        "id": "tvmaze:5674",
        "title": "The Juice is Loose!",
        "season": 7,
        "episode": 9,
        "released": "2009-03-15",
        "overview": "Peter cashes in a raffle ticket from 1989 and wins a golf outing with O.J. Simpson. When Peter befriends the infamous former running back and brings him home to meet the family, the residents of Quahog aren't so welcoming to the new houseguest and tell him to take a hike."
      },
      {
        "id": "tvmaze:5675",
        "title": "FOX-y Lady",
        "season": 7,
        "episode": 10,
        "released": "2009-03-22",
        "overview": "Lois lands a job as a news reporter where her first assignment is to shoot an investigative expose on a liberal filmmaker, but when her story implicates a conservative radio host she gets canned."
      },
      {
        "id": "tvmaze:5676",
        "title": "Not All Dogs Go to Heaven",
        "season": 7,
        "episode": 11,
        "released": "2009-03-29",
        "overview": "The Griffin family heads to the annual Quahog \"Star Trek\" convention, but Stewie blows a fuse when he doesn't get a chance to ask his favorite \"Star Trek: The Next Generation\" cast members any questions. He devises a plan, builds a transporter and beams the entire cast to his bedroom so they can spend a fun-filled day together."
      },
      {
        "id": "tvmaze:5677",
        "title": "420",
        "season": 7,
        "episode": 12,
        "released": "2009-04-19",
        "overview": "After Brian gets thrown in the slammer for drug possession, he launches a campaign to legalize marijuana. Mayor West passes the law, and the whole town goes to pot."
      },
      {
        "id": "tvmaze:5678",
        "title": "Stew-Roids",
        "season": 7,
        "episode": 13,
        "released": "2009-04-26",
        "overview": "After Stewie gets his baby butt kicked by Joe's infant daughter, he starts hitting the gym with Peter. It seems like all of Stewie's hard work is paying off until Peter drops a bombshell when he reveals just how Stewie got those six-pack abs. Meanwhile, Chris starts to date a popular girl at school and quickly realizes that popularity is like physics - as in what goes up must come down -."
      },
      {
        "id": "tvmaze:5679",
        "title": "We Love You Conrad",
        "season": 7,
        "episode": 14,
        "released": "2009-05-03",
        "overview": "When Brian discovers that his beloved Jillian is getting married, he hits the sauce to drown his sorrows. The next morning, he wakes up with more than a hangover. After realizing he has hooked up with \"The Hills\" star Lauren Conrad, he wants to run and hide. When Brian discovers Lauren is nothing like how she's portrayed on TV, he thinks he may have found his perfect match - if only he can let Jillian go."
      },
      {
        "id": "tvmaze:5680",
        "title": "Three Kings",
        "season": 7,
        "episode": 15,
        "released": "2009-05-10",
        "overview": "After Peter discovers the writing of Stephen King, he imagines his family and friends in three of King's most famous works. First, Peter, Quagmire, Cleveland and Joe - as 12-year-olds - travel along a railroad track on a journey of self-discovery narrated by Richard Dreyfuss. Second, Brian is injured in a bad car crash only to be \"rescued\" by his \"number one fan,\" Stewie. Finally, Cleveland and Peter become fast friends in prison."
      },
      {
        "id": "tvmaze:5681",
        "title": "Peter's Progress",
        "season": 7,
        "episode": 16,
        "released": "2009-05-17",
        "overview": "Peter has his palm read by a psychic who reveals that he had a fascinating past life as Griffin Peterson, a dignified gentleman who vied for the love of Lady Redbush in 17th century England and in the newly founded American colony of Quahog. It was a time of great love and adventure where King Stewart reigned supreme, the smartest dog in the room was the court jester, army lieutenants were merely boys and even old England loved \"How I Met Your Mother\"."
      },
      {
        "id": "tvmaze:5682",
        "title": "Road to the Multiverse",
        "season": 8,
        "episode": 1,
        "released": "2009-09-27",
        "overview": "With the help of an out-of-this-world remote control, Stewie and Brian travel through alternate universes, including a post-apocalyptic world, a parallel world run by dogs where humans are pets and a \"Robot Chicken\"-like existence."
      },
      {
        "id": "tvmaze:5683",
        "title": "Family Goy",
        "season": 8,
        "episode": 2,
        "released": "2009-10-04",
        "overview": "When Lois finds a lump on her breast, she goes to the doctor to test for cancer. The tests come back benign, but the doctor looks at her family medical history and reveals some news about Lois' heritage. Peter takes to the family's newfound faith eagerly, but when he is visited by the ghost of his father, he changes his tune. After a visit from an old friend sets him straight, Peter and Lois agree to go back to the way things were. Meanwhile, Quagmire finds out about internet porn."
      },
      {
        "id": "tvmaze:5684",
        "title": "Spies Reminiscent of Us",
        "season": 8,
        "episode": 3,
        "released": "2009-10-11",
        "overview": "Stewie and Brian are suspicious when two guys move into Cleveland's old house, and when they find out Dan and Chevy are spies and they have dossiers of all the people in Quahog they follow them on a mission to Russia and end up in hot water ."
      },
      {
        "id": "tvmaze:5685",
        "title": "Brian's Got a Brand New Bag",
        "season": 8,
        "episode": 4,
        "released": "2009-11-08",
        "overview": "When Brian snags an older woman, he becomes the laughingstock of the family, but things go from bad to worse when she breaks her hip and Brian has to be her errand-boy."
      },
      {
        "id": "tvmaze:5686",
        "title": "Hannah Banana",
        "season": 8,
        "episode": 5,
        "released": "2009-11-08",
        "overview": "When Stewie scores tickets to a famous teen pop singer's concert, he ends up meeting and becoming great friends with her, but things get weird when he discovers one of her darkest secrets. Meanwhile, Chris tries to prove to the family that the Evil Monkey is real."
      },
      {
        "id": "tvmaze:5687",
        "title": "Quagmire's Baby",
        "season": 8,
        "episode": 6,
        "released": "2009-11-15",
        "overview": "When Quagmire assumes responsibility for a baby who looks just like him, he quickly realizes he may be in over his head. Meanwhile, Stewie clones himself in order to have a personal assistant."
      },
      {
        "id": "tvmaze:5688",
        "title": "Jerome is the New Black",
        "season": 8,
        "episode": 7,
        "released": "2009-11-22",
        "overview": "Feeling blue, Peter and the guys interview potential friends to fill the vacancy left by Cleveland. The interview process leads them to Jerome but things don't look so good when it's discovered that Quagmire hates him."
      },
      {
        "id": "tvmaze:5689",
        "title": "Dog Gone",
        "season": 8,
        "episode": 8,
        "released": "2009-11-29",
        "overview": "When Brian accidentally kills another dog he is surprised to see that no one cares so he tries to convince everyone that the life of a dog should have the same value as a human one. Meanwhile, Lois hires a maid who doesn't listen to Peter."
      },
      {
        "id": "tvmaze:5690",
        "title": "Business Guy",
        "season": 8,
        "episode": 9,
        "released": "2009-12-13",
        "overview": "When Peter gives Lois' father the bachelor party he never had, Mr. Pewterschmidt slips into a coma and not even Dr. House can bring him out of it. With her father incapacitated, Lois is given control ofPewterschmidt Industries. Peter convinces Lois to let him run the operation, but he gets power-hungry and fires the board. Mr. Pewterschmidt soon bounces back and tries to regain control of what he's built - even though it may be more difficult than Christmas shopping for Peter -."
      },
      {
        "id": "tvmaze:5691",
        "title": "Big Man on Hippocampus",
        "season": 8,
        "episode": 10,
        "released": "2010-01-03",
        "overview": "After Peter hits his head and develops amnesia, he forgets everything, including his family and his friends. Lois takes extra care of Peter and tries everything to jog his memory and until he starts hitting on other women. Fed up with his antics, Lois takes the kids and leaves, giving Quagmire his opportunity to swoop in and score."
      },
      {
        "id": "tvmaze:5692",
        "title": "Dial Meg for Murder",
        "season": 8,
        "episode": 11,
        "released": "2010-01-31",
        "overview": "Brian gets a gig writing for a teen magazine about the average American girl, but when he starts trailing Meg for research he discovers that her desperate attempts at dating have led her to a guy in the slammer. When Brian tries to expose Meg's secret to the family, he finds that her boyfriend, Luke, has broken out of jail and has been hiding in the Griffin's house."
      },
      {
        "id": "tvmaze:5693",
        "title": "Extra Large Medium",
        "season": 8,
        "episode": 12,
        "released": "2010-02-14",
        "overview": "When Chris and Stewie go missing for several days, Lois is at her wit's end until she sees a psychic who assures her they are safe. Even after the boys return home, Lois and Peter's psychic obsession continues, and Peter takes it a step too far when he starts charging neighbors for his extrasensory perception. Meanwhile, Chris develops a crush on a girl at school."
      },
      {
        "id": "tvmaze:5694",
        "title": "Go, Stewie, Go!",
        "season": 8,
        "episode": 13,
        "released": "2010-03-14",
        "overview": "Stewie wants to audition for his favorite show, \"Jolly Farm,\" but when he finds out they are only auditioning little girls, he creates and alter ego by dressing up a la \"Tootsie.\" Meanwhile, Meg finds herself a normal guy to date and shocks the entire city of Quahog."
      },
      {
        "id": "tvmaze:5695",
        "title": "Peter-assment",
        "season": 8,
        "episode": 14,
        "released": "2010-03-21",
        "overview": "After Peter has some luck selling footage of a celebrity he caught off-guard, he decides to become a full-time paparazzo. To make matters worse, his new boss, Angela, finds him irresistible and plagues him with unwanted advances. When Peter rebuffs her, he winds up getting the ax. Meanwhile, Stewie makes his theatrical debut in a school play, only to be overcome with stage fright."
      },
      {
        "id": "tvmaze:5696",
        "title": "Brian Griffin's House of Payne",
        "season": 8,
        "episode": 15,
        "released": "2010-03-28",
        "overview": "When Lois reads Brian's pilot script, she falls in love with it and insists that he meet with network executives to pitch it. The execs respond positively, and the initial casting session goes well with Elijah Wood auditioning for the lead role. But when the suits insist that Brian hire James Woods and change the entire concept, Brian finds himself caught between a rock and a hard place. Meanwhile, Chris and Meg seriously injure Stewie and try to cover it up."
      },
      {
        "id": "tvmaze:5697",
        "title": "April in Quahog",
        "season": 8,
        "episode": 16,
        "released": "2010-04-11",
        "overview": "When the local news announces that the Earth will be destroyed by a black hole in 24 hours, everyone in Quahog goes nuts trying to live out their last day."
      },
      {
        "id": "tvmaze:5698",
        "title": "Brian & Stewie",
        "season": 8,
        "episode": 17,
        "released": "2010-05-02",
        "overview": "In a Special 150th Episode Event, Brian and Stewie get locked in a bank vault where they are forced to deal with each other on a whole new level."
      },
      {
        "id": "tvmaze:5699",
        "title": "Quagmire's Dad",
        "season": 8,
        "episode": 18,
        "released": "2010-05-09",
        "overview": "Quagmire gets the surprise of his life on Mother's Day, when his father starts to go through the change of his life."
      },
      {
        "id": "tvmaze:5700",
        "title": "The Splendid Source",
        "season": 8,
        "episode": 19,
        "released": "2010-05-16",
        "overview": "Peter, Quagmire and Joe search to find the source of all dirty jokes leads them to Virginia, where they reunite with Cleveland and meet his new family,."
      },
      {
        "id": "tvmaze:5701",
        "title": "Something, Something, Something, Dark Side",
        "season": 8,
        "episode": 20,
        "released": "2010-05-23",
        "overview": "In a special one-hour episode, Family Guy's homage to the \"Star Wars\" saga continues with a retelling of \"The Empire Strikes Back\"."
      },
      {
        "id": "tvmaze:5702",
        "title": "Partial Terms of Endearment",
        "season": 8,
        "episode": 21,
        "released": "2010-06-20",
        "overview": "Lois agrees to become a surrogate mother for a friend who is unable to conceive a child of her own. But when the friend and her husband are killed in a car accident, Lois and Peter consider whether to terminate the pregnancy."
      },
      {
        "id": "tvmaze:5703",
        "title": "And Then There Were Fewer",
        "season": 9,
        "episode": 1,
        "released": "2010-09-26",
        "overview": "When the Griffins and other residents of Quahog are invited to visit the mansion of James Woods, the evening turns into a real murder mystery when guests end up dead and everyone scrambles to figure out who done it."
      },
      {
        "id": "tvmaze:5704",
        "title": "Excellence in Broadcasting",
        "season": 9,
        "episode": 2,
        "released": "2010-10-03",
        "overview": "When Brian learns that Rush Limbaugh is going to be at the Quahog Mall for a book-signing, he decides to go down there and give him a piece of his left-wing mind. But when Rush unexpectedly comes to Brian's rescue, Brian has a political change of heart."
      },
      {
        "id": "tvmaze:5705",
        "title": "Welcome Back, Carter",
        "season": 9,
        "episode": 3,
        "released": "2010-10-10",
        "overview": "After Peter catches Lois' dad, Carter, having an affair, he is strong-armed into keeping a secret. But when Peter accidentally spills the beans, Lois' mom demands a divorce, and Peter is in charge of Carter's return to bachelorhood."
      },
      {
        "id": "tvmaze:5706",
        "title": "Halloween on Spooner Street",
        "season": 9,
        "episode": 4,
        "released": "2010-11-07",
        "overview": "Peter and Joe team up to execute a series of painful and humiliating Halloween pranks on unsuspecting family, friends and neighbors. While Brian shows Stewie the ropes of trick-or-treating, Meg sets out to attend her first high school Halloween party with high hopes for the evening."
      },
      {
        "id": "tvmaze:5707",
        "title": "Baby, You Knock Me Out",
        "season": 9,
        "episode": 5,
        "released": "2010-11-14",
        "overview": "When Peter receives tickets to a boxing match as a birthday gift, he volunteers Lois to compete. To everyone's surprise, Lois dominates in the ring, and Peter decides to become her fight promoter. Her frustration with Peter turns into motivation in the ring as the housewife turns champion."
      },
      {
        "id": "tvmaze:5708",
        "title": "Brian Writes a Bestseller",
        "season": 9,
        "episode": 6,
        "released": "2010-11-21",
        "overview": "Feeling discouraged with the progress of his writing career, Brian decides to throw in the towel until Stewie becomes his manager and one of his books hits the bestseller list. But when the fame goes to his head, Brian gets a wake-up call from Bill Maher (appearing in a live-action scene as himself)."
      },
      {
        "id": "tvmaze:5709",
        "title": "Road to the North Pole",
        "season": 9,
        "episode": 7,
        "released": "2010-12-12",
        "overview": "Stewie's favorite thing after his teddy bear, Rupert, is Christmas. So when he hears that Santa is making an appearance at the mall, he begs Brian to take him so that he can tell Santa in person what he wants for Christmas. Brian begrudgingly takes Stewie to the mall, only to get the brush-off from Santa. As a result, Stewie and Brian travel to the North Pole to find Santa and teach him a lesson in holiday cheer."
      },
      {
        "id": "tvmaze:5710",
        "title": "New Kidney in Town",
        "season": 9,
        "episode": 8,
        "released": "2011-01-09",
        "overview": "After years of drinking with the guys, Peter's love of the sauce has finally caught up with him and he needs a kidney transplant. Brian offers him one of his, but will a canine kidney be compatible? Meanwhile, Meg and Chris collaborate on a poem to celebrate a very important visitor."
      },
      {
        "id": "tvmaze:5711",
        "title": "And I'm Joyce Kinney",
        "season": 9,
        "episode": 9,
        "released": "2011-01-16",
        "overview": "Lois becomes friends with Joyce Kinney, the new local news anchor, and Joyce convinces Lois to let her do a story on her as the model American housewife. The television story makes Lois look terrible, and Joyce is unapologetic, leaving Lois no choice but to right a wrong."
      },
      {
        "id": "tvmaze:5712",
        "title": "Friends of Peter G",
        "season": 9,
        "episode": 10,
        "released": "2011-02-13",
        "overview": "After a public disturbance, Peter and Brian are forced to attend a 12-step meeting to help kick their drinking problems. Unable to recognize his issue, Peter gets a visit from Death, who gives him a glimpse of what life would be like with and without \"Mr. Booze\" in his bloodstream."
      },
      {
        "id": "tvmaze:5713",
        "title": "German Guy",
        "season": 9,
        "episode": 11,
        "released": "2011-02-20",
        "overview": "On the search to find a new hobby, Chris meets a puppeteer named Franz, an old friend of Herbert's. Despite Herbert's warnings, Chris and Franz remain friends until Franz's checkered past is suddenly revealed."
      },
      {
        "id": "tvmaze:5714",
        "title": "The Hand That Rocks the Wheelchair",
        "season": 9,
        "episode": 12,
        "released": "2011-03-06",
        "overview": "When Bonnie goes out of town, Meg offers to check in on Joe, but she soon becomes a little too involved and starts freaking everyone out - especially Joe. Meanwhile, Stewie thinks he's losing his edge as the toughest baby on the block, so he hooks himself up to a machine that is supposed to make him more evil than ever before."
      },
      {
        "id": "tvmaze:5715",
        "title": "Trading Places",
        "season": 9,
        "episode": 13,
        "released": "2011-03-20",
        "overview": "Chris and Meg think their parents have it easy, and Peter and Lois beg to differ, so in order to teach them a lesson, they all trade roles. Chris goes to work at the brewery while Meg runs the house. While things start off well, it's not long until the stress of running a household and being the sole breadwinner break down Chris and Meg."
      },
      {
        "id": "tvmaze:5716",
        "title": "Tiegs for Two",
        "season": 9,
        "episode": 14,
        "released": "2011-04-10",
        "overview": "When the local dry cleaner loses Peter's favorite white shirt, he goes ballistic. Meanwhile, Brian tries to score on a date with a new friend, Denise, but ends up striking out. Instead of calling it quits on love, he decides to enlist Quagmire's help, but things get nasty when they start to compete for the affections of each other's old flames, Cheryl Tiegs and Jillian ."
      },
      {
        "id": "tvmaze:5717",
        "title": "Brothers & Sisters",
        "season": 9,
        "episode": 15,
        "released": "2011-04-17",
        "overview": "When Mayor West marries Lois' sister, Carol, they move into the Griffin's house to be one big \"happy\" family. To make room for everyone, Stewie is bumped out of his room and takes over Chris' room, but not everyone is annoyed by the change. Peter and Mayor West bond and become best friends."
      },
      {
        "id": "tvmaze:5718",
        "title": "The Big Bang Theory",
        "season": 9,
        "episode": 16,
        "released": "2011-05-08",
        "overview": "Stewie and Brian go back in time to stop Bertram from killing Leonardo da Vinci."
      },
      {
        "id": "tvmaze:5719",
        "title": "Foreign Affairs",
        "season": 9,
        "episode": 17,
        "released": "2011-05-15",
        "overview": "When Bonnie and Lois take a trip to Paris, Bonnie crosses the line while in the City of Love. Meanwhile, Peter homeschools Chris and Meg using some unorthodox teaching methods."
      },
      {
        "id": "tvmaze:5720",
        "title": "Episode VI: It's a Trap",
        "season": 9,
        "episode": 18,
        "released": "2011-05-22",
        "overview": "Return to the Griffins' version of that galaxy far, far away as their freakin' sweet saga continues with the final installment of the hilarious three-part \"Star Wars\" satire. Following 2005's \"Family Guy: Blue Harvest\" and last year's \"Family Guy: Something, Something, Something Dark Side,\" the Griffins reprise their intergalactic roles in an outrageous retelling of \"Star Wars, Episode VI: Return of the Jedi\" ."
      },
      {
        "id": "tvmaze:5721",
        "title": "Lottery Fever",
        "season": 10,
        "episode": 1,
        "released": "2011-09-25",
        "overview": "Peter blows his savings on lottery tickets and the family writes it off as one of his usual shenanigans until they end up millionaires. In true Griffin fashion, they can't handle the good fortune and struggle to stay grounded."
      },
      {
        "id": "tvmaze:5722",
        "title": "Seahorse Seashell Party",
        "season": 10,
        "episode": 2,
        "released": "2011-10-02",
        "overview": "When a storm hits in Quahog, to help pass the time and calm his nerves, Brian consumes some questionable substances and has trouble sobering up. Meanwhile, Meg goes off the deep end after the family takes one too many jabs at her."
      },
      {
        "id": "tvmaze:5723",
        "title": "Screams of Silence: The Story of Brenda Q",
        "season": 10,
        "episode": 3,
        "released": "2011-10-30",
        "overview": "Quagmire lands in the hospital and his sister, Brenda, and her boyfriend, Jeff, rush to Quahog to nurse him back to health. As Glenn recovers he quickly realizes that Brenda is the one who needs help."
      },
      {
        "id": "tvmaze:5724",
        "title": "Stewie Goes for a Drive",
        "season": 10,
        "episode": 4,
        "released": "2011-11-06",
        "overview": "Ryan Reynolds pays a visit to Quahog and becomes obsessed with Peter Griffin. Meanwhile, Stewie tries to be a big boy and steals the family car for a joy ride but lands in a bit of trouble."
      },
      {
        "id": "tvmaze:5725",
        "title": "Back to the Pilot",
        "season": 10,
        "episode": 5,
        "released": "2011-11-13",
        "overview": "Brian and Stewie travel back in time to the pilot episode of FAMILY GUY to change history, and then to change history again."
      },
      {
        "id": "tvmaze:5726",
        "title": "Thanksgiving",
        "season": 10,
        "episode": 6,
        "released": "2011-11-20",
        "overview": "Lois cooks a big Thanksgiving meal and invites the whole crew over for dinner, and Joe is shocked when his formerly M.I.A. son, Kevin Swanson, returns from Iraq."
      },
      {
        "id": "tvmaze:5727",
        "title": "Amish Guy",
        "season": 10,
        "episode": 7,
        "released": "2011-11-27",
        "overview": "On the return from an adventurous day at an amusement park, the Griffins' car breaks down in Amish country and they are stranded with no way out. When Meg falls for an Amish boy, the Griffins then find themselves in a crusade against the conservative locals."
      },
      {
        "id": "tvmaze:5728",
        "title": "Cool Hand Peter",
        "season": 10,
        "episode": 8,
        "released": "2011-12-04",
        "overview": "Peter and the guys take a stand against their wives and flee to the Deep South on a road trip. On the way there, the men earn a one-way ticket to jail. But when they decide to make a run for it, Joe's quick planning and Peter's seductive ways help them escape. Meanwhile, Lois spends some quality time with the girls and they engage in childish antics."
      },
      {
        "id": "tvmaze:5729",
        "title": "Grumpy Old Man",
        "season": 10,
        "episode": 9,
        "released": "2011-12-11",
        "overview": "It's winter in Quahog, and Lois' parents, Carter and Babs, take Stewie for a trip. But when Carter falls asleep at the wheel, the family decides it might be time for him to retire. Peter and Lois take the clan to Florida to check out some fine retirement communities, but Carter refuses to go down without a fight."
      },
      {
        "id": "tvmaze:5730",
        "title": "Meg and Quagmire",
        "season": 10,
        "episode": 10,
        "released": "2012-01-08",
        "overview": "When Meg finally turns 18, Quagmire seizes the opportunity to pursue his next romantic conquest. As the new couple's relationship blossoms, Peter stops at nothing to come in between his innocent - well, somewhat innocent - daughter and his creepy friend."
      },
      {
        "id": "tvmaze:5731",
        "title": "The Blind Side",
        "season": 10,
        "episode": 11,
        "released": "2012-01-15",
        "overview": "Brian starts dating a blind girl and things get a little dicey when she divulges that she hates dogs. Meanwhile, the Griffin family installs a new staircase in their home when Peter keeps falling on the old one and decides to live upstairs full-time."
      },
      {
        "id": "tvmaze:5732",
        "title": "Livin' on a Prayer",
        "season": 10,
        "episode": 12,
        "released": "2012-01-29",
        "overview": "When Stewie's new best friend falls ill, Lois takes him to the hospital where she finds out he has a critical, but treatable, disease. However, the boy's parents refuse treatment due to their religious beliefs, leaving Lois no choice but to take drastic measures to seek treatment for the boy herself. Meanwhile, Peter has a religious experience of his own."
      },
      {
        "id": "tvmaze:5733",
        "title": "Tom Tucker: The Man and His Dream",
        "season": 10,
        "episode": 13,
        "released": "2012-02-12",
        "overview": "When Peter decides to be a famous actor, he becomes Tom Tucker's agent as his first step toward stardom. Meanwhile, Chris dates a girl who looks disturbingly like a member of the Griffin household."
      },
      {
        "id": "tvmaze:5734",
        "title": "Be Careful What You Fish For",
        "season": 10,
        "episode": 14,
        "released": "2012-02-19",
        "overview": "When Peter and the guys try to salvage a sunken Mercedes-Benz, Peter half-heartedly promises a favor to a helpful dolphin. Soon the dolphin moves to Quahog, outstays his welcome at Peter's and moves into Cleveland's house across the street. Peter tries to reunite the dolphin with his ex-wife in hopes that he'll return to the ocean, but his plan backfires and the whole dolphin family moves into Cleveland's."
      },
      {
        "id": "tvmaze:5735",
        "title": "Burning Down the Bayit",
        "season": 10,
        "episode": 15,
        "released": "2012-03-04",
        "overview": "Overwhelmed with financial troubles, Mort asks Peter and Quagmire to help him save his pharmacy. However, things take a turn for the worse when the trio decides to burn it down to collect insurance money."
      },
      {
        "id": "tvmaze:5736",
        "title": "Killer Queen",
        "season": 10,
        "episode": 16,
        "released": "2012-03-11",
        "overview": "When Peter and Chris go away to fat camp, they cross paths with a serial killer who targets overweight kids. Meanwhile, Stewie is traumatized by the frightening cover of a Queen album."
      },
      {
        "id": "tvmaze:5737",
        "title": "Forget-Me-Not",
        "season": 10,
        "episode": 17,
        "released": "2012-03-18",
        "overview": "When a seemingly innocent guy's night out takes a sudden turn, Peter, Joe, Brian and Quagmire wake up in a hospital and discover that their memories have been erased and Quahog has been deserted."
      },
      {
        "id": "tvmaze:5738",
        "title": "You Can't Do That on Television, Peter",
        "season": 10,
        "episode": 18,
        "released": "2012-04-01",
        "overview": "After Peter's favorite children's television show gets cancelled, he takes matters into his own hands by creating and starring in his own show for kids. Meanwhile, Meg begins an internship at the hospital with Dr. Hartman."
      },
      {
        "id": "tvmaze:5739",
        "title": "Mr. and Mrs. Stewie",
        "season": 10,
        "episode": 19,
        "released": "2012-04-29",
        "overview": "Stewie becomes smitten when he meets a girl who happens to be the female version of himself. Meanwhile, Peter and Quagmire take their friendship to a new level."
      },
      {
        "id": "tvmaze:5740",
        "title": "Leggo My Meg-O",
        "season": 10,
        "episode": 20,
        "released": "2012-05-06",
        "overview": "When Meg travels abroad to Europe, her exciting adventure comes to a halt when she gets kidnapped. Brian and Stewie embark on an action-packed mission to find her before it's too late."
      },
      {
        "id": "tvmaze:5741",
        "title": "Tea Peter",
        "season": 10,
        "episode": 21,
        "released": "2012-05-13",
        "overview": "After Quahog City Hall threatens to shut down Peter's illegally-run business, Peter joins the Tea Party and successfully campaigns to shut down the government. As a result of all the chaos in Quahog, Peter's father-in-law, Carter, reaps the benefits."
      },
      {
        "id": "tvmaze:5742",
        "title": "Family Guy Viewer Mail (2)",
        "season": 10,
        "episode": 22,
        "released": "2012-05-20",
        "overview": "Continuing a popular show tradition, Brian and Stewie respond to viewer mail. We meet a British version of the Griffins, Quahog is taken over by a famous comedian and we get to see the world from Stewie's POV. Then, Peter encourages Joe to have a one-night stand with his attractive new partner in order to even the score with Bonnie for her own indiscretions. But when Bonnie finds out and threatens divorce, Lois insists that Peter get them back together. Meanwhile, Peter has another run-in with the angry chicken which makes for yet another epic fight."
      },
      {
        "id": "tvmaze:5743",
        "title": "Internal Affairs",
        "season": 10,
        "episode": 23,
        "released": "2012-05-20",
        "overview": "Joe cheats on the cheating Bonnie; and it's Peter vs. the angry chicken (again)."
      },
      {
        "id": "tvmaze:5744",
        "title": "Into Fat Air",
        "season": 11,
        "episode": 1,
        "released": "2012-09-30",
        "overview": "In the season premiere, the Griffins decide to climb Mount Everest after their competitive family friends announce their ambitious plans to hike the legendary mountain. However, things go awry when the Griffins get stuck on the mountainside in the middle of a massive storm."
      },
      {
        "id": "tvmaze:5745",
        "title": "Ratings Guy",
        "season": 11,
        "episode": 2,
        "released": "2012-10-07",
        "overview": "On a Halloween-themed night, the Griffins are selected to have their television viewing habits monitored. But Peter takes his participation too far when he tries to control the airwaves."
      },
      {
        "id": "tvmaze:5746",
        "title": "The Old Man & the Big 'C'",
        "season": 11,
        "episode": 3,
        "released": "2012-11-04",
        "overview": "When Brian discovers that Carter Pewterschmidt's pharmaceutical company is withholding the cure for cancer from the public in order to gain more profit, he and Stewie plot to expose the big secret that could change the world. Meanwhile, Quagmire reveals a hair-raising secret of his own."
      },
      {
        "id": "tvmaze:5747",
        "title": "Yug Ylimaf",
        "season": 11,
        "episode": 4,
        "released": "2012-11-11",
        "overview": "When Brian uses Stewie's time machine to impress women whom he meets at bars, he accidentally causes time to run in reverse. So he and Stewie must figure out how to restore the forward progress of time before Stewie is unborn. Then, in the FAMILY GUY 200th Episode retrospective, fans will get a behind-the-scenes look at this irreverent comedy's most outrageous moments, through fascinating interviews with creator Seth MacFarlane and voice actors Mila Kunis, Alex Borstein and Seth Green. Additionally, the special will give fans an exclusive glimpse into the cast and crew's 200th episode party in Los Angeles."
      },
      {
        "id": "tvmaze:5748",
        "title": "Joe's Revenge",
        "season": 11,
        "episode": 5,
        "released": "2012-11-18",
        "overview": "The criminal who, years ago, shot Joe and left him in a wheelchair, becomes a fugitive. So, Quagmire, Joe and Peter team up to hunt the bad guy down."
      },
      {
        "id": "tvmaze:5749",
        "title": "Lois Comes Out of Her Shell",
        "season": 11,
        "episode": 6,
        "released": "2012-11-25",
        "overview": "Lois experiences a mid-life crisis, and Peter tries to keep up with her new, wild lifestyle. Meanwhile, Stewie finds a turtle at the park and brings him home as his new pet, unaware that the turtle is evil and determined to destroy Stewie's life."
      },
      {
        "id": "tvmaze:5750",
        "title": "Friends Without Benefits",
        "season": 11,
        "episode": 7,
        "released": "2012-12-09",
        "overview": "When Meg finally gathers the courage to ask out her crush, Kent, she is devastated to learn he's gay. But when Meg discovers that Kent has feelings for Chris, she uses her brother in the worst way to get closer to Kent."
      },
      {
        "id": "tvmaze:5751",
        "title": "Jesus, Mary & Joseph",
        "season": 11,
        "episode": 8,
        "released": "2012-12-23",
        "overview": "Peter tells his own version of the Nativity story."
      },
      {
        "id": "tvmaze:5752",
        "title": "Space Cadet",
        "season": 11,
        "episode": 9,
        "released": "2013-01-06",
        "overview": "To boost Chris' self-esteem, Peter and Lois send him to space camp. When camp ends and the Griffins come to pick Chris up, they accidentally are launched into outer space, and it's up to Chris to land the clan safely back on earth."
      },
      {
        "id": "tvmaze:5753",
        "title": "Brian's Play",
        "season": 11,
        "episode": 10,
        "released": "2013-01-13",
        "overview": "Brian writes a play that's a hit in Quahog, but his confidence is shaken when he reads a play Stewie wrote that's much better than his. Soon, Stewie's work is Broadway-bound, causing a rift between the two."
      },
      {
        "id": "tvmaze:5754",
        "title": "The Giggity Wife",
        "season": 11,
        "episode": 11,
        "released": "2013-01-27",
        "overview": "When Peter, Quagmire and Joe visit the Harvard University campus, Quagmire accidentally marries a prostitute. In order to get out of his marriage, Quagmire pretends to be lovers with Peter."
      },
      {
        "id": "tvmaze:5755",
        "title": "Valentine's Day in Quahog",
        "season": 11,
        "episode": 12,
        "released": "2013-02-10",
        "overview": "Love is in the air on Valentine's Day. Meg dates a guy from the internet, Stewie uses his time machine and falls for a girl in the '60s and Peter and Lois decide to stay in bed all day. Meanwhile, Brian's ex-girlfriends pay him a visit and Quagmire gets in touch with his feminine side."
      },
      {
        "id": "tvmaze:5756",
        "title": "Chris Cross",
        "season": 11,
        "episode": 13,
        "released": "2013-02-17",
        "overview": "To buy new sneakers, Chris steals money from Lois' purse. When Meg catches him in the act, she forces him to do all of her chores in exchange for keeping mum. But Chris finally tires of the pact, and runs away to live with Herbert. Meanwhile, Stewie and Brian become obsessed with singer Anne Murray, and visit her to find out the true meaning of \"Snowbird\"."
      },
      {
        "id": "tvmaze:5757",
        "title": "Call Girl",
        "season": 11,
        "episode": 14,
        "released": "2013-03-10",
        "overview": "When the Griffins find themselves in a financial bind, Lois is forced to find a job of her own. She gets discovered by a \"voiceover\" talent agent named Randy, who actually runs an adult-only phone line and pays his employees generously. As Lois settles into her new gig, she hears Peter's voice on the other end of the line. Peter introduces his pet falcon Xerces that has been trained to retrieve items for him to everyone."
      },
      {
        "id": "tvmaze:5758",
        "title": "Turban Cowboy",
        "season": 11,
        "episode": 15,
        "released": "2013-03-17",
        "overview": "When Peter, Quagmire and Joe need a jolt in their mundane lives, they decide to go skydiving. But after an unfortunate accident, Peter ends up in the hospital, where he befriends Mahmoud, who convinces Peter to convert to Islam. Quagmire and Joe are suspicious of Mahmoud's intentions and try to stop the friendship from progressing."
      },
      {
        "id": "tvmaze:5759",
        "title": "12 and a Half Angry Men",
        "season": 11,
        "episode": 16,
        "released": "2013-03-24",
        "overview": "Bloody murder occurs at Mayor West's mansion, and he is the prime suspect. The mayor is put on trial, and it is up to the citizens of Quahog to determine if he is guilty or not."
      },
      {
        "id": "tvmaze:5760",
        "title": "Bigfat",
        "season": 11,
        "episode": 17,
        "released": "2013-04-14",
        "overview": "When Peter, Quagmire and Joe fly on a private plane to Canada, they crash in the middle of the wilderness, far from civilization. Peter is chosen to find help, but ends up going missing for two months, only to be found as a feral creature with no ability to communicate intelligently. The Griffins must find a way to bring back Peter to his old self."
      },
      {
        "id": "tvmaze:5761",
        "title": "Total Recall",
        "season": 11,
        "episode": 18,
        "released": "2013-04-28",
        "overview": "After teddy bear Rupert gets recalled, Stewie stops at nothing to get back his beloved best friend. Meanwhile, Peter falls ill and can't compete in his bowling tournament. So Lois fills in for him. But when she gets a little too close to Peter's teammates, he gets jealous."
      },
      {
        "id": "tvmaze:5762",
        "title": "Save the Clam",
        "season": 11,
        "episode": 19,
        "released": "2013-05-05",
        "overview": "When the owner of the Clam is killed, the bar closes and Peter, Quagmire and Joe must find a way to save their beloved watering hole. Meanwhile, Meg gets an after-school job at a funeral home."
      },
      {
        "id": "tvmaze:5763",
        "title": "Farmer Guy",
        "season": 11,
        "episode": 20,
        "released": "2013-05-12",
        "overview": "When the Griffins move to a farm, Peter gets into the illicit drug business, a la \"Breaking Bad,\"."
      },
      {
        "id": "tvmaze:5764",
        "title": "Roads to Vegas",
        "season": 11,
        "episode": 21,
        "released": "2013-05-19",
        "overview": "Stewie and Brian use Stewie's time machine to go to Las Vegas for a Bette Midler concert, but chaos ensues when the machine malfunctions and creates alt-versions of the pair: a \"lucky\" version and an \"unlucky\" one. Then, the Griffins are invited to join the prestigious Barrington Country Club and, of course, get thrown out."
      },
      {
        "id": "tvmaze:5765",
        "title": "No Country Club for Old Men",
        "season": 11,
        "episode": 22,
        "released": "2013-05-19",
        "overview": "The Griffins receive an invite to join a posh country club, the Barringtons. Peters father in-law gets jealous because he has been trying to join for years."
      },
      {
        "id": "tvmaze:5766",
        "title": "Finders Keepers",
        "season": 12,
        "episode": 1,
        "released": "2013-09-29",
        "overview": "Peter is convinced that a restaurant placemat is a treasure map. Word quickly spreads about the alleged cache, sparking a city-wide search and turning the citizens of Quahog against each other."
      },
      {
        "id": "tvmaze:5767",
        "title": "Vestigial Peter",
        "season": 12,
        "episode": 2,
        "released": "2013-10-06",
        "overview": "Peter discovers that he has a vestigial twin, whom he names Chip, growing out of his neck. It's not long before Peter resents the fact that everyone seems to love Chip more than him, so he decides to amputate his twin. However, when Peter gets into trouble, he realizes he needs Chip more than ever."
      },
      {
        "id": "tvmaze:5768",
        "title": "Quagmire's Quagmire",
        "season": 12,
        "episode": 3,
        "released": "2013-11-03",
        "overview": "When Quagmire meets a woman named Sonja who is as sexually insatiable as he is, he is thrilled to finally be with someone who won't judge him. However, things take a turn for the worse when Sonja abducts Quagmire, intending to make him her sex slave. It is up to Peter, Joe and Quagmire's dad to explore the seedy underbelly of Quahog to find and rescue Quagmire. Meanwhile, a love triangle emerges between Stewie, Brian and Stewie's teddy bear, Rupert,."
      },
      {
        "id": "tvmaze:5769",
        "title": "A Fistful of Meg",
        "season": 12,
        "episode": 4,
        "released": "2013-11-10",
        "overview": "Meg spills her lunch on the new kid, Michael, who is appropriately nicknamed \"Mental Mike.\" When he sets the date for her end on Friday, Meg tries to get out of it. Meanwhile, Peter continually harasses Brian in the nude until it escalates to the breaking point."
      },
      {
        "id": "tvmaze:5770",
        "title": "Boopa-dee Bappa-dee",
        "season": 12,
        "episode": 5,
        "released": "2013-11-17",
        "overview": "The Griffins take a trip to Italy and are forced to deal with annoying immigration laws after Peter destroys the family's passports."
      },
      {
        "id": "tvmaze:5771",
        "title": "Life of Brian",
        "season": 12,
        "episode": 6,
        "released": "2013-11-24",
        "overview": "When Stewie and Brian travel back to 17th century Jamestown, via Stewie's time machine, they encounter too many close calls with altering the course of mankind. Stewie decides to destroy his time machine, but immediately regrets his decision when an unthinkable event happens and he is unable to go back in time."
      },
      {
        "id": "tvmaze:5772",
        "title": "Into Harmony's Way",
        "season": 12,
        "episode": 7,
        "released": "2013-12-08",
        "overview": "When Peter and Quagmire discover that their singing voices create beautiful harmony together, they form a singing/songwriting team, in the vein of Simon and Garfunkel. However, tensions run high when fame gets to Peter's head."
      },
      {
        "id": "tvmaze:5773",
        "title": "Christmas Guy",
        "season": 12,
        "episode": 8,
        "released": "2013-12-15",
        "overview": "When Carter Pewterschmidt cancels the annual Quahog Christmas carnival, because he hates the holiday, Peter must transform his father-in-law from a Scrooge into a hometown hero in order to salvage the event. Meanwhile, Stewie devises a master plan to get the one and only thing he wants for Christmas."
      },
      {
        "id": "tvmaze:5774",
        "title": "Peter Problems",
        "season": 12,
        "episode": 9,
        "released": "2014-01-05",
        "overview": "When Peter finds he can't perform his, um, er, uh, manly duties, he enlists Quagmire and Joe to help him get his mojo back."
      },
      {
        "id": "tvmaze:5775",
        "title": "Grimm Job",
        "season": 12,
        "episode": 10,
        "released": "2014-01-12",
        "overview": "From Grimm to Griffin, three classic fairy tales get a new Quahog spin, including \"Jack and the Beanstalk,\" \"Little Red Riding Hood,\" and \"Cinderella\"."
      },
      {
        "id": "tvmaze:5776",
        "title": "Brian's a Bad Father",
        "season": 12,
        "episode": 11,
        "released": "2014-01-26",
        "overview": "When Brian's neglected son Dylan shows up in town as a teen TV star, Brian jumps at the opportunity to be hired on the show's writing staff - instead of being a good father. Meanwhile, after Peter accidentally shoots Quagmire on a hunting trip, the two friends clash and Joe must choose a side."
      },
      {
        "id": "tvmaze:5777",
        "title": "Mom's the Word",
        "season": 12,
        "episode": 12,
        "released": "2014-03-09",
        "overview": "After Peter's mother passes away, he forms a special friendship with her longtime pal, Evelyn, who attempts to seduce Peter. Meanwhile, Stewie is distraught when he understands the reality of death for the first time."
      },
      {
        "id": "tvmaze:5778",
        "title": "3 Acts of God",
        "season": 12,
        "episode": 13,
        "released": "2014-03-16",
        "overview": "Peter grows frustrated when players on opposing teams continue to thank God after defeating his beloved New England Patriots football team, so he and the guys embark on a global quest to find God and ask Him to stop interfering with the outcome of professional football games."
      },
      {
        "id": "tvmaze:5779",
        "title": "Fresh Heir",
        "season": 12,
        "episode": 14,
        "released": "2014-03-23",
        "overview": "When Chris learns that he is the heir to Carter's fortune - but refuses to take the money - Peter takes drastic measures to keep the wealth in the family."
      },
      {
        "id": "tvmaze:5780",
        "title": "Secondhand Spoke",
        "season": 12,
        "episode": 15,
        "released": "2014-03-30",
        "overview": "Peter takes up smoking cigarettes, and is approached by Mr. Stone, an advertising executive who wants Peter to be the face of his anti-smoking campaign under the caveat that Peter continues to smoke. Meanwhile, Stewie helps Chris battle bullies at school."
      },
      {
        "id": "tvmaze:5781",
        "title": "Herpe the Love Sore",
        "season": 12,
        "episode": 16,
        "released": "2014-04-06",
        "overview": "Brian gives Stewie an STD. Meanwhile, Peter and the guys fight back when another group claims their booth at The Drunken Clam."
      },
      {
        "id": "tvmaze:5782",
        "title": "The Most Interesting Man in the World",
        "season": 12,
        "episode": 17,
        "released": "2014-04-13",
        "overview": "When Peter takes Stewie to the park for some quality father-son time, he mistakenly takes the wrong baby home, prompting Lois to call him an idiot. Determined to prove to her that he's a responsible adult, Peter goes on a business trip to Chicago and returns as an intelligent, classy person."
      },
      {
        "id": "tvmaze:5783",
        "title": "Baby Got Black",
        "season": 12,
        "episode": 18,
        "released": "2014-04-27",
        "overview": "When Chris begins to date Jerome's daughter, Pam, Jerome forbids it. But when Chris and Pam run away together, Jerome and Peter must work together to find their kids."
      },
      {
        "id": "tvmaze:5784",
        "title": "Meg Stinks!",
        "season": 12,
        "episode": 19,
        "released": "2014-05-04",
        "overview": "Meg has fun partying with Peter when he takes her to a college for an interview. Brian must learn how to live in the wild when he gets sprayed by a skunk and is prohibited from entering the house."
      },
      {
        "id": "tvmaze:5785",
        "title": "He's Bla-ack!",
        "season": 12,
        "episode": 20,
        "released": "2014-05-11",
        "overview": "Cleveland returns to town, but is instantly banned from spending time with Peter when Lois and Donna get into a big fight over parenting."
      },
      {
        "id": "tvmaze:5786",
        "title": "Chap Stewie",
        "season": 12,
        "episode": 21,
        "released": "2014-05-18",
        "overview": "When Peter and Chris interrupt Stewie's TV time, the angry baby goes back in time to break up Peter and Lois, so he's never conceived. But instead, he is reborn into a \"Downton Abbey\"-esque British household."
      },
      {
        "id": "tvmaze:5787",
        "title": "The Simpsons Guy",
        "season": 13,
        "episode": 1,
        "released": "2014-09-28",
        "overview": "In \"The Simpsons Guy\" episode of FAMILY GUY, Peter and the Griffins get out of dodge and end up in Springfield, where they are greeted by a friendly stranger named Homer Simpson, who welcomes his new \"albino\" friends with open arms. The families get along famously: Stewie and Bart make out like bandits when Stewie trades in his mind control device for a good old-fashioned slingshot; Lisa takes Meg under her wing and teaches her the saxophone; and Peter and Homer fight over the best beer in town - Pawtucket vs Duff"
      },
      {
        "id": "tvmaze:5788",
        "title": "The Book of Joe",
        "season": 13,
        "episode": 2,
        "released": "2014-10-05",
        "overview": "Peter helps Joe realize his dream of publishing a book, but things get out of hand when Peter takes over as the author. Meanwhile, Brian starts exercising to the extreme after experiencing a euphoric runner's high for the first time."
      },
      {
        "id": "tvmaze:5789",
        "title": "Baking Bad",
        "season": 13,
        "episode": 3,
        "released": "2014-10-19",
        "overview": "Lois and Peter go into business together and open a cookie store, but things get messy when Peter comes up with his own way to get more customers."
      },
      {
        "id": "tvmaze:15841",
        "title": "Brian the Closer",
        "season": 13,
        "episode": 4,
        "released": "2014-11-09",
        "overview": "After Brian undergoes cosmetic surgery he is faced with a new career---real-estate agent---which leads to trouble with Quagmire."
      },
      {
        "id": "tvmaze:44348",
        "title": "Turkey Guys",
        "season": 13,
        "episode": 5,
        "released": "2014-11-16",
        "overview": "On Thanksgiving eve, a drunken and ravenous Peter and Brian wolf down the holiday turkey, and then must go on hunt to find a replacement bird. With Peter gone, Chris decides to step up and take over as man of the house."
      },
      {
        "id": "tvmaze:46245",
        "title": "The 2000-Year-Old Virgin",
        "season": 13,
        "episode": 6,
        "released": "2014-12-07",
        "overview": "Peter is stunned to run into Jesus at the mall, and even more stunned to discover that he is still a virgin, so Peter recruits Quagmire and Cleveland to celebrate Jesus' birthday by finding a way to end his celibacy."
      },
      {
        "id": "tvmaze:58252",
        "title": "Stewie, Chris & Brian's Excellent Adventure",
        "season": 13,
        "episode": 7,
        "released": "2015-01-04",
        "overview": "To help Chris ace his ninth grade history class, Stewie and Brian employ the time travel machine for educational purposes. Not surprisingly, all three get stuck in the past."
      },
      {
        "id": "tvmaze:92023",
        "title": "Our Idiot Brian",
        "season": 13,
        "episode": 8,
        "released": "2015-01-11",
        "overview": "Meg convinces Brian to take the SAT's for her, but when he tests poorly, they start to suspect that Brian might not that smart after all. Peter decides to spend the day showing Brian the joys of being stupid and the benefits of having a low IQ."
      },
      {
        "id": "tvmaze:107029",
        "title": "This Little Piggy",
        "season": 13,
        "episode": 9,
        "released": "2015-01-25",
        "overview": "Meg is thrilled to be recruited as a model, but it turns out to be for a very specific type of modeling: the foot-fetish industry. Meanwhile, Brian accompanies Stewie on an open-road adventure when Stewie decides he wants to experience life outside of preschool."
      },
      {
        "id": "tvmaze:117740",
        "title": "Quagmire's Mom",
        "season": 13,
        "episode": 10,
        "released": "2015-02-08",
        "overview": "Lois takes Peter to open a checking account, and they discover that his first name is actually Justin, which Peter adopts as the name of his younger \"bro\"-style alter-ego. Then, Peter/Justin throws a party, during which Quagmire unknowingly gets into some trouble with his mother ."
      },
      {
        "id": "tvmaze:122958",
        "title": "Encyclopedia Griffin",
        "season": 13,
        "episode": 11,
        "released": "2015-02-15",
        "overview": "Peter, Quagmire, Joe and Cleveland form a neighborhood detective agency, and are stunned to discover that Chris is a thief. Meanwhile, Lois is worried about Chris' delusional relationship with his new girlfriend, but also sees it as an opportunity for Peter to copy Chris' romantic gestures."
      },
      {
        "id": "tvmaze:139707",
        "title": "Stewie is Enceinte",
        "season": 13,
        "episode": 12,
        "released": "2015-03-08",
        "overview": "Brian decides he doesn't want to hang out with Stewie anymore, so Stewie tries to save their relationship by having a baby... or seven... by using Brian's DNA to impregnate himself. Meanwhile, Peter, Joe, Quagmire and Cleveland attempt to make a viral video."
      },
      {
        "id": "tvmaze:141542",
        "title": "Dr. C and the Women",
        "season": 13,
        "episode": 13,
        "released": "2015-03-15",
        "overview": "Meg gets a new job at the airport, where she's instantly popular for being the hottest employee there. Meanwhile, Cleveland becomes a therapist and starts giving Peter and Lois relationship advice, but Peter quickly becomes frustrated and threatens to tell Donna a big secret about what went down at Cleveland's bachelor party."
      },
      {
        "id": "tvmaze:151384",
        "title": "#JOLO",
        "season": 13,
        "episode": 14,
        "released": "2015-04-12",
        "overview": "Peter becomes a town hero for accidentally finding a missing boy. Meanwhile, Joe decides to live life to the fullest by quitting his job and taking a road trip to Niagara Falls with Peter, Quagmire and Cleveland."
      },
      {
        "id": "tvmaze:151663",
        "title": "Once Bitten",
        "season": 13,
        "episode": 15,
        "released": "2015-04-19",
        "overview": "After attending obedience school, Brian becomes much more submissive, and Peter realizes he misses his old, feistier pal. Meanwhile, Chris makes a new friend at school, but feels betrayed when he discovers it was all a ploy to get closer to Meg."
      },
      {
        "id": "tvmaze:151664",
        "title": "Roasted Guy",
        "season": 13,
        "episode": 16,
        "released": "2015-04-26",
        "overview": "Peter befriends a group of mean girls after his feelings are hurt when his so-called friends decide to \"roast\" him. Lois, all too familiar with the gossipy nature of women, tells Peter they are probably talking about him behind his back, and Peter soon discovers that Lois may be right."
      },
      {
        "id": "tvmaze:151665",
        "title": "Fighting Irish",
        "season": 13,
        "episode": 17,
        "released": "2015-05-03",
        "overview": "Peter claims he would beat Liam Neeson in a fight, but when he is put to the test, he learns that winning is tougher than it seems. Meanwhile, Stewie becomes jealous when Lois decides to be a class mom and starts paying more attention to the other kids over him."
      },
      {
        "id": "tvmaze:151666",
        "title": "Take My Wife",
        "season": 13,
        "episode": 18,
        "released": "2015-05-17",
        "overview": "Lois books a fun couple's vacation in the Bahamas, but much to Peter's surprise, it turns out to be a marriage counseling program instead. Meanwhile, Carter watches the kids at home and becomes frustrated that they're too into their electronics to play games the old-fashioned way. So he tries to fix it himself."
      },
      {
        "id": "tvmaze:157377",
        "title": "Pilling Them Softly",
        "season": 14,
        "episode": 1,
        "released": "2015-09-27",
        "overview": "Stewie is diagnosed with ADD and prescribed Adderall, which Brian takes to write a 2000-page proposal to pitch to author George R.R. Martin at a book convention. Meanwhile, Quagmire and Peter compete, Iron Chef-style, to determine which of them gets to keep his new cooking show."
      },
      {
        "id": "tvmaze:185252",
        "title": "Papa Has a Rollin' Son",
        "season": 14,
        "episode": 2,
        "released": "2015-10-04",
        "overview": "For Father's Day, the guys track down Joe's estranged father. But when Joe explains that his dad is intolerant of people with disabilities, Peter steps in and pretends to be Joe. Meanwhile, Stewie's doctor tells him that he'll only grow to be 5'1\", so he hangs out with Tiny Tom Cruise to understand what it's like to be short."
      },
      {
        "id": "tvmaze:185253",
        "title": "Guy, Robot",
        "season": 14,
        "episode": 3,
        "released": "2015-10-11",
        "overview": "Stewie doesn't like Brian's stand-up comedy jokes, so the two of them fight. To get back at Brian and make him jealous, Stewie builds a robot friend. But when the robot outsmarts Stewie and dumps him, Brian and Stewie reunite. Meanwhile, Lois forces Peter to get a new mattress."
      },
      {
        "id": "tvmaze:185254",
        "title": "Peternormal Activity",
        "season": 14,
        "episode": 4,
        "released": "2015-10-25",
        "overview": "The guys go to an abandoned asylum seeking inspiration for a new horror movie idea, but end up accidentally killing a man they think is keeping them hostage. Wracked with guilt, they each try to pin the murder on someone else. Meanwhile, Stewie is on a mission to destroy Brian's glasses because he's annoyed by how pretentious Brian's been acting when he wears them."
      },
      {
        "id": "tvmaze:185255",
        "title": "Peter, Chris, & Brian",
        "season": 14,
        "episode": 5,
        "released": "2015-11-08",
        "overview": "Peter gets a check in the mail from the sale of his mother's home and he remembers that all of his old porn is still in there. When he returns to retrieve his stash, he finds a \"to Peter from Peter\" tape and realizes that his life has amounted to nothing. Reeling from his own failures, Peter then attempts to fix Chris before it's too late, and forces his son to spend time with Brian."
      },
      {
        "id": "tvmaze:185256",
        "title": "Peter's Sister",
        "season": 14,
        "episode": 6,
        "released": "2015-11-15",
        "overview": "Peter's sister, Karen, visits for Thanksgiving and bullies Peter the same way he treats Meg. At first, Meg is amused, but she soon helps Peter train to defeat his sister in a wrestling match.Meanwhile, to avoid overeating on Thanksgiving, Stewie and Brian go on a cleanse, which Stewie takes one step too far"
      },
      {
        "id": "tvmaze:443343",
        "title": "Hot Pocket-Dial",
        "season": 14,
        "episode": 7,
        "released": "2015-11-22",
        "overview": "Quagmire admits that he is in love with Lois. Unfortunately, he proclaims his love while he has accidentally pocket-dialed Peter. Peter is furious and Brian takes it upon himself to fix the situation."
      },
      {
        "id": "tvmaze:473793",
        "title": "Brokeback Swanson",
        "season": 14,
        "episode": 8,
        "released": "2015-12-06",
        "overview": "When Joe is trampled in a local running of the bulls and becomes a quadriplegic, the guys find it too difficult to hang around him. Meanwhile, Brian sleeps with a married woman, and when the husband returns home, he pretends to be the family's new dog."
      },
      {
        "id": "tvmaze:466111",
        "title": "A Shot in the Dark",
        "season": 14,
        "episode": 9,
        "released": "2015-12-13",
        "overview": "When Peter's couch is stolen from his front lawn, the guys form a neighborhood watch group. While on duty, Peter sees someone trying to climb into Cleveland's house and he shoots him. Peter is then arrested and charged with a hate crime."
      },
      {
        "id": "tvmaze:523929",
        "title": "Candy, Quahog Marshmallow",
        "season": 14,
        "episode": 10,
        "released": "2016-01-03",
        "overview": "Peter, Cleveland and Joe come across an old VHS tape called \"Winter/Summer,\" an Asian soap that Quagmire starred in when he was living in Korea. Unable to find the final tape of the series, the guys travel to Korea to find it and Quagmire is reunited with his old lover. Meanwhile, Stewie worries he might become a redhead."
      },
      {
        "id": "tvmaze:536318",
        "title": "The Peanut Butter Kid",
        "season": 14,
        "episode": 11,
        "released": "2016-01-10",
        "overview": "When their bank accounts begin to run dry, the Griffins look for ways to make money. Stewie gets cast in a peanut butter commercial and becomes the money maker for the family. Meanwhile, Lois and Peter become crazy show business parents and Brian helps Stewie realize that he does not want to be a child actor."
      },
      {
        "id": "tvmaze:542741",
        "title": "Scammed Yankees",
        "season": 14,
        "episode": 12,
        "released": "2016-01-17",
        "overview": "Lois and her mom, Babs, have a relaxing spa day, leaving Peter to entertain Lois' father, Carter. The boys fall for an email scam, and have to go to Africa to get their money back. Meanwhile, Brian pursues Meg's friend, Patty."
      },
      {
        "id": "tvmaze:573783",
        "title": "An App a Day",
        "season": 14,
        "episode": 13,
        "released": "2016-02-14",
        "overview": "Peter learns about phone apps and overloads his phone with them. He buys a new phone with more memory and gives his old phone to Chris, which causes a series of horrible events. Meanwhile, Stewie joins a tennis club and invites Brian to be his tennis partner."
      },
      {
        "id": "tvmaze:589448",
        "title": "Underage Peter",
        "season": 14,
        "episode": 14,
        "released": "2016-02-21",
        "overview": "Mayor West raises the drinking age to 50. Because of dog years, Brian is the only one old enough to buy alcohol, so Peter makes him buy all of his booze."
      },
      {
        "id": "tvmaze:609066",
        "title": "A Lot Going on Upstairs",
        "season": 14,
        "episode": 15,
        "released": "2016-03-06",
        "overview": "When Stewie refuses to sleep in his own bed because of nightmares, Peter can't stand it, so he goes to sleep in the attic. Peter turns the attic into a man cave and all of the guys begin hanging out there, which makes Lois incredibly angry. Meanwhile, Brian helps Stewie overcome his fears by building a device to go into his nightmares and defeat his demons."
      },
      {
        "id": "tvmaze:610699",
        "title": "The Heartbreak Dog",
        "season": 14,
        "episode": 16,
        "released": "2016-03-13",
        "overview": "Meg begins working at a retirement community and starts stealing from the residents. Then Chris finds out and wants in on the heist. When the residents catch them, they blackmail them and force the thieves to listen to all of their boring stories."
      },
      {
        "id": "tvmaze:667249",
        "title": "Take a Letter",
        "season": 14,
        "episode": 17,
        "released": "2016-04-17",
        "overview": "To pay for Stewie's private school, Lois becomes a postal worker. She finds a letter from Peter that was never sent to his old fling, Gretchen (guest voice Kathryn Hahn), dated a week before their marriage. When Gretchen tries to come between Lois and Peter, Lois has a plan of her own."
      },
      {
        "id": "tvmaze:682215",
        "title": "The New Adventures of Old Tom",
        "season": 14,
        "episode": 18,
        "released": "2016-05-08",
        "overview": "Peter gets lost in the mall overnight after his family abandons him. Meanwhile, Brian pretends to be a millionaire to win over a girl."
      },
      {
        "id": "tvmaze:682225",
        "title": "Run, Chris, Run",
        "season": 14,
        "episode": 19,
        "released": "2016-05-15",
        "overview": "To everyone's surprise, Chris wins homecoming king. However, Meg finds out that the cool kids plan to prank him during the homecoming ceremony, so they go to the school to investigate. Meanwhile, Cleveland starts hanging out with Jerome, the bartender. So Peter and the guys try to replace him."
      },
      {
        "id": "tvmaze:682231",
        "title": "Road to India",
        "season": 14,
        "episode": 20,
        "released": "2016-05-22",
        "overview": "Brian falls in love with a tech support worker in India, so he and Stewie travel there to find her. Meanwhile, Joe invites Peter to his bingo night, but when Peter becomes the new center of attention, Lois helps Joe reclaim the group."
      },
      {
        "id": "tvmaze:835549",
        "title": "The Boys in the Band",
        "season": 15,
        "episode": 1,
        "released": "2016-09-25",
        "overview": "Stewie and Brian form a children's band that quickly rises to fame until they let a girl get between them and drive the band apart. Meanwhile, Peter and Lois insist that Chris gets a job so he takes a job managing Quagmire's sex life as his personal assistant."
      },
      {
        "id": "tvmaze:911626",
        "title": "Bookie of the Year",
        "season": 15,
        "episode": 2,
        "released": "2016-10-02",
        "overview": "Brian and Lois decide it's time for Chris to work out his anger management issues by taking up a sport. Chris surprises everyone and becomes a star baseball pitcher, which turns Peter into a gambling father, as he bets on his son's baseball games. Meanwhile, Stewie, Brian and Frank Sinatra Jr. attempt to open an Italian restaurant."
      },
      {
        "id": "tvmaze:926903",
        "title": "American Gigg-olo",
        "season": 15,
        "episode": 3,
        "released": "2016-10-16",
        "overview": "After the local airline pilots go on strike, Quagmire looks for new work and becomes a gigolo. When his clients begin to avoid paying for his services, he asks Peter for help getting his money. Meanwhile, Brian is kicked off Peter's health insurance, so he gets a job at a hardware store, until Stewie gets him fired and things get medical."
      },
      {
        "id": "tvmaze:944751",
        "title": "Inside Family Guy",
        "season": 15,
        "episode": 4,
        "released": "2016-10-23",
        "overview": "FAMILY GUY takes viewers behind the scenes of a regular FAMILY GUY production week, with James Woods as the guide. See the ins-and-outs of what goes into the making of a FAMILY GUY episode and watch the drama unfold as Peter is replaced and ends up in the office of Fox Television Group Chairmen and CEOs Dana Walden and Gary Newman to pitch his very own new series."
      },
      {
        "id": "tvmaze:952876",
        "title": "Chris Has Got a Date, Date, Date, Date, Date",
        "season": 15,
        "episode": 5,
        "released": "2016-11-06",
        "overview": "Taylor Swift agrees to go to a homecoming dance with Chris after he asks her via online video. However, when she starts to fall for him, her music takes a hit. Meanwhile, Peter decides to try a new profession and sees firsthand what it's like to be an Uber driver."
      },
      {
        "id": "tvmaze:967334",
        "title": "Hot Shots",
        "season": 15,
        "episode": 6,
        "released": "2016-11-13",
        "overview": "In order to \"save\" Stewie from autism, Peter and Lois decide not to vaccinate him and then proceed to convince the rest of Quahog to follow suit. Stewie runs away to save himself from diseases until Sean Penn (guest-voicing as himself) swoops in to save the day and brings vaccines to the whole town."
      },
      {
        "id": "tvmaze:974913",
        "title": "High School English",
        "season": 15,
        "episode": 7,
        "released": "2016-11-20",
        "overview": "In an anthology episode, the cast reenacts three classic pieces of literature commonly taught in high school: \"The Great Gatsby,\" \"The Adventures of Huckleberry Finn\" and \"Of Mice and Men\"."
      },
      {
        "id": "tvmaze:979806",
        "title": "Carter and Tricia",
        "season": 15,
        "episode": 8,
        "released": "2016-12-04",
        "overview": "Carter buys the Pawtucket Patriot brewery and decides to cut some corners to save a few bucks. Peter overhears the plan and runs and tells investigative journalist Tricia Takanawa about Carter's plan to use toxic chemicals in the beer cans. Meanwhile, Brian's drivers' license has expired and he enlists Stewie as an instructor."
      },
      {
        "id": "tvmaze:981063",
        "title": "How the Griffin Stole Christmas",
        "season": 15,
        "episode": 9,
        "released": "2016-12-11",
        "overview": "Peter is asked to fill in for the mall Santa, until he gets drunk on the power when he realizes that Santa can get away with anything. Meanwhile, Stewie and Brian crash holiday office parties for the free food, drama and women."
      },
      {
        "id": "tvmaze:1009804",
        "title": "Passenger Fatty-Seven",
        "season": 15,
        "episode": 10,
        "released": "2017-01-08",
        "overview": "Quagmire scores free friends-and-family plane tickets for a guys' trip to San Francisco. However, after seeing the auto-pilot function, the boys doubt Quagmire's flying skills. Then, unforeseen events in the air put Quagmire's abilities to the test."
      },
      {
        "id": "tvmaze:1020533",
        "title": "Gronkowsbees",
        "season": 15,
        "episode": 11,
        "released": "2017-01-15",
        "overview": "Rob Gronkowski, of the New England Patriots, moves into the house behind the Griffins, and the guys enjoy partying with him until his antics become overwhelming. Meanwhile, Stewie begins beekeeping and gives his bees steroids to produce more honey, but instead they become aggressive."
      },
      {
        "id": "tvmaze:1044381",
        "title": "Peter's Def Jam",
        "season": 15,
        "episode": 12,
        "released": "2017-02-12",
        "overview": "The guys try to start a podcast, but Peter goes solo and branches out as a DJ. Meanwhile, back at the Griffin home, Lois' allergy forces Brian to move into Stewie's bedroom and the two have roommate difficulties."
      },
      {
        "id": "tvmaze:1049330",
        "title": "The Finer Strings",
        "season": 15,
        "episode": 13,
        "released": "2017-02-19",
        "overview": "The guys decide to form a string quartet, but Peter doesn't make the cut. Meanwhile, Brian is forced to be Carter's seeing eye dog and enjoys the life of luxury a little too much."
      },
      {
        "id": "tvmaze:1067419",
        "title": "The Dating Game",
        "season": 15,
        "episode": 14,
        "released": "2017-03-05",
        "overview": "Quagmire discovers the \"dating\" app Tinder, forcing Peter, Joe and Cleveland to intervene and save him from his soul-sucking hedonism. Meanwhile, Stewie finds out that he has scoliosis and learns the perks of his latest diagnosis."
      },
      {
        "id": "tvmaze:1075111",
        "title": "Cop and a Half-Wit",
        "season": 15,
        "episode": 15,
        "released": "2017-03-12",
        "overview": "Peter helps Joe out with several crime cases, but when Joe tries to take all the credit, Peter gets extremely angry. Meanwhile, Brian convinces Stewie to join a football team and panics when he gets a concussion."
      },
      {
        "id": "tvmaze:1080732",
        "title": "Saturated Fat Guy",
        "season": 15,
        "episode": 16,
        "released": "2017-03-19",
        "overview": "In an attempt to avoid eating the healthy food that Lois forces him to eat, Peter opens up his own food truck with fattening foods. Meanwhile, Meg joins a roller derby team, despite Chris thinking it's too dangerous."
      },
      {
        "id": "tvmaze:1087375",
        "title": "Peter's Lost Youth",
        "season": 15,
        "episode": 17,
        "released": "2017-03-26",
        "overview": "Peter gets jealous of Lois when she upstages him at a Red Sox fantasy baseball camp. Meanwhile, Stewie runs away from home when Meg is left to babysit him."
      },
      {
        "id": "tvmaze:1107605",
        "title": "The Peter Principal",
        "season": 15,
        "episode": 18,
        "released": "2017-04-30",
        "overview": "Peter becomes the temporary principal at the high school, and Meg uses his new power to get even with her bullies. Meanwhile, Brian and Stewie open a bed &amp; breakfast that quickly turns into a brothel."
      },
      {
        "id": "tvmaze:1156197",
        "title": "Dearly Deported",
        "season": 15,
        "episode": 19,
        "released": "2017-05-21",
        "overview": "When Chris' Mexican girlfriend, Isabella, gets deported, he volunteers to take care of her twin babies. After learning that Isabella can't come back to the U.S., the Griffins go to Mexico to return her children. Then, Peter's past as a sperm donor catches up to him when many of his children show up unannounced to his house."
      },
      {
        "id": "tvmaze:1156198",
        "title": "A House Full of Peters",
        "season": 15,
        "episode": 20,
        "released": "2017-05-21",
        "overview": "Peter's past as a sperm donor catches up to him when many of his children show up unannounced to his house"
      },
      {
        "id": "tvmaze:1223233",
        "title": "Emmy-Winning Episode",
        "season": 16,
        "episode": 1,
        "released": "2017-10-01",
        "overview": "Tired of not winning an Emmy, Peter embarks on his own For Your Consideration campaign for Family Guy by making the show more like Emmy-winning shows - and no category is off limits."
      },
      {
        "id": "tvmaze:1297108",
        "title": "Foxx in the Men House",
        "season": 16,
        "episode": 2,
        "released": "2017-10-08",
        "overview": "Peter becomes friends with a cool, handsome paramedic named Stryker Foxx. Wrapped up in his newfound \"coolness,\" he soon dumps Quagmire, Joe and Cleveland."
      },
      {
        "id": "tvmaze:1297117",
        "title": "Nanny Goats",
        "season": 16,
        "episode": 3,
        "released": "2017-10-15",
        "overview": "The Griffins get a nanny for the kids, courtesy of Lois' parents, which gives Peter and Lois the opportunity to reconnect."
      },
      {
        "id": "tvmaze:1297126",
        "title": "Follow the Money",
        "season": 16,
        "episode": 4,
        "released": "2017-10-22",
        "overview": "After Chris gets a special one-dollar bill for his birthday and quickly loses it, the dollar gets passed from character to character throughout Quahog."
      },
      {
        "id": "tvmaze:1328855",
        "title": "Three Directors",
        "season": 16,
        "episode": 5,
        "released": "2017-11-05",
        "overview": "In a special anthology-style episode, Peter gets fired from his job at the brewery in the signature styles of three famous Hollywood film directors."
      },
      {
        "id": "tvmaze:1333360",
        "title": "The D in Apartment 23",
        "season": 16,
        "episode": 6,
        "released": "2017-11-12",
        "overview": "When Brian posts an offensive tweet that goes viral and the rest of the Griffins are also treated as outcasts, he's forced to move out of the Griffin house."
      },
      {
        "id": "tvmaze:1333361",
        "title": "Petey IV",
        "season": 16,
        "episode": 7,
        "released": "2017-11-19",
        "overview": "On Thanksgiving weekend, Peter discovers an alternate ending in the Russian version of one of his favorite films and writes to Vladimir Putin, who comes to Quahog. Meanwhile, a strapped-for-cash Brian gets a job at a suicide hotline center and attempts to strike up a romance with a co-worker."
      },
      {
        "id": "tvmaze:1351023",
        "title": "Crimes and Meg's Demeanor",
        "season": 16,
        "episode": 8,
        "released": "2017-12-03",
        "overview": "Peter encourages Meg to attend a high school party, where she takes up drinking, which both concerns and delights her father. Meanwhile, Brian begins spying on his neighbors and suspects Principal Shepherd of a crime."
      },
      {
        "id": "tvmaze:1348798",
        "title": "Don't Be a Dickens at Christmas",
        "season": 16,
        "episode": 9,
        "released": "2017-12-10",
        "overview": "In this special holiday episode, a selfish Peter loses his Christmas spirit and is visited by ghosts of Christmas past, present and future who take him on a journey around Quahog in the style of Charles Dickens' \"A Christmas Carol\"."
      },
      {
        "id": "tvmaze:1369148",
        "title": "Boy (Dog) Meets Girl (Dog)",
        "season": 16,
        "episode": 10,
        "released": "2018-01-07",
        "overview": "At the vet's office, Brian meets a female show dog named Ellie. Smitten with her, he enters a show dog competition, in which the winner gets to breed with her. Meanwhile, Peter and Lois go to extreme measures to try to convince Chris that \"Arthur Valentine\" doesn't exist."
      },
      {
        "id": "tvmaze:1373672",
        "title": "Dog Bites Bear",
        "season": 16,
        "episode": 11,
        "released": "2018-01-14",
        "overview": "Milestone 300th episodeStewie and Brian get into a friendship-ending fight after Brian commits a terrible act to one of Stewie's beloved toys. Meanwhile, Peter refuses to wash his hand after meeting his favorite breakfast cereal mascot, Boo Berry."
      },
      {
        "id": "tvmaze:1411129",
        "title": "Send in Stewie, Please",
        "season": 16,
        "episode": 12,
        "released": "2018-03-18",
        "overview": "Stewie gets sent to see his school's child psychologist, Dr. Cecil Pritchfield, for a surprising session, which causes Stewie to reveal major, never-before-told secrets about himself."
      },
      {
        "id": "tvmaze:1384416",
        "title": "V is for Mystery",
        "season": 16,
        "episode": 13,
        "released": "2018-03-25",
        "overview": "In a special Dickensian-themed episode, Stewie and Brian are detectives who embark on solving a string of mysterious murders set in Victorian-era London."
      },
      {
        "id": "tvmaze:1418820",
        "title": "Veteran Guy",
        "season": 16,
        "episode": 14,
        "released": "2018-04-01",
        "overview": "After Peter and the guys get caught pretending to be military veterans and are found guilty of the Stolen Valor Act, a judge sentences them to join the U.S. Coast Guard."
      },
      {
        "id": "tvmaze:1426446",
        "title": "The Woof of Wall Street",
        "season": 16,
        "episode": 15,
        "released": "2018-04-08",
        "overview": "Brian convinces Stewie to teach him how to invest in the stock market after learning Stewie has a knack for making money from it. Meanwhile, Peter, Quagmire, Cleveland, and Joe look after the Drunken Clam while Jerome is away."
      },
      {
        "id": "tvmaze:1430062",
        "title": "'Family Guy' Through the Years",
        "season": 16,
        "episode": 16,
        "released": "2018-04-22",
        "overview": "Family Guy is reimagined as a series that's been on the air for 60 years and, in a special retrospective, it looks back at the cultural events and issues that were tackled on the show in the 1950s, '60s and '70s."
      },
      {
        "id": "tvmaze:1436313",
        "title": "Switch the Flip",
        "season": 16,
        "episode": 17,
        "released": "2018-04-29",
        "overview": "To help get Brian's life in order, Stewie and Brian swap bodies using a machine that Stewie invents, but chaos quickly ensues around Quahog when the machine goes haywire."
      },
      {
        "id": "tvmaze:1436314",
        "title": "HTTPete",
        "season": 16,
        "episode": 18,
        "released": "2018-05-06",
        "overview": "To help promote the brewery to millennials, Peter adopts the millennial lifestyle, and his methods soon attract the attention of a high-powered Silicon Valley executive."
      },
      {
        "id": "tvmaze:1436315",
        "title": "The Unkindest Cut",
        "season": 16,
        "episode": 19,
        "released": "2018-05-13",
        "overview": "Quagmire's most treasured body part gets cut off in a freak accident and he is forced to learn how to live without it. Meanwhile, Stewie and Brian search for Mort after learning there is a $10,000 reward for turning him into the police for his involvement in a drug scam."
      },
      {
        "id": "tvmaze:1430063",
        "title": "Are You There God? It's Me, Peter",
        "season": 16,
        "episode": 20,
        "released": "2018-05-20",
        "overview": "After Peter falls into a coma, Peter meets God face-to-face, which leads him to ask some of life's tough questions."
      },
      {
        "id": "tvmaze:1486841",
        "title": "Married... with Cancer",
        "season": 17,
        "episode": 1,
        "released": "2018-09-30",
        "overview": "Brian meets and quickly falls in love with a woman named Jess, who reveals she has cancer. After she receives devastating news regarding her diagnosis, Brian proposes marriage to her."
      },
      {
        "id": "tvmaze:1502783",
        "title": "Dead Dog Walking",
        "season": 17,
        "episode": 2,
        "released": "2018-10-07",
        "overview": "Brian's marriage to Jess is not what he envisioned. At the suggestion of Peter, Brian lets himself go, causing Jess to make a surprising decision."
      },
      {
        "id": "tvmaze:1533535",
        "title": "Pal Stewie",
        "season": 17,
        "episode": 3,
        "released": "2018-10-14",
        "overview": "To Stewie's surprise, he quickly befriends a boy his age, but is devastated when he realizes he isn't invited to his birthday party. Meanwhile, Peter and Lois attend a self-empowerment seminar."
      },
      {
        "id": "tvmaze:1536709",
        "title": "Big Trouble in Little Quahog",
        "season": 17,
        "episode": 4,
        "released": "2018-10-21",
        "overview": "After Brian teases Stewie for being small, Stewie invents a shrinking machine that results in both of them shrinking to a microscopic size."
      },
      {
        "id": "tvmaze:1544185",
        "title": "Regarding Carter",
        "season": 17,
        "episode": 5,
        "released": "2018-11-04",
        "overview": "Lois receives a surprising birthday present from her father, Carter Pewterschmidt, that leads to an unfortunate accident leaving him dependent on Lois and the Griffin's care."
      },
      {
        "id": "tvmaze:1548326",
        "title": "Stand By Meg",
        "season": 17,
        "episode": 6,
        "released": "2018-11-11",
        "overview": "After Meg saves Stewie from a choking incident, Stewie makes it his personal mission to create a better life for Meg. Meanwhile, Chris is sent to a vocational school."
      },
      {
        "id": "tvmaze:1552432",
        "title": "The Griffin Winter Games",
        "season": 17,
        "episode": 7,
        "released": "2018-11-18",
        "overview": "To the surprise of all the Griffins, Meg makes the U.S. Olympic team as a biathlete and competes in the Winter Olympics."
      },
      {
        "id": "tvmaze:1553227",
        "title": "Con Heiress",
        "season": 17,
        "episode": 8,
        "released": "2018-12-02",
        "overview": "Stewie and Brian compete for the inheritance of a wealthy, older heiress. Meanwhile, Peter and Chris battle for Mr. Herbert's affection."
      },
      {
        "id": "tvmaze:1565506",
        "title": "Pawtucket Pete",
        "season": 17,
        "episode": 9,
        "released": "2018-12-09",
        "overview": "The Pawtucket Brewery hires new bosses, who decide to change the company's mascot. In an attempt to be crowned the new face of Pawtucket Ale, Peter and Brian go head-to-head."
      },
      {
        "id": "tvmaze:1577672",
        "title": "Hefty Shades of Gray",
        "season": 17,
        "episode": 10,
        "released": "2019-01-06",
        "overview": "After Peter's hair turns white from a ghost-hunting adventure in his house with the guys, his new look grabs the attention of local news anchor Tom Tucker. Under Tucker's guidance, he learns the ways of reporting fake news, and soon becomes a senior crime analyst on Quahog's Channel 5 News. Meanwhile, Brian and Stewie attempt to help Chris improve his dating game."
      },
      {
        "id": "tvmaze:1580425",
        "title": "Trump Guy",
        "season": 17,
        "episode": 11,
        "released": "2019-01-13",
        "overview": "The Griffins move to Washington D.C. where Peter is hired as the new White House Press Secretary."
      },
      {
        "id": "tvmaze:1592704",
        "title": "Bri, Robot",
        "season": 17,
        "episode": 12,
        "released": "2019-02-10",
        "overview": "Brian worries about the legacy he's leaving behind, so Stewie makes a robot duplicate as a living biography."
      },
      {
        "id": "tvmaze:1596124",
        "title": "Trans-Fat",
        "season": 17,
        "episode": 13,
        "released": "2019-02-17",
        "overview": "Peter is mistakenly identified as transgender, which leads to an unexpected event and an important learning lesson."
      },
      {
        "id": "tvmaze:1610365",
        "title": "Family Guy Lite",
        "season": 17,
        "episode": 14,
        "released": "2019-03-03",
        "overview": "After a mishap at work, Peter decides to take his health more seriously and diet with the help of Quagmire, Joe, and Cleveland. When Lois takes a stab at writing a romantic fantasy novel, a curious Brian and Stewie investigate to find out who she might have a crush."
      },
      {
        "id": "tvmaze:1610372",
        "title": "No Giggity, No Doubt",
        "season": 17,
        "episode": 15,
        "released": "2019-03-10",
        "overview": "When the guys volunteer to chaperone the high school prom, Quagmire hits it off with Courtney only to discover that she is his daughter. To his and the gang's surprise, Quagmire makes a serious effort to embrace parenting Courtney, joining Peter and Meg on an ill-fated father-daughter camping trip."
      },
      {
        "id": "tvmaze:1616522",
        "title": "You Can't Handle the Booth",
        "season": 17,
        "episode": 16,
        "released": "2019-03-24",
        "overview": "In a special episode, the Griffins provide DVD commentary on a recent episode and reveal never-before-told drama between Peter and Lois."
      },
      {
        "id": "tvmaze:1619574",
        "title": "Island Adventure",
        "season": 17,
        "episode": 17,
        "released": "2019-03-31",
        "overview": "In search of Stewie's cherished big wheel tricycle, that Peter threw out, Stewie and Brian embark on an adventure to \"Garbage Island,\" a giant floating mass of trash out in the sea. Meanwhile, Lois tries to help Quagmire elevate his dating game, as he courts a middle-aged woman."
      },
      {
        "id": "tvmaze:1634961",
        "title": "Throw It Away",
        "season": 17,
        "episode": 18,
        "released": "2019-04-28",
        "overview": "After Lois reads a new book on the joys of decluttering, she challenges the rest of the Griffins to throw anything out of the house that does not spark joy. While all starts out well, Lois soon takes the decluttering to a surprising extreme."
      },
      {
        "id": "tvmaze:1638397",
        "title": "Girl, Internetted",
        "season": 17,
        "episode": 19,
        "released": "2019-05-05",
        "overview": "When Meg suddenly becomes internet famous, she and an excited Peter work together to build her following and create content for her new image that revolves around unhealthy eating. Meanwhile, Brian and Stewie revel in a new ride while Brian's car gets repaired."
      },
      {
        "id": "tvmaze:1638763",
        "title": "Adam West High",
        "season": 17,
        "episode": 20,
        "released": "2019-05-12",
        "overview": "When Brian's proposition to rename Quahog's high school \"Adam West High,\" to honor the late Mayor West, is successful, he feels encouraged to run for office as Quahog's new mayor. The race takes a turn when Quagmire campaigns against Brian for the open seat."
      },
      {
        "id": "tvmaze:1674643",
        "title": "Yacht Rocky",
        "season": 18,
        "episode": 1,
        "released": "2019-09-29",
        "overview": "When the brewery announces it will be firing one employee, Peter is nervous he will be the one let go. In order to calm his nerves, the family departs on a Yacht Rock cruise that doesn't go as expected."
      },
      {
        "id": "tvmaze:1685891",
        "title": "Bri-Da",
        "season": 18,
        "episode": 2,
        "released": "2019-10-06",
        "overview": "Peter and his friends are sick of forgetting the million-dollar business ideas they come up with while drinking, so they strap on Joe's police body cams to record their every move. Meanwhile, Quagmire is trying to come to terms with an unexpected family development."
      },
      {
        "id": "tvmaze:1685892",
        "title": "Absolutely Babulous",
        "season": 18,
        "episode": 3,
        "released": "2019-10-13",
        "overview": "When Stewie receives a participation medal in his school's toddler games, he begins to question everything he has ever won. Meanwhile, Peter causes a fight between Lois' parents and must repair the damage he caused."
      },
      {
        "id": "tvmaze:1722422",
        "title": "Disney's the Reboot",
        "season": 18,
        "episode": 4,
        "released": "2019-10-20",
        "overview": "The network decides that it's time to explore some unique ways to reboot the series. When three versions of the reboots are shown to a focus group, the feedback takes some surprising turns."
      },
      {
        "id": "tvmaze:1722425",
        "title": "Cat Fight",
        "season": 18,
        "episode": 5,
        "released": "2019-11-03",
        "overview": "When Quagmire opens a cat caf in town, Brian decides to take a stand to get the caf shut down. Meanwhile, when Meg and Brian get in trouble at school, Lois becomes nervous and decides they need to go to church camp in order to find their way."
      },
      {
        "id": "tvmaze:1722426",
        "title": "Peter & Lois' Wedding",
        "season": 18,
        "episode": 6,
        "released": "2019-11-10",
        "overview": "The Wi-Fi goes out in the Griffin house, leaving the family with nothing to do for the evening. In order to keep the family entertained, Peter and Lois decide to tell the kids the story of how they met and fell in love in the '90s."
      },
      {
        "id": "tvmaze:1744387",
        "title": "Heart Burn",
        "season": 18,
        "episode": 7,
        "released": "2019-11-17",
        "overview": "In celebration of Peter and Lois' anniversary, the Griffins recount their own versions of three well-known love stories."
      },
      {
        "id": "tvmaze:1749354",
        "title": "Shanksgiving",
        "season": 18,
        "episode": 8,
        "released": "2019-11-24",
        "overview": "When Lois hosts a special Thanksgiving dinner for her family, Peter decides the best way to avoid it is to get arrested. Meanwhile, a secret that Stewie has been keeping from everyone is revealed."
      },
      {
        "id": "tvmaze:1760189",
        "title": "Christmas is Coming",
        "season": 18,
        "episode": 9,
        "released": "2019-12-15",
        "overview": "When Meg takes Stewie to the mall to meet Santa, she has a surprising response. Meanwhile, Stewie is entirely scarred from the same experience and Brian tries to help him process."
      },
      {
        "id": "tvmaze:1773701",
        "title": "Connie's Celica",
        "season": 18,
        "episode": 10,
        "released": "2020-01-05",
        "overview": "When Lois gets a job as the music teacher at Chris and Meg's school, a mean student, Connie, decides to make Lois the target of her antics."
      },
      {
        "id": "tvmaze:1776045",
        "title": "Short Cuts",
        "season": 18,
        "episode": 11,
        "released": "2020-02-16",
        "overview": "When Brian accidentally becomes a local hero, an old street pal - and now a successful millionaire dog - reaches out and tries to convince him to get neutered. Meanwhile, Lois gets a pixie cut against Peter's wishes, so Peter retaliates by trying to out-embarrass her."
      },
      {
        "id": "tvmaze:1776046",
        "title": "Undergrounded",
        "season": 18,
        "episode": 12,
        "released": "2020-02-23",
        "overview": "Peter secretly gets a credit card and overspends the family money, so Lois grounds him. To plan the perfect escape, he builds a tunnel leading directly to The Drunken Clam."
      },
      {
        "id": "tvmaze:1798770",
        "title": "Rich Old Stewie",
        "season": 18,
        "episode": 13,
        "released": "2020-03-01",
        "overview": "Stewie's future life could not be going any better, living as a wealthy, old Mr. Burns-type man, until his retirement is interrupted by Brian, who brings news that Peter is dying."
      },
      {
        "id": "tvmaze:1801284",
        "title": "The Movement",
        "season": 18,
        "episode": 14,
        "released": "2020-03-08",
        "overview": "When Peter starts coaching for Quahog's minor league baseball team, he gets constipated during the national anthem and must kneel, unintentionally becoming the face of racial justice."
      },
      {
        "id": "tvmaze:1805081",
        "title": "Baby Stewie",
        "season": 18,
        "episode": 15,
        "released": "2020-03-15",
        "overview": "Stewie builds a DNA-altering machine that will allow him to remain smart forever, but the invention has the adverse effect and he instead transforms into what he should have always been - an actual baby -."
      },
      {
        "id": "tvmaze:1824339",
        "title": "Start Me Up",
        "season": 18,
        "episode": 16,
        "released": "2020-04-19",
        "overview": "Peter's non-stop sweating becomes a liability at his company, so his boss tells him to work from home. Meanwhile, after Stewie and Chris cause thousands of dollars in damage to an electronics store, the two create a fake Kickstarter campaign with Brian to pay back the money."
      },
      {
        "id": "tvmaze:1829796",
        "title": "Coma Guy",
        "season": 18,
        "episode": 17,
        "released": "2020-04-26",
        "overview": "With a newfound love for rocking out to Van Halen, Peter gets in a car accident and falls into a coma."
      },
      {
        "id": "tvmaze:1836560",
        "title": "Better Off Meg",
        "season": 18,
        "episode": 18,
        "released": "2020-05-03",
        "overview": "When Meg is erroneously reported to have died in a car crash, she goes along with the story to start a new life elsewhere. Meanwhile, the Griffins experience a life without Meg."
      },
      {
        "id": "tvmaze:1836561",
        "title": "Holly Bibble",
        "season": 18,
        "episode": 19,
        "released": "2020-05-10",
        "overview": "Cooped up in a hotel room due to a big storm, the Griffins pass the time by reimagining three stories from the Bible."
      },
      {
        "id": "tvmaze:1836562",
        "title": "Movin' In (Principal Shepherd's Song)",
        "season": 18,
        "episode": 20,
        "released": "2020-05-17",
        "overview": "Principal Shepherd moves in with the Griffins after he is fired for fat-shaming Chris at school. Meanwhile, Brian sues Stewie for writing a series of children's books which portray him as an idiot."
      },
      {
        "id": "tvmaze:1905910",
        "title": "Stewie's First Word",
        "season": 19,
        "episode": 1,
        "released": "2020-09-27",
        "overview": "Stewie finally says his first word, and it's a swear. When Lois is shunned by the other moms, she tries to figure out where Stewie could have possibly learned it."
      },
      {
        "id": "tvmaze:1912675",
        "title": "The Talented Mr. Stewie",
        "season": 19,
        "episode": 2,
        "released": "2020-10-04",
        "overview": "Stewie \"breaks up with\" Rupert after learning that he used to belong to Chris. Unable to get over his feelings of betrayal, Stewie decides to take action."
      },
      {
        "id": "tvmaze:1931140",
        "title": "Boys & Squirrels",
        "season": 19,
        "episode": 3,
        "released": "2020-10-11",
        "overview": "When Peter injures himself and a family of squirrels in a chainsaw accident, Chris and Stewie take in one of the injured rodents to nurse it back to health. Meanwhile, a chiropractor fixes Peter's injury by realigning his spine - and restoring him to his \"true height\" of 6'5\"."
      },
      {
        "id": "tvmaze:1937534",
        "title": "Cutawayland",
        "season": 19,
        "episode": 4,
        "released": "2020-11-01",
        "overview": "Peter and Lois accidentally set up a cutaway gag together, which somehow transports them into the cutaway itself."
      },
      {
        "id": "tvmaze:1912676",
        "title": "La Famiglia Guy",
        "season": 19,
        "episode": 5,
        "released": "2020-11-08",
        "overview": "When Joe asks Peter to be the godfather to his daughter, Peter commits to his mistaken interpretation of the role so much that he becomes a real gangster."
      },
      {
        "id": "tvmaze:1912677",
        "title": "Meg's Wedding",
        "season": 19,
        "episode": 6,
        "released": "2020-11-15",
        "overview": "Meg plans her wedding to an unexpected Quahog resident. Meanwhile, Peter finds a new vest and on one of many adventures fitting for his new attire, his arms are torn off and he is left with tiny hands that have yet to grow back."
      },
      {
        "id": "tvmaze:1961062",
        "title": "Wild Wild West",
        "season": 19,
        "episode": 7,
        "released": "2020-11-22",
        "overview": "Lois and Peter are divided by differing views on who the next Mayor of Quahog should be. Upset at Lois' first choice, Peter seeks out the late Mayor Adam West's cousin, Wild Wild West."
      },
      {
        "id": "tvmaze:1968978",
        "title": "Pawtucket Pat",
        "season": 19,
        "episode": 8,
        "released": "2020-12-06",
        "overview": "Brian's new job as a journalist leads him to uncover that Pawtucket Pat, Quahog's hero and brewery founder, took part in racist actions against Native Americans. The town becomes divided on whether or not to remove the statue that commemorates him."
      },
      {
        "id": "tvmaze:1973111",
        "title": "The First No L",
        "season": 19,
        "episode": 9,
        "released": "2020-12-13",
        "overview": "When the family fails to help Lois with the Christmas shopping, she walks out on the family and the Griffins must try to save Christmas on their own."
      },
      {
        "id": "tvmaze:1980419",
        "title": "Fecal Matters",
        "season": 19,
        "episode": 10,
        "released": "2021-01-17",
        "overview": "When Peter makes it through a bad flu season without getting sick, the hospital asks him to volunteer as a nurse, but he finds himself at a crossroads when his mortal enemy, The Giant Chicken, is admitted to the ER. Meanwhile, Brian receives his genetic test results and learns he is part cat, causing him to have an identity crisis."
      },
      {
        "id": "tvmaze:1977954",
        "title": "Boy's Best Friend",
        "season": 19,
        "episode": 11,
        "released": "2021-02-21",
        "overview": "While Brian bonds with the son of his new girlfriend. Meanwhile, Peter, Quagmire and Cleveland take a joy ride in Joe's new classic corvette."
      },
      {
        "id": "tvmaze:2017173",
        "title": "And Then There's Fraud",
        "season": 19,
        "episode": 12,
        "released": "2021-02-28",
        "overview": "After attending a baseball game, Peter and Chris are inspired to start a memorabilia business. Meanwhile, Stewie tries to combat aging by getting plastic surgery, but ends up taking it too far."
      },
      {
        "id": "tvmaze:2028981",
        "title": "PeTerminator",
        "season": 19,
        "episode": 13,
        "released": "2021-03-07",
        "overview": "Stewie designs a \"Terminator\" Peter robot to destroy Lois for trying to feed him broccoli, but when things don't go according to plan, Stewie and Brian must go on a Terminator-esque mission to save Stewie's life."
      },
      {
        "id": "tvmaze:2029706",
        "title": "The Marrying Kind",
        "season": 19,
        "episode": 14,
        "released": "2021-03-14",
        "overview": "Stewie gets a mail order bride from Ukraine and experiences domestic life. Meanwhile, Peter and Chris become addicted to free hotel breakfast buffets."
      },
      {
        "id": "tvmaze:2040899",
        "title": "Customer of the Week",
        "season": 19,
        "episode": 15,
        "released": "2021-03-28",
        "overview": "After feeling unappreciated by her family, Lois taps into her villainous side and attempts to win \"Best Customer\" at her favorite coffee shop."
      },
      {
        "id": "tvmaze:2040968",
        "title": "Who's Brian Now?",
        "season": 19,
        "episode": 16,
        "released": "2021-04-11",
        "overview": "Brian has a microchip that reveals he had a family before the Griffins, when he then seeks out. After meeting the richer, smarter Hendersons, Brian struggles to enjoy his life with the Griffins as much as he once did."
      },
      {
        "id": "tvmaze:2040969",
        "title": "The Young Parent Trap",
        "season": 19,
        "episode": 17,
        "released": "2021-04-18",
        "overview": "Lois and Peter are mistaken for \"young parents\" by another couple at Stewie's school and invited to live in a millennial apartment complex, leaving Meg and Chris home alone."
      },
      {
        "id": "tvmaze:2040970",
        "title": "Meg Goes to College",
        "season": 19,
        "episode": 18,
        "released": "2021-05-02",
        "overview": "Meg deals with a college admissions scandal, while Brian embarks on a fitness journey."
      },
      {
        "id": "tvmaze:2040971",
        "title": "Family Cat",
        "season": 19,
        "episode": 19,
        "released": "2021-05-09",
        "overview": "Brian tries to convince The Griffins that their new adopted cat, Pouncy, is evil."
      },
      {
        "id": "tvmaze:2040973",
        "title": "Tales of Former Sports Glory",
        "season": 19,
        "episode": 20,
        "released": "2021-05-16",
        "overview": "The guys regale each other with stories of youthful athletic accomplishments. Cleveland was a teenage baseball player from Cuba, Quagmire was a bad boy tennis superstar from New York and Peter was an underdog boxer from Philadelphia."
      },
      {
        "id": "tvmaze:2136733",
        "title": "LASIK Instinct",
        "season": 20,
        "episode": 1,
        "released": "2021-09-26",
        "overview": "With her vision waning, Lois elects to get LASIK surgery, but exploits her new disability for monetary gain. Meanwhile, Peter, Chris and Stewie must partake in all the activities with Doug that his father neglects."
      },
      {
        "id": "tvmaze:2166447",
        "title": "Rock Hard",
        "season": 20,
        "episode": 2,
        "released": "2021-10-03",
        "overview": "While at an old record store, Peter and the guys recount tales of three rock legends: Jim Morrison, Muddy Waters and Elton John."
      },
      {
        "id": "tvmaze:2172947",
        "title": "Must Love Dogs",
        "season": 20,
        "episode": 3,
        "released": "2021-10-10",
        "overview": "Quagmire meets an avid dog lover, and pretends Brian is his dog in an attempt to win her over. Meanwhile, Chris helps Stewie track down the culprit who stole his Halloween candy in the \"Must Love Dogs\" Halloween-themed episode of FAMILY GUY."
      },
      {
        "id": "tvmaze:2180119",
        "title": "80's Guy",
        "season": 20,
        "episode": 4,
        "released": "2021-10-17",
        "overview": "Impelled by nostalgia, Peter recreates movie scenes from his favorite decade. Meanwhile, Stewie and Doug compete to retrieve a frisbee stuck at the top of the jungle gym."
      },
      {
        "id": "tvmaze:2185212",
        "title": "Brief Encounter",
        "season": 20,
        "episode": 5,
        "released": "2021-10-24",
        "overview": "When Peter and Quagmire accidentally switch underwear, they begin to mimic the other's behavior. Meanwhile, Stewie and Doug agree to commit each other's murders."
      },
      {
        "id": "tvmaze:2196714",
        "title": "Cootie & The Blowhard",
        "season": 20,
        "episode": 6,
        "released": "2021-11-07",
        "overview": "Stewie takes drastic measures when he thinks he is diagnosed with terminal \"cooties.\" Meanwhile, Peter becomes infatuated with Bonnie's cooking."
      },
      {
        "id": "tvmaze:2198364",
        "title": "Peterschmidt Manor",
        "season": 20,
        "episode": 7,
        "released": "2021-11-14",
        "overview": "Lois and her father attend the funeral of Lois' childhood nanny. Meanwhile, Peter and the rest of the family turn Pewterschmidt mansion into a hotel."
      },
      {
        "id": "tvmaze:2205197",
        "title": "The Birthday Bootlegger",
        "season": 20,
        "episode": 8,
        "released": "2021-11-21",
        "overview": "A new boss (Preston Lloyd) quells Peter's favorite part about work: office birthdays. Meanwhile, Stewie is put in detention and comes out a ruffian."
      },
      {
        "id": "tvmaze:2209756",
        "title": "The Fatman Always Rings Twice",
        "season": 20,
        "episode": 9,
        "released": "2021-11-28",
        "overview": "In noir-style, Peter/Mac investigates the disappearance of Meg/Sister Megan."
      },
      {
        "id": "tvmaze:2222034",
        "title": "Christmas Crime",
        "season": 20,
        "episode": 10,
        "released": "2021-12-19",
        "overview": "When Mayor West's nativity scene is ruined, Brian is seen as the prime suspect."
      },
      {
        "id": "tvmaze:2238986",
        "title": "Mister Act",
        "season": 20,
        "episode": 11,
        "released": "2022-01-09",
        "overview": "An accident leaves Peter with a high-pitched voice, and Jesus coaches him into fending off the other choir boys; meanwhile, Stewie is attracted to Lois' new masculine physique."
      },
      {
        "id": "tvmaze:2270937",
        "title": "The Lois Quagmire",
        "season": 20,
        "episode": 12,
        "released": "2022-02-27",
        "overview": "At odds with Peter, Lois takes Quagmire to her high school reunion. Meanwhile, the rest of the family must cover up the death of a pizza delivery man."
      },
      {
        "id": "tvmaze:2274807",
        "title": "Lawyer Guy",
        "season": 20,
        "episode": 13,
        "released": "2022-03-06",
        "overview": "Peter hires the town's new lawyer, Brick Baker, to represent him in litigation against his new neighbor.. who turns out to be Brick. Meanwhile, Brian and Stewie become lobstermen and save Rupert from the perils of the deep."
      },
      {
        "id": "tvmaze:2279039",
        "title": "HBO-No",
        "season": 20,
        "episode": 14,
        "released": "2022-03-13",
        "overview": "The Griffins tell their own versions of three HBO shows: \"Game of Thrones,\" \"Succession\" and \"Big Little Lies.\""
      },
      {
        "id": "tvmaze:2285306",
        "title": "Hard Boiled Meg",
        "season": 20,
        "episode": 15,
        "released": "2022-03-20",
        "overview": "Meg is invigorated by her new role as a getaway driver, Meanwhile, Quagmire can't rid himself of the hiccups and implores Peter to kill him."
      },
      {
        "id": "tvmaze:2288692",
        "title": "Prescription Heroine",
        "season": 20,
        "episode": 16,
        "released": "2022-03-27",
        "overview": "After Brian sustains an injury, Lois gets hooked on his painkillers. Meanwhile, Cleveland refurbishes Peter's ping pong table, which becomes the hot spot in the neighborhood."
      },
      {
        "id": "tvmaze:2308430",
        "title": "All About Alana",
        "season": 20,
        "episode": 17,
        "released": "2022-05-01",
        "overview": "When Lois' piano student, Alana, comes to work for the Griffins, Lois is initially glad for the help, until she realizes Alana's intentions are more sinister than she thought."
      },
      {
        "id": "tvmaze:2308431",
        "title": "Girlfriend, Eh?",
        "season": 20,
        "episode": 18,
        "released": "2022-05-08",
        "overview": "Peter and Chris take a road trip to Canada to prove the existence of Chris' girlfriend. Meanwhile, Lois and Meg compete for the attention of a handsome handyman."
      },
      {
        "id": "tvmaze:2308432",
        "title": "First Blood",
        "season": 20,
        "episode": 19,
        "released": "2022-05-15",
        "overview": "The guys' physical prowess is tested at Mayor West's dude ranch. Meanwhile, Stewie thinks he's gotten his first period."
      },
      {
        "id": "tvmaze:2308433",
        "title": "Jersey Bore",
        "season": 20,
        "episode": 20,
        "released": "2022-05-22",
        "overview": "Peter attends a business conference in Atlantic City with Preston. Meanwhile, Stewie helps Chris prepare for his role in Adam West High's rendition of \"Romeo and Juliet\"."
      },
      {
        "id": "tvmaze:2341175",
        "title": "Oscars Guy",
        "season": 21,
        "episode": 1,
        "released": "2022-09-25",
        "overview": "\"Family Guy\" retells three Oscar-winning stories: \"Silence of the Lambs,\" \"American Beauty\" and \"Forrest Gump,\"."
      },
      {
        "id": "tvmaze:2392929",
        "title": "Bend or Blockbuster",
        "season": 21,
        "episode": 2,
        "released": "2022-10-02",
        "overview": "Resolved to enjoy a family movie night, the Griffins take a road trip to Bend, Oregon, to rent a VHS from the last Blockbuster in existence."
      },
      {
        "id": "tvmaze:2395428",
        "title": "A Wife-Changing Experience",
        "season": 21,
        "episode": 3,
        "released": "2022-10-09",
        "overview": "Joe accidentally sees Lois naked, leading to a reinvigoration of his sex life with Bonnie. Meanwhile, Stewie is gifted an electric SUV and quickly embodies the \"Range Rover\" lifestyle."
      },
      {
        "id": "tvmaze:2399543",
        "title": "The Munchurian Candidate",
        "season": 21,
        "episode": 4,
        "released": "2022-10-16",
        "overview": "Lois hypnotizes Peter into satisfying her sexual proclivities. Meanwhile, Stewie renovates his treehouse in an attempt to win over Brian and Chris."
      },
      {
        "id": "tvmaze:2410514",
        "title": "Unzipped Code",
        "season": 21,
        "episode": 5,
        "released": "2022-10-23",
        "overview": "Cleveland is fired as a mailman after an ignominious mishap, but flourishes in his new job at the brewery."
      },
      {
        "id": "tvmaze:2411934",
        "title": "Happy Holo-ween",
        "season": 21,
        "episode": 6,
        "released": "2022-10-30",
        "overview": "Peter makes a hologram of himself in order to get out of menial household duties."
      },
      {
        "id": "tvmaze:2418662",
        "title": "The Stewaway",
        "season": 21,
        "episode": 7,
        "released": "2022-11-13",
        "overview": "During a game of \"hide and seek,\" Stewie takes refuge in Quagmire's suitcase, only to wind up in Paris. Meanwhile, Peter and Lois take a getaway to Vermont, where Lois is intent on breaking Bonnie's Instagram \"like\" record."
      },
      {
        "id": "tvmaze:2421796",
        "title": "Get Stewie",
        "season": 21,
        "episode": 8,
        "released": "2022-11-20",
        "overview": "Stewie finds himself in public disgrace after a popstar unleashes her fan base on him for a benign comment. Meanwhile, Peter gets lap band surgery and enjoys the merriment of excess skin."
      },
      {
        "id": "tvmaze:2430971",
        "title": "Carny Knowledge",
        "season": 21,
        "episode": 9,
        "released": "2022-12-04",
        "overview": "Peter and Chris finish last in a \"Generation Gap\" game at a carnival, forcing them to try to reconnect. Meanwhile, Brian starts to date a carny, whom he can't break up with even after witnessing some of her crude habits."
      },
      {
        "id": "tvmaze:2430972",
        "title": "The Candidate",
        "season": 21,
        "episode": 10,
        "released": "2022-12-11",
        "overview": "Stewie and Doug compete for the honor of class \"snack captain\"."
      },
      {
        "id": "tvmaze:2451079",
        "title": "Love Story Guy",
        "season": 21,
        "episode": 11,
        "released": "2023-01-08",
        "overview": "The guys recount their first true love stories, leading to parodies of Castaway, Dirty Dancing, and various Meg Ryan rom-coms."
      },
      {
        "id": "tvmaze:2457305",
        "title": "Old West",
        "season": 21,
        "episode": 12,
        "released": "2023-02-19",
        "overview": "The guys try to help Mayor Wild West reconnect with his estranged father, Old West."
      },
      {
        "id": "tvmaze:2459687",
        "title": "Single White Dad",
        "season": 21,
        "episode": 13,
        "released": "2023-02-26",
        "overview": "Peter is mistaken for being a single parent, and relishes in the perks that come with it."
      },
      {
        "id": "tvmaze:2459691",
        "title": "White Meg Can't Jump",
        "season": 21,
        "episode": 14,
        "released": "2023-03-05",
        "overview": "Meg joins the Adam West High School basketball team, and her play is fueled by Peter's lambasting from the crowd. Meanwhile, Stewie goes down a rabbit hole of conspiracies, which ultimately ends with him developing multiple personalities."
      },
      {
        "id": "tvmaze:2459695",
        "title": "Adoptation",
        "season": 21,
        "episode": 15,
        "released": "2023-03-12",
        "overview": "To restore his public image, Carter adopts a young girl from an orphanage, drawing jealousy from Lois."
      },
      {
        "id": "tvmaze:2459696",
        "title": "The Bird Reich",
        "season": 21,
        "episode": 16,
        "released": "2023-04-16",
        "overview": "To take advantage of a work policy granting leave in the event of a pet's death, Peter adopts the oldest bird he can find... and realizes it used to belong to Hitler. Meanwhile, after giving Stewie a signed copy of his book, Brian finds it in a free library, causing Brian to give up writing."
      },
      {
        "id": "tvmaze:2459702",
        "title": "A Bottle Episode",
        "season": 21,
        "episode": 17,
        "released": "2023-04-16",
        "overview": "Lois is blocked from a vacation rental app and accused of stealing after the family's trip to Nantucket. Meanwhile, Stewie and Brian buy saltwater taffy in bulk, and try their hands at door-to-door sales in the community."
      },
      {
        "id": "tvmaze:2459705",
        "title": "Vat Man and Rob 'Em",
        "season": 21,
        "episode": 18,
        "released": "2023-04-23",
        "overview": "When Peter gets a job as the new night watchman, he and the guys turn Pawtucket Brewery into an after-hours bar. Meanwhile, Stewie and Brian's plan to collect \"lost dog\" return money backfires when Brian is used for a dangerous TikTok stunt."
      },
      {
        "id": "tvmaze:2459712",
        "title": "From Russia with Love",
        "season": 21,
        "episode": 19,
        "released": "2023-04-30",
        "overview": "After Brian's Instagram is hacked, Meg takes Stewie and Brian to Russia, only to realize she'd rather stay there. Meanwhile, Lois reverts to her tormented teenage self when Quagmire starts dating her high school bully."
      },
      {
        "id": "tvmaze:2459714",
        "title": "Adult Education",
        "season": 21,
        "episode": 20,
        "released": "2023-05-07",
        "overview": "Meg gets married in Russia but returns home after discovering she was used for a green card marriage. Meanwhile, Chris, in need of an extracurricular activity, joins Principal Shepherd in shooting pornos at the high school."
      },
      {
        "id": "tvmaze:2594031",
        "title": "Fertilized Megg",
        "season": 22,
        "episode": 1,
        "released": "2023-10-01",
        "overview": "Meg agrees to be Bruce and Jeffery's surrogate causing a pregnant Meg to annoy her family. But, when the couple fails to pick up the baby, the Griffin's must take care of their new family member."
      },
      {
        "id": "tvmaze:2652985",
        "title": "Supermarket Pete",
        "season": 22,
        "episode": 2,
        "released": "2023-10-08",
        "overview": "With the brewery under construction, Lois implores Peter to take a new job, but grows irate when he begins work at the grocery store. Meanwhile, armed with his police stories, Joe and Brian team up to write their own true crime novel."
      },
      {
        "id": "tvmaze:2661237",
        "title": "A Stache From the Past",
        "season": 22,
        "episode": 3,
        "released": "2023-10-22",
        "overview": "When Peter loses the Griffins' home in a reverse mortgage, he and Mayor West travel to confront the man advertising the scheme, Tom Selleck. Meanwhile, Stewie and Brian open a booth at the flea market, leading to a rivalry with Bruce."
      },
      {
        "id": "tvmaze:2663801",
        "title": "Old World Harm",
        "season": 22,
        "episode": 4,
        "released": "2023-11-05",
        "overview": "Peter and Lois vacation in Florida, only to discover they've rented a condo in a retirement community. Back at home, Brian helps Stewie take his first shower."
      },
      {
        "id": "tvmaze:2673368",
        "title": "Baby, It's Cold Inside",
        "season": 22,
        "episode": 5,
        "released": "2023-11-12",
        "overview": "Peter is emasculated when, on their anniversary, he abandons Lois amidst a shark attack. Meanwhile, Stewie finds a mini fridge and lives the dorm lifestyle."
      },
      {
        "id": "tvmaze:2679649",
        "title": "Boston Stewie",
        "season": 22,
        "episode": 6,
        "released": "2023-11-19",
        "overview": "Stewie tries to civilize his half-brother, Boston Stewie, so that he may be adopted. Meanwhile, Meg and Chris start a venture in which people online pay Chris to sit on and smash cupcakes."
      },
      {
        "id": "tvmaze:2680425",
        "title": "Snap(ple) Decision",
        "season": 22,
        "episode": 7,
        "released": "2023-11-26",
        "overview": "Winner of a Snapple contest, Lois uses her winnings to take Meg on a tropical vacation. Flaunting their wealth, the two are kidnapped. Meanwhile, Stewie and Brian undergo \"friendship therapy\"."
      },
      {
        "id": "tvmaze:2680426",
        "title": "Baking Sad",
        "season": 22,
        "episode": 8,
        "released": "2023-12-03",
        "overview": "Meg discovers her tears produce delicious cookies, and her, along with her siblings, enjoy a profit until the success makes her too happy to cry. Meanwhile, Peter and the guys launch a \"male talk show\"."
      },
      {
        "id": "tvmaze:2680427",
        "title": "The Return of the King (of Queens)",
        "season": 22,
        "episode": 9,
        "released": "2023-12-17",
        "overview": "Lois decides to sell the family's TV to help pay for Christmas presents; Kevin James gets upset over losing Peter as a viewer."
      },
      {
        "id": "tvmaze:2717618",
        "title": "Cabin Pressure",
        "season": 22,
        "episode": 10,
        "released": "2024-03-06",
        "overview": "When the Griffins win a trip to Maine at Peter's company picnic, they decide to invite their friends on the vacation; tensions run high and things soon spiral out of control when the cabin burns down."
      },
      {
        "id": "tvmaze:2691922",
        "title": "Teacher's Heavy Pet",
        "season": 22,
        "episode": 11,
        "released": "2024-03-13",
        "overview": "Lois joins Chris' school as a substitute teacher."
      },
      {
        "id": "tvmaze:2717617",
        "title": "Take This Job and Love It",
        "season": 22,
        "episode": 12,
        "released": "2024-03-20",
        "overview": "Peter and his friends wonder about what their dream jobs would be; Peter enters a sequence featuring himself as a James Bond-type; Quagmire reflects on his job as an aerobics instructor; Cleveland and Joe take part in a \"Lethal Weapon\" sequence."
      },
      {
        "id": "tvmaze:2796786",
        "title": "Lifeguard Meg",
        "season": 22,
        "episode": 13,
        "released": "2024-03-27",
        "overview": "Stewie and Brian become overwhelmed after winning a coffee shop; Peter and his friends annoy Meg at her new lifeguard job when they don't follow the pool rules."
      },
      {
        "id": "tvmaze:2806821",
        "title": "Fat Actor",
        "season": 22,
        "episode": 14,
        "released": "2024-04-10",
        "overview": "Peter tries to protest Hollywood after learning that Brad Pitt was cast in a biopic about a politician. After Pitt injures himself on set, Peter must act out the role himself."
      },
      {
        "id": "tvmaze:2815239",
        "title": "Faith No More",
        "season": 22,
        "episode": 15,
        "released": "2024-04-17",
        "overview": "Brian becomes romantically interested in someone and it inspires him to use Stewie's time machine. Strange consequences result from their journey."
      },
      {
        "id": "tvmaze:3117920",
        "title": "Fat Gun",
        "season": 23,
        "episode": 1,
        "released": "2025-02-16",
        "overview": "Peter and his family and friends star in a parody of \"Top Gun.\""
      },
      {
        "id": "tvmaze:3127856",
        "title": "Live, Laugh, Love",
        "season": 23,
        "episode": 2,
        "released": "2025-02-23",
        "overview": "Peter tries to make Joe laugh when he realizes Joe has never found him funny. Lois chaperones Chris and Meg's school trip, where she hopes to reunite Principal Shepherd with his long-lost love."
      },
      {
        "id": "tvmaze:3128253",
        "title": "Drunk With Power",
        "season": 23,
        "episode": 3,
        "released": "2025-03-02",
        "overview": "Peter runs into Supreme Court Justice Brett Kavanaugh at a brewery tour."
      },
      {
        "id": "tvmaze:3128254",
        "title": "Lois C.K.",
        "season": 23,
        "episode": 4,
        "released": "2025-03-09",
        "overview": "Lois becomes a stand-up comedian."
      },
      {
        "id": "tvmaze:3143219",
        "title": "The Chicken or the Meg",
        "season": 23,
        "episode": 5,
        "released": "2025-03-16",
        "overview": "Meg starts dating a chicken she meets on a reality dating show \"Sex Farm\" and moves out when Peter disapproves of their relationship."
      },
      {
        "id": "tvmaze:3157447",
        "title": "Dog Is My Co-Pilot",
        "season": 23,
        "episode": 6,
        "released": "2025-03-23",
        "overview": "Brian and Quagmire successfully land the plane and go on a press tour."
      },
      {
        "id": "tvmaze:3157529",
        "title": "Pitch Imperfect",
        "season": 23,
        "episode": 7,
        "released": "2025-03-30",
        "overview": "Peter must gain his family's respect back after he makes a humiliating throw. Brian and Stewie become chiropractors."
      },
      {
        "id": "tvmaze:3170300",
        "title": "Hard Times at Adam West High",
        "season": 23,
        "episode": 8,
        "released": "2025-04-06",
        "overview": "Chris uses Stewie's time machine to stop himself from having an erection during a book report. Peter becomes jealous when he sits out of a lottery pool and the guys win $123."
      },
      {
        "id": "tvmaze:3173142",
        "title": "The Elle Word",
        "season": 23,
        "episode": 9,
        "released": "2025-04-13",
        "overview": "When Quagmire starts dating a mystery woman, Peter, Joe, and Cleveland go on a stakeout and discover her to be The Librarian."
      },
      {
        "id": "tvmaze:3192300",
        "title": "A Real Who's Hulu",
        "season": 23,
        "episode": 10,
        "released": "2025-04-27",
        "overview": "This episode will feature three Hulu parodies such as Only Murders in the Building, The Dropout and The Bear."
      },
      {
        "id": "tvmaze:3197519",
        "title": "China Doll",
        "season": 23,
        "episode": 11,
        "released": "2025-05-04",
        "overview": "Stewie finds out his stuffed bear Rupert was made in China and makes it his mission to take him back there to meet his family."
      },
      {
        "id": "tvmaze:3217031",
        "title": "One Foot in Front of the Mother",
        "season": 23,
        "episode": 12,
        "released": "2025-05-11",
        "overview": "Brian wears a shock collar while Chris discovers a talent for speed walking."
      },
      {
        "id": "tvmaze:3217032",
        "title": "The Fat Lotus",
        "season": 23,
        "episode": 13,
        "released": "2025-05-18",
        "overview": "Peter suspects an affair between Lois and Quagmire."
      },
      {
        "id": "tvmaze:3226071",
        "title": "Cool Hand Lois",
        "season": 23,
        "episode": 14,
        "released": "2025-05-29",
        "overview": "Lois abandons her responsibilities as a mother and dates Bonnie when she masturbates for the first time, so Peter and Joe crash their wives' couples' trip to win them back."
      },
      {
        "id": "tvmaze:3235932",
        "title": "Martian Meg",
        "season": 23,
        "episode": 15,
        "released": "2025-06-05",
        "overview": "Meg enlists in a training program for a mission to Mars when she gets fed up with feeling like she doesn't belong."
      },
      {
        "id": "tvmaze:3235933",
        "title": "Row v. Wade",
        "season": 23,
        "episode": 16,
        "released": "2025-07-03",
        "overview": "Brian wins a boat on \"The Price is Right\" and decides to sail to Texas to help women seeking legal abortions."
      },
      {
        "id": "tvmaze:3235934",
        "title": "Karenheit 451",
        "season": 23,
        "episode": 17,
        "released": "2025-07-10",
        "overview": "Lois becomes the leader of a group of mothers who want to ban books from schools."
      },
      {
        "id": "tvmaze:3235935",
        "title": "Twain's World",
        "season": 23,
        "episode": 18,
        "released": "2025-07-17",
        "overview": "Brian plans to improve his writing by convincing Stewie to go back in time and bring Mark Twain to the present-day."
      },
      {
        "id": "tvmaze:3438910",
        "title": "TBA",
        "season": 24,
        "episode": 1,
        "released": "2026-02-15",
        "overview": ""
      },
      {
        "id": "tvmaze:3438913",
        "title": "TBA",
        "season": 24,
        "episode": 2,
        "released": "2026-02-22",
        "overview": ""
      }
    ]
  }
}