{
  "meta": {
    "id": "tvmaze:86738",
    "type": "series",
    "name": "I Love LA",
    "description": "I Love LA follows a codependent friend group navigating life and love in Los Angeles. With aspirations of becoming a talent manager, Maia is stalled out as an assistant while living with her boyfriend... until her longtime best friend and frenzied influencer Tallulah returns.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/596/1490312.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/596/1490312.jpg",
    "videos": [
      {
        "id": "tvmaze:3340974",
        "title": "Divas Down",
        "season": 1,
        "episode": 7,
        "released": "2025-12-14",
        "overview": "While Tallulah is completely absorbed in her new relationship, Maia turns her attention to scoring a seat for Tallulah at an exclusive fashion dinner. Alani accompanies Charlie home from a surgery."
      },
      {
        "id": "tvmaze:3340975",
        "title": "I Love NY",
        "season": 1,
        "episode": 8,
        "released": "2025-12-21",
        "overview": "The girls return to New York for an exclusive fashion event, and Maia tries to enjoy herself while Tallulah contends with some questionable styling decisions. Alani plans a surprise for her parents' anniversary. Back in LA, Charlie checks on Dylan."
      },
      {
        "id": "tvmaze:3340971",
        "title": "Game Night",
        "season": 1,
        "episode": 6,
        "released": "2025-12-07",
        "overview": "Maia scores Tallulah a high-profile ad campaign, but Tallulah questions its resulting impact on her brand. Maia joins Dylan's work friends for a game night, and things get horny. Meanwhile, Charlie runs into an ex at a funeral."
      },
      {
        "id": "tvmaze:3340966",
        "title": "Block Her",
        "season": 1,
        "episode": 1,
        "released": "2025-11-02",
        "overview": "Newly 27, Maia hyper-fixates on the state of her life in Los Angeles while attempting to impress her boss, Alyssa. But when her carefully laid plans are upended by the surprise arrival of her chaotic BFF Tallulah, Maia must contend with complicated feelings towards her oldest friend."
      },
      {
        "id": "tvmaze:3340967",
        "title": "Roger & Munchy",
        "season": 1,
        "episode": 2,
        "released": "2025-11-09",
        "overview": "While settling into her role as her best friend's manager, Maia must do damage control when Tallulah's erratic frenemy accuses her of stealing a Balenciaga bag. Meanwhile, Charlie searches for dirt on a movie star to share with a high-profile client, and Alani visits her dad's office."
      },
      {
        "id": "tvmaze:3340968",
        "title": "Girl's Girl",
        "season": 1,
        "episode": 3,
        "released": "2025-11-16",
        "overview": "After Paulena's rant goes viral, Tallulah grows increasingly anxious over the online hate, while Maia wrestles with following Alyssa's advice or her own managerial instincts after securing an important brand deal."
      },
      {
        "id": "tvmaze:3340969",
        "title": "Upstairses",
        "season": 1,
        "episode": 4,
        "released": "2025-11-23",
        "overview": "As Tallulah's star rises, she receives an invite to a famous influencer's party. There, Maia and Alani have an eccentric encounter with the home's famous owner, Tallulah faces the reality of an influencing career, and Charlie is pulled into the orbit of a new guy."
      },
      {
        "id": "tvmaze:3340970",
        "title": "They Can't All Be Jeremys",
        "season": 1,
        "episode": 5,
        "released": "2025-11-30",
        "overview": "Impressed with Maia's strides at work, Alyssa invites her and Dylan over for dinner. Meanwhile, Charlie finds himself charmed by Lukas and his friend group, and Alani teaches Tallulah to drive."
      }
    ]
  }
}