{
  "meta": {
    "id": "tvmaze:43567",
    "type": "series",
    "name": "The Murder Tapes",
    "description": "Homicide investigations unfold through dramatic real video footage in this groundbreaking new series. This series provides an up-close perspective on homicide investigations, incorporating bodycam footage from the initial crime scene, surveillance video, and interrogation room recordings. This footage is interwoven with present-day interviews from those directly involved in the investigation. The Murder Tapes uses every conceivable form of authentic video available, sharing up-close perspectives in a raw and unfiltered form. Viewers see and hear first impressions from officers to show exactly how theories begin to arise, heart-pounding confessionals inside the interrogation room, and from loved ones in real time.",
    "poster": "https://static.tvmaze.com/uploads/images/original_untouched/473/1183740.jpg",
    "background": "https://static.tvmaze.com/uploads/images/original_untouched/473/1183740.jpg",
    "videos": [
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:3449212",
        "title": "A Date with Destiny",
        "season": 10,
        "episode": 3,
        "released": "2025-12-03",
        "overview": "Destiny Orr Clark's friend calls 911 hysterical after two men shoot and kill Destiny behind a Chuckie Cheese late at night; police race to the scene and begin their investigation to see who killed the 19-year-old and why they wanted her dead."
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      },
      {
        "id": "tvmaze:1706130",
        "title": "Albuquerque Ambush",
        "season": 1,
        "episode": 1,
        "released": "2019-08-28",
        "overview": "Don Fluitt is dead. Now, body-cam video and original audio capture the detectives hunt for his killer. As the case unravels, security video captures the moments just before the evil deed and a surprising twist will bring this killer to their knees."
      },
      {
        "id": "tvmaze:1706131",
        "title": "Scene of the Crime",
        "season": 1,
        "episode": 2,
        "released": "2019-09-04",
        "overview": "When Brad McGarry is discovered murdered in his Ohio basement, residents in this sleepy coalmining town are left in shock. Detectives suspect robbery but then a friend comes forward and points them in the direction of someone whom they least expected."
      },
      {
        "id": "tvmaze:1706132",
        "title": "Jane Doe",
        "season": 1,
        "episode": 3,
        "released": "2019-09-11",
        "overview": "Judith Therianos is a free spirit who wants to see the good in everyone; after her body is found in a wooded area, detectives unearth video surveillance that shows her alone and unaware of the danger she faces moments before her life is cut short."
      },
      {
        "id": "tvmaze:1710070",
        "title": "Frenzy",
        "season": 1,
        "episode": 4,
        "released": "2019-09-18",
        "overview": "Billy Shuler is dead. Now, video and audio capture the detectives desperate hunt for his killer. As the case slowly unravels, someone comes forward and identifies Billy's murderer. When the US Marshals get involved, the killer is brought to justice."
      },
      {
        "id": "tvmaze:1721787",
        "title": "Don't Go in There",
        "season": 1,
        "episode": 5,
        "released": "2019-09-25",
        "overview": "Beverly Puccio is found murdered in her home by her ex-boyfriend, who displays odd behavior; detectives use security and traffic cam footage to piece together the last night of her life, including an encounter with a mysterious stranger."
      },
      {
        "id": "tvmaze:1721968",
        "title": "I Did It",
        "season": 1,
        "episode": 6,
        "released": "2019-10-02",
        "overview": "Michelle Kinney is found murdered in her apartment in Dubuque, Iowa. Her neighbors are puzzled. She had no enemies - so who would do such a thing? Local detectives unveil a haunting truth, leading to a shocking confession from an unlikely murderer."
      },
      {
        "id": "tvmaze:1797699",
        "title": "Lost in the Desert",
        "season": 2,
        "episode": 1,
        "released": "2020-02-05",
        "overview": "Steven Begay is a loving uncle whose nephews see as a protector, but his bloody body is found near a playground in New Mexico; a manhunt ensues leaving police with a major discovery that turns the case on its head."
      },
      {
        "id": "tvmaze:1797700",
        "title": "Puzzle Piece",
        "season": 2,
        "episode": 2,
        "released": "2020-02-12",
        "overview": "When the battered body of Bianca Rainer, mother of two young girls, is found in rural Arkansas, the police have just one unusual clue, a puzzle piece found stuck to her body, but they know if they find the missing puzzle, they will find her murderer."
      },
      {
        "id": "tvmaze:1797701",
        "title": "The Bloody Footprint",
        "season": 2,
        "episode": 3,
        "released": "2020-02-19",
        "overview": "Maurice Goins, a friendly neighbor who provides meals to other tenants in his apartment complex, is found murdered in his bedroom. The case goes cold, until Lakewood, Ohio police suddenly receive a tip and the investigation is thrown into overdrive."
      },
      {
        "id": "tvmaze:1798794",
        "title": "Fire in the Desert",
        "season": 2,
        "episode": 4,
        "released": "2020-02-26",
        "overview": "Albuquerque, N.M., mail carrier Marilyn Gandert disappears for days and no one knows where she has gone; when her body is found in the desert, detectives must find the murderer, and they only have a few witnesses beyond Marilyn's family members."
      },
      {
        "id": "tvmaze:1805322",
        "title": "Is That Blood?",
        "season": 2,
        "episode": 5,
        "released": "2020-03-04",
        "overview": "When devoted mother Danielle Pruett goes missing in Tazewell, Virginia, police launch an investigation to find her. But when her lifeless body is discovered in an open field, what starts as a web of lies and deceit becomes a race to track her killer."
      },
      {
        "id": "tvmaze:1815237",
        "title": "Dying Words",
        "season": 2,
        "episode": 6,
        "released": "2020-03-11",
        "overview": "Steven Galvin is dead. Now, bodycam video captures the detectives hunt for his killer. As the case unravels, a surprise witness turns this case on its head. And a play-by-play of the crime will reveal new evidence that brings the killer to justice."
      },
      {
        "id": "tvmaze:1815238",
        "title": "Tape the Scene",
        "season": 2,
        "episode": 7,
        "released": "2020-03-18",
        "overview": "Agnes Bram, an 82-year-old Middleton, Wisconsin woman is found murdered in her garage. As detectives develop their case, a city-wide manhunt follows, and investigators are forced to curb public hysteria with the need to ensure he doesn't kill again."
      },
      {
        "id": "tvmaze:1818144",
        "title": "Down by Fire",
        "season": 2,
        "episode": 8,
        "released": "2020-03-25",
        "overview": "Ryne Zahner is an inspiration to his high school math students in Arizona. His friends see him as one of the nicest people they know. When a hooded murderer guns him down after a night of partying, the entire community struggles to grasp his murder."
      },
      {
        "id": "tvmaze:1888567",
        "title": "Stay With Us, Madison",
        "season": 3,
        "episode": 1,
        "released": "2020-06-30",
        "overview": "Madison Wells, a sixteen-year-old student in New Jersey, is found murdered in her aunt's kitchen. When police look into her relationship with a twenty-year-old, they go down a rabbit hole that exposes an abusive relationship with a tragic end."
      },
      {
        "id": "tvmaze:1896067",
        "title": "Who Shot Buckii?",
        "season": 3,
        "episode": 2,
        "released": "2020-07-07",
        "overview": "It's the middle of the night when Delvin \"Buckii\" Meadows is shot and killed in his neighbor's yard. As police investigate, it's not until witnesses come forward with information that detectives realize they may be the key to finding Delvin's killer."
      },
      {
        "id": "tvmaze:1896068",
        "title": "The Truth Is Dangerous",
        "season": 3,
        "episode": 3,
        "released": "2020-07-14",
        "overview": "Ty Underwood, a transgender woman, is found shot to death in her car, leaving detectives to wonder if she may have been a victim of a hate crime. Detectives use text messages, social media posts, and surveillance footage to track down her killer."
      },
      {
        "id": "tvmaze:1896522",
        "title": "Things Weigh on You",
        "season": 3,
        "episode": 4,
        "released": "2020-07-21",
        "overview": "Jeffrey Franklin, a deaf sixteen-year-old, is dead. Now, body-cam video and original audio capture detectives' hunt for what happened. As the investigation unravels, GPS data and shocking admissions give Jeffrey the justice he desperately deserves."
      },
      {
        "id": "tvmaze:1902343",
        "title": "Don't Look Back",
        "season": 3,
        "episode": 5,
        "released": "2020-07-28",
        "overview": "Karen Simek is a talented food service worker; her body is found with a gunshot wound outside her office in the early morning hours, it leaves her family in shock and sparks a year-long investigation."
      },
      {
        "id": "tvmaze:1902344",
        "title": "Twisted Upside Down",
        "season": 3,
        "episode": 6,
        "released": "2020-08-04",
        "overview": "The streets of Kalamazoo, Michigan are awash with rumors about 69-year-old, William Gray. Is he dead? Is he alive? No one local police speak with seems to know for sure. Faced with a missing persons case, investigators are met with a wall of silence."
      },
      {
        "id": "tvmaze:1963277",
        "title": "The Back of the Shed",
        "season": 4,
        "episode": 1,
        "released": "2020-11-18",
        "overview": "A backyard shed in a Michigan trailer park holds the answers to a dark secret regarding a missing teenage couple. Police interview their families, but one member is evasive, deepening the mystery and setting off a covert manhunt across the Midwest."
      },
      {
        "id": "tvmaze:1969714",
        "title": "He's Not Going to Stop",
        "season": 4,
        "episode": 2,
        "released": "2020-11-25",
        "overview": "A spree shooter is on the loose in Scottsdale, and the entire city holds its breath while waiting for the culprit to be identified. Bodycam footage captures the tension as police try to nab a killer who always seems to be one step ahead."
      },
      {
        "id": "tvmaze:1974850",
        "title": "The Great Don Lewis",
        "season": 4,
        "episode": 3,
        "released": "2020-12-02",
        "overview": "Donald Lewis is a popular musician who owns a local Jazz Cafe. Despite being beloved in the community, mystery strikes when he suddenly disappears from his jazz club along with his employee. Detectives must find the both of them before it's too late."
      },
      {
        "id": "tvmaze:1977879",
        "title": "Blind Love",
        "season": 4,
        "episode": 4,
        "released": "2020-12-09",
        "overview": "Thirty-one-year-old, Gabriel Montanez is found shot in a liquor store parking lot in Kalamazoo, Michigan. Two men in hooded sweatshirts are seen fleeing from the scene. Police then make a shocking discovery that leads to the truth behind the homicide."
      },
      {
        "id": "tvmaze:1978327",
        "title": "Blood on the Bed",
        "season": 4,
        "episode": 5,
        "released": "2020-12-16",
        "overview": "When 27-year-old Byron Edwards is found brutally stabbed in his home, his family is absolutely devastated. But as detectives work to find the person responsible, they discover a single piece of evidence that changes the course of their investigation."
      },
      {
        "id": "tvmaze:1984662",
        "title": "The Last Laugh",
        "season": 4,
        "episode": 6,
        "released": "2020-12-30",
        "overview": "Dawn Sandoval is gone. What appears to be a missing persons case, take a stunning turn when very different portraits of her are revealed. Now, detectives must weed through a series of tangled relationships to uncover where Dawn has been all along."
      },
      {
        "id": "tvmaze:1995433",
        "title": "Do You Want to Smell Human Blood?",
        "season": 4,
        "episode": 7,
        "released": "2021-01-06",
        "overview": "Shelby Weatherly is found brutally stabbed to death by the side of the highway, and investigators struggle to find a suspect. Forensic evidence and reports of a mysterious car lead to revealing images and evidence that point toward the vicious killer."
      },
      {
        "id": "tvmaze:1996722",
        "title": "So Hateful",
        "season": 4,
        "episode": 8,
        "released": "2021-01-13",
        "overview": "When 46-year-old Anthony Edwards is found shot in the park, his family has no idea who would want to bring harm to a man that was loved by so many. Using modern technology and forensic testing, detectives are determined to bring his killer to justice."
      },
      {
        "id": "tvmaze:2006554",
        "title": "This Guy's Getting Paranoid",
        "season": 4,
        "episode": 9,
        "released": "2021-01-20",
        "overview": "Roaa Al-Dhanoon has disappeared. What begins as a missing persons case, takes a disturbing turn by someone who is closest to her. Now, detectives must unravel a complex web of deceit that continues to strike fear throughout the devastated community."
      },
      {
        "id": "tvmaze:2008543",
        "title": "The Girl in the Crowd",
        "season": 4,
        "episode": 10,
        "released": "2021-01-27",
        "overview": "What starts out as a calm night at the American Legion in Evansville, Indiana, quickly takes a turn when Anthony Blaylock is shot dead. But when detectives obtain video surveillance showing who is responsible, they stop at nothing to find his killer."
      },
      {
        "id": "tvmaze:2082120",
        "title": "The Girl in the Park",
        "season": 5,
        "episode": 1,
        "released": "2021-05-05",
        "overview": "A deceased female's brutally beaten and sexually assaulted body turns up in Farmington, New Mexico. With an unidentified victim and plenty of suspects, detectives struggle with one of the most challenging \"whodunits\" of their career."
      },
      {
        "id": "tvmaze:2082121",
        "title": "I'd Kill Them Again",
        "season": 5,
        "episode": 2,
        "released": "2021-05-12",
        "overview": "Columbus, Georgia, police are blindsided by a triple homicide that rocks the foundation of this small community just south of Atlanta. An unlikely source provides investigators with the lead they need, resulting in a series of shocking arrests."
      },
      {
        "id": "tvmaze:2082122",
        "title": "Footprints in the Snow",
        "season": 5,
        "episode": 3,
        "released": "2021-05-19",
        "overview": "The community in Bozeman, Montana, is shocked when police officers find Lauren DeWise deceased, and her roommate, Ashley Van Hemert, critically injured. The police look to solve this horrifying crime."
      },
      {
        "id": "tvmaze:2091434",
        "title": "What's in the Backpack?",
        "season": 5,
        "episode": 4,
        "released": "2021-05-26",
        "overview": "Robert Sharp is a retired professor living in Ann Arbor, Michigan, and the last person anyone would expect to be murdered. But when he turns up brutally stabbed and burned, Robert's final moments make police wonder who could have done this and why."
      },
      {
        "id": "tvmaze:2093229",
        "title": "Cover the Camera and I'll Talk",
        "season": 5,
        "episode": 5,
        "released": "2021-06-02",
        "overview": "The Sheriff's Office in Virginia's Isle of Wight County discovers a double homicide involving an 80-year-old disabled grandmother. An undercover informant, a hidden handgun, and an unusual confession all lead to convictions in this cold-blooded crime."
      },
      {
        "id": "tvmaze:2102708",
        "title": "The Move Out",
        "season": 5,
        "episode": 6,
        "released": "2021-06-09",
        "overview": "Kiana Marshall, her brother Corey, and their friend Alexis are murdered. Now, bodycam and CCTV capture the hunt for their insane killer. Twisted tales lead detectives on a wild goose chase, but the killers are revealed and must face the consequences."
      },
      {
        "id": "tvmaze:2102709",
        "title": "She Set Me Up",
        "season": 5,
        "episode": 7,
        "released": "2021-06-16",
        "overview": "Indiana police prove to be adaptable when they are forced to rely on an unlikely source of information as they search for the person responsible for the shooting of 28-year-old D'Angelo White."
      },
      {
        "id": "tvmaze:2110258",
        "title": "The Robin Tattoo",
        "season": 5,
        "episode": 8,
        "released": "2021-06-23",
        "overview": "A dismembered torso turns up in a Florida forest, and the discovery launches detectives across the US to search for answers. With only a tattoo found on the victim, investigators must solve this horrific mystery before the killer is gone for good."
      },
      {
        "id": "tvmaze:2126802",
        "title": "Kind of a Vicious Person",
        "season": 5,
        "episode": 9,
        "released": "2021-07-07",
        "overview": "Apache County Sheriff's Office begins a double homicide investigation after the gruesome discovery of an elderly couple's remains in Sanders, Arizona. A statewide hunt for the perpetrator challenges veteran investigators resulting in an unusual arrest."
      },
      {
        "id": "tvmaze:2131282",
        "title": "The Drop Off",
        "season": 5,
        "episode": 10,
        "released": "2021-07-14",
        "overview": "Ahmad Shad Laster's loved ones are grief-stricken when he is shot outside a friend's home; Flagler County, Fla., detectives uncover evidence that blows the case wide open, but the hunt for justice tests family bonds and reveals shocking secrets."
      },
      {
        "id": "tvmaze:2270946",
        "title": "Blunt Force Trauma",
        "season": 6,
        "episode": 1,
        "released": "2022-02-16",
        "overview": "A woman of faith, Susan Hernandez, is the last person police would expect to find murdered in her basement; searching for suspects, detectives turn over every stone in the hunt for Susan's killer, with a result that shakes the town to its core."
      },
      {
        "id": "tvmaze:2274812",
        "title": "Fled on Foot",
        "season": 6,
        "episode": 2,
        "released": "2022-02-23",
        "overview": "In Alabama, Brucetravius Frazier lies dead in his car from a gunshot wound to his head; a subsequent attempt on a witness's life causes police to realize they're not dealing with the average killer and must work quickly to bring them to justice."
      },
      {
        "id": "tvmaze:2280132",
        "title": "The House on Lillian Street",
        "season": 6,
        "episode": 3,
        "released": "2022-03-02",
        "overview": "Samantha Guthrie's parents desperately search for their missing child. As the police search reveals many players in this mystery, the common thread becomes the Lillian St. house. Police aim to find the truth of what occurred within those walls."
      },
      {
        "id": "tvmaze:2280133",
        "title": "A Really Odd Situation",
        "season": 6,
        "episode": 4,
        "released": "2022-03-09",
        "overview": "In Grand Rapids, Mich., local mother Laurie Lundeberg lies dead from gunshots outside her home; detectives must track down the culprit and uncover their motive for shooting Laurie; making matters worse, the killer strikes again."
      },
      {
        "id": "tvmaze:2289593",
        "title": "Something Came Over Me",
        "season": 6,
        "episode": 5,
        "released": "2022-03-16",
        "overview": "In Akron, Ohio, local antiques dealer Mary Kay Wohlfarth mysteriously vanishes into thin air; detectives race to find the elderly woman, leaving no stone unturned; however, finding Mary Kay might lead to more questions than answers."
      },
      {
        "id": "tvmaze:2298250",
        "title": "Smokescreen",
        "season": 6,
        "episode": 6,
        "released": "2022-03-23",
        "overview": "Detectives in Waynesfield, Ohio, contend with a grim mystery when they discover the lifeless body of Erin Mulcahy in her shower and the pressure is on the police department to catch those responsible for the town's first murder in over 50 years."
      },
      {
        "id": "tvmaze:2298251",
        "title": "The Man In The Red Shirt",
        "season": 6,
        "episode": 7,
        "released": "2022-03-30",
        "overview": "Forty-year-old Jamie Baker leaves her family behind when someone shoots and kills her with a bullet through the back; the mystery deepens when police dig into her last moments and uncover what transpired the night of her death."
      },
      {
        "id": "tvmaze:2301776",
        "title": "Body in the Yard",
        "season": 6,
        "episode": 8,
        "released": "2022-04-06",
        "overview": "When workers come across a body within an abandoned property in western Ohio, it opens up a homicide investigation that sends shock waves throughout the surrounding Amish communities."
      },
      {
        "id": "tvmaze:2305989",
        "title": "The Quick Change",
        "season": 6,
        "episode": 9,
        "released": "2022-04-13",
        "overview": "The town of Fort Smith, Ark., reels when an elderly, retired school teacher turns up dead, bludgeoned to death with a hammer no fewer than 36 times; when the person responsible receives justice, an unlikely perpetrator comes to light."
      },
      {
        "id": "tvmaze:2305990",
        "title": "Blue Nightmare",
        "season": 6,
        "episode": 10,
        "released": "2022-04-20",
        "overview": "The murder of a popular EMT devastates the local law enforcement community."
      },
      {
        "id": "tvmaze:2352977",
        "title": "Three Loud Booms",
        "season": 7,
        "episode": 1,
        "released": "2022-07-06",
        "overview": "In what looks like a planned ambush, a young man turns up dead in his garage in Maricopa, Ariz.; police must look into a romance gone wrong to find his killer, and the child that the two may share."
      },
      {
        "id": "tvmaze:2352978",
        "title": "Friends Like These",
        "season": 7,
        "episode": 2,
        "released": "2022-07-13",
        "overview": "A woman shocks the Titus County Sheriff's Office when she reports the kidnapping of her husband, Ernie; police race to find him, but things are not as they seem, and they must first figure out who is telling the truth to them to solve the case."
      },
      {
        "id": "tvmaze:2358665",
        "title": "One in the Chamber",
        "season": 7,
        "episode": 3,
        "released": "2022-07-20",
        "overview": "A retirement community in Evansville, Indiana is rocked when Odie Carrier Jr. is found mortally shot in his own home. Puzzled even more by the surprising way he was killed, police must work quickly if they are going to find the person responsible."
      },
      {
        "id": "tvmaze:2358666",
        "title": "The Body in the Truck",
        "season": 7,
        "episode": 4,
        "released": "2022-07-27",
        "overview": "In Jonesboro, Ark., authorities investigate the death of Steven McQuay after his badly beaten body turns up in the back of a pickup truck; when the results of the victim's toxicology report arrive, the entire investigation plunges into a tailspin."
      },
      {
        "id": "tvmaze:2365801",
        "title": "Midnight on Autumn St.",
        "season": 7,
        "episode": 5,
        "released": "2022-08-03",
        "overview": "A late-night shooting at an apartment complex in Hot Springs, Arkansas, leaves a young man dead in a bad drug deal. Police question the person responsible for luring the victim to his death. Will this lead authorities to the person who pulled the trigger?"
      },
      {
        "id": "tvmaze:2365802",
        "title": "The Smoke Shop in the Truck",
        "season": 7,
        "episode": 6,
        "released": "2022-08-10",
        "overview": "Homicide investigations unfold through dramatic, real footage in this groundbreaking series; viewers get an up-close perspective of each case using raw, unfiltered footage."
      },
      {
        "id": "tvmaze:2409340",
        "title": "Two Neighbors",
        "season": 8,
        "episode": 1,
        "released": "2022-10-18",
        "overview": "One woman's murder and another's disappearance jolt a small Maryland town."
      },
      {
        "id": "tvmaze:2416508",
        "title": "Sergeant Hassel",
        "season": 8,
        "episode": 2,
        "released": "2022-10-25",
        "overview": "Officers find Tyrone Hassel III shot to death outside his father's home while on holiday leave from the Army; investigators must unravel a real whodunit, and when the killer finally reveals themselves, the detectives can't hide their shock."
      },
      {
        "id": "tvmaze:2416509",
        "title": "Follow the Tracks",
        "season": 8,
        "episode": 3,
        "released": "2022-11-01",
        "overview": "The Bryan, Texas, Police Department investigates the shooting of 23-year-old local landscaper, Jose Armando Pina; a masked perpetrator flees the area via a path thick with brambles, leaving behind vital evidence."
      },
      {
        "id": "tvmaze:2421800",
        "title": "I Did Something Real Bad",
        "season": 8,
        "episode": 4,
        "released": "2022-11-08",
        "overview": "Police find Orlando Euell's body left for dead on the side of the road in Milwaukee; police examine extensive surveillance footage to learn about Orlando's last moments, including witnessing him get into the car that would take him to his death."
      },
      {
        "id": "tvmaze:2422107",
        "title": "Club Chaos",
        "season": 8,
        "episode": 5,
        "released": "2022-11-15",
        "overview": "Lima, Ohio, police race to a chaotic scene at an after-hours nightclub following a shooting that leaves one person dead and multiple others injured. As they try to identify the shooter, dozens of patrons flee in fear, confusing first responders."
      },
      {
        "id": "tvmaze:2429616",
        "title": "Help, I've Been Shot",
        "season": 8,
        "episode": 6,
        "released": "2022-11-22",
        "overview": "Police find one man shot in an empty lot and hear of a second man missing."
      },
      {
        "id": "tvmaze:2434388",
        "title": "Parking Lot Carnage",
        "season": 8,
        "episode": 7,
        "released": "2022-11-29",
        "overview": "A fatal shooting takes place at an Evansville, Indiana, American Legion parking lot; with all the commotion, none of the witnesses can describe the killer."
      },
      {
        "id": "tvmaze:2624666",
        "title": "Blood in the Snow",
        "season": 9,
        "episode": 1,
        "released": "2023-08-22",
        "overview": "Noah Kinney is shot dead in a car that crashed outside a home in Akron, Ohio, and detectives race to find an armed killer on the loose, but ultimately investigators are shocked to discover the video evidence that solve the case."
      },
      {
        "id": "tvmaze:2624667",
        "title": "The Elder Murders",
        "season": 9,
        "episode": 2,
        "released": "2023-08-29",
        "overview": "A 911 call comes in from a woman who says her neighbor is not breathing and covered in blood, then police find 69-year-old Benjamin dead, his house in disarray and money missing, but as detectives search for answers, another murder occurs."
      },
      {
        "id": "tvmaze:2630408",
        "title": "Killer on Camera",
        "season": 9,
        "episode": 3,
        "released": "2023-09-05",
        "overview": "Akron police officers respond to a shooting outside a bar on a busy Friday night on Main Street; what starts out as a shooting investigation turns into a mystery of murder and the hunt for a cold-blooded killer."
      },
      {
        "id": "tvmaze:2630409",
        "title": "Who Killed the Landlord?",
        "season": 9,
        "episode": 4,
        "released": "2023-09-12",
        "overview": "After a man calls 911 to report being stabbed and a house on fire, police find Ron Whiles shot and burned in his home in Lafayette, Ind.; with one victim dead and one clinging to life, detectives question multiple suspects, which leads to one name."
      },
      {
        "id": "tvmaze:2640096",
        "title": "Murder of Convenience",
        "season": 9,
        "episode": 5,
        "released": "2023-09-19",
        "overview": "Akron officers respond to a shooting outside a convenience store; they find Dereke Alexander bleeding with a faint pulse, but he doesn't survive; the investigation leads detectives to two cold-blooded killers who stalked and hunted the man."
      },
      {
        "id": "tvmaze:2640425",
        "title": "Last Roll of the Dice",
        "season": 9,
        "episode": 6,
        "released": "2023-09-26",
        "overview": "Lansing police officers find Donovan Barfield's body riddled with bullets and his apartment ransacked; as investigators race to identify the perpetrator, they uncover a diabolical plan of murder and robbery orchestrated by a trio of reckless killers."
      },
      {
        "id": "tvmaze:2650595",
        "title": "For Love or Money",
        "season": 9,
        "episode": 7,
        "released": "2023-10-03",
        "overview": "In separate calls, Chillicothe, Ohio, police officers find three murder victims and another clinging to life. As they investigate these crimes, they discover the victims are related. Detectives question suspects, which leads to an unlikely killer."
      },
      {
        "id": "tvmaze:2650596",
        "title": "Three Days, Six Murders",
        "season": 9,
        "episode": 8,
        "released": "2023-10-10",
        "overview": "Newnan, Georgia, Police respond to six murders in three days. As investigators try to piece together the motive behind the killings, several witnesses claim to know who is responsible -- but a rush to judgment could result in a killer going free."
      },
      {
        "id": "tvmaze:2659853",
        "title": "A Shot in the Dark",
        "season": 9,
        "episode": 9,
        "released": "2023-10-17",
        "overview": "Ida Mae Ford gets shot dead in the middle of a dark street near her home in Macon, Georgia; detectives race to track down the beloved grandmother's elusive killer, and a shocking crime spree ultimately leads investigators to an unexpected suspect."
      },
      {
        "id": "tvmaze:2662824",
        "title": "Isle of Wight",
        "season": 9,
        "episode": 10,
        "released": "2023-10-24",
        "overview": "Deputies discover a young man shot dead in a trailer park miles away from home; as they try to solve the mystery behind the murder, several key witnesses step forward to point the finger at different suspects."
      },
      {
        "id": "tvmaze:3427597",
        "title": "Head in a Bag",
        "season": 10,
        "episode": 1,
        "released": "2025-11-12",
        "overview": "On a rainy night in a parking lot in Arkansas, a mysterious trash bag turns up in a truck; police come to the scene and find Connie Goodwin beheaded, and go into overdrive to find out who killed the grandmother and how her head ended up in a truck."
      },
      {
        "id": "tvmaze:3438705",
        "title": "Stage Fright",
        "season": 10,
        "episode": 2,
        "released": "2025-11-19",
        "overview": "In the early morning hours, at a warehouse music venue in Texas, someone shoots a man who later succumbs to his wounds; police find a chaotic crime scene; they search for answers on who shot Keyundta Barrett and the location of the murder weapon."
      },
      {
        "id": "tvmaze:3449212",
        "title": "A Date with Destiny",
        "season": 10,
        "episode": 3,
        "released": "2025-12-03",
        "overview": "Destiny Orr Clark's friend calls 911 hysterical after two men shoot and kill Destiny behind a Chuckie Cheese late at night; police race to the scene and begin their investigation to see who killed the 19-year-old and why they wanted her dead."
      },
      {
        "id": "tvmaze:3449213",
        "title": "Marked for Murder",
        "season": 10,
        "episode": 4,
        "released": "2025-12-10",
        "overview": ""
      },
      {
        "id": "tvmaze:3449214",
        "title": "The Tipster",
        "season": 10,
        "episode": 5,
        "released": "2025-12-17",
        "overview": ""
      },
      {
        "id": "tvmaze:3457154",
        "title": "TBD",
        "season": 10,
        "episode": 6,
        "released": "2026-01-07",
        "overview": ""
      }
    ]
  }
}